[{"url": "http://www.macmillandictionary.com/dictionary/british/prominent", "passage_text": "Thesaurus. The thesaurus of synonyms and related words is fully integrated into the dictionary. Click on the thesaurus category heading under the button in an entry to see the synonyms and related words for that meaning. 90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars."}, {"url": "http://www.thefreedictionary.com/prominent", "passage_text": "prom·i·nent. adj. 1. Projecting outward or upward from a line or surface; protuberant: prominent eyebrows. 2. Immediately noticeable; conspicuous: a product with a prominent place in the store. See Synonyms at noticeable. "}, {"url": "http://www.merriam-webster.com/dictionary/prominent", "passage_text": "Full Definition of PROMINENT. 1. : standing out or projecting beyond a surface or line: protuberant. 2. a: readily noticeable: conspicuous b: widely and popularly known: leading. — prom·i·nent·ly adverb. See prominent defined for English-language learners. See prominent defined for kids. 1 He placed the award in a prominent position on his desk. 2  He has a prominent nose. 3  the most prominent peak in the mountain range. … 4  and a small precise mouth he kept pursed over teeth a shade too prominent and yellow."}, {"url": "http://dictionary.reverso.net/english-definition/prominent", "passage_text": "English Collins Dictionary-English synonyms & Thesaurus. See also: prominent moth, prominently, prominentness, prominence. Add your entry in the Collaborative Dictionary. n any moth of the family Notodontidae characterized by tufts of scales on the back edge of the forewing that stand up prominently at rest and give the group its name. It includes the puss moth and buff-tip as well as those with prominent in the name."}, {"url": "http://dictionary.reverso.net/english-synonyms/prominent", "passage_text": "English Collins Dictionary-English synonyms & Thesaurus &nbsp. prominent 1 adj Someone who is prominent is important. (=well-known) ...a prominent member of the Law Society. 2 adj Something that is prominent is very noticeable or is an important part of something else. Here the window plays a prominent part in the design. ♦ prominently adv ADV with v. Trade will figure prominently in the second day of talks in Washington..."}, {"url": "http://www.macmillandictionary.com/dictionary/british/prominent", "passage_text": "This is the British English definition of prominent. View American English definition of prominent. Change your default dictionary to American English. View the pronunciation for prominent. 90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars."}, {"url": "http://dictionary.reverso.net/english-synonyms/prominent", "passage_text": "(=well-known). ...a prominent member of the Law Society. 2 adj Something that is prominent is very noticeable or is an important part of something else. Here the window plays a prominent part in the design. ♦ prominently adv ADV with v. Trade will figure prominently in the second day of talks in Washington..."}, {"url": "http://www.macmillandictionary.com/dictionary/british/prominent", "passage_text": "A must for anyone with an interest in the changing face of language. The Macmillan Dictionary blog explores English as it is spoken around the world today. Definition and synonyms of prominent from the online English dictionary from Macmillan Publishers Limited. 90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars."}, {"url": "http://www.thefreedictionary.com/prominents", "passage_text": "prom·i·nent. adj. 1. Projecting outward or upward from a line or surface; protuberant: prominent eyebrows. 2. Immediately noticeable; conspicuous: a product with a prominent place in the store. See Synonyms at noticeable"}]