[{"url": "http://www.tgslc.org/forms/claims.cfm", "passage_text": "FFELP Assignment Support Supplemental Form. Guarantors and FFEL lenders or servicers use this matrix to exchange information prior to assignment of the loan to ED. This form should be used in conjunction with the FFELP Claim Form when submitting a Total and Permanent Disability claim. FFELP Claim Form. A lender or servicer uses the FFELP Claim Form to request claim reimbursement on a loan due to the borrower's default, death, disability, bankruptcy filing, ineligibility for the loan, or situations involving school closure or false certification."}, {"url": "http://financialaid.wfu.edu/need-based-financial-aid/need-based-supplemental-forms/", "passage_text": "Need-based supplemental forms. Supplemental forms are sometimes required of need-based aid applicants. The Office of Student Financial Aid notifies applicants if any supplemental forms are required. Applicants SHOULD NOT submit these supplemental forms unless requested to do so"}, {"url": "http://acpe.alaska.gov/FINANCIAL_AID/Loans/Alaska_Supplemental_Education_Loan", "passage_text": "Alaska Supplemental Education Loan (ASEL). ASEL is a low-cost option to pay remaining education costs not paid for through savings, grants, scholarships or federal Stafford loans. * The following rates and benefits are for the 2015-2016 academic year. Features."}, {"url": "https://www.bankmidwest.com/borrow/personal/student-loans/", "passage_text": "Iowa Student Loan® is a private, nonprofit corporation offering supplemental private student loans to help you pay for college. 2. The Partnership Advance Education Loan® (Partnership Loan): 1  Provides terms and conditions upfront, so you know what you’re getting before you apply. Students in Minnesota can take advantage of long-term, low-interest post high school educational loans offered by the SELF program administered by the Minnesota Office of Higher Education, a state agency. Learn more. 1 Bank Midwest does not accept applications for private student loans."}, {"url": "http://nursing.jhu.edu/admissions/financial-aid/loans.html", "passage_text": "Private Supplemental Loans. Supplemental loans are offered by banks and other student loan organizations. These private loans are used to supplement other forms of financial assistance and may also assist students who enroll less than half-time. Credit-based. Supplemental loans are credit-based and are not subject to the Federal Need Analysis Methodology. In order to receive a supplemental loan, borrowers must meet specific credit criteria established by the lender."}, {"url": "https://www.americanstatebank.com/student-loan", "passage_text": "American State Bank works with Iowa Student Loan ® to offer supplemental private student loans to help you meet the cost of college. 1. Partnership Advance Education Loan. The Partnership Advance Education Loan ® (Partnership Loan): 1  Provides terms and conditions upfront, so you know what you’re getting before you apply. "}, {"url": "http://nursing.jhu.edu/admissions/financial-aid/loans.html", "passage_text": "Student Loans. Federal and supplemental (private) student loans are available to assist students in meeting their educational expenses. Since loans must be repaid, our office encourages individuals who use this option to (a) fully understand the terms of each loan and (b) take only what is needed. Credit-based. Supplemental loans are credit-based and are not subject to the Federal Need Analysis Methodology. In order to receive a supplemental loan, borrowers must meet specific credit criteria established by the lender."}]