[{"url": "https://en.wikipedia.org/wiki/Doyon", "passage_text": "Doyon may refer to: 1  Cyrille Doyon (1842–1918), Quebec merchant, farmer and political figure. 2  Marie-Claude Doyon (born 1965), Canadian luger who competed in the late 1980s. 1 Cyrille Doyon (1842–1918), Quebec merchant, farmer and political figure. 2  Marie-Claude Doyon (born 1965), Canadian luger who competed in the late 1980s. 3  Mario Doyon (born 1968), retired Canadian ice hockey defenceman. 4  Pierre Adolphe Adrien Doyon (1827–1907), French dermatologist and balneologist born in Grenoble."}, {"url": "http://www.doyonfoundation.com/static/facts.aspx", "passage_text": "About Us. The Doyon Foundation was established as a separate nonprofit charitable organization in 1989 by Doyon, Limited. Doyon Foundation’s mission is to provide educational, career and cultural opportunities to enhance the identity and quality of life for Doyon shareholders. To be eligible for a Doyon Foundation scholarship, applicants must: 1  Be enrolled to Doyon, Limited or be the child of an original enrollee. 2  If applicant is not an original enrollee, but is the child of an original enrollee, please submit an original birth certificate, which will be copied and returned."}, {"url": "http://www.doyonuniversal.com/", "passage_text": "Doyon Universal Services, LLC (DUS) was created in 1992 through the bringing together of two companies with a collective 80 years of experience in Alaska. DUS is the premier Integrated Facility Management contractor and full spectrum security services provider for the private and public sectors. The Facilities Services of Doyon Universal Services (DUS) prides itself on being the industry leader among support services contractors in Alaska. DUS is owned by two companies who share similar philosophies and have proven track records in their respective fields. Learn More"}, {"url": "http://www.wordaz.com/doyon.html", "passage_text": "Synonyms of doyon. Here you will find one or more explanations in English for the word doyon. Also in the bottom left of the page several parts of wikipedia pages related to the word doyon and, of course, doyon synonyms and on the right images related to the word doyon. - doyon is an unincorporated community in ramsey county, in the u.s. state of north dakota. a post office was established at doyon in 1900, and remained."}, {"url": "https://en.wikipedia.org/wiki/Doyon,_Limited", "passage_text": "Doyon, Limited is one of thirteen Alaska Native Regional Corporations created under the Alaska Native Claims Settlement Act of 1971 (ANCSA) in settlement of aboriginal land claims. Doyon, Limited was incorporated in Alaska on June 26, 1972. Headquartered in Fairbanks, Alaska, Doyon, Limited is a for-profit corporation with about 18,000 Alaska Native shareholders primarily of Northern Athabaskan Indian descent. Under federal law, Doyon, Limited and its majority-owned subsidiaries, joint ventures and partnerships are deemed to be minority and economically disadvantaged business enterprise[s] (43 USC 1626(e))."}, {"url": "http://www.doyonuniversal.com/employment/", "passage_text": "Employment. Doyon Universal Services (DUS) is looking for individuals who thrive on challenge and are motivated by the ever-changing environments in our industries. Whether you are just starting your career or have an extensive background, we are excited you have chosen DUS as a potential employer. "}, {"url": "http://www.wordaz.com/doyon.html", "passage_text": "- doyon, limited is one of thirteen alaska native regional corporations created under the alaska native claims settlement act of 1971 (ancsa) in settlement. - j. michel doyon qc is a former head of the quebec bar and the viceregal representative of queen elizabeth ii of canada in the province of quebec. he ****umed. - doyon is an unincorporated community in ramsey county, in the u.s. state of north dakota. a post office was established at doyon in 1900, and remained."}, {"url": "http://www.wordaz.com/doyon.html", "passage_text": "Meaning of doyon. Here you will find one or more explanations in English for the word doyon. Also in the bottom left of the page several parts of wikipedia pages related to the word doyon and, of course, doyon synonyms and on the right images related to the word doyon. - doyon is an unincorporated community in ramsey county, in the u.s. state of north dakota. a post office was established at doyon in 1900, and remained."}]