[{"url": "http://www.medicinenet.com/rash/article.htm", "passage_text": "1 Common rashes include eczema, poison ivy, hives, and heat rash. 2  Infections that cause rashes may be fungal, bacterial, parasitic, or viral. 3  Over-the-counter products may be helpful treatments for many skin rashes. 4  Rashes lasting more than a few days that are unexplained should be evaluated by a doctor. Rash facts. 1  Rash is not a specific diagnosis. 2  Instead it means skin inflammation and discoloration that changes the way the skin looks. 3  Common rashes include eczema, poison ivy, hives, and heat rash. 4  Infections that cause rashes may be fungal, bacterial, parasitic, or viral"}, {"url": "http://www.healthgrades.com/symptoms/itching-skin", "passage_text": "Itching skin is an inflammatory reaction of the skin. Itching is a symptom of a wide variety of mild to serious diseases, disorders and conditions. Itching is also called pruritus. Itching or itchy skin may or may not be associated with a rash. Itching skin can affect a small area of the skin or the full body, and it differs in severity, frequency and duration, depending on the underlying cause. Itching can occur by itself or in conjunction with other symptoms, including rash, runny nose, and sneezing. In addition, excessive scratching can introduce bacteria or fungus into the layers of the skin, resulting in infections. Tell your health care provider about any symptoms that occur with itchy skin."}, {"url": "http://www.healthline.com/health/rashes", "passage_text": "A rash is a noticeable change in the texture or color of the skin. The skin may become itchy, bumpy, chapped, scaly, or otherwise irritated. Rashes are caused by a wide range of conditions, including allergies, medication, cosmetics, and various diseases. Other types of rashes include: 1  eczema: a common rash for people with asthma or allergies. 2  The rash is often reddish and itchy, with a scaly texture. 3  bug bites: tick bites are of particular concern, as they can transmit disease. 4  psoriasis: a scaly, itchy, red rash that forms along the scalp and joint"}, {"url": "http://www.mayoclinic.org/diseases-conditions/itchy-skin/basics/causes/CON-20028460", "passage_text": "1 Skin conditions and rashes. 2  Many skin conditions itch, including eczema (dermatitis), psoriasis, scabies, lice, chickenpox and hives. 3  The itching usually affects specific areas and is accompanied by other signs, such as red, irritated skin or bumps and blisters. 4  Internal diseases. 1 If you don't see a crop of bright, red bumps or some other dramatic change in the itchy area, dry skin (xerosis) is a likely cause. 2  Dry skin usually results from environmental factors such as hot or cold weather with low humidity, long-term use of air conditioning or central heating, and washing or bathing too much."}, {"url": "http://www.mayoclinic.org/skin-rash/SLS-20077087", "passage_text": "Skin rashes can occur from a variety of factors, including infections, heat, allergens, immune system disorders and medications. One of the most common skin disorders that causes a rash is atopic dermatitis (ay-TOP-ik dur-muh-TIE-tis), also known as eczema. Atopic dermatitis is an ongoing (chronic) condition that causes itchy, inflamed skin. Most often it appears as patches on the face, neck, trunk or limb"}, {"url": "http://www.healthline.com/health/rashes", "passage_text": "1 The rash is often reddish and itchy, with a scaly texture. 2  bug bites: tick bites are of particular concern, as they can transmit disease. 3  psoriasis: a scaly, itchy, red rash that forms along the scalp and joints. 4  dandruff: an itchy, flaky rash on the scalp. Other types of rashes include: 1  eczema: a common rash for people with asthma or allergies. 2  The rash is often reddish and itchy, with a scaly texture. 3  bug bites: tick bites are of particular concern, as they can transmit disease. 4  psoriasis: a scaly, itchy, red rash that forms along the scalp and joints"}, {"url": "https://en.wikipedia.org/wiki/Rash", "passage_text": "A rash may be localized in one part of the body, or affect all the skin. Rashes may cause the skin to change color, itch, become warm, bumpy, chapped, dry, cracked or blistered, swell, and may be painful. The causes, and therefore treatments for rashes, vary widely. "}, {"url": "http://www.healthgrades.com/symptoms/itchy-rash", "passage_text": "An itchy rash is an inflammatory reaction of the skin. An itchy rash is a symptom of a wide variety of mild to serious diseases, disorders and conditions. Itchy rashes differ in severity, frequency and duration depending on the underlying cause. Itchy rashes can appear as blotchy or tiny spots or occur in a large, solid continuous area. "}]