[{"url": "http://www.answers.com/Q/What_is_the_average_mans_running_stride_length", "passage_text": "The average stride length for men is 0.78 m and 0.7 m for women. An approximation to your personal walking stride is multiplying your height with 0.415 (or 0.413 for women). For adult females, the average step length is about 26 inches and  the average stride length is around 52 inches."}, {"url": "http://livehealthy.chron.com/average-walking-stride-length-7494.html", "passage_text": "Stride length is measured from heel to heel and determines how far you walk with each step. On average, a man's walking stride length is 2.5 feet, or 30 inches, according to Arizona State University Extension. A woman's average stride length is 2.2 feet, or 26.4 inches, reports the school. In general, people with longer legs have a greater stride length than those with shorter legs. For example, if you travel 290 inches in 10 steps, you average 29 inches per step, which is about 2.4 feet. Another method is to step in a puddle of water, walk 10 steps and measure the stride length between three wet steps. Average those distances to find your average stride rate."}, {"url": "http://www.livestrong.com/article/438560-the-average-stride-length-in-running/", "passage_text": "The length of your stride depends on your height, your fitness level and your body's individual biomechanics. Regardless of the length of your stride, a faster stride rate of 180 to 200 steps per minute may be the best way to improve your running performance. In the 1984 Olympics, women demonstrated stride lengths averaging 4 feet 10 inches during the marathon and longer stride lengths averaging 6 feet 8 inches during the 800 meters."}, {"url": "http://www.livestrong.com/article/438560-the-average-stride-length-in-running/", "passage_text": "Men also had a longer average stride during shorter distances, covering an average of 7 feet 9 inches with each stride in the 800 meters and an average of 6 feet 8 inches in the 10k. Additional analysis of stride length in sprinters found average length was dependent on height. The website BrianMac Sports Coach notes that research in the 1970s determined that sprinters' stride length was equal to 1.14 to 1.17 times the athlete's height. In the 1984 Olympics, women demonstrated stride lengths averaging 4 feet 10 inches during the marathon and longer stride lengths averaging 6 feet 8 inches during the 800 meters."}, {"url": "http://livehealthy.chron.com/average-walking-stride-length-7494.html", "passage_text": "While averages can be useful, it's fairly simple to find your own stride length. One way is to walk 10 steps, measure the distance from the starting and stopping point, then divide the number by 10. For example, if you travel 290 inches in 10 steps, you average 29 inches per step, which is about 2.4 feet. Another method is to step in a puddle of water, walk 10 steps and measure the stride length between three wet steps. Average those distances to find your average stride rate."}, {"url": "http://livehealthy.chron.com/average-inches-per-stride-running-8064.html", "passage_text": "Studies in the early 1970s found that average stride length for sprinters ranged from 1.14 to 1.35 times the athlete’s height. The shorter stride lengths were recorded on cinder tracks while the longer strides were recorded on synthetic surfaces. When exercise physiologist Jack Daniels analyzed runners’ stride lengths at the 1984 Olympics, he found that women distance runners had an average stride length of 58 inches, while women sprinters averaged strides of 80 inches."}, {"url": "http://www.livestrong.com/article/438170-the-average-walking-stride-length/", "passage_text": "This means that for the average person, the approximate distance from the initial point of contact of your left heel and the initial point of contact of your right heel is about 32 inches. The average stride length, or two steps, is about 62 inches, or a little more than 5 feet. "}, {"url": "http://www.answers.com/Q/What_is_a_women's_average_walking_stride", "passage_text": "The average stride length for men is 0.78 m and 0.7 m for women. An approximation to your personal walking stride is multiplying your height with 0.415 (or 0.413 for women). For adult females, the average step length is about 26 inches and  the average stride length is around 52 inches. For adult males, the  average step length is 31 inches and … the average stride is 62  inches."}, {"url": "http://livehealthy.chron.com/average-inches-per-stride-running-8064.html", "passage_text": "The length of the average stride in running can vary according to the runner's height, how fast he or she is running and the surface and slope he or she is running on. In general, the shorter the distance, the longer the average stride length. When exercise physiologist Jack Daniels analyzed runners’ stride lengths at the 1984 Olympics, he found that women distance runners had an average stride length of 58 inches, while women sprinters averaged strides of 80 inches. For men, the average stride was 74 inches for distance runners and 93 inches for sprinters"}, {"url": "http://www.answers.com/Q/What_is_a_women's_average_walking_stride", "passage_text": "Average stride length: 2.2 feet for women and 2.5 feet for man or you can estimate stride length relative to your height (females: height x .413 equals your stride length; males: height x .415 equals your stride length). For adult females, the average step length is about 26 inches and  the average stride length is around 52 inches. For adult males, the  average step length is 31 inches and … the average stride is 62  inches."}]