[{"url": "http://www.homewyse.com/services/cost_to_install_resin_bonded_driveway.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Resin Bonded Driveway Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Resin Bonded Driveway ranges between $8.66 - $12.75 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. "}, {"url": "http://www.drive-cote.co.uk/product-details/resin-driveway-cost-does-bonded-or-bound-make-a-difference/", "passage_text": "The simple answer to this is yes! However not only will the type of surfacing (resin bonded stone or resin bound stone) make a difference to a resin driveway cost, so will the substrate all ready in place. As will the purpose for the resin driveway."}, {"url": "http://www.justaquote.co.uk/driveways/resin-and-aggregate", "passage_text": "Prices for resin and aggregate driveways and patio areas vary tremendously, though the average cost seems to be between £40 and £60 per square metre, with minimum charges for small areas. One of the major disadvantages however, can be the cost of preparing a suitable sub-base if the existing surface is unsatisfactory. Although the thickness of the resin bonded aggregate layer is only 3 to 6 mm (depending on the type of resin and aggregate used), its durable finish and non-slip surface make it suitable for both domestic and commercial applications."}, {"url": "http://www.homewyse.com/costs/cost_of_resin_bonded_driveway.html", "passage_text": "Do you need to know the average cost to install Resin Bonded Driveway in your zip code? Do you need an easy-to-understand 2015 estimate of Resin Bonded Driveway job options and costs? Get pricing INSTANTLY. Enter your options and zip code above-then select Update. 1 The homewyse cost estimates include all typical costs for cleaning of area to be covered, and application of flat, uniform layer of resin bonded gravel."}, {"url": "http://www.homewyse.com/costs/cost_of_resin_bonded_driveway.html", "passage_text": "1 Resin Bonded Driveway installation costs vary considerably by location. 2  For an accurate estimate in your area, enter your zip code in the calculator above. 3  Reduce total project cost by having multiple vendors bid on the same, detailed work specification of your Resin Bonded Driveway project. 1 The homewyse cost estimates include all typical costs for cleaning of area to be covered, and application of flat, uniform layer of resin bonded gravel."}, {"url": "http://www.homewyse.com/costs/cost_of_resin_bonded_driveway.html", "passage_text": "1 The homewyse Resin Bonded Driveway cost estimates do not include costs for significant regrading or excavation, or demolition and removal of existing driveway. 1 The homewyse cost estimates include all typical costs for cleaning of area to be covered, and application of flat, uniform layer of resin bonded gravel."}, {"url": "http://www.resindrives.co.uk/how-much-would-a-resin-drive-cost-me/", "passage_text": "The size of the area you want to cover-The more surface area you need to cover, the greater the cost of the resin products and the aggregates. Bigger areas take more time too so this would be a cost factor. The type of surface you have at the moment-for instance if your driveway has a tarmac or concrete finish then this would be the most cost effective option as we could utilise your existing driveway. After specialist preparation work has been completed your base would be ready to lay the finished resin bound surface. Aggregates vary in price so this would be a factor when we quote you. Resin bound surfaces cost no more than an equivalent high quality paved driveway and when you bring maintenance into the equation there really is only one choice."}, {"url": "http://www.justaquote.co.uk/driveways/resin-and-aggregate", "passage_text": "Resin and aggregate driveways are fairly economical as long as there is an existing, suitable sub-base but for new areas where virgin land is the starting point, the cost of a concrete or tarmacadam driveway in addition to the cost of a resin and aggregate surface over it, can be prohibitive. Tweet. Although the thickness of the resin bonded aggregate layer is only 3 to 6 mm (depending on the type of resin and aggregate used), its durable finish and non-slip surface make it suitable for both domestic and commercial applications."}, {"url": "http://www.remodelingexpense.com/cost-of-resin-bonded-driveway/", "passage_text": "The Resin Bonded Driveway estimator will provide you with up to date pricing for your area. Simply enter your zip code and the square footage, next click update and you will see a breakdown on what it should cost to have Resin Bonded Driveway installed onto your home. Example: a 10 x 10 area = 100 square feet. 1 Try to get prices in late Fall, early winter – you should expect aggressive pricing discounts by waiting for a contractor’s down season. 2  Try to budget and additional 7-15% more on top of what our calculator gives out for Resin Bonded Driveway costs."}, {"url": "http://www.remodelingexpense.com/cost-of-resin-bonded-driveway/", "passage_text": "If you’re looking for 2014 breakdown for Cost of Resin Bonded Driveway materials and what installation cost might be, you’ve come to the right place. As an experienced licensed home improvement contractor, I know first hand what it should cost for various levels — from Basic, Better, and of course the best. 1 Try to get prices in late Fall, early winter – you should expect aggressive pricing discounts by waiting for a contractor’s down season. 2  Try to budget and additional 7-15% more on top of what our calculator gives out for Resin Bonded Driveway costs."}]