[{"url": "http://physics.tutorvista.com/waves/wave-frequency.html", "passage_text": "The rate of its motion is 2 cycles/second. This rate is referred to as the wave frequency. Thus the wave frequency shows that how much the medium particles undergo in vibration when a wave is passed through that medium. It is cycles per second or waves per second or vibrations per second."}, {"url": "http://www.earthguide.ucsd.edu/wav/frequency.html", "passage_text": "Frequency. Frequency is a measurement of how often a recurring event such as a wave occurs in a measured amount of time. One completion of the repeating pattern is called a cycle. Only moving waves which vary their positions with respect to time possess frequency. Frequency is one way to define how fast a wave moves."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/radiation/anintroductiontowavesrev2.shtml", "passage_text": "The wavelength of a wave is the distance between a point on one wave and the same point on the next wave. It is often easiest to measure this from the crest of one wave to the crest of the next wave, but it doesn't matter where as long as it is the same point in each wave."}, {"url": "http://www.dangerousdecibels.org/virtualexhibit/6measuringsound.html", "passage_text": "Sound energy travels in waves and is measured in frequency and amplitude. The energy in a sound wave can be measured using Decibels. The Decibel Meter shows examples of things that make noise and measurements in decibels. Amplitude measures how forceful the wave is."}, {"url": "http://www.bbc.co.uk/bitesize/standard/physics/telecommunications/communication_using_waves/revision/5/", "passage_text": "Wavelength is also measured in metres (m) - it is a length after all. The frequency, f, of a wave is the number of waves passing a point in a certain time. We normally use a time of one second, so this gives frequency the unit hertz (Hz), since one hertz is equal to one wave per second."}, {"url": "http://www.wikihow.com/Calculate-Frequency", "passage_text": "Frequency, also called wave frequency, is a measurement of the total number of vibrations or oscillations made within a certain amount of time. There are a few different ways to calculate frequency based on the information you have available to you. Keep reading to learn some of the most common and useful versions. Ad."}, {"url": "http://www.earthguide.ucsd.edu/wav/frequency.html", "passage_text": "Wave frequency is also related to another measurement called the wave period (T). The wave period is just how much time it takes for one cycle to pass and the units are always in terms of time. The faster a wave moves, its wave period becomes smaller."}, {"url": "http://www.wikihow.com/Calculate-Wavelength", "passage_text": "If you want to calculate the wavelength of a wave, then all you have to do is plug the wave's speed and wave's frequency into the equation. Plug the quantities from this problem into the equation: Find the wavelength of a wave traveling at 20 m/s at a frequency of 5 Hz."}, {"url": "http://physics.tutorvista.com/waves/wave-frequency.html", "passage_text": "For the sound wave we use Hertz as the unit of measurement where 1 Hertz = 1 vibration/second. Conceptually whenever a wave passes the medium it makes the first particle to which it comes in contact, vibrate. Then this particle vibrates the nearby particle at the same frequency. This is how energy is propagated."}]