[{"url": "http://www.answers.com/Q/Mechanism_for_evolution_that_Charles_Darwin_proposed", "passage_text": "Charles Darwin proposed a mechanism-called natural selection-for how evolution takes place. http://wiki.answers.com/Q/What_did_Charles_Darwin_propose. 8 people found this useful. Edit. Share to: Jorge Quinones. 41,382 Contributions. There are things that interest me. History covers them all."}, {"url": "https://quizlet.com/18042357/ap-bio-evolutionnatural-selection-flash-cards/", "passage_text": "The mechanism for evolutionary change proposed by Charles Darwin was descent with modification.. Darwin perceived unity in life, with all organisms related through descent from some unknown ancestor in the remote past."}, {"url": "https://answers.yahoo.com/question/index?qid=20150122203410AAc1x53", "passage_text": "Though Darwin proposed natural selection as the primary evolutionary mechanism, he accepted other auxiliary mechanisms too. The most important of these was the transmission of acquired characteristics (those acquired by use-disuse) first proposed by Lamarck in the early 1800s.."}, {"url": "http://www.answers.com/Q/What_does_Darwin_propose_as_his_mechanism_for_evolution", "passage_text": "Charles Darwin proposed the theory of Natural Selection as a mechanism of evolution. His theory includes many aspects. The organism that is better suited to the environment ha … s a higher chance of survival."}, {"url": "http://www.answers.com/Q/Mechanism_for_evolution_that_Charles_Darwin_proposed", "passage_text": "Natural selection was the mechanism for evolution that Darwin proposed, though there are other mechanisms of evolution. Genetic drift and gene flow are two more mechanisms o … "}, {"url": "http://www.answers.com/Q/What_does_Darwin_propose_as_his_mechanism_for_evolution", "passage_text": "Natural selection was the mechanism for evolution that Darwin proposed, though there are other mechanisms of evolution. Genetic drift and gene flow are two more mechanisms o … "}, {"url": "http://www.answers.com/Q/Mechanism_for_evolution_that_Charles_Darwin_proposed", "passage_text": "Charles Darwin proposed a mechanism-called natural selection-for how evolution takes place.   Evolution is the process by which living things become adapted to th … eir environment and new species develop. The idea of evolution was already widely discussed before Darwin but there was no widely accepted mechanism."}, {"url": "http://darwinwasright.org/heredity.html", "passage_text": "When Charles Darwin proposed his theory of evolution in 1859, one of its major problems was the lack of an underlying mechanism for heredity. Darwin believed in a mix of blending inheritance and the inheritance of acquired traits (pangenesis)."}, {"url": "http://www.answers.com/Q/Mechanism_for_evolution_that_Charles_Darwin_proposed", "passage_text": "Charles Darwin proposed the theory of Natural Selection as a mechanism of evolution. His theory includes many aspects. The organism that is better suited to the environment has a higher chance of survival."}]