[{"url": "http://www.consumeractiongroup.co.uk/forum/showthread.php?203427-How-long-will-my-default-stay-on-credit-file", "passage_text": "re: How long will my default stay on credit file. Yes 6 years from the date of default, whether or not you have settled the account. I made the mistake of trying to keep accounts out of default when I lost my job, it just delays the agony. Re: How long will my default stay on credit file. A defaulted account, 'the default' can still be paid even when defaulted. In your case looking at your info in your oringinal post you have not paid the default amount (1735) it is not settled. The default date was 08/02/08 and so will drop off your credit file 08/02/14."}, {"url": "http://blog.equifax.com/credit/how-long-does-information-stay-on-my-credit-report/", "passage_text": "1 Tax liens. 2  Paid tax liens will typically stay on your credit report for seven years from the date released (paid), while unpaid tax liens can remain on your credit report for 15 years. 3  Bankruptcies. 4  In general, the public record of a bankruptcy can stay on your credit report for 10 years. How long negative information appears on your credit report depends on the type of information: 1  Late paid accounts. 2  In general, negative information will stay on your credit report for seven years from the date of last activity."}, {"url": "http://www.consumeractiongroup.co.uk/forum/showthread.php?203427-How-long-will-my-default-stay-on-credit-file", "passage_text": "re: How long will my default stay on credit file. This is getting complicated If it's not been paid, it's not been settled, it just drops off after 6 years. Any advice I give is honest and in good faith. If in doubt, you should seek the opinion of a Qualified Professional. If you can, please donate to this site. Re: How long will my default stay on credit file. A defaulted account, 'the default' can still be paid even when defaulted. In your case looking at your info in your oringinal post you have not paid the default amount (1735) it is not settled. The default date was 08/02/08 and so will drop off your credit file 08/02/14."}, {"url": "http://www.answers.com/Q/How_long_does_a_mortgage_default_stay_on_your_credit_file", "passage_text": "Most information (good and bad) will stay on your credit report for seven years. However, some financial disasters (divorce, bankruptcy) can stay for as long as ten years. The … silver lining to this is that, the older the negative information is, the less influence it has on the overall report. "}, {"url": "http://www.financecomparison.com.au/bad-credit-loans-article-disappear.cfm", "passage_text": "1 Overdue accounts reported as a default on your credit file will remain on the report for five years from the date of listing. 2  Overdue accounts reported as a clearout will remain on the file for seven years from the date of listing. "}, {"url": "https://ico.org.uk/for-the-public/bankruptcy/", "passage_text": "Yes. If an account has been included in your bankruptcy, the lender should have marked the account in default. The default will stay on your credit reference file for six years from the date of the default. You can ask the credit reference agency to add a statement called a 'notice of correction' to the default entry. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070218081425AAge7HR", "passage_text": "Report Abuse. each new default stays on for a maximum of 6 years ... every credit check goes back 6 years from the date they submit it. whats on your credit rateing before that can not be revealed.. andygames07 · 9 years ago."}, {"url": "http://www.experian.co.uk/consumer/questions/askjames211.html", "passage_text": "Dear Richard, The default will stay on your credit report for six years from the default date, so it should disappear sometime during 2012. While lenders tend to concentrate on your most recent credit history when assessing new credit applications, a four-year-old default might still cause you problems. "}, {"url": "http://www.consumeractiongroup.co.uk/forum/showthread.php?203427-How-long-will-my-default-stay-on-credit-file", "passage_text": "re: How long will my default stay on credit file. A default naturally drops off a credit file after six years no matter whether it's paid or not. Anthrax alert at debt collectors caused by box of doughnuts Make sure you do not post anything which identifies you. Re: How long will my default stay on credit file. A defaulted account, 'the default' can still be paid even when defaulted. In your case looking at your info in your oringinal post you have not paid the default amount (1735) it is not settled. The default date was 08/02/08 and so will drop off your credit file 08/02/14."}]