[{"url": "http://www.liazon.com/wp-content/uploads/Private_Exchange_White_Paper.pdf", "passage_text": "• “Individual in Group Clothing” Private Exchange – A private exchange that sells individual market health plans to employees of employers through an HRA.• Individual Market Private Exchange – A private exchange that sells health insurance to individuals and families in the individual health insurance market."}, {"url": "https://www.healthinsurance.org/faqs/what-is-a-private-exchange/", "passage_text": "A. A private exchange is simply an online resource set up by brokers, insurance carriers or benefit consultants, where individuals and employers can shop for health insurance, enroll in a plan, and receive customer support as needed."}, {"url": "http://www.aetna.com/health-reform-connection/reform-explained/video-exchanges.html", "passage_text": "So that’s the public exchange – offered by the government – either state or federal, or both. There are also private exchanges. Private exchanges are not part of the Affordable Care Act. They are created by private sector companies, for example, by a health insurance company or a brokerage or consulting firm."}, {"url": "http://www.liazon.com/wp-content/uploads/Private_Exchange_White_Paper.pdf", "passage_text": "For example, some private exchanges service individuals purchasing insurance in the individual health insurance market. Other private exchanges service the “group” health insurance market – both the fully-insured and the self-insured markets – offering group health plans to large and small employers."}, {"url": "http://www.usatoday.com/story/money/personalfinance/2013/09/18/walgreens-workers-buy-health-plans-state-marketplaces/2830105/", "passage_text": "Walgreen's announcement that it will send its workers to a private health insurance exchange to buy their own plans is a sign of the times that isn't going away. And that may be good news for consumers, though it's too soon to tell, experts say."}, {"url": "http://www.aetna.com/health-reform-connection/reform-explained/video-exchanges.html", "passage_text": "Most people get health insurance through their employers. But people without this option can now shop for health insurance on exchanges, as an alternative to buying coverage directly from individual health insurers. Public exchanges opened for business in October 2013, allowing consumers to shop for health plans that began on January 1, 2014 or later."}, {"url": "http://www.strategyand.pwc.com/media/uploads/Strategyand-Emergence-Private-Health-Insurance-Exchanges.pdf", "passage_text": "EXECUTIVE SUMMARY Health insurance in the U.S. is at the cusp of a major transition from an employer-driven payor model to a model directly involving many more employees and consumers. Private health insurance exchanges with a defined contribution approach represent a significant step toward catalyzing this change."}, {"url": "http://www.strategyand.pwc.com/media/file/Private-health-insurance-exchanges.pdf", "passage_text": "Private exchanges are marketplaces of health insurance and other related products. Employers purchase health insurance through the private exchange, and then their employees can choose a health plan from those supplied by participating payors."}]