[{"url": "http://www.interpretereducation.org/specialization/deaf-interpreter/", "passage_text": "The Deaf-Hearing interpreter team ensures that the spoken language message reaches the Deaf consumer in a language or communication form that he or she can understand, and that the Deaf consumer’s message is conveyed successfully in the spoken language."}, {"url": "http://www.acdhh.org/interpreter-services", "passage_text": "Interpreter Services. The State of Arizona wants to make sure the Deaf and Hard of Hearing individuals are receiving Quality access to communication. That's why Arizona Sign Language Interpreters are now required to be licensed through the Arizona Commission for the Deaf and the Hard of Hearing."}, {"url": "http://www.diinstitute.org/what-is-the-deaf-interpreter/", "passage_text": "A Deaf Interpreter is a specialist who provides interpreting, translation, and transliteration services in American Sign Language and other visual and tactual communication forms used by individuals who are Deaf, hard-of-hearing, and Deaf-Blind."}, {"url": "http://kcdhh.ky.gov/oea/whatisterp.html", "passage_text": "Certified Deaf Interpreter (CDI) - A deaf or hard of hearing individual, who is able to assist in providing an accurate interpretation between standard sign language and variants of sign language (including home signs) by acting as an intermediary between a deaf or hard of hearing person and a qualified interpreter."}, {"url": "http://www.streetleverage.com/2014/11/hearing-interpreters-the-danger-of-being-the-public-face-of-asl/", "passage_text": "The very notion that Deaf people can work as professional sign language interpreters is new for most hearing people; indeed, if they see ASL at all, it’s usually hearing interpreters like me, or signed music videos of questionable value (also by hearing people) on social media."}, {"url": "http://www.interpretereducation.org/specialization/deaf-interpreter/", "passage_text": "NCIEC studies indicate that in many situations, use of a Deaf Interpreter enables a level of linguistic and cultural bridging that is often not possible when hearing ASL-English interpreters work alone. Currently, Deaf Interpreters work most often in tandem with hearing interpreters."}, {"url": "http://www.diinstitute.org/what-is-the-deaf-interpreter/", "passage_text": "The Deaf-Hearing interpreter team ensures that the spoken language message reaches the Deaf consumer in a language or communication form that he or she can understand, and that the Deaf consumer’s message is conveyed successfully in the spoken language."}, {"url": "http://www.interpretereducation.org/specialization/deaf-interpreter/", "passage_text": "Deaf Interpreter. A Deaf Interpreter is a specialist who provides interpreting, translation, and transliteration services in American Sign Language and other visual and tactual communication forms used by individuals who are Deaf, hard-of-hearing, and Deaf-Blind."}, {"url": "http://www.handsandvoices.org/articles/misc/V13-2_interpDiff.htm", "passage_text": "Lorrie Kosinski is a certified sign language interpreter who has served as the on-staff interpreter/ interpreter coordinator and Communication Specialist for Denver City/County agencies through the Denver Office of Disability Rights since 1987."}, {"url": "http://kcdhh.ky.gov/oea/whatisterp.html", "passage_text": "Oral Interpreter-Transliterators transliterate a spoken message from a person who hears to a person who is deaf or hard of hearing. They possess the ability to understand and repeat the message and intent of the speech and mouth movements of the person who is deaf or hard-of-hearing."}]