[{"url": "http://terpconnect.umd.edu/~wbreslyn/chemistry/is-copper-magnetic.html", "passage_text": "The answer is that copper itself is not magnetic or is only slightly magnetic (not big enough to see under normal situations). But it does interact with magnets and that's pretty important. If you have a strong enough magnetic field all matter is magnetic. But copper is so weakly magnetic that we can't observe it without very, very large magnetic fields. So the short answer is No, copper isn t magnetic.."}, {"url": "http://terpconnect.umd.edu/~wbreslyn/chemistry/is-copper-magnetic.html", "passage_text": "When a magnet moves near copper (or other metals) it sets up electrical eddy currents. The eddy currents will repel the magnet as it falls down the copper tube. This repulsion pushes against the magnet and slows it down. In the video you can see that the magnet appears to float through the tube. If you have a strong enough magnetic field all matter is magnetic. But copper is so weakly magnetic that we can't observe it without very, very large magnetic fields. So the short answer is No, copper isn t magnetic.."}, {"url": "https://en.wikipedia.org/wiki/Tetraamminecopper(II)_sulfate", "passage_text": "Tetraamminecopper(II) sulfate is the inorganic compound with the formula [Cu(NH 3) 4 (H 2 O) n ]SO 4. This dark blue solid is a metal complex with faint odor of ammonia. It is closely related to Schweizer's reagent, which is used for the production of cellulose fibers in the production of rayon. Synthesis [edit]. This compound can be prepared by adding concentrated solution of ammonia to a saturated aqueous solution of copper sulfate followed by precipitation of the product with ethanol. NH 3 + CuSO 4 →"}, {"url": "http://www.answers.com/Q/Is_copper_II_sulfate_magnetic", "passage_text": "If an aqueous solution of copper(II) sulfate is contacted with metallic iron, at the least the surface of the iron passes into solution and is replaced by a layer of metallic … copper. This is an example of displacement by a metal higher in the electromotive series than the metal it displaces. Joppe De Quint. 1 How to Make a Copper Sulfate Solution Copper sulfate is a reagent used in many applications. 2  It is used in aquariums to kill algae. 3  It is also used as a solution for copper plating."}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Copper (II) sulfate, also known as cupric sulfate or copper sulphate, is the inorganic compound with the chemical formula Cu SO4. When water is then added to the anhydrous compound, it turns back into the pentahydrate form, regaining its blue color, and is known as blue vitriol. Copper(II) sulfate pentahydrate can easily be produced by crystallization from solution as copper(II) sulfate is quite hygroscopic."}, {"url": "http://www.answers.com/Q/Is_copper_sulphate_magnetic", "passage_text": "Hydrated copper sulphate or CuSO4.5H2O is a hydrated salt. It contains the water of crystallisation molecules(water molecules are attached to it). It is also known as blue vit … riol because of its blue colour. CUPRIC is used when copper has the oxidation state +2 For example CuSO4 is copper (II) sulphate or cupric sulphate. It is often simply called copper sulphate. So the answe … r is that there's no difference. Copper sulphate is another name for cupric sulphate."}, {"url": "http://info.ee.surrey.ac.uk/Workshop/advice/coils/mu/", "passage_text": "The 'poles' of the molecule tend to line up parallel with the field and reinforce it. Such molecules, with permanent magnetic moments are called paramagnetic. Although paramagnetic substances like oxygen, tin, aluminium and copper sulphate are attracted to a magnet the effect is almost as feeble as diamagnetism. "}, {"url": "http://www.answers.com/Q/Is_copper_sulphate_magnetic", "passage_text": "On the other hand copper sulphate or CuSO4 is an anhydrous salt i.e. there are no water of crystallisation molecules. It is a white anhydrous powder and can be produced on heating hydrated copper sulphate. It is actually the anhydrous form of hydrated copper sulphate. 4 people found this useful. CUPRIC is used when copper has the oxidation state +2 For example CuSO4 is copper (II) sulphate or cupric sulphate. It is often simply called copper sulphate. So the answe … r is that there's no difference. Copper sulphate is another name for cupric sulphate."}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "The anhydrous form is a pale green or gray-white powder, whereas the pentahydrate (CuSO 4 ·5H 2 O), the most commonly encountered salt, is bright blue. Copper (II) sulfate exothermically dissolves in water to give the aquo complex [Cu(H 2 O) 6 ] 2+ , which has octahedral molecular geometry and is paramagnetic. Other names for copper(II) sulfate are blue vitriol and bluestone. When water is then added to the anhydrous compound, it turns back into the pentahydrate form, regaining its blue color, and is known as blue vitriol. Copper(II) sulfate pentahydrate can easily be produced by crystallization from solution as copper(II) sulfate is quite hygroscopic."}]