[{"url": "http://lifestyle.howstuffworks.com/crafts/sewing/how-to-mend-clothes5.htm", "passage_text": "How to Repair a Broken Zipper. A garment with a broken zipper is unwearable -- new or old, shabby or not. Instead of abandoning it, repair the zipper, or replace it with a new one. Tools: needle, sewing scissors needle-nosed pliers, seam ripper, straight pins, sewing machine. Materials: thread, small safety pin or paper clip, old zipper of similar size; replacement zipper, if required. Time: 5 to 15 minutes for repair; 1/2 to 1 hour for replacement. Before you decide to replace a zipper, examine it carefully to see if you can repair it."}, {"url": "http://www.manmadediy.com/users/dan_e_t/posts/2698-the-diy-tailor-three-common-broken-zipper-problems-and-how-to-fix-them", "passage_text": "2) Move the slider to the bottom of the zipper. 3) Angle the slider and insert the opposite side of the zipper into the bottom of the slider. 4) Sometimes the edge of the zipper is a little thick to easily slide into the side of the slider. You can use a narrow screwdriver to push the edge in. 3) Using a pliers, pull off the the stop at the bottom of the zipper. 4) Slide one side of the zipper into each side of the slider. The slider should be upside down as you're looking at it. If you do it with the zipper tab facing you, the zipper will function inside out."}, {"url": "http://www.manmadediy.com/users/dan_e_t/posts/2698-the-diy-tailor-three-common-broken-zipper-problems-and-how-to-fix-them", "passage_text": "7) Now we need to free up the backside of the zipper so we can close the bottom. On the inside of the garment, use a seam ripper or razor to cut the tack the holds together the placket layers. 8) To close the bottom, you'll need a zipper bottom stop. 3) Using a pliers, pull off the the stop at the bottom of the zipper. 4) Slide one side of the zipper into each side of the slider. The slider should be upside down as you're looking at it. If you do it with the zipper tab facing you, the zipper will function inside out."}, {"url": "https://answers.yahoo.com/question/index?qid=20091222223630AABsYl9", "passage_text": "Instead of ripping the old one out and sewing on a new one, try these steps to get your zipper back in working order. Step 1 With a small pair of pliers (needle-nose pliers work best), pry off the zipper's metal stop, the little band at the bottom of the zipper that stops the slider when you open the zipper (see A). Step 6 Starting with your thread on the back side of the zipper, make six or seven stitches across the bottom of the zipper where the old stop was, creating a new stop out of thread (see B). Step 7 With your thread on the back side of the zipper, tie a knot in the thread and snip it off with your scissors"}, {"url": "http://www.instructables.com/id/Fix-a-Separated-Boot-Zipper-any-zipper-really/", "passage_text": "Coffee's in the cup. The only thing standing between you and doing stuff is shoes. But you go to zip up your boot and it happens: the zipper separates. Sure, you could wear different shoes, change your whole outfit, or throw up your hands in despair and go back to bed... But you don't give up that easily"}, {"url": "http://susanfriedlandsmith.com/2014/11/09/how-to-fix-a-broken-zipper-on-your-boot/", "passage_text": "Here is what I did and my boots are as good as new. 1. Spray Windex (I used the Target version) all along the zipper and pull the zipper down to the bottom, the starting point. You might have to really muscle it to get it to go up or down. 2. Smooth a fragment of candle wax along the zipper. (Just to be sure"}, {"url": "http://www.manmadediy.com/users/dan_e_t/posts/2698-the-diy-tailor-three-common-broken-zipper-problems-and-how-to-fix-them", "passage_text": "If you did, you would reverse the direction of the zipper and then it would be useless. 2) Cut the thread tack on the inside like in step 7 of the first demo. 3) Using a pliers, pull off the the stop at the bottom of the zipper. 4) Slide one side of the zipper into each side of the slider. The slider should be upside down as you're looking at it. If you do it with the zipper tab facing you, the zipper will function inside out. 5) Keeping even tension on both sides of the bottom of the zipper, gently pull the slider to start the zipper"}, {"url": "http://lifehacker.com/5975700/how-to-fix-every-common-zipper-problem", "passage_text": "The Zipper Pull Broke Off. When the pull breaks off a zipper it makes it incredibly hard to zip the zipper up. The good news is that this is pretty much the easiest fix out there. You can turn a paperclip, a keyring, or even a telephone wire connector into a zipper pull. Just slide it through the tab on the slider and you have a new zipper pull. Try it again and it should work. If that doesn't work, it's time to move on to a lubricant. Windex is good because it's not oil-based, but you can also use bar soap, or lip balm. Start with the zipper all the way up, and slowly apply the the lubricant to the teeth."}]