[{"url": "http://www.onenesspentecostal.com/yahorjesus.htm", "passage_text": "Jason Dulle. JasonDulle@yahoo.com. In the OT God declared that His name was YHWH (Exodus 6:3; 20:7; see also 3:14). Scholars believe that YHWH, or Yahweh is the third person singular form of the ancient Hebrew verb, haya, meaning to be.. The basic thrust of this verb describes the state of existenc"}, {"url": "http://www.thefreedictionary.com/Yahweh", "passage_text": "Yahweh-a name for the God of the Old Testament as transliterated from the Hebrew consonants YHVH. Jahvey, Jahweh, Jehovah, JHVH, Wahvey, Yahve, Yahveh, Yahwe, YHVH, YHWH. "}, {"url": "http://www.thefreedictionary.com/YHWH", "passage_text": "YHWH-a name for the God of the Old Testament as transliterated from the Hebrew consonants YHVH. Jahvey, Jahweh, Jehovah, JHVH, Wahvey, Yahve, Yahveh, Yahwe, Yahweh, YHVH. "}, {"url": "http://www.abarim-publications.com/Meaning/YHWH.html", "passage_text": "The name YHWH in the Bible. YHWH is the second creation Name of God. God's Name changes from Elohim to YHWH Elohim in Genesis 2:4 and the reason for this change is examined in our article on the Chaotic Set Theory. It has been long supposed that YHWH was derived from the verb that is used to make I AM, namely היה (haya), meaning to be or to become, or rather from an older form and rare synonym of haya, namely הוה, hawa, hence y-hawa or yahweh, the proper imperfect of the verb, thus rendering the name either BEING or HE IS."}, {"url": "http://www.patheos.com/blogs/christiancrier/2014/05/30/what-does-yahweh-mean-a-biblical-study/", "passage_text": "Jehovah is not YHWH. No one knows how this name of God is actually pronounced and so this lead to the vowels from “Adonai” (Lord) and “Elohim” (God) being inserted into YHWH to become Yahweh however this does not mean that this is how God’s name was originally pronounced or how God pronounced it. Even the Hebrew letter vav, which is transliterated as the W in YHWH is said to have originally had a pronunciation closer to W than the V of Jehovah. Jehovah is essentially a Germanic pronunciation of the Latinized transliteration of the Hebrew YHWH."}, {"url": "https://en.wikipedia.org/wiki/Yahweh", "passage_text": "This article is about the national god of the Iron Age kingdoms of Israel and Judah. For other uses, see Yahweh (disambiguation). See also: Tetragrammaton. Yahweh (/ˈjɑːhweɪ/ , or often /ˈjɑːweɪ/ in English; Hebrew: יהוה ‎) is the national god of the ancient kingdoms of Israel and Judah. El, not Yahweh, was the original God of Israel—the word Israel is based on the name El rather than Yahweh. He was the chief of the Canaanite gods, described as the kind, the compassionate, the creator of creatures."}, {"url": "https://en.wikipedia.org/wiki/Tetragrammaton", "passage_text": "The tetragrammaton (from Greek τετραγράμματον, meaning (consisting) of four letters) is the Hebrew theonym יהוה, commonly transliterated into Latin letters as YHWH. It is one of the names of the national God of the Israelites used in the Hebrew Bible. The most widely accepted pronunciation of the tetragrammaton (YHWH) is Yahweh. Genebrardus suggested the pronunciation Jahve based on Theodoret 's assertion that the Samaritans used the pronunciation Iabe. For most Jews, however, it was forbidden to pronounce or even write in full, the tetragrammaton."}, {"url": "https://www.knowingthebible.net/the-meaning-of-Yahweh", "passage_text": "The word “He is” comes from the Hebrew root word haya, which means, “to be.” It is the third person form of this word, “He is,” that becomes the name Yahweh. The significance of the name Yahweh is that it is confirming God’s existence but most importantly His presence. In the context of Ex. 3, God is talking about His presence with Moses and subsequently with Israel. Meaning-of-Yahweh. The name Yahweh is best known from the famous “I AM” interaction with Moses (Ex. 3) and references the fact that God has always existed and will always exist. Though this is true, it is also a very basic understanding of the meaning of Yahweh"}]