[{"url": "https://en.wikipedia.org/wiki/Cura%C3%A7ao_liqueur", "passage_text": "Curacao (/curaçao/ ˈKJʊəRəSAʊ-kewr-ə) sow is a liqueur flavored with the dried peel of the laraha citrus, fruit grown on the island Of. curacao curaçao The nutrient-poor soil and arid climate of Curacao curaçao proved unsuitable To valencia, cultivation resulting in, small bitter fruit of the. Trees although the bitter flesh of the laraha is hardly, edible the peels are aromatic and, flavorful maintaining much of the essence of The valencia. orange"}, {"url": "http://www.thefiftybest.com/wine/best_champagne_cocktails/", "passage_text": "Champagne Cobbler 1/2 tsp lemon juice, 1/2 tsp curacao, curaçao thin slice of, orange chilled Champagne fill a large goblet half full of cracked. ice These are the fifty best.Nine times nine cheers! Champagne Cobbler 1/2 tsp lemon juice, 1/2 tsp curacao, curaçao thin slice of, orange chilled Champagne fill a large goblet half full of cracked. Ice add lemon, juice, curacao curaçao and. orange slice"}, {"url": "http://cocktails.about.com/od/cocktailsbyflavor/a/orange-liqueur-cocktail-recipes_2.htm", "passage_text": "Curacao Curaçao. Cocktails (curacao curaçao-pronounced) kurra sow liqueur is, a-sweet orange flavored. Distilled spirit it is often made from the dried peels of small laraha oranges that are more bitter than. Common oranges curacao curaçao liqueur is the oldest style of orange liqueur known and is often called for in. classic cocktail recipes It is often made from the dried peels of small laraha oranges that are more bitter than common oranges. Curacao curaçao liqueur is the oldest style of orange liqueur known and is often called for in classic cocktail. Recipes there are four colors of curacao: curaçao, available, orange, blue green. and white"}, {"url": "http://www.sheknows.com/recipes/champagne-and-curaao-cocktail", "passage_text": "Curacao curaçao is a slightly, bitter-orange flavored liqueur made from the dried peel of the laraha citrus. Fruit try it mixed with champagne and bitters in this delicious champagne. cocktail "}, {"url": "http://www.drinksmixer.com/cat/494/", "passage_text": "1/2 oz lime juice. 2 oz orange juice. Blue Curacao liqueur. 1 tsp sugar. Serve in: Wine Goblet. Grand Mimosa recipe. Pour grand marnier into a champagne flute. Fill almost to the top with champagne and top off with fresh orange juice. Poinsettia recipe. Mix the champagne and cranberry juice, then float the Grand Marnier on top. 1 tbsp Grand Marnier® orange liqueur. 1 part cranberry juice. 1 part Champagne. Serve in: Champagne Flute. Ritz Fizz recipe. Pour blue curacao, amaretto and lemon juice into a champagne flute filled with champagne. Stir, add a twist of lemon, and serve. 1 dash Blue Curacao liqueur. 1 dash amaretto almond liqueur. 1 dash lemon juice. Champagne. Serve in: Champagne Flute. Royal Silver recipe. Rim a wine glass with grenadine and caster sugar"}, {"url": "http://www.curacao.com/en/directory/do/sights-and-sounds/curacao-winery/", "passage_text": "Curacao Curaçao. Winery, recently The Curacao curaçao winery opened its doors at the unique ‘Location At’ (Landhuis Hato hato), country house where history and viniculture now flow. Together seamlessly here you can enjoy wine from our. Own vineyard call in and taste a glass on our terrace or take a guided tour of. our vineyard Curacao Curaçao. Winery, recently The Curacao curaçao winery opened its doors at the unique ‘Location At’ (Landhuis Hato hato), country house where history and viniculture now flow. Together seamlessly here you can enjoy wine from our. o"}, {"url": "https://en.wikipedia.org/wiki/Cura%C3%A7ao_liqueur", "passage_text": "(Redirected from Curacao curaçao). Liqueur (/curacao/ CURAçAO-ˈkjʊərəsaʊ-kewr) ə sow is a liqueur flavored with the dried peel of the laraha, citrus fruit grown on the Island. Of curacao-curaçao a non native plant similar, to an orange the laraha developed From the sweet valencia Orange transplanted. by spanish explorers The nutrient-poor soil and arid climate of Curacao curaçao proved unsuitable To valencia, cultivation resulting in, small bitter fruit of the. Trees although the bitter flesh of the laraha is hardly, edible the peels are aromatic and, flavorful maintaining much of the essence of The valencia. orange"}, {"url": "http://drinksmixer.com/cat/2416/", "passage_text": "Layer both ingredients in a cocktail glass, and serve. 2 oz lemon juice. 2 oz Blue Curacao liqueur. 15% (30 proof). Serve in: Cocktail Glass. Dark Lagoon recipe. Pour the blue curacao and grenadine into a highball glass. Fill with pineapple-flavored wine, to taste, and stir. Garnish with a slice of pineapple. 1 oz Blue Curacao liqueur. 1 oz grenadine syrup. pineapple wine. Serve in: Highball Glass. Dolphin's Foam recipe. Shake vigorously in a shaker with lots of ice. Pour curacao over ice in a highball glass, then fill the rest of the way up with ginger ale. 1 1/2 oz Bols® Blue Curacao liqueur. fill with ginger ale. 4% (8 proof). Serve in: Highball Glass. Green Widow recipe. Pour blue curacao into a cocktail glass."}, {"url": "http://drinksmixer.com/cat/2416/", "passage_text": "Chill the grenadine. Pour the blue curacao into a champagne flute. Add the sprite to taste. Slowly pour the grenadine into the glass in order for it to sink. Add the Bailey's irish cream with a teaspoon slowly in the glass to allow it to float, and serve. Pour curacao over ice in a highball glass, then fill the rest of the way up with ginger ale. 1 1/2 oz Bols® Blue Curacao liqueur. fill with ginger ale. 4% (8 proof). Serve in: Highball Glass. Green Widow recipe. Pour blue curacao into a cocktail glass."}]