[{"url": "http://www.webmd.com/melanoma-skin-cancer/skin-cancer-guide/skin-cancer-nonmelanoma-medications", "passage_text": "Medicines are rarely used to treat nonmelanoma skin cancer. Surgery is the most common and the most effective treatment. But when surgery is not possible, your doctor may suggest medicines. Medicines may also be used when a skin cancer is too large for surgery or when new skin cancers keep appearing. Medicines that may be used to treat basal cell carcinoma include: 1  Fluorouracil (5-FU). 2  Imiquimod (Aldara). 3  Vismodegib pills may be used if surgery and radiation haven't worked and if the basal cell carcinoma has spread to other parts of the body."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/skin-cancer/treatment/which-treatment-for-skin-cancer", "passage_text": "A drug called interferon is a type of immunotherapy. It is sometimes used to treat advanced squamous cell skin cancers. Basal cell skin cancers may be treated with imiquimod cream. This cream stimulates the immune system to attack the cancer. Photodynamic therapy (PDT). This is a relatively new type of treatment. It is another alternative to surgery. PDT uses a drug that makes skin cells sensitive to light. The area of skin that needs treating is exposed to a special type of light, and the cancer cells are destroyed."}, {"url": "http://www.healthline.com/health/skin-cancer/treatments", "passage_text": "Skin Cancer Treatments and Drugs. The three primary types of skin cancer are basal cell carcinoma, squamous cell carcinoma, and melanoma. In addition to surgery, there are several other treatment options. It’s crucial to catch skin cancer in the early stages. Long-term survival can depend on early treatment. Even though not specifically designed to treat superficial squamous cell carcinomas, they are sometimes used to good effect. Other skin cancer drugs include: 1  Ipilimumab (Yervoy) – Approved in 2011 by the Food and Drug Administration (FDA), this drug is for treating late-stage melanoma."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/skin-cancer/treatment/chemotherapy-for-skin-cancer", "passage_text": "The chemotherapy drug fluorouracil (5FU) can be applied to the skin cancer in a cream. This is called topical chemotherapy. Very little of the drug is absorbed into the body. This treatment is only used for cancers affecting the top layer of skin. Chemotherapy means the use of anti cancer drugs to destroy cancer cells. You can have chemotherapy as a cream or through a drip into a vein to treat your skin cancer."}, {"url": "http://www.nccn.org/patients/resources/life_with_cancer/managing_symptoms/skin_rashes.aspx", "passage_text": "Skin Rashes. Certain drugs used in cancer treatment can cause skin problems. One example is EGFR (e pidermal g rowth f actor r eceptor) inhibitors. These drugs are often prescribed for patients with colon, head and neck, pancreatic, non-small cell lung, and breast cancers. "}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/skin-cancer/treatment/which-treatment-for-skin-cancer", "passage_text": "Another alternative to an operation for basal cell skin cancer is treatment with a drug to make your skin sensitive to light. This is followed by treatment with a bright light to the affected area. This treatment is called photodynamic therapy or PDT. Chemotherapy is only occasionally used for skin cancer. Chemotherapy cream (containing fluorouracil) is mainly used to treat actinic (or solar) keratosis and Bowen's disease. Photodynamic therapy (PDT). This is a relatively new type of treatment. It is another alternative to surgery. PDT uses a drug that makes skin cells sensitive to light. The area of skin that needs treating is exposed to a special type of light, and the cancer cells are destroyed."}, {"url": "http://www.cancer.gov/about-cancer/treatment/drugs/skin", "passage_text": "Research. This page lists cancer drugs approved by the Food and Drug Administration (FDA) for skin cancer, including drugs for basal cell carcinoma and melanoma. The list includes generic names and brand names. The drug names link to NCI's Cancer Drug Information summaries. There may be drugs used in skin cancer that are not listed here."}, {"url": "http://www.cancer.org/cancer/skincancer-melanoma/detailedguide/melanoma-skin-cancer-treating-chemotherapy", "passage_text": "Chemotherapy for melanoma skin cancer. Chemotherapy (chemo) uses drugs that kill cancer cells. The drugs are usually injected into a vein or taken by mouth as a pill."}, {"url": "http://www.cancer.gov/about-cancer/treatment/drugs/skin", "passage_text": "Drugs Approved for Skin Cancer. This page lists cancer drugs approved by the Food and Drug Administration (FDA) for skin cancer, including drugs for basal cell carcinoma and melanoma. The list includes generic names and brand names. The drug names link to NCI's Cancer Drug Information summaries. There may be drugs used in skin cancer that are not listed here."}]