[{"url": "http://www.memorialcare.org/services/glossary/a/abnormal-heart-rhythms-arrhythmias", "passage_text": "Each year millions of people experience abnormal heart rhythms (arrhythmias), which are common as we age. For most, a normal resting heart rate is 60 to 100 beats per minute (bpm). For athletic individuals, a normal resting heart rate may be as low as 40 to 60 bpm. Abnormal heart rhythms can be described as a heart beating too fast (above 100 bpm) or slow (below 60 bpm), a fluttering sensation in the chest area or the skipping of a heart beat."}, {"url": "http://www.livescience.com/42081-normal-heart-rate.html", "passage_text": "Heart rate, also known as pulse, is the number of times a person's heart beats per minute. A normal heart rate depends on the individual, age, body size, heart conditions, whether the person is sitting or moving, medication use and even air temperature. Even emotions can have an impact on heart rate. For example, getting excited or scared can increase the heart rate."}, {"url": "https://en.wikipedia.org/wiki/Heart_rate", "passage_text": "The normal resting adult human heart rate ranges from 60–100 bpm. Tachycardia is a fast heart rate, defined as above 100 bpm at rest. Bradycardia is a slow heart rate, defined as below 60 bpm at rest. During sleep a slow heartbeat with rates around 40–50 BPM is common and is considered normal. Normal resting heart rates range from 60–100 bpm. Bradycardia is defined as a resting heart rate below 60 bpm. However, heart rates from 50 to 60 bpm are common among healthy people and do not necessarily require special attention."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/fitness/expert-answers/heart-rate/faq-20057979", "passage_text": "A normal resting heart rate for adults ranges from 60 to 100 beats a minute. Generally, a lower heart rate at rest implies more efficient heart function and better cardiovascular fitness. For example, a well-trained athlete might have a normal resting heart rate closer to 40 beats a minute. To measure your heart rate, simply check your pulse. Place your index and third fingers on your neck to the side of your windpipe. Consult your doctor if your resting heart rate is consistently above 100 beats a minute (tachycardia) or if you're not a trained athlete and your resting heart rate is below 60 beats a minute (bradycardia) — especially if you have other signs or symptoms, such as fainting, dizziness or shortness of breath. With."}, {"url": "http://www.drjohnm.org/2011/08/whats-a-normal-heart-rate/", "passage_text": "As a heart rhythm specialist, I am often asked to see patients referred for low or high heart rates. We are asked to be the judge for what is “normal.”. The old school teaching holds that the normal resting heart rate is greater than 55 and less than 100 beats per minute (bpm). Maximal heart rates are estimated by the well known formula: 220 – your age = Max heart rate. "}, {"url": "http://www.nhs.uk/chq/Pages/2024.aspx?CategoryID=52", "passage_text": "Most adults have a resting heart rate of 60-100 beats per minute (bpm). The fitter you are, the lower your resting heart rate is likely to be. For example, athletes may have a resting heart rate of 40-60 bpm or lower. You should contact your GP if you think your heart rate is continuously above 120 bpm or below 40 bpm, although this could just be normal for you."}, {"url": "http://www.livescience.com/42081-normal-heart-rate.html", "passage_text": "For adults 18 and older, a normal resting heart rate is between 60 and 100 beats per minute (bpm), depending on the person’s physical condition and age. For children ages 6 to 15, the normal resting heart rate is between 70 and 100 bpm, according to the AHA. But a heart rate lower than 60 doesn’t necessarily mean you have a medical problem. Active people often have lower heart rates because their heart muscles don't need to work as hard to maintain a steady beat. A normal heart rate depends on the individual, age, body size, heart conditions, whether the person is sitting or moving, medication use and even air temperature. Even emotions can have an impact on heart rate. For example, getting excited or scared can increase the"}, {"url": "http://share.upmc.com/2015/07/what-is-a-normal-heart-rate/", "passage_text": "Your Heart Rate Over Time. As you grow older, your normal resting heart rate changes. For children 10 years and younger, and most adults, normal heart rate is 60 to 80 beats per minute (BPM) . Well-trained athletes can have a normal heart rate of 40 to 60 BPM."}, {"url": "http://www.webmd.com/heart-disease/features/5-heart-rate-myths-debunked", "passage_text": "Myth: A normal heart rate is 60-100 beats per minute. That's the old standard. Many doctors think it should be lower. About 50-70 beats per minute is ideal, says Suzanne Steinbaum, MD, director of women's heart health at Lenox Hill Hospital. "}]