[{"url": "http://www.google.com/patents/US8596578", "passage_text": "Abstract. A pressure bulkhead for a fuselage of an aircraft is configured for bounding a fuselage interior relative to an external environment. The pressure bulkhead includes a flat skin configured to span a cross-section of the fuselage and having a cavity disposed at a core region of the skin. The core region..."}, {"url": "http://www.google.com/patents/US8596578", "passage_text": "The invention relates to a pressure bulkhead for purposes of arrangement in a fuselage of an aircraft, in particular of an aeroplane. Pressure bulkheads in aircraft serve to bound an internal cabin and/or a freight compartment relative to the external environment."}, {"url": "http://www.businessdictionary.com/definition/bulkhead-seating.html", "passage_text": "Definition. Aircraft seat immediately behind a bulkhead (that separates first class from economy), preferred by some because it usually has more legroom and there is no seat in the front that recline into one's face."}, {"url": "http://www.google.com/patents/US8596578", "passage_text": "Patents. A pressure bulkhead for a fuselage of an aircraft is configured for bounding a fuselage interior relative to an external environment. The pressure bulkhead includes a flat skin configured to span a cross-section of the fuselage and having a cavity disposed at a core region of the skin. The core region..."}, {"url": "https://answers.yahoo.com/question/index?qid=20130508223830AAerZmG", "passage_text": "Yes the answer by Philip is correct in this instance in regard to aircraft interiors, although in aircraft maintenance terminology, it usually refers to a pressure bulkhead, such as either side of the wheel wells, or at either end of the fuselage, such as between the cabin and the tail section."}, {"url": "http://www.seatguru.com/articles/bulkheads.php", "passage_text": "Typically, a bulkhead is a wall but can also be a curtain or screen. In addition to separating classes from one another, i.e. business and economy, bulkheads can be found throughout the plane, separating the seats from the galley and lavatory areas."}, {"url": "http://businesstravel.about.com/od/faqs/g/Glossary-Bulkhead-Seating.htm", "passage_text": "Bulkhead seating is a term that refers to the seats that are immediately behind the bulkheads (or walls) of an airplane that separate first class from coach or one section from another. Bulkhead seats may not have as much legroom as other seats--or--they may have more."}, {"url": "http://www.wisegeek.com/what-is-a-bulkhead.htm", "passage_text": "A bulkhead is a wall inside a craft such as a ship, airplane, or spacecraft. Bulkheads serve a number of structural functions, and there are a wide array of variations on the basic bulkhead design which can be used in specific applications."}]