[{"url": "http://stackoverflow.com/questions/20055497/emulate-mifare-card-with-android-4-4", "passage_text": "8. I have researched Mifare and other card emulation I have very good knowledge in programming (not Android, but C/C++). I have proxmark and I have made multiple emulation codes for proxmark, so I know how the cards communicate. I don't understand currently, does android enable full card emulation. So regarding emulation of various MIFARE protocols: 1  MIFARE Ultralight (and derivates) protocol operates on top of ISO/IEC 14443-3. 2  It is not possible to emulate cards using such low layer protocols using Android HCE."}, {"url": "http://contactless-world.com/?s=mifare", "passage_text": "Mifare emulation is actually an application running on the chip operating system. It emulates the mifare classic operating system by providing the exact same hardware and software functionality. Once it has been installed, it responds exactly like a native mifare chip to the readers transmitting mifare commands. If any software product has this much of popularity in its class, the need for running it on different platforms is a must. That is what NXP did years ago. Now almost all dual interface chips-including SIM cards-have the option for running mifare as an emulation."}, {"url": "http://emutag.com/", "passage_text": "1 It is not an emulator of MIFARE Classic NFC tags. 2  It is not an emulator of MIFARE Ultralight C and EV1 type NFC tags, but there might be a possibility of future firmware versions to be able to emulate those tags as well. 1 It is not a ISO 14443 part 4 smartcard, so does not work with APDU nor returns an answer to select (ATS). 2  It is not an emulator of 125 kHz tags mainly used for access control with Wiegand interface devices. 3 "}, {"url": "http://emutag.com/", "passage_text": "1 It is not an emulator of MIFARE Ultralight C and EV1 type NFC tags, but there might be a possibility of future firmware versions to be able to emulate those tags as well. 2  If anyone writes such a user application using the SDK and would like to share it, I'll be more than happy to convert it to a full-featured firmware. 1 It is not a ISO 14443 part 4 smartcard, so does not work with APDU nor returns an answer to select (ATS). 2  It is not an emulator of 125 kHz tags mainly used for access control with Wiegand interface devices. 3  It is not an emulator of MIFARE Classic NFC tags."}, {"url": "http://contactless-world.com/mifare-emulation/", "passage_text": "Mifare emulation. Mifare is definitely the most used contactless chip in the world. I’ve already covered main topics on Mifare on my previous posts. You can find it everywhere; it has been used billions of times, hacked, cloned and it is still the most popular chip in the world. It is of course very useful to have the mifare functionality on other platforms, but it has some drawbacks as well: 1  First, it has the exact same security problem with the native mifare. 2  But this is something you must have considered while using mifare classic, so it can be skipped."}, {"url": "https://www.mifare.net/support/forum/topic/mifare-emulation/", "passage_text": "No, MIFARE SDK does not emulate any card, as of now MIFARE SDK is meant to communicate with NXP cards. Forum / MIFARE SDK / Mifare emulation. 17. September 2014 at 11:50. fsurleau. Hi, Will the Mifare SDK enable Mifare classic emulation in Android? If yes, what are the prerequisites?"}, {"url": "http://contactless-world.com/mifare-emulation/", "passage_text": "1 Mifare emulation applet is generally slower than native mifare chip while responding the mifare commands. 2  You need to consider this if you must use native mifare chips and mifare emulation at the same time. 3  You may have to re-configure the readers if they are set to work only with native mifare classic chips. It is of course very useful to have the mifare functionality on other platforms, but it has some drawbacks as well: 1  First, it has the exact same security problem with the native mifare. 2  But this is something you must have considered while using mifare classic, so it can be skipped."}, {"url": "http://contactless-world.com/?s=mifare", "passage_text": "Mifare emulation applets provide an API for accessing the mifare blocks over the contact interface during run time. This way, you get the chance to update the data stored in the mifare blocks during another contact transaction. If any software product has this much of popularity in its class, the need for running it on different platforms is a must. That is what NXP did years ago. Now almost all dual interface chips-including SIM cards-have the option for running mifare as an emulation."}, {"url": "http://contactless-world.com/?s=mifare", "passage_text": "1 Mifare emulation applet is generally slower than native mifare chip while responding the mifare commands. 2  You need to consider this if you must use native mifare chips and mifare emulation at the same time. 3  You may have to re-configure the readers if they are set to work only with native mifare classic chips. If any software product has this much of popularity in its class, the need for running it on different platforms is a must. That is what NXP did years ago. Now almost all dual interface chips-including SIM cards-have the option for running mifare as an emulation."}, {"url": "http://contactless-world.com/mifare-emulation/", "passage_text": "Mifare emulation is actually an application running on the chip operating system. It emulates the mifare classic operating system by providing the exact same hardware and software functionality. It is of course very useful to have the mifare functionality on other platforms, but it has some drawbacks as well: 1  First, it has the exact same security problem with the native mifare. 2  But this is something you must have considered while using mifare classic, so it can be skipped."}]