[{"url": "http://www.chinatravel.com/facts/habitat-of-giant-panda.htm", "passage_text": "Minshan Mountains. Although the giant panda habitats in the Minshan Mountains area (Sichuan and Gansu Provinces) are larger, viewed collectively, fewer giant pandas live in these habitats – only about 45% of the total population of giant pandas living in the wild, in fact, live in the Minshan Mountains area. Unfortunately, neither of these two mountainous areas forms a single, contiguous panda habitat. Instead it is broken up into small patches, with human-related patches in between them. A phenomenon referred to by panda experts as habitat fragmentation."}, {"url": "http://www.bearlife.org/red-panda.html", "passage_text": "The red panda has small features like a cat but the markings of a panda or raccoon. In fact it looks like a cross between all three! It is reddish brown with a very thick ringed tail. Red pandas lives in Asia and shares some of its habitat with the giant panda. They both share some similar lifestyle facts. Both animals like to eat bamboo, although the red panda will supplement its diet and eat addition foods when available."}, {"url": "http://nationalzoo.si.edu/Animals/GiantPandas/PandaFacts/", "passage_text": "The panda's thick, wooly coat keeps it warm in the cool forests of its habitat. Giant pandas have large molar teeth and strong jaw muscles for crushing tough bamboo. Many people find these chunky, lumbering animals to be cute, but giant pandas can be as dangerous as any other bear. Giant pandas live in broadleaf and coniferous forests with a dense understory of bamboo, at elevations between 5,000 and 10,000 feet. Torrential rains or dense mist throughout the year characterizes these forests, often shrouded in heavy clouds"}, {"url": "http://www.chinatravel.com/facts/habitat-of-giant-panda.htm", "passage_text": "The giant panda lives today on the eastern rim of the mountainous Qinghai-Tibet Plateau in Southwestern China, specifically in the areas of the Minshan and Qinling Mountains (the provinces of Gansu-Sichuan and Shaanxi, respectively). Unfortunately, neither of these two mountainous areas forms a single, contiguous panda habitat. Instead it is broken up into small patches, with human-related patches in between them. A phenomenon referred to by panda experts as habitat fragmentation."}, {"url": "http://nationalzoo.si.edu/Animals/AsiaTrail/RedPanda/factsheet.cfm", "passage_text": "Distribution and Habitat: Red pandas live in the cool temperate bamboo forests in Sichuan, Yunnan, and Xizang provinces in China, in the foothills of the Himalayas in Nepal and Bhutan, and in northern Myanmar. They share part of their range with giant pandas. "}, {"url": "http://wwf.panda.org/what_we_do/endangered_species/giant_panda/panda/where_panda_lives_habitat/", "passage_text": "But the Minshan mountains' magnificent forests are a critical habitat not only for giant pandas but also for a wealth of other species, including the dwarf blue sheep and beautiful multi-coloured pheasants. Giant panda in Wolong Nature Reserve in Sichuan Province. © Susan A. Mainka / WWF. The Qinling Mountains. But due to expanding human populations and development, the species is now restricted to around 20 isolated patches of bamboo forest in six mountain ranges in China's Sichuan, Shaanxi and Gansu provinces. Most of the remaining wild pandas live in the Minshan and Qinling mountains. And it is here that WWF has focussed its giant panda conservation work, supporting the Chinese government's efforts to conserve the specie"}, {"url": "http://www.bearlife.org/red-panda.html", "passage_text": "Bamboo is the main diet of the red panda and is abundant in its natural habitat. However it will also eat a variety of other foods such as fruits, nuts, eggs, flowers, and seeds. Information from their droppings reveal additional diet facts, such as their taste for other prey such as rodents and small birds. It is reddish brown with a very thick ringed tail. Red pandas lives in Asia and shares some of its habitat with the giant panda. They both share some similar lifestyle facts. Both animals like to eat bamboo, although the red panda will supplement its diet and eat addition foods when available."}, {"url": "http://samsp3.weebly.com/biomes-and-habitat.html", "passage_text": "Pandas live in mountainous regions and forests. Pandas use to live in lowlands before their land was destroyed. Pandas were forced to move into the mountains because of their habitat being destroyed, and have adapted there. Moutain Ranges where Pandas live. "}]