[{"url": "http://public.oed.com/aspects-of-english/english-in-use/cockney/", "passage_text": "Home Aspects of English English in use Cockney. Cockney’s not a language it is only a slang And was originated inna England The first place it was used was over East London… Smiley Culture, ‘Cockney Translation’ (1984)."}, {"url": "https://en.wikipedia.org/wiki/Cockney", "passage_text": "More recently, it is variously used to refer to those in London's East End, or to all working-class Londoners generally. Linguistically, Cockney English refers to the accent or dialect of English traditionally spoken by working-class Londoners. In recent years, many aspects of Cockney English have become part of general South East English speech, producing a variant known as Estuary English."}, {"url": "http://language-dossier.webs.com/londonaccent.htm", "passage_text": "It is spoken mainly in inner London, and some outer London areas such as Brent, Ealing, Newham, Croydon, Sutton and Enfield. According to research conducted at Queen Mary, University of London, Multicultural London English is gaining territory from Cockney."}, {"url": "http://www.innovateus.net/innopedia/where-cockney-dialect-spoken", "passage_text": "The cockney dialect is the accent spoken by a Londoner, specifically belonging to the East-End of London. The term Cockney refers not only to the accent but also to the people who speak the Cockney dialect. The dialect is typically used by the working class Londoners. The Cockney dialect has its own distinct vocabulary and special usage. “Rhyming slang” is a characteristic feature of the original cockney culture."}, {"url": "http://www.innovateus.net/innopedia/where-cockney-dialect-spoken", "passage_text": "Main Image: The cockney dialect is the accent spoken by a Londoner, specifically belonging to the East-End of London. The term Cockney refers not only to the accent but also to the people who speak the Cockney dialect. The dialect is typically used by the working class Londoners. The Cockney dialect has its own distinct vocabulary and special usage. “Rhyming slang” is a characteristic feature of the original cockney culture."}, {"url": "http://language-dossier.webs.com/londonaccent.htm", "passage_text": "The following varieties of English are used in London: 1  The London accent, in particular, Cockney (spoken mainly in the East End and exemplified in the movie My Fair Lady). 2  Received Pronunciation ('R.P.'). 3  Posh accents (spoken in areas in London such as Kensington, Chelsea and Mayfair)."}, {"url": "http://public.oed.com/aspects-of-english/english-in-use/cockney/", "passage_text": "The nineteenth century saw the first wholesale attempt to record Cockney as it was spoken. The low-life episodes of Pierce Egan’s Life in London (1821) take his heroes deep into the East End and its speech."}]