[{"url": "http://www.thefreedictionary.com/curd", "passage_text": "curd. n. 1. The part of milk that coagulates when the milk sours or is treated with enzymes. Curd is used to make cheese. 2. A lump of curd: cheese curds. 3. A coagulated liquid that resembles milk curd. intr. & tr.v. curd·ed, curd·ing, curds. To form or cause to form into curd; curdle."}, {"url": "http://biotechlearn.org.nz/focus_stories/cheesemaking/the_science_of_cheese", "passage_text": "Cheesemaking principles. Curds and whey. Cheesemaking involves coagulating the casein protein in milk and then separating the milk into solid curds and liquid whey. The liquid whey is drained away, and the curds are salted, shaped and left to ripen in a controlled environment. However, for most cheeses, rennet is also added to the milk after a starter bacteria. Rennet is a mixture containing the active enzyme chymosin. Rennet speeds up the coagulation of casein and produces a stronger curd."}, {"url": "http://idahomilkproducts.com/content/how-does-milk-protein-concentrate-differ-casein-or-caseinates", "passage_text": "The casein curd is then washed repeatedly with acidified fresh water to “purify” the casein (wash away unwanted, occluded milk solids such as fat and lactose). Because the casein curd is kept at an acid pH, the milk minerals are leached out of the protein. The result is a relatively pure protein curd (96% protein on a dry basis). This casein curd, however, is not very useful in food products. Acid casein (as the curd is known) is insoluble in water, behaving much like sand. "}, {"url": "http://www.merriam-webster.com/dictionary/curd", "passage_text": "Definition of CURD for Kids. : the thickened or solid part of milk that separates from the whey after milk sours and is used to make cheese. Full Definition of CURD. 1. : the thick casein-rich part of coagulated milk. 2. : something suggesting the curd of milk. — curdy \\ˈkər-dē\\ adjective. See curd defined for English-language learners."}, {"url": "http://www.builtlean.com/2013/04/17/whey-casein-protein/", "passage_text": "Whey and casein are dairy proteins found in milk – casein is the “curds” in “curds and whey” (think: cottage cheese). Whey is considered a “fast” protein, because it is rapidly digested in as little as an hour, whereas casein is a “slow” protein that is digested over several hours. "}, {"url": "https://en.wikipedia.org/wiki/Casein", "passage_text": "These proteins are commonly found in mammalian milk, making up 80% of the proteins in cow milk and between 20% and 45% of the proteins in human milk. Casein has a wide variety of uses, from being a major component of cheese, to use as a food additive, to a binder for safety matches. Since milk's pH is 6.6, casein has a negative charge in milk. The purified protein is water-insoluble. While it is also insoluble in neutral salt solutions, it is readily dispersible in dilute alkalis and in salt solutions such as sodium oxalate and sodium acetate."}, {"url": "https://en.wikipedia.org/wiki/Casein", "passage_text": "The isoelectric point of casein is 4.6. Since milk's pH is 6.6, casein has a negative charge in milk. The purified protein is water-insoluble. While it is also insoluble in neutral salt solutions, it is readily dispersible in dilute alkalis and in salt solutions such as sodium oxalate and sodium acetate."}, {"url": "http://ehealthforum.com/health/casein-curds-the-peril-of-poop-pods-t206703.html", "passage_text": "Casein is a protein found in milk, but it is used in LOTS of other processed foods. It is often listed as sodium caseinate, calcium caseinate, or milk protein, whey, whey protein concentrate, and many more. The biggest and baddest source of casein (in my experience) is called Milk Protein Concentrate (MPC). Curds of this description are rarely seen unless proportion of casein in the food is high. Curds of the first variety, if numerous, call for a considerable reduction in the amount of fat. The large, smooth, hard curds, if numerous and persistent, may usually be made to disappear by boiling the milk."}, {"url": "http://www.wisegeek.org/what-is-casein.htm", "passage_text": "Casein is a protein that is found in milk and used independently in many foods as a binding agent. Technically, it is part of a group called phosphoproteins, collections of proteins bound to something containing phosphoric acid. It may also be called caseinogen, particularly in European foods. "}]