[{"url": "https://en.wikipedia.org/wiki/Tissue_(biology)", "passage_text": "Plant tissues are categorized broadly into three tissue systems: the epidermis, the ground tissue, and the vascular tissue. 1  Epidermis-Cells forming the outer surface of the leaves and of the young plant body. 2  Vascular tissue-The primary components of vascular tissue are the xylem and phloem. Xylem is a chief, conducting tissue of vascular plants. It is responsible for conduction of water and mineral ions/salt. Xylem is a very important plant tissue as it is part of the 'plumbing system' of a plant. Think of bundles of pipes running along the main axis of stems and roots."}, {"url": "http://programs.clarendoncollege.edu/programs/NatSci/Biology/Botany/online%20lecture%20outlines/tissues.htm", "passage_text": "The resulting tissues are called primary tissues. a. In botany, primary always refers to the first year s growth. 2. In annuals (that live only one year) this is the only type of growth. 3. In perennials, this is the first year s growth and the growth of elongation every subsequent year of the plant s life. 4. Primary tissues arise from the primary meristems (apical, axillary, and intercalary)."}, {"url": "http://www.biology-questions-and-answers.com/plant-tissues.html", "passage_text": "Lateral, or secondary, meristems, consist of the cambium and the phellogen (also known as cork cambium). These are tissues in the stem, branches and roots that generate other tissues via mitosis. These tissues participate in the secondary growth of plant, that is, in the thickening of the stem, branches and roots. Meristems are the tissues that produce plant growth, and are the origin of all other tissues. They are formed of undifferentiated cells with an intense cell division rate. Meristems are classified as primary meristems and secondary meristems."}, {"url": "http://www.biology-questions-and-answers.com/plant-tissues.html", "passage_text": "The growth tissues of the plants are meristems. Meristems are the tissues that produce plant growth, and are the origin of all other tissues. They are formed of undifferentiated cells with an intense cell division rate. Meristems are classified as primary meristems and secondary meristems."}, {"url": "http://biology.about.com/od/plantbiology/ss/plant-tissue-systems.htm", "passage_text": "Like other organisms, plant cells are grouped together into various tissues. These tissues can be simple, consisting of a single cell type, or complex, consisting of more than one cell type. Above and beyond tissues, plants also have a higher level of structure called plant tissue systems. There are three types of tissue systems: dermal tissue, vascular tissue, and ground tissue systems. The dermal tissue system consists of the epidermis and the periderm."}, {"url": "http://www.biology-questions-and-answers.com/plant-tissues.html", "passage_text": "15. The vascular cambium is the secondary meristematic tissue that forms the vascular tissues (xylem and phloem) of the plant in roots and in the stem. Usually, the outer side of the vascular cambium produces a layer of phloem and the inner (more central) side of the tissue produces a layer of xylem. Meristems are the tissues that produce plant growth, and are the origin of all other tissues. They are formed of undifferentiated cells with an intense cell division rate. Meristems are classified as primary meristems and secondary meristems."}, {"url": "https://en.wikipedia.org/wiki/Tissue_(biology)", "passage_text": "Meristematic tissue consists of actively dividing cells, and leads to increase in length and thickness of the plant. The primary growth of a plant occurs only in certain, specific regions, such as in the tips of stems or roots. It is in these regions that meristematic tissue is present. Xylem is a chief, conducting tissue of vascular plants. It is responsible for conduction of water and mineral ions/salt. Xylem is a very important plant tissue as it is part of the 'plumbing system' of a plant. Think of bundles of pipes running along the main axis of stems and roots."}, {"url": "http://www.shmoop.com/plant-biology/primary-secondary-growth.html", "passage_text": "Because the xylem and phloem that come from the vascular cambium replace the original (primary) xylem and phloem, and add to the width of the plant, they are called secondary xylem and secondary phloem. Here is what that looks like: The vascular cambium is only one cell thick and forms a ring around the stem of a plant. The width of a plant, or its girth, is called secondary growth and it arises from the lateral meristems in stems and roots. As with apical meristems, lateral meristems are regions of high cell division activity."}, {"url": "https://answers.yahoo.com/question/index?qid=20080216234621AAdgnNS", "passage_text": "Secondary vascular tissue is derived from the cambium as the plant grows wider. Secondary growth is an evolutionary advance that allows plants to grow taller because the can form very thick stems (woody trunks). Seedless plants and nearly all monocotyledons and herbaceous eudicotyledons, have only primary vascular tissue."}, {"url": "https://en.wikipedia.org/wiki/Meristem", "passage_text": "A meristem is the tissue in most plants containing undifferentiated cells (meristematic cells), found in zones of the plant where growth can take place. Meristematic cells give rise to various organs of the plant and keep the plant growing. In general, differentiated plant cells cannot divide or produce cells of a different type. Therefore, cell division in the meristem is required to provide new cells for expansion and differentiation of tissues and initiation of new organs, providing the basic structure of the plant body."}]