[{"url": "http://www.terrain.net.nz/friends-of-te-henui-group/table-1/towai.html", "passage_text": "Common name: Towai, Tawhero. Weinmannia silvicola known as Towai or Tawhero is a medium-sized tree of the family Cunoniaceae, is a very common tree in the north of the North Island of New Zealand, occurring in forest and forest margins from North Cape south to the latitude 38°S."}, {"url": "http://www.fndc.govt.nz/about-the-district/visitor-information/kawakawa--towai", "passage_text": "Kawakawa is the only town in New Zealand to boast a railway track through the centre of the commercial area. The history of the railway dates back to the discovery of coal in Kawakawa in 1864."}, {"url": "http://www.aatravel.co.nz/new-zealand/Towai_Accommodation.html", "passage_text": "If you are looking for comprehensive travel information for Towai Accommodation including Hotels, Motels (Self-Contained), Bed and Breakfast, Holiday Parks, Backpackers and Apartments, you will find it here on AA Travel. New Zealand is fortunate enough to have a wide variety of accommodation options to choose from."}, {"url": "http://www.maplandia.com/new-zealand/northland/towai/", "passage_text": "The location of each Towai hotel listed is shown on the detailed zoomable map. Moreover, Towai hotel map is available where all hotels in Towai are marked. You can easily choose your hotel by location."}, {"url": "http://www.maplandia.com/new-zealand/northland/towai/", "passage_text": "3D map of Towai in New Zealand. You can also dive right into Towai on unique 3D satellite map provided by Google Earth. With new GoogLe Earth plugin you can enjoy the interactive Towai 3D map within your web browser."}, {"url": "http://www.maplandia.com/new-zealand/northland/towai/", "passage_text": "detailed map of Towai and near places. Welcome to the Towai google satellite map! This place is situated in Northland, New Zealand, its geographical coordinates are 35° 29' 0 South, 174° 8' 0 East and its original name (with diacritics) is Towai. See Towai photos and images from satellite below, explore the aerial photographs of Towai in New Zealand."}]