[{"url": "http://earthobservatory.nasa.gov/blogs/climateqa/are-the-ozone-hole-and-global-warming-related/", "passage_text": "Global warming is also predicted to have a modest impact on the Antarctic ozone hole. The chlorine gases in the lower stratosphere interact with tiny cloud particles that form at extremely cold temperatures — below -80 degrees Celsius (-112 degrees Fahrenheit). For example, the CFCs that destroy ozone are also potent greenhouse gases, though they are present in such small concentrations in the atmosphere (several hundred parts per trillion, compared to several hundred parts per million for carbon dioxide) that they are considered a minor player in greenhouse warming."}, {"url": "http://www.ehow.com/how-does_5112209_global-warming-effects-ozone-depletion.html", "passage_text": "Ozone depletion, on the other hand, is the disappearance of ozone. The ozone layer is a dynamic protective layer above the earth; it's a layer approximately nine to 30 miles above the earth in the stratosphere (upper atmosphere). Ozone is actually a greenhouse gas, contributing to trapping heat in the stratosphere. If the ozone layer depletes, it affects the temperature of the earth. The depletion contributes to a global cool down and significant weather changes in higher areas near"}, {"url": "http://www.answers.com/Q/How_does_global_warming_affect_the_ozone_layer", "passage_text": "Scientists now believe that global warming will lead to a weaker ozone layer, because as the surface temperature rises, the stratosphere (where the ozone layer is in the upper part) will get colder, slowing the natural repairing of the ozone layer. A: Yes the global warming affects the ozone layer enormously. The ozone layer is a part of the atmosphere that is nothing but a layer of Ozone gas (O3) that allows the sunlight to penetrate into the atmosphere but reflects back the har … mful UV (ultra-violet) rays of the sun. Global warming is the very phenomenon which is causing Earth to fall apart today."}, {"url": "http://www.answers.com/Q/How_does_the_Ozone_Layer_affect_Global_Warming", "passage_text": "The ozone layer is a part of the atmosphere that is nothing but a layer of Ozone gas (O3) that allows the sunlight to penetrate into the atmosphere but reflects back the har … mful UV (ultra-violet) rays of the sun. Global warming is the very phenomenon which is causing Earth to fall apart today. A: Differences: Global warming is an increase in surface temperatures.The hole in the ozone layer is a natural repeating phenomenon, for the pole that is experiencing winter. Ozone decays naturally with time, and due to forcings by various contaminants."}, {"url": "http://www.ucsusa.org/global_warming/science_and_impacts/science/ozone-hole-and-gw-faq.html", "passage_text": "These gases, through several chemical reactions, cause the ozone molecules to break down, reducing ozone's ultraviolet (UV) radiation-absorbing capacity. Because our atmosphere is one connected system, it is not surprising that ozone depletion and global warming are related in other ways. For example, evidence suggests that climate change may contribute to thinning of the protective ozone layer. Figure 1. Seasonal thinning of the ozone layer above Antarctica. The ozone hole, however, is not the mechanism of global warming. Ultraviolet radiation represents less than one percent of the energy from the sun—not enough to be the cause of the excess heat from human activities."}, {"url": "http://earthobservatory.nasa.gov/blogs/climateqa/are-the-ozone-hole-and-global-warming-related/", "passage_text": "The ozone hole itself has a minor cooling effect (about 2 percent of the warming effect of greenhouses gases) because ozone in the stratosphere absorbs heat radiated to space by gases in a lower layer of Earth’s atmosphere (the upper troposphere). For example, the CFCs that destroy ozone are also potent greenhouse gases, though they are present in such small concentrations in the atmosphere (several hundred parts per trillion, compared to several hundred parts per million for carbon dioxide) that they are considered a minor player in greenhouse warming."}, {"url": "http://www.answers.com/Q/How_does_global_warming_affect_the_ozone_layer", "passage_text": "No, Global Climate Change has very little to do with the Depletion of the Ozone Layer. Recent global climate change or global warming is now considered by most climate scien … tists to be the likely result of increases in man-made greenhouse gas concentrations such as carbon Dioxide (CO2) in the atmosphere. The ozone layer is a part of the atmosphere that is nothing but a layer of Ozone gas (O3) that allows the sunlight to penetrate into the atmosphere but reflects back the har … mful UV (ultra-violet) rays of the sun. Global warming is the very phenomenon which is causing Earth to fall apart today."}, {"url": "http://www.eia.gov/tools/faqs/faq.cfm?id=84&t=11", "passage_text": "The hole in the ozone layer in the earth’s upper atmosphere (stratosphere) reduces the greenhouse effect because ozone is a greenhouse gas. However, ozone is needed in the stratosphere where it occurs naturally to filter out harmful ultraviolet radiation from the sun. Ozone in the lower atmosphere (troposphere) is created by chemical reactions between pollutants and sunlight. Ozone in the troposphere is dangerous to human health because it can cause lung damage and other cardiopulmonary problems when breathed. Substances that deplete ozone in the stratosphere are regulated under the Montreal Protocol."}, {"url": "http://www.answers.com/Q/How_does_the_Ozone_Layer_affect_Global_Warming", "passage_text": "No, Global Climate Change has very little to do with the Depletion of the Ozone Layer. Recent global climate change or global warming is now considered by most climate scien … tists to be the likely result of increases in man-made greenhouse gas concentrations such as carbon Dioxide (CO2) in the atmosphere. A: Differences: Global warming is an increase in surface temperatures.The hole in the ozone layer is a natural repeating phenomenon, for the pole that is experiencing winter. Ozone decays naturally with time, and due to forcings by various contaminants."}, {"url": "http://www.globalissues.org/article/184/the-ozone-layer-and-climate-change", "passage_text": "Scientists believe that Global Warming will lead to a weaker Ozone layer, because as the surface temperature rises, the stratosphere (the Ozone layer being found in the upper part) will get colder, making the natural repairing of the Ozone slower. "}]