[{"url": "http://www.answers.com/Q/What_is_an_anticodon_How_does_it_function", "passage_text": "An anticodon is a sequence of three nucleic acids in tRNA that corresponds with the sequence of three nucleic acids in mRNA. The three nucleic acid sequences in mRNA are calle … d codons. For example, if the mRNA codon reads AUC then the tRNA anticodon would read UAG. Anticodon on the tRNA base-pair with the codon on the mRNA and catalyses the elongation of the polypeptide chain in translation. Besides that, anticodon are specific and the … specific anticodon on the tRNA decides what types of amino acid it carries on the 3' end. 1 person found this useful."}, {"url": "http://www.nature.com/scitable/definition/trna-transfer-rna-256", "passage_text": "transfer RNA / tRNA. Transfer ribonucleic acid (tRNA) is a type of RNA molecule that helps decode a messenger RNA (mRNA) sequence into a protein. tRNAs function at specific sites in the ribosome during translation, which is a process that synthesizes a protein from an mRNA molecule. Proteins are built from smaller units called amino acids, which are specified by three-nucleotide mRNA sequences called codons. When a tRNA recognizes and binds to its corresponding codon in the ribosome, the tRNA transfers the appropriate amino acid to the end of the growing amino acid chain. Then the tRNAs and ribosome continue to decode the mRNA molecule until the entire sequence is translated into a protein. Further Exploration."}, {"url": "http://www.thefreedictionary.com/codon", "passage_text": "co·don. n. A sequence of three adjacent nucleotides constituting the genetic code that determines the insertion of a specific amino acid in a polypeptide chain during protein synthesis or the signal to stop protein synthesis. [ cod(e) + -on .]."}, {"url": "https://en.wikipedia.org/wiki/Start_codon", "passage_text": "The start codon is the first codon of a messenger RNA (mRNA) transcript translated by a ribosome. The start codon always codes for methionine in eukaryotes and a modified Met (fMet) in prokaryotes. The most common start codon is AUG. The start codon is often preceded by a 5' untranslated region (5' UTR). "}, {"url": "http://www.nature.com/scitable/definition/codon-155", "passage_text": "codon. A codon is a sequence of three DNA or RNA nucleotides that corresponds with a specific amino acid or stop signal during protein synthesis. DNA and RNA molecules are written in a language of four nucleotides; meanwhile, the language of proteins includes 20 amino acids. Each codon corresponds to a single amino acid (or stop signal), and the full set of codons is called the genetic code. The genetic code includes 64 possible permutations, or combinations, of three-letter nucleotide sequences that can be made from the four nucleotides."}, {"url": "https://en.wikipedia.org/wiki/Stop_codon", "passage_text": "In the genetic code, a stop codon (or termination codon) is a nucleotide triplet within messenger RNA that signals a termination of translation. Proteins are based on polypeptides, which are unique sequences of amino acids. Most codons in messenger RNA (from DNA) correspond to the addition of an amino acid to a growing polypeptide chain, which may ultimately become a protein."}, {"url": "http://www.answers.com/Q/What_is_an_anticodon_How_does_it_function", "passage_text": "An anticodon is basically the linking to a codon found on the bottom of a tRNA. A codon-basically a triplet code base-pair found in the transcription of mRNA. An anticodon-basically a triplet code that corresponds to a codon like that of DNA. For example: if a codon was AUG, than an anticodon would be UAC (remember that in. RNA, there is no thymine (T), but Uracil (U)). Anticodon on the tRNA base-pair with the codon on the mRNA and catalyses the elongation of the polypeptide chain in translation. Besides that, anticodon are specific and the … specific anticodon on the tRNA decides what types of amino acid it carries on the 3' end. 1 person found this useful."}]