[{"url": "http://www.holiday-weather.com/seattle/averages/", "passage_text": "Seattle: Annual Weather Averages. July is the hottest month in Seattle with an average temperature of 18°C (64°F) and the coldest is January at 5°C (41°F) with the most daily sunshine hours at 10 in July. The wettest month is December with an average of 150mm of rain. The best month to swim in the sea is in July when the average sea temperature is 14°C (57°F)."}, {"url": "http://www.holiday-weather.com/seattle/averages/august/", "passage_text": "The average daily temperature expected in Seattle in this month is 23 C (73 F) , dropping to an average temperature of 13 C (55 F) . Seattle sees up to 9 hours of sunshine per day throughout the month. The average expectation for rain fall for this month is 34 mm over 6 days. Expect more hot, dry and sunny days with very little expectation of rain in August. The average daily temperature expected in Seattle in this month is 23 C (73°F) , dropping to an average temperature of 13°C (55°F) ."}, {"url": "http://www.currentresults.com/Weather/Washington/Places/seattle-temperatures-by-month-average.php", "passage_text": "There are also monthly and yearly counts of days with cold weather. All the numbers are averages, based on climate data gathered from 1981 to 2010 at Seattle's Husky Stadium, located near downtown Seattle at the University of Washington on the shore of Lake Washington's Union Bay. The city averages only two days a year of temperatures in the 90s Fahrenheit and normally doesn t get any hotter than 100. Nights are equally moderate with minimum temperatures dropping below 70 °F. Just ten times a year, on average does the daily low remain in the 60s."}, {"url": "http://www.currentresults.com/Weather/Washington/Places/seattle-temperatures-by-month-average.php", "passage_text": "Sweltering weather is a rarity in Seattle. The city averages only two days a year of temperatures in the 90s Fahrenheit and normally doesn t get any hotter than 100. Nights are equally moderate with minimum temperatures dropping below 70 °F. Just ten times a year, on average does the daily low remain in the 60s."}, {"url": "http://traveltips.usatoday.com/average-temperature-seattle-washington-14723.html", "passage_text": "It&#039;s Not All Rain. The average winter temperature in Seattle is fairly mild, with January experiencing the coldest monthly temps -- the average high is 47 degrees F and the average low is 36. February is typically a few degrees warmer. On average, the warmest days of the year in Seattle occur between July 26 and August 8, with average highs of 76 degrees. These are some of the best days to spend on some of Seattle&#039;s beaches. Alki Beach Park is open from 6 a.m. until 11 p.m."}, {"url": "http://www.usa.com/seattle-wa-weather.htm", "passage_text": "The average temperature of Seattle is 52.02°F, which is higher than the Washington average temperature of 50.47°F and is lower than the national average temperature of 54.45°F. "}, {"url": "http://www.currentresults.com/Weather/Washington/Places/seattle-temperatures-by-month-average.php", "passage_text": "The average high and low temperatures are listed below monthly and annually for Seattle, in both degrees Fahrenheit and Celsius. Maximums and minimums are only part of the temperature picture. To fill in the rest, there's information on how many days a month get above or below a given temperature. The city averages only two days a year of temperatures in the 90s Fahrenheit and normally doesn t get any hotter than 100. Nights are equally moderate with minimum temperatures dropping below 70 °F. Just ten times a year, on average does the daily low remain in the 60s."}, {"url": "http://www.areavibes.com/seattle-wa/weather/", "passage_text": "n/a. The highest average temperature in Seattle is July at 64.1 degrees. The coldest average temperature in Seattle is December at 42.1 degrees. The most monthly precipitation in Seattle occurs in January with 0 inches. The Seattle weather information is based on the average of the previous 3-7 years of data. Loading... "}, {"url": "http://traveltips.usatoday.com/average-temperature-seattle-washington-14723.html", "passage_text": "Coffee Time Again. Seattle experiences a distinct drop in average high temperature between September and October, when the 70s of summer drop a full 10 degrees or so and the average low falls to 46. On average, the warmest days of the year in Seattle occur between July 26 and August 8, with average highs of 76 degrees. These are some of the best days to spend on some of Seattle&#039;s beaches. Alki Beach Park is open from 6 a.m. until 11 p.m."}]