[{"url": "http://www.eatbydate.com/grains/baked-goods/how-long-do-tortillas-last-shelf-life-expiration-date/", "passage_text": "Since different companies use different preservatives, there is variation in how long they last. Tortillas, which begin very pliable, will begin to get stiffer when they are getting old."}, {"url": "http://www.eatbydate.com/grains/baked-goods/how-long-do-tortillas-last-shelf-life-expiration-date/", "passage_text": "6-8 Months. Of course, all foods last for a shorter period of time if they are not stored properly. But, like many other products, tortillas usually have a best by date which is simply the last date by which a manufacturer will vouch for a product's quality, not its safety."}, {"url": "http://www.eatbydate.com/grains/baked-goods/how-long-do-tortillas-last-shelf-life-expiration-date/", "passage_text": "The shelf life of tortillas depends on the best by date, the processing and how they are stored. Tortillas, a Spanish word meaning torta or little cake, are typically grilled on the stove top and consist of flour or corn, oil, and salt."}, {"url": "http://www.answers.com/Q/How_long_do_tortillas_stay_fresh", "passage_text": "Answer   fresh uncooked sealed meat can stay good 7-10 from purchase if kept inn fridge at the right temp.   Answer   It depends on what type of meat. Some meat c … an stay in you fridge for 3 days but chicken and fish don't work."}, {"url": "http://www.yelp.com/topic/oakland-how-long-do-tortillas-stay-good", "passage_text": "take it from a Mexican, as long as they are not moldy or hard as a rock,then you can use them. usually in my house they keep for one week. But thats becasue we eat them everyday."}, {"url": "http://www.answers.com/Q/How_long_do_tortillas_stay_fresh", "passage_text": "If tortillas are uncooked they tend to show signs of mold a bit faster then pre-cooked tortillas. Store bought cooked tortillas if stored properly can be stored for up to a month in the fridge, where uncooked tortillas if stored properly can last up to three weeks."}, {"url": "http://www.answers.com/Q/How_long_can_corn_tortillas_last_in_the_%27fridge", "passage_text": "You can store cabbage in your fridge for about 3 months. Keep it in a plastic bag, and remove as much air as possible before storing. If some of the outside leaves don't look … good, you can just remove them.   Do not wash your vegetables before storing as this will considerably shorten their lives."}, {"url": "http://www.answers.com/Q/How_long_do_tortillas_stay_fresh", "passage_text": "Oranges will stay fresh for about 3 weeks to 1 month. If an orange goes from a grove to a warehouse and stays there for a few days to weeks before making it to the shelf, it w … ill steadily degrade in quality.     Never store citrus fruit in plastic bags or film-wrapped trays."}]