[{"url": "http://www.teleflora.com/floral-facts/rose-color-meaning", "passage_text": "rose color meanings. While every flower has a wonderful story to tell, the rose stands alone in its abundant history and color meaning. So much so that we couldn’t resist giving it a little preferential treatment and dedicating a separate space to its rich symbolism."}, {"url": "http://www.flower-dictionary.com/color.html", "passage_text": "Love, above all else, is the symbolic meaning of flowers ranging from crimson to scarlet and back. The deeper the red, the deeper the meaning. Dark reds show a charitable love while brighter reds reveal devoted passion. Whether this is love born of beauty, fire, or courage, red is the color to have.he meaning of the color of flowers lets you know which to get for your mother and which for your lover. Other sites explore the symbolic meaning of flowers, but Flower-Dictionary.com also explores the meaning of actual colors."}, {"url": "http://www.flowershopping.com/shop-by-color/flowercolorsymbolism/", "passage_text": "Red Flowers. View our Red Flower Selection. Fresh red flowers send the clear and powerful message of intense romantic love. Red is the unquestioned color of passion and any red bouquet or red flower arrangement will communicate your strong and powerful love. Red flowers are the closest symbolic likeness to the heart. Red is the color of seduction and desire. Red roses are the most common red flower, but red carnations, red tulips, and red gerbera daisies will all transmit your message of desire and passion."}, {"url": "http://www.incredibleart.org/lessons/middle/color2.htm", "passage_text": "Color Fun-Integrate art, science, and writing with these color-filled activities. Color Theory Tutorial Elements of Design-Value & Color Elimy Gems-This site includes color symbolism as well a how it relates to gems. Flower Symbolism-This page explains what flowers symbolize as well as the color of certain flowers. Elements of Design-Value & Color."}, {"url": "http://aboutflowers.com/flower-a-plant-information-and-photos/meanings-of-flowers.html", "passage_text": "In Victorian times, certain flowers had specific meanings because the flower selection was limited and people used more symbols and gestures to communicate than words. But today, with so many flower choices, there are no rules-it's the sentiment that gives the gift its meaning.eautiful Flowers! A low, clustered floral arrangement in all shades of pink symbolizes opening the heart and making others more receptive to you. Start and end the day counting your blessings, by placing this floral design of gratitude on a nightstand, dresser or in the kitchen."}, {"url": "http://www.teleflora.com/floral-facts/flower-color-meaning", "passage_text": "Purple Flowers. With its origins tied to royalty and ceremony, purple flowers represent dignity, pride and success. Whether grouped alone in a bold range of rich hues or mixed in with other colors to provide depth and contrast, an arrangement filled with purple blooms represents accomplishment and admiration. Show for purple flowers. There’s an indisputable energy to the color red – an energy that has the power to transform an otherwise unassuming flower into the essence of desire, strength, and passionate love. With beauty, courage and heat as its symbolism, it’s no surprise that a bouquet filled with rich, red blooms knows no restraint."}, {"url": "http://www.bloomnation.com/blog/the-meaning-behind-flower-colors/", "passage_text": "Yellow flowers burst with happiness. They symbolize the bonds of friendship, the taste of success and pride. Joy is also one of the meanings of this flower, as that is one of the feelings the color is said to evoke."}, {"url": "http://www.proflowers.com/blog/flower-meanings", "passage_text": "Few other flowers can match the elegant beauty of the iris. Representing faith, hope, and wisdom, the iris is a flower that can be used for many different occasions. While it is most known for its distinctive blue varieties, the iris can also be found in other colors such as yellow and white."}, {"url": "http://www.teleflora.com/floral-facts/flower-color-meaning", "passage_text": "The symbolism of flower colors is steeped in tradition. In fact, every flower color from a deep red rose to a bright yellow daffodil offers a rich and meaningful story dating back thousands of years. There’s an indisputable energy to the color red – an energy that has the power to transform an otherwise unassuming flower into the essence of desire, strength, and passionate love. With beauty, courage and heat as its symbolism, it’s no surprise that a bouquet filled with rich, red blooms knows no restraint."}]