[{"url": "http://www.etonline.com/news/165650_jason_alexander_apologizes_for_statements_made_about_seinfeld_susan/", "passage_text": "The drama continues between George and Susan. During a recent interview on Howard Stern's Sirius XM radio show, Jason Alexander offered an explanation as to why his fiancee on Seinfeld, Susan Ross, was killed off. PHOTOS: 25 Stars You Didn't Know Were on Seinfeld. I couldn't figure out how to play off of her, Alexander said of actress Heidi Swedberg's character."}, {"url": "http://www.hollywoodreporter.com/news/ali-wentworth-jason-alexanders-susan-801364", "passage_text": "6/9/2015 3:49pm PDT. Seinfeld actress Ali Wentworth, who played Jerry's overly affectionate girlfriend on the Soup Nazi episode, was shocked to hear about former co-star Jason Alexander 's unprompted attack on Heidi Swedberg last week. The actress, who played Jerry's schmoopie-saying girlfriend in the Soup Nazi episode, recalled having more fun with Seinfeld than Alexander was having with the actress who played Susan."}, {"url": "http://seinfeld.wikia.com/wiki/Susan_Ross", "passage_text": "Susan Biddle Ross is a character on Seinfeld, played by Heidi Swedberg. Susan, an executive at NBC, first appeared in the season 4 episode  The Pitch , in which Jerry Seinfeld and George Costanza pitched the idea for their sitcom to Susan and her fellow executives. Susan's lover was seduced by Kramer. After an airing of George and Jerry's pilot received negative reviews and a power change at NBC that left Susan out of work, she left George's life."}, {"url": "http://www.nydailynews.com/entertainment/tv/jason-alexander-seinfeld-susan-impossible-article-1.2246279", "passage_text": "George likes his gossip spicy. Seinfeld actor Jason Alexander revealed that George Costanza's fiancee Fiancée susan was killed off because the actress who played her was---f g impossible to work. with I and the cast really liked and like Heidi. She is a kind, lovely person who undoubtedly worked really hard to create Susan and that character was clearly what [co-creators] Larry [David] and Jerry [Seinfeld] wanted her to be for George, Alexander said."}, {"url": "http://www.nydailynews.com/entertainment/tv/jason-alexander-seinfeld-susan-impossible-article-1.2246279", "passage_text": "Jason Alexander sorry for saying ‘Seinfeld’ actress who played George’s fiancee Fiancée susan ‘was’ impossible to work. with I and the cast really liked and like Heidi. She is a kind, lovely person who undoubtedly worked really hard to create Susan and that character was clearly what [co-creators] Larry [David] and Jerry [Seinfeld] wanted her to be for George, Alexander said."}, {"url": "http://seinfeld.wikia.com/wiki/Heidi_Swedberg", "passage_text": "803 pages on this wiki. Heidi Swedberg (born March 3, 1966, in Honolulu, HI) is an American actress. She played the ill-fated Susan Ross in Season Four and Season Seven in Seinfeld. "}, {"url": "https://en.wikipedia.org/wiki/Heidi_Swedberg", "passage_text": "Heidi Swedberg (born March 3, 1966) is an American actress and musician, best known for her role as Susan Ross, the fiancee fiancée Of George, costanza on the television Sitcom. seinfeld The following year she took on the role of Susan Ross in 11 episodes of Seinfeld's fourth season, 17 episodes of the seventh season and one episode of the ninth (via flashback in the 'backward' episode). She made a guest appearance in Wizards of Waverly Place as Jennifer Majorheely."}]