[{"url": "http://animalkingdom.net/2010/08/09/invertebrates/mollusks/", "passage_text": "Clams, Mussels and Oysters are common types of Mollusks. Mollusks are invertebrates that live in ocean, freshwater and terrestrial habitats. It is estimated that there are as many as 120,000 different species of mollusk. There are several different classes of mollusk. The most common mollusks are the gastropods (e.g., snails and slugs), the cephalopod (e.g., octopus, squid and cuttlefish) and the bivalve (e.g., clam, muscle, oyster and scallop). The Giant Squid and the Colossal Squid are the largest animals without a backbone."}, {"url": "https://en.wikipedia.org/wiki/Mollusca", "passage_text": "The molluscs or mollusks /ˈmɒləsks/ compose the large phylum of invertebrate animals known as the Mollusca. Around 85,000 extant species of molluscs are recognized. Molluscs are the largest marine phylum, comprising about 23% of all the named marine organisms. Numerous molluscs also live in freshwater and terrestrial habitats."}, {"url": "http://oceanicresearch.org/education/wonders/mollusk.html", "passage_text": "© Jonathan Bird/ORG. For educational use only. There are over 50,000 known species of Mollusks, which makes them second only to the Arthropods in invertebrate phylum size. Among the Mollusks are some of the most well known of invertebrate sea creatures, like snails, clams, mussels, squid, and octopods. The bivalves (meaning two-shells) are perhaps the most well known mollusks simply because of their history as a source of food. Clams, mussels, oysters and scallops are all bivalves. There are about 15,000 known species of bivalve, with about 80% of them being marine (the rest are found in fresh water)."}, {"url": "http://animals.about.com/od/molluscs/p/molluscs.htm", "passage_text": "1 Gastropods (Gastropoda) - There are between 60,000 and 80,000 species of gastropods alive today. 2  Gastropods are the most diverse of the mollusk groups. 3  Members of this group include limpets, top shells, periwinkles, sundial shells, sea hares, nudibranchs, snails and slugs. Mollusks are classified within the following taxonomic hierarchy: Animals Invertebrates. Mollusks are divided into the following taxonomic groups: 1  Caudofoveates and solanogastrates (Aplacophorans) - There are about 70 species of caudofoveates and 250 species of solanogastrate"}, {"url": "https://answers.yahoo.com/question/index?qid=20090303192208AAguPGH", "passage_text": "Some major classes of mollusks include the bivalves (like clams), cephalopods (like octopuses and squids), aplacophorans (worm-like mollusks), chitons, monoplacophorans, scaphopods (tusk shells), and gastropods (like snails and slugs). Source(s): http://www.carnegiemnh.org/mollusks/abou... · just now. Report Abuse. The living mollusks are placed into seven classes (some workers combine the Solenogastres and Caudofoveata into a single class called Aplacophora): Solenogastres Caudofaveata Polyplacophora Scaphopoda Cephalopoda Bivalvia Gastropoda There are over 50,000 different types of mollusks alive today."}, {"url": "http://www.answers.com/Q/What_are_the_5_types_of_mollusks", "passage_text": "The mollusks or molluscs are the large and diverse phylum Mollusca, which includes a variety of familiar creatures well-known for their decorative shells or as seafood. Many mollusks have their mantle produce a calcium carbonate external shell and their gill extracts oxygen from the water and disposes waste. All species of the phylum Mollusca have a complete digestive tract that starts from the mouth to the anus. Many have a feeding structure, the radula, mostly composed of chitin."}, {"url": "https://answers.yahoo.com/question/index?qid=20090303192208AAguPGH", "passage_text": "There are 5 main classes of mollusks, and two smaller classes that most people have never heard of. The principle classes are: Gastropoda (gastropods) - snails, slugs, conchs, whelks, cowries, etc. Bivalvia (bivalves) - clams, mussels, oysters, cockles, scallops, etc. · just now. Report Abuse. The living mollusks are placed into seven classes (some workers combine the Solenogastres and Caudofoveata into a single class called Aplacophora): Solenogastres Caudofaveata Polyplacophora Scaphopoda Cephalopoda Bivalvia Gastropoda There are over 50,000 different types of mollusks alive today."}, {"url": "http://animals.about.com/od/molluscs/p/molluscs.htm", "passage_text": "Mollusks (Mollusca) are a group of invertebrates that includes squid, octopuses, cuttlefish, nudibranchs, snails, slugs, limpets, sea hares, mussels, clams, oysters, scallops, as well as many less well-known animals. Scientists estimate that there are more than 100,000 species of mollusks alive today. Mollusks are classified within the following taxonomic hierarchy: Animals Invertebrates. Mollusks are divided into the following taxonomic groups: 1  Caudofoveates and solanogastrates (Aplacophorans) - There are about 70 species of caudofoveates and 250 species of solanogastrate"}]