[{"url": "https://quizlet.com/9891679/elkins-act-flash-cards/", "passage_text": "The Elkins Act is a 1903 United States federal law that amended the Interstate Commerce Act of 1887.[1] The Elkins Act authorized the Interstate Commerce Commission to impose heavy fines on railroads that offered rebates, and upon the shippers that accepted these rebates. "}, {"url": "https://en.wikipedia.org/wiki/Hepburn_Act", "passage_text": "The Hepburn Act is a 1906 United States federal law that gave the Interstate Commerce Commission (ICC) the power to set maximum railroad rates and extend its jurisdiction. This led to the discontinuation of free passes to loyal shippers. The limitation on railroad rates depreciated the value of railroad securities, a factor in causing the Panic of 1907. Scholars consider the Hepburn Act the most important piece of legislation regarding railroads in the first half of the 20th century."}, {"url": "http://www.answers.com/Q/What_is_the_Hepburn_Act", "passage_text": "Confidence votes 565. The Hepburn Act was passed by Congress to increase the authority of the Interstate Commerce Commission over railroads and certain other types of carriers. The Hepburn Act of 1906 allowed the Interstate Commerce Commission  the ability to extend its jurisdiction."}, {"url": "http://commercial.laws.com/hepburn-act", "passage_text": "This portion of the Hepburn Act is regarded as the Commodities Clause. History of the Hepburn Act 1906: In 1887, the United States Congress passed the Interstate Commerce Act, which made railroads the first industry explicitly subject to federal regulations. • The Hepburn Act 1906 increased the size of the Interstate Commerce Commission and its attached powers—the Act tangibly increased the commission in regards to the agency’s operating budget and number of employees."}, {"url": "https://en.wikipedia.org/wiki/Elkins_Act", "passage_text": "(October 2010). The Elkins Act is a 1903 United States federal law that amended the Interstate Commerce Act of 1887. The Act authorized the Interstate Commerce Commission (ICC) to impose heavy fines on railroads that offered rebates, and upon the shippers that accepted these rebates"}, {"url": "http://www.theodorerooseveltcenter.org/Learn-About-TR/TR-Encyclopedia/Capitalism-and-Labor/The-Hepburn-Act.aspx", "passage_text": "The Hepburn Act of 1906 was a bill that fortified the powers of the Interstate Commerce Commission (ICC) and strengthened federal regulation of railroads. Named for Rep. William Hepburn of Iowa, chairman of the House Commerce Commission, the Act passed after a series of unpopular rate increases by railroad corporations. The Hepburn Act expanded the powers of the 1903 Elkins Act. It gave ICC rulings the force of law (where before only the courts could enforce the regulations) and allowed the Commission to set maximum—though not minimum—“fair, just, and reasonable” rates."}, {"url": "http://www.wisegeek.com/what-is-the-hepburn-act.htm", "passage_text": "The Hepburn Act is a piece of legislation passed by the United States Legislature in 1906 whose purpose was to regulate the railroad industry. At the time, monopolistic oil companies wielded their power over the railroads and the Hepburn Act was a measure to check those companies’ growing power. "}, {"url": "http://commercial.laws.com/hepburn-act", "passage_text": "The Hepburn Act 1906 was passed to transfer power from the private sector to the federal government—through the bolstering of the Interstate Commerce Commission the government was able to regulate railroad shipping rates. • The Hepburn Act 1906 increased the size of the Interstate Commerce Commission and its attached powers—the Act tangibly increased the commission in regards to the agency’s operating budget and number of employees."}, {"url": "https://en.wikipedia.org/wiki/Hepburn_Act", "passage_text": "For any railroad that resisted, the ICC's conditions would remain in effect until the outcome of legislation said otherwise. By the Hepburn Act, the ICC's authority was extended to cover bridges, terminals, ferries, railroad sleeping cars, express companies and oil pipelines. The limitation on railroad rates depreciated the value of railroad securities, a factor in causing the Panic of 1907. Scholars consider the Hepburn Act the most important piece of legislation regarding railroads in the first half of the 20th century."}]