[{"url": "https://answers.yahoo.com/question/index?qid=20080723134941AAOEvpq", "passage_text": "An antecedent is the noun that a pronoun (later in the sentence) is referring to. The boy went to school and gave his speech. The antecedent is the boy, the pronoun is his. We found our books. We is the antecedent for the pronoun our At least that's what it means grammatically... Best Answer: An antecedent is the noun in a previous sentence that a second sentence may refer to. Yeah, I know, I suck at explaining. But... I met JOHN yesterday. HE seems nice. John is the antecedent. It is what the pronoun he in the next sentence refers to."}, {"url": "http://www.audioenglish.org/dictionary/antecedent.htm", "passage_text": "2. a preceding occurrence or cause or event. 3. anything that precedes something similar in time. 4. the referent of an anaphor; a phrase or clause that is referred to by an anaphoric pronoun. Familiarity information: ANTECEDENT used as a noun is uncommon. • ANTECEDENT (adjective)."}, {"url": "http://leo.stcloudstate.edu/grammar/pronante.html", "passage_text": "An antecedent is the word, phrase, or clause to which a pronoun refers, understood by the context. The antecedent in the following sample sentence is bolded. The critique of Plato's Republic was written from a contemporary point of view. It was an in-depth analysis of Plato's opinions about possible governmental forms. Agreement. A pronoun must agree with its antecedent in three ways: 1  Person refers to the quality of being. 2  Number is the quality that distinguishes between singular (one entity) and plural (numerous entities). 3  Gender is the quality that distinguishes the entities as masculine or feminine."}, {"url": "http://www.merriam-webster.com/dictionary/antecedent", "passage_text": "Full Definition of ANTECEDENT. 1. : a substantive word, phrase, or clause whose denotation is referred to by a pronoun (as John in “Mary saw John and called to him”); broadly: a word or phrase replaced by a substitute. 2. : the conditional element in a proposition (as if A in “if A, then B”). 3"}, {"url": "http://study.com/academy/lesson/what-is-an-antecedent-definition-meaning-examples.html", "passage_text": "An antecedent is the word that a pronoun replaces or refers to. Any time that you have a pronoun, you'll have an antecedent, even if it's not in the very same sentence. This makes sense; if we didn't have an antecedent for every pronoun, we'd be left with a lot of confusion. First, remember that a pronoun and its antecedent must always agree in number. Basically, if an antecedent is singular, then the pronoun that replaces it or refers to it must also be singular. If a word is singular, that means that there is just one."}, {"url": "http://www.grammar-monster.com/glossary/antecedent.htm", "passage_text": "An antecedent is the word (or words) that a pronoun refers to. The word antecedent means to go before in Latin. It gets its name from the idea that a pronoun refers to something previously mentioned in the sentence. Look at this example: Typically, the antecedent of a pronoun is a noun or a noun phrase. Despite the name, an antecedent does not always come before its pronoun."}, {"url": "http://www.answers.com/Q/What_is_the_meaning_of_a_pronoun_antecedent_agreement", "passage_text": "Confidence votes 95.1K. A pronoun is a substitute for a noun. An antecedent is the noun that the pronoun is standing in for. The pronoun used must agree in number (singular, plural) and gender (male, female, neuter) with the noun antecedent. Example: Judge John Lee insists on proper dress in his courtroom. "}]