[{"url": "http://whatscookingamerica.net/Information/MeatTemperatureChart.htm", "passage_text": "Cooking thermometers take the guesswork out of cooking, as they measure the internal temperatures of your cooked meat, poultry, seafood, baked goods, and/or casseroles, to assure that a safe temperature has been reached, harmful bacteria have been destroyed, and your food is cooked perfectly."}, {"url": "http://www.health.state.mn.us/foodsafety/cook/cooktemp.html", "passage_text": "Note: There are three important temperatures to remember when cooking meat or eggs at home: Eggs and all ground meats must be cooked to 160°F; poultry and fowl to 165°F; and fresh meat steaks, chops and roasts to 145°F. Use a thermometer to check temperatures."}, {"url": "http://www.health.state.mn.us/foodsafety/cook/temperature.html", "passage_text": "1 Ground beef and hamburgers should be cooked until they are no longer pink in the middle. 2  Using a thermometer to measure the internal temperature of meat can be used to ensure that it is cooked sufficiently to kill bacteria. 3  Ground beef should be cooked to an internal temperature of 160°F."}, {"url": "http://amazingribs.com/tips_and_technique/meat_temperature_guide.html", "passage_text": "But at that temp, it takes at least two hours to kill them to 7D. The time gets lower as the temperature goes higher. So beef at 140°F degrees will get to a 7D kill rate in just 12 minutes, while at 160°F degrees, pathogens are destroyed in just 7.3 seconds, hence the USDA guidelines for the consumer."}, {"url": "http://southernfood.about.com/od/foodsafety/fl/Meat-and-Poultry-Temperature-Chart.htm", "passage_text": "Marinated Grilled Steak. The proper temperature to cook a medium-rare steak is 130° - 135° F. Although, according to foodsafety.gov, beef, lamb, and pork should be cooked to at least 145° (or above, if desired). Ground meat must be cooked to at least 160° F. Ground poultry must be cooked to at least 165°."}, {"url": "http://web.extension.illinois.edu/meatsafety/freezer.cfm", "passage_text": "(See Packaging or Repackaging Meat). Properly handled food stored in a freezer at 0°F (-18 °C) will always be safe as long as it hasn’t thawed. The food is safe because the bacteria has entered a dormant stage. For best quality, store frozen raw ground meats no more than 3 to 4 months; cooked meats, 2 to 3 months."}]