[{"url": "http://money.usnews.com/careers/best-jobs/veterinarian/salary", "passage_text": "The BLS reports that veterinarians earned a median salary of $86,640 in 2013. The best-paid veterinarians earned $149,530, while the lowest-paid earned $53,270. With an average salary of $96,140 in 2013, veterinarians earned a healthy take-home pay for health care jobs. While they earned less than physicians ($188,440), they made about three times the pay of veterinary technologists ($31,760) in 2013. They made about the same average salary as physician assistants ($94,530)."}, {"url": "http://www.funtrivia.com/askft/Question2207.html", "passage_text": "Veterinarians who treat only large animals, such as cows, earn the highest entry wage. They receive about $3,290/month. The type of industry can also affect wages for veterinarians. Those who work for universities, often in research labs, earn the least. On average, their starting salary is $1,640/month. Veterinarians who work for industry or commercial businesses earn the highest starting salaries. They generally start at $3,710/month. Wages are higher for experienced veterinarians. The average salary for veterinarians in private practice is $4,790/month. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070922124236AAMJYMn", "passage_text": "Rating Newest Oldest. Best Answer: Most, if not all, vets get paid a yearly salary. The mean for a starting veterinary fresh out of college is about $43,000 a year. This is not really much if you think about all the education that they've had to go through (4 years college undergrad., 4 years vet school, a couple years of internship). Most vets aren't paid hourly, they get a set salary. The salary is based on the size of the vet clinic, if the vet is a specialist in a particular field, area of the country, rural or city, large or small animal practice or both, etc. Source(s): vet tech for 35 years. Great Dane Lover · 8 years ago."}, {"url": "http://salarybystate.org/tag/how-much-does-a-veterinarian-make", "passage_text": "Bureau of Labor Statistics information for the median salary in 2010 for Veterinarians shows the the wage was $82,040 a year which is about $39.44 an hour. The veterinarian career is expected to grow by 36% from 2010 – 2020 and will add around 22,000 jobs to the overall market over this 10 year period. Being employed in one of the best paying states for veterinarians can earn you as much as $92,000 a year which is about $10,000 more than the median pay. Listed below is information that is specific to Veterinarian job salaries that you can expect to receive in that state area"}, {"url": "http://work.chron.com/much-veterinarians-make-yearly-6628.html", "passage_text": "Basics. The country’s 55,410 veterinarians made an average $91,250 per year as of May 2011, according to the BLS. However, annual pay ranged from $50,480 to $141,680 per year. Veterinarians diagnose and treat pets and animals on farms, ranches, zoos, racetracks and laboratories. The highest paying jobs for veterinarians were in scientific research and development, pharmaceutical research and manufacturing, and support activities for animal production. Their respective average salaries ran $124,610, $113,270 and $104,160 per year in 2011."}, {"url": "http://www.healthassistancepartnership.org/veterinarian-salary/", "passage_text": "Veterinarian salary is very high in New Jersey. The salary range of veterinarians who work in New Jersey is around $84,460-$117,170 per year. Connecticut vet doctors can earn around 116,150. If you are working in California, you can earn around 99,940. Around 10% veterinarians in the United States get a minimum hourly salary of $24.77 and annual salary of $51,500. Around 50 percent vet doctors in the US get an average hourly salary of $40.61 and $84,500 annually."}, {"url": "http://money.usnews.com/careers/best-jobs/veterinarian/salary", "passage_text": "Salary Outlook. The BLS reports that veterinarians earned a median salary of $86,640 in 2013. The best-paid veterinarians earned $149,530, while the lowest-paid earned $53,270. Veterinarians working in scientific research tend to be among the highest paid. With an average salary of $96,140 in 2013, veterinarians earned a healthy take-home pay for health care jobs. While they earned less than physicians ($188,440), they made about three times the pay of veterinary technologists ($31,760) in 2013. They made about the same average salary as physician assistants ($94,530)."}]