[{"url": "http://budgeting.thenest.com/tax-deductions-energy-saving-appliances-3357.html", "passage_text": "If you own a home, you can claim up to a $1,500 credit on your income taxes for installing qualified energy-efficient appliances. The amount of credit you receive depends on how much you spent on energy-efficient appliances. The tax credit is 30 percent of the total cost of the energy-efficient appliance, including any installation costs."}, {"url": "http://www.efile.com/tax-credit/energy-credit/", "passage_text": "If you made certain energy-saving or energy-efficient home improvements in 2014 or earlier, you could get a tax credit for up to 10% of the purchase price of qualified products, up to a maximum amount of $500 for all your home improvements (a maximum of $200 for windows) made during 2014. In addition to home energy credits, there are many other tax breaks and tax deductions available to homeowners. Learn about other federal tax credits. See what tax deductions you may qualify to claim on your tax return. tax deductions for"}, {"url": "http://www.ehow.com/how_5858760_deduct-energy_efficient-appliances-taxes.html", "passage_text": "Taxpayers typically fill out Form 1040 when they want to deduct various items from their taxes. In this case, when you want to deduct energy-efficient appliances from your taxes, on line 52 of the 1040, you can claim or enter the amount of deduction taken from Form 5695. Fill out Form 5695, which is called the Residential Energy Efficient Property Credit. In order to claim an appliance for a deduction in 2011, for example, the product must have been “placed in service” and used in 2011."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Tax-Deductions-and-Credits/Are-Energy-Efficient-Appliances-Tax-Deductible-/INF14167.html", "passage_text": "Equipment that qualifies for energy tax credits. Residential geothermal heat pumps, wind turbines and solar-power systems installed before the end of 2016 also qualify for a separate 30 percent credit. You can claim this for new or existing buildings, and for your vacation home as well as your primary residence. OVERVIEW. In past years, as an incentive to conserve energy at home, the federal government has offered tax credits to homeowners who purchase energy-efficient appliances."}, {"url": "http://budgeting.thenest.com/can-claim-washer-dryer-taxes-21978.html", "passage_text": "Charitable Deduction. If you replace your existing HE washer and dryer with a new model, and donate your used appliances to a qualified charity, you can deduct the fair market value of the washer and dryer."}, {"url": "http://www.tax.virginia.gov/content/deductions", "passage_text": "109 Sales Tax Paid on Certain Energy Efficient Equipment or Appliances-Allows an income tax deduction for 20% of the sales tax paid on certain energy efficient equipment or appliances, up to $500 per year. If filing a joint return, you may deduct up to $1,000. "}, {"url": "http://budgeting.thenest.com/tax-deductions-energy-saving-appliances-3357.html", "passage_text": "Tax Deductions for Energy Saving Appliances. If you've purchased energy-efficient appliances this year, you may be eligible for a tax credit. If you've been transforming your house or condo into a green-friendly haven by installing energy-efficient appliances, you may qualify for credits on this year's taxes. Tax credits reduce the amount of income tax you owe dollar-for-dollar, so they can offer serious tax savings. The amount of credit you receive depends on how much you spent on energy-efficient appliances. The tax credit is 30 percent of the total cost of the energy-efficient appliance, including any installation costs."}, {"url": "http://budgeting.thenest.com/tax-deductions-energy-saving-appliances-3357.html", "passage_text": "Qualifying Criteria. You can apply for the tax credit if you have installed your energy-efficient appliances in 2009 and before December 31, 2010. Unfortunately, only the appliances listed above are eligible and you cannot receive a tax credit for energy-efficient dishwashers, dryers or other common appliances. The amount of credit you receive depends on how much you spent on energy-efficient appliances. The tax credit is 30 percent of the total cost of the energy-efficient appliance, including any installation costs."}, {"url": "http://www.ehow.com/how_5858760_deduct-energy_efficient-appliances-taxes.html", "passage_text": "Read and understand the new legislation on deducting energy efficient appliances. The new legislation on the 2005 Energy Policy Act indicates that taxpayers who invest in energy-efficient appliances can claim tax credits or deductions when doing their taxes for 2011. Fill out Form 5695, which is called the Residential Energy Efficient Property Credit. In order to claim an appliance for a deduction in 2011, for example, the product must have been “placed in service” and used in 2011."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Tax-Deductions-and-Credits/Are-Energy-Efficient-Appliances-Tax-Deductible-/INF14167.html", "passage_text": "You should keep your receipt for the appliance as well as the Manufacturer's Certification Statement, so you can prove your claim if the IRS ever conducts an audit. Just remember, you can reduce your taxes with the energy tax credit, but you can't get money back. In other words, if you owe $2,200 and your credit is $3,400, you can only claim $2,200 this year. OVERVIEW. In past years, as an incentive to conserve energy at home, the federal government has offered tax credits to homeowners who purchase energy-efficient appliances."}]