[{"url": "https://discussions.apple.com/thread/2376772?start=0&tstart=0", "passage_text": "Hello beachgeek, From the Apple support document provided below: The folder where your backup data is stored changes depending on the computer's operating system. Since iTunes only keeps one backup per device, you should ensure the backup folder is included in your periodic data backup routine."}, {"url": "http://www.iphonefaq.org/archives/97900", "passage_text": "C:\\Documents and Settings\\user\\Application Data\\Apple Computer\\MobileSync\\Backup. The location of backup files on Windows Vista and 7 when made through iTunes are mentioned below: C:\\Users\\user\\AppData\\Roaming\\Apple Computer\\MobileSync\\Backup. For more info on this click http://www.iphonesmsrecovery.com."}, {"url": "https://support.apple.com/en-us/HT204215", "passage_text": "Windows XP: Find a list of your iTunes backups under \\Documents and Settings\\(username)\\Application Data\\Apple Computer\\MobileSync\\Backup\\. To quickly access the Application Data folder: 1  Click Start, then choose Run. 2  In the search bar, type:"}, {"url": "https://support.apple.com/en-us/HT204215", "passage_text": "iTunes saves backups to your user folder. The location of this folder varies depending on your operating system, and the location can't be changed. If you want to have extra copies of your iTunes backups, you can copy the backup folders to another location, external drive, or network storage location."}, {"url": "https://support.apple.com/en-us/HT204136", "passage_text": "From your Mac or PC, you can make a backup of your device in iTunes. Syncing your device with your computer isn't the same as making a backup. An iTunes backup includes nearly all of your device's data and settings."}, {"url": "http://apple.stackexchange.com/questions/96623/where-on-my-pc-does-itunes-store-the-backup", "passage_text": "iTunes places the backup files in the following places: Mac: ~/Library/Application Support/MobileSync/Backup/ Windows XP: \\Documents and Settings\\(username)\\Application Data\\Apple Computer\\MobileSync\\Backup\\ Note: To quickly access the Application Data folder, click Start, and choose Run. Type %appdata% and click OK."}, {"url": "http://www.windowspasswordsrecovery.com/articles/iphone-data/iphone-backup-file-location.html", "passage_text": "After you backup iPhone with iTunes, your iPhone data are stored in backup location. Here is the quick list of what is exactly stored in iPhone backup: 1  Various settings from the Settings app data, including Mail and Calendar account saeetings."}, {"url": "http://osxdaily.com/2009/09/11/iphone-backup-location/", "passage_text": "Windows XP stores all of your iPhone backup files in this location: C:\\Documents and Settings\\user\\Application Data\\Apple Computer\\MobileSync\\Backup. Obviously if your main drive is not C: then you’ll have to change that, same goes for ‘user’, be sure to replace with the username of your login in Windows."}]