[{"url": "http://www.answers.com/Q/What_alkali_is_in_gaviscon", "passage_text": "Ranitidine (brand name = Zantac) reduces the amount of acid secre … ted by the stomach lining. Gaviscon contains a mild antacid but its main action is to form a raft which floats on top of the stomach contents and makes it less likely to reflux into the oesophagus. + 74 others found this useful. Because, alkali is basically the term for a base in a liquid form, whereas a base is an alkali in a liquid or gas form so cannot be called an alkali because it is not liquid …. 4 people"}, {"url": "http://www.rsc.org/learn-chemistry/resources/chemistry-in-your-cupboard/gaviscon", "passage_text": "Heartburn occurs when hydrochloric acid from the stomach escapes into the oesophagus. The Gaviscon® brand of products uses chemistry to ‘keep the acid where it works not where it hurts’. "}, {"url": "https://www.gaviscon.com/", "passage_text": "In addition to the acid-neutralizing ingredients found in Gaviscon® , all Gaviscon® products contain alginate. When chewed (Gaviscon® tablets) or swallowed (Gaviscon® liquid), the combination of the alginic acid and bicarbonate creates a foam barrier or raft that floats on the stomach acid. This raft foam barrier helps reduce the number of reflux episodes and. than ordinary antacid products. If reflux occurs, this raft foam barrier is the first to contact the esophageal mucosa, and thus provides protection against the acid-pepsin gastric contents. In fact, Gaviscon® helps keep acid down in the stomach, where it belongs"}, {"url": "http://www.answers.com/Q/Are_antacids_a_acid_or_alkali", "passage_text": "Is alkali an acid? No. Alkali's and acids are an separate ends of the pH scale, the pH of acids being 1, 2, 3, 4 and 5 (strong to weak) and the pH of alkali's being 11, 12, 13, 14 and 15 (weak t … o strong). Examples of acids are hydrochloric acid (strong) and vinegar (weak). Toothpaste is an example of a weak alkali."}, {"url": "http://www.answers.com/Q/Are_antacids_a_acid_or_alkali", "passage_text": "They are designed for acid build up in your stomach, and when an acid (stomach acid) is mixed with the base (antacid) it causes a neutral substance in your … stomach, and that's how it gets rid of the build up. This process is called neutralization (when bases and acids react). No. Alkali's and acids are an separate ends of the pH scale, the pH of acids being 1, 2, 3, 4 and 5 (strong to weak) and the pH of alkali's being 11, 12, 13, 14 and 15 (weak t … o strong)."}, {"url": "http://www.answers.com/Q/What_alkali_is_in_gaviscon", "passage_text": "1 Gaviscon Antacid for Heartburn Treatment Heartburn is not a pleasant feeling and many people suffer from it. 2  It's good to know then that there are methods of healing it. 3  Gaviscon is an over-the-counter drug that com…. Because, alkali is basically the term for a base in a liquid form, whereas a base is an alkali in a liquid or gas form so cannot be called an alkali because it is not liquid …. 4 people found this useful"}, {"url": "http://www.mhra.gov.uk/home/groups/par/documents/websiteresources/con2033375.pdf", "passage_text": "The product contains the active ingredients sodium alginate, sodium bicarbonate and calcium carbonate. Gaviscon Liquid Sachets are indicated in the treatment of gastrooesophageal reflux, acid reflux, heartburn and reflux oesophagitis. "}, {"url": "http://www.answers.com/Q/Are_antacids_a_acid_or_alkali", "passage_text": "Alkali and acid are terms used when the pH of a substance is a certain number, for example if a substance has a pH of 1, 2, 3, 4, or 5, then the substanc … e is an acid. If the pH is 11, 12, 13, 14 or 15, then the substance is an alkali. No. Alkali's and acids are an separate ends of the pH scale, the pH of acids being 1, 2, 3, 4 and 5 (strong to weak) and the pH of alkali's being 11, 12, 13, 14 and 15 (weak t … o strong)."}, {"url": "http://www.answers.com/Q/What_alkali_is_in_gaviscon", "passage_text": "Sodium alginate / sodium bicarbonate / calcium carbonate Gaviscon is specifically made for relieving the symptoms of gastro-oesophageal reflux, such as heartburn, indigest … ion and acid regurgitation and Reflux esophagitis. 11 people found this useful. Because, alkali is basically the term for a base in a liquid form, whereas a base is an alkali in a liquid or gas form so cannot be called an alkali because it is not liquid …. 4"}]