[{"url": "https://www.ptk.org/", "passage_text": "GEICO® and Phi Theta Kappa have partnered to offer members a special discount of up to 8% off of GEICO's already low car insurance rates. GEICO® is an Annual Convention Sponsor and provides the GEICO Pathways to Completion Scholarships for Associate, Bachelor's and Master's students."}, {"url": "http://www.alamo.edu/spc/Phi-Theta-Kappa/", "passage_text": "Phi Theta Kappa, founded in 1918, is recognized as the official honor society for two-year colleges by the American Association of Community Colleges. Among the Society's distinguished alumni are the late Ambassador Jeane Kirkpatrick, astronaut Fred Haise, and journalist Jim Lehrer."}, {"url": "http://www.delta.edu/student-engagement/clubsorganizations/ptk.aspx", "passage_text": "Phi Theta Kappa. Phi Theta Kappa is the International Honor Society of the two-year college. It was founded in 1918 to recognize and encourage scholarship amongst students at two-year colleges. Currently, there are more than 1.5 million members worldwide, with close 100,000 new members inducted annually."}, {"url": "http://www.jtcc.edu/services/student-life/ptk/", "passage_text": "Phi Theta Kappa is the International Honor Society for two year colleges. The Chester Campus of John Tyler Community College is the home of the Tau Rho Chapter. The Midlothian Campus is the home of the Beta Omicron Omicron Chapter."}, {"url": "http://mcc.edu/ptk/ptk_faq.shtml", "passage_text": "1 Members of Phi Theta Kappa will have their membership in the international honor society noted on their transcript and may affix the Society's Gold Diploma Seal, denoting Society membership, to their two-year college diploma."}, {"url": "https://en.wikipedia.org/wiki/Phi_Theta_Kappa", "passage_text": "Phi Theta Kappa has a name similar to, and is heavily based on, Phi Beta Kappa, which is an international honor society for universities and traditional four-year colleges."}, {"url": "http://www.gmc.edu/current-students/phi-theta-kappa.cms", "passage_text": "Phi Theta Kappa. Phi Theta Kappa is an international honor society for students in two year colleges. Since its founding in 1918, Phi Theta Kappa has been the only national honor fraternity for junior colleges. It serves to promote scholarship, develop character, and cultivate fellowship."}]