[{"url": "https://www.exercise.com/faq/is-vitamin-d-stored-in-the-body", "passage_text": "Vitamin D is good for bone health and it aids the body in absorbing calcium. Of course, everyone knows that it is healthy calcium levels that lead to strong bones, which is why vitamin D is good for bone health. Vitamin D has been attributed to providing further benefits. Some of the symptoms of too much vitamin D include: 1  Loss of appetite. 2  Vomiting. 3  Nausea. 4  Constipation. 5  Weight loss. 6  Weakness. 7  Increase of blood calcium levels."}, {"url": "http://www.livestrong.com/article/465017-does-the-body-store-vitamin-d/", "passage_text": "Afterward, these vitamins are stored in the fat tissue for approximately two months. When the body needs more vitamins, vitamin D-2 and vitamin D-3 are converted to their active form called 25-hydroxyvitamin D. The active vitamin is then released into the blood. The released 25-hydroxyvitamin D can circulate in the body for approximately three weeks. Humans synthesize vitamin D by exposing the skin to the sun’s ultraviolet-B radiations, or by obtaining it from the diet. Unlike water-soluble vitamins, excess fat-soluble vitamins are stored in the liver and fatty tissue. Most healthy people do not need vitamin D supplements."}, {"url": "http://ods.od.nih.gov/factsheets/VitaminD-HealthProfessional/", "passage_text": "Vitamin D is a fat-soluble vitamin that is naturally present in very few foods, added to others, and available as a dietary supplement. It is also produced endogenously when ultraviolet rays from sunlight strike the skin and trigger vitamin D synthesis. Vitamin D in these foods is primarily in the form of vitamin D 3 and its metabolite 25(OH)D 3 [ 12 ]. Some mushrooms provide vitamin D 2 in variable amounts [ 13, 14 ]. Mushrooms with enhanced levels of vitamin D 2 from being exposed to ultraviolet light under controlled conditions are also available."}, {"url": "http://healthyeating.sfgate.com/taking-extra-vitamin-d-reduce-body-fat-7101.html", "passage_text": "Although vitamin D may help with weight loss, it is not recommended to take excessive vitamin D in an attempt to lose those extra pounds. Because vitamin D is a fat-soluble vitamin stored in the fat cells, high doses may lead to toxicity. The upper limit of vitamin D is 4,000 IUs. Signs of vitamin D toxicity include nausea, vomiting and weakness. As with most vitamins, more is not always better. "}, {"url": "https://www.exercise.com/faq/is-vitamin-d-stored-in-the-body", "passage_text": "The great thing about the fact that vitamin D is stored in the body is the fact that if you go a few days without exposure to sunlight you will still have enough vitamin D to remain healthy. Some of the symptoms of too much vitamin D include: 1  Loss of appetite. 2  Vomiting. 3  Nausea. 4  Constipation. 5  Weight loss. 6  Weakness. 7  Increase of blood calcium levels."}, {"url": "http://www.livestrong.com/article/465017-does-the-body-store-vitamin-d/", "passage_text": "Vitamin D is an essential fat-soluble vitamin that helps the body to metabolize calcium. Humans synthesize vitamin D by exposing the skin to the sun’s ultraviolet-B radiations, or by obtaining it from the diet. Unlike water-soluble vitamins, excess fat-soluble vitamins are stored in the liver and fatty tissue. Most healthy people do not need vitamin D supplements. Moreover, those who may require supplemental amounts of vitamin D should note that too much of it could be toxic"}, {"url": "http://www.merckmanuals.com/home/disorders-of-nutrition/vitamins/vitamin-d", "passage_text": "Human breast milk contains only small amounts of vitamin D. Vitamin D is stored mainly in the liver. Vitamin D 2 and D 3 are not active in the body. Both forms must be processed (metabolized) by the liver and kidneys into an active form called active vitamin D or calcitriol. This active form promotes absorption of calcium and phosphorus from the intestine. It is also the form used in high-dose supplements. Vitamin D 3 (cholecalciferol): This form is the most active form of vitamin D. It is formed in the skin when the skin is exposed to direct sunlight. The most common food source is fortified foods, mainly cereals and dairy products."}, {"url": "http://www.myfooddiary.com/Resources/nutrient_facts/nutrient_vitaminA.asp", "passage_text": "Vitamin A is a fat-soluble vitamin that acts as an antioxidant. Antioxidants are chemicals which may help reduce risk of cancer. Since vitamin A is fat-soluble it is not needed in daily, large quantities. Fat-soluble vitamins are stored in the body in organs such as the liver. Most of the vitamin A that we consume goes to the liver to be stored until it is needed by another part of the body."}]