[{"url": "http://www.answers.com/Q/How_long_do_members_of_the_US_House_of_Representatives_serve", "passage_text": "Members of the House of Representatives are elected to two-year terms of office. All 435 voting seats are up for reelection at once, every two years in even-numbered years. There are no term limits. Members of the U.S. House of Representatives are elected for 2-year terms, so every two years each House seat is up for election."}, {"url": "http://www.house.state.tx.us/about-us/", "passage_text": "The Texas House of Representatives is composed of 150 members, each elected for a two-year term. The Texas Legislature meets in Regular Session for about five months every other year. Special Sessions may be called by the Governor and can last up to 30 days. A member of the house must be a citizen of the United States, must be a qualified elector of the state, and must be at least 21 years old."}, {"url": "http://www.answers.com/Q/How_long_do_members_of_the_US_House_of_Representatives_serve", "passage_text": "The number of voting members in the US House of Representatives is fixed at 435. That was set by Congress in The Reapportionment Act of 1929. Members of the U.S. House of Representatives are elected for 2-year terms, so every two years each House seat is up for election."}, {"url": "http://www.answers.com/Q/How_many_years_do_members_of_the_US_House_of_Representatives_serve", "passage_text": "Not counting reelections, special elections, or stepping down, members of the House of Representatives serve for two years, and members of the Senate serve for six years. Members of House and Senate There are 435 members of the house and 100 members of the senate."}, {"url": "http://www.house.state.tx.us/resources/frequently-asked-questions/", "passage_text": "The Texas House of Representatives is composed of 150 members, each elected for a two-year term. A member of the house must be a citizen of the United States, must be a qualified elector of the state, and must be at least 21 years old. There are 150 members of the house of representatives as opposed to 31 members of the senate. According to the most recent census figures, the ideal house district population is 113,243 as opposed to an ideal population of 547,952 for each senate district."}, {"url": "http://www.answers.com/Q/How_long_do_members_of_the_US_House_of_Representatives_serve", "passage_text": "How long do they serve in the house of representatives? Members of the U.S. House of Representatives are elected for 2-year terms, so every two years each House seat is up for election."}, {"url": "https://en.wikipedia.org/wiki/Illinois_House_of_Representatives", "passage_text": "Lawmakers must be at least 21 years of age and a resident of the district in which they serve for at least two years. U.S. President Abraham Lincoln, who oversaw the American Civil War and the end of slavery in the United States, got his start in politics at the Illinois House of Representatives. A person must be a U.S. citizen and two-year resident of an electoral district of at least 21 years of age to serve in the Illinois House of Representatives."}, {"url": "http://house.mo.gov/content.aspx?info=/info/memfaq.htm", "passage_text": "House members serve for two-year terms. To be eligible to run for the office of state representative, a candidate must be at least 24 years old, a qualified voter of the state for two years and a qualified voter of the district he or she would represent for one year. How many terms can a person serve in the Missouri House of Representatives? Under a constitutional amendment adopted by the voters in 1992, a person can serve no more than 8 years in the House and 8 years in the Missouri Senate. The limit applies to any member elected after 1992. Members of the House of Representatives receive an annual salary of $35,915. "}, {"url": "http://capuano.house.gov/services/faq.shtml", "passage_text": "All 435 seats in the House of Representatives are up for re-election every two years during even numbered years. Members serve two-year terms. Senators serve six-year terms. Approximately one third of the Senate is up for re-election every two years. There are 535 members of Congress 100 Senators and 435 Representatives. All states have two Senators while population determines representation in the House. The Commonwealth has 9 members of the House of"}]