[{"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "Unwinding of DNA at the origin and synthesis of new strands results in replication forks growing bidirectional from the origin. A number of proteins are associated with the replication fork which helps in terms of the initiation and continuation of DNA synthesis. Most prominently, DNA polymerase synthesizes the new DNA by adding complementary nucleotides to the template strand."}, {"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "DNA is made up of two strands and each strand of the original DNA molecule serves as a template for the production of the complementary strand, a process referred to as semiconservative replication. Cellular proofreading and error-checking mechanisms ensure near perfect fidelity for DNA replication. A number of proteins are associated with the replication fork which helps in terms of the initiation and continuation of DNA synthesis. Most prominently, DNA polymerase synthesizes the new DNA by adding complementary nucleotides to the template strand."}, {"url": "http://www.yourgenome.org/facts/what-is-dna-replication", "passage_text": "DNA replication is the process by which DNA makes a copy of itself during cell division. 1  The first step in DNA replication is to ‘unzip’ the double helix structure of the DNA molecule. 1 This sort of replication is called continuous. 2  Lagging strand: 3  Numerous RNA primers are made by the primase enzyme and bind at various points along the lagging strand. 4  Chunks of DNA, called Okazaki fragments, are then added to the lagging strand also in the 5’ to 3’ direction."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna3.htm", "passage_text": "The structure of DNA lends itself easily to DNA replication. Each side of the double helix runs in opposite (anti-parallel) directions. The beauty of this structure is that it can unzip down the middle and each side can serve as a pattern or template for the other side (called semi-conservative replication). "}, {"url": "https://en.wikipedia.org/wiki/DNA_replication", "passage_text": "DNA replication is the process of producing two identical replicas from one original DNA molecule. This biological process occurs in all living organisms and is the basis for biological inheritance. A number of proteins are associated with the replication fork which helps in terms of the initiation and continuation of DNA synthesis. Most prominently, DNA polymerase synthesizes the new DNA by adding complementary nucleotides to the template strand."}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Nucleic_Acid/DNA/Replication_Process", "passage_text": "Replication Fork [edit]. When DNA is being replicated, it forms a replication fork that was created during the helicase process that separates the DNA strand. The strands that are separated are called the leading strand and the lagging strand accordingly. The leading strand is synthesized in the 5'-3' direction. In initiation, many replication proteins called initiators convert the DNA into a replication fork. This is accomplished first by the initiator proteins assembling around the DNA which causes melting of the dsDNA (double stranded DNA) origin."}, {"url": "https://answers.yahoo.com/question/index?qid=20110130182200AAVfZvX", "passage_text": "Rating Newest Oldest. Best Answer: The most widespread example of DNA replication in the real world is your zipper. It divides into two strands on unwinding and forms replication fork just like DNA does. And the same unwinded strands can be incorporated into the daughter DNA molecules and thus becomes semiconservative in nature. Source(s): . "}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/D/DNAReplication.html", "passage_text": "1 A molecule of a DNA polymerase binds to one strand of the DNA and begins moving along it in the 3' to 5' direction, using it as a template for assembling a leading strand of nucleotides and reforming a double helix. 2  In eukaryotes, this molecule is called DNA polymerase epsilon (ε). 1 A portion of the double helix is unwound by a helicase. 2  A molecule of a DNA polymerase binds to one strand of the DNA and begins moving along it in the 3' to 5' direction, using it as a template for assembling a leading strand of nucleotides and reforming a double helix."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "The mechanism of transcription has parallels in that of DNA replication. As with DNA replication, partial unwinding of the double helix must occur before transcription can take place, and it is the RNA polymerase enzymes that catalyze this process. Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes."}]