[{"url": "https://answers.yahoo.com/question/index?qid=20101229113909AAVhExE", "passage_text": "Answers. Best Answer: RNA polymerase (RNAP or RNApol) is an enzyme that produces RNA. In cells, RNAP is needed for constructing RNA chains from DNA genes as templates, a process called transcription. RNA polymerase enzymes are essential to life and are found in all organisms and many viruses. In chemical terms, RNAP is a nucleotidyl transferase that polymerizes ribonucleotides at the 3' end of an RNA transcript"}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase", "passage_text": "Compare RNA-dependent RNA polymerase. RNA polymerase (RNAP or RNApol), also known as DNA-dependent RNA polymerase, is an enzyme that produces primary transcript RNA. In cells, RNAP is necessary for constructing RNA chains using DNA genes as templates, a process called transcription. Each RNAP is transcribing an RNA strand, which can be seen branching off from the DNA. Begin indicates the 3' end of the DNA, where RNAP initiates transcription; End indicates the 5' end, where the longer RNA molecules are completely transcribed."}, {"url": "http://www.nature.com/scitable/definition/RNA-polymerase-106", "passage_text": "RNA polymerase is an enzyme that is responsible for copying a DNA sequence into an RNA sequence, duyring the process of transcription. As complex molecule composed of protein subunits, RNA polymerase controls the process of transcription, during which the information stored in a molecule of DNA is copied into a new molecule of messenger RNA."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_RNA_polymerase", "passage_text": "Basically, RNA polymerase's role is very similar to that of DNA polymerase. RNA polymerase is an enzyme that is used during transcription in the nucleus. Similar to DNA polyme … rase, RNA polymerase codes for the complementary nucleotides to a DNA strand. Instead of thymine though, uracil codes with adenine. A polymerase is an enzyme that catalyzes the conversion of free nucleotides into a single strand.   DNA polymerase differs from RNA polymerase in two major respects:   * … Like all enzymes, DNA polymerase is substrate-specific."}, {"url": "http://www.ehow.com/about_6518716_primary-function-rna-polymerase-i_.html", "passage_text": "Mechanism. For each DNA base, RNA polymerase adds to its RNA molecule a complementary RNA base. As is usually the case in genetics, the DNA sequence is critical. This sequence determines the type of RNA that's being synthesized, as well as which of the existing RNA polymerases (I, II or III) will do it. Transcription, the first step in transforming DNA into proteins, is mediated by an enzyme named RNA polymerase. It consists of reading a sequence of DNA and transforming it, base by base, into a complementary sequence of RNA."}, {"url": "https://en.wikipedia.org/wiki/RNA_polymerase_II", "passage_text": "RNA polymerase II of Saccharomyces cerevisiae consisting of all 12 subunits. RNA polymerase II (RNAP II and Pol II) is an enzyme found in eukaryotic cells. It catalyzes the transcription of DNA to synthesize precursors of mRNA and most snRNA and microRNA. A 550 kDa complex of 12 subunits, RNAP II is the most studied type of RNA polymerase. "}, {"url": "http://www.ehow.com/about_6518716_primary-function-rna-polymerase-i_.html", "passage_text": "Transcription. Transcription, the first step in transforming DNA into proteins, is mediated by an enzyme named RNA polymerase. It consists of reading a sequence of DNA and transforming it, base by base, into a complementary sequence of RNA."}, {"url": "https://en.wikipedia.org/wiki/DNA_polymerase", "passage_text": "The DNA polymerases are enzymes that create DNA molecules by assembling nucleotides, the building blocks of DNA. These enzymes are essential to DNA replication and usually work in pairs to create two identical DNA strands from a single original DNA molecule. "}]