[{"url": "http://www.specialtyenzymes.com/products/term/protein-hydrolysis", "passage_text": "Home › Products › Protein Hydrolysis. Protein hydrolysis is the breakdown of protein into smaller peptides and free amino acids. Specialty Enzymes has animal-based proteases like trypsin, plant based proteases like papain and a large variety of microbial source proteases. "}, {"url": "http://www.gopetsamerica.com/bio/enzyme_types.aspx", "passage_text": "Like digestive enzymes, they enable the body to digest the food by breaking down the various nutrients, such as proteins, fats, carbohydrates, and vitamins and minerals, into smallest compounds that the body can absorb. Digestive enzymes aid in the digestion of food and the absorption and delivery of nutrients throughout the body. The most commonly known digestive enzymes are secreted from the pancreas into the stomach and small intestine. Each enzyme is specific to a particular compound which it breaks or synthesizes."}, {"url": "http://sciencelearn.org.nz/Contexts/Digestion-Chemistry/Science-Ideas-and-Concepts/Digestion-breaking-the-large-into-the-small", "passage_text": "Proteins. The basic building blocks of proteins are amino acids. The bonds that hold amino acids together are known as peptide bonds. To break the peptide bonds in a protein, a hydrolysis reaction is needed similar to that involved in breaking up carbohydrates. Enzymes known as proteases are needed to break up the protein. "}, {"url": "http://capital.osd.wednet.edu/media/capital/staff/jansen/enzyme_packet.doc", "passage_text": "There are several categories of food enzymes: Lipase, breaks down fats that are found in most dairy products, nuts, oils, and meat. Lactase, breaks down lactose (milk sugars). Protease, breaks down proteins that are found in meats, nuts, eggs, and cheese. Amylase, breaks down carbohydrates, starches, and sugars, prevalent in potatoes,fruits, vegetables, and many snack foods. The enzymes involved in food decomposition and in the digestive process are hydrolases. They break down proteins (proteases), carbohydrates (carbohydrases or amylases), and fats (lipases). Plants also contain enzymes to break down fiber (cellulases)"}, {"url": "http://capital.osd.wednet.edu/media/capital/staff/jansen/enzyme_packet.doc", "passage_text": "Enzymes are composed of two parts, a protein portion called the apoenzyme and a nonprotein portion, either a coenzyme (organic) or cofactor (inorganic). Enzymes are present in every cell in both plants and animals; and are responsible for regulating the biochemical reactions necessary to sustain life. The enzymes involved in food decomposition and in the digestive process are hydrolases. They break down proteins (proteases), carbohydrates (carbohydrases or amylases), and fats (lipases). Plants also contain enzymes to break down fiber (cellulases)"}, {"url": "http://www.discoveryeducation.com/diabetes/pdf/Lesson2.pdf", "passage_text": "Fats are broken down and digested into fatty acids and glycerol  Proteins are digested into amino acids  Carbohydrates are digested into simple sugars • Digestion involves mechanical and chemical processes. An enzyme is a protein that speeds up a chemical reaction; digestive enzymes speed up the breakdown of a food. "}, {"url": "http://www.enzymestuff.com/basicswhichenzyme.htm", "passage_text": "All enzymes themselves are proteins that consist of amino acids just like all other proteins. Enzymes That Work on Specific Food Types or Compounds. Specific enzymes work on specific foods. You need the right type of enzyme for the foods you want it to break down. Think of the foods you have problems with and then choose a product that contains at least those types of enzymes. Here is a list of the common enzyme types and foods they act on. Digestive enzymes are enzymes that break down food into usable material"}, {"url": "http://www.aboutcleaningproducts.com/science/ezyme-science/", "passage_text": "Enzyme proteins are only active when the specified substrate is present. The various types of actions can be categorized into specific enzyme classes. The most common enzyme types used in the Household care industry are proteases, amylases, lipase, cellulases, mannanases, and pectinases. Each type may have many variations of the same protein structure that results in different preferences for conditions for peak performance."}, {"url": "http://www.answers.com/Q/What_types_of_enzymes_are_responsible_for_hydrolyzing_the_proteins_in_foods", "passage_text": "A protease is an enzyme that uses hydrolysis to break down the peptide bonds of a protein. They can also be called proteinases, proteolytic enzymes, or peptidase. 5 people found this useful. Edit. This is harmless to proteins. So there is no autodigestion of the cell producing the enzyme. In the acid environment of stom … ach the pepsinogen get converted into pepsin. This pepsin is responsible for the breaking of peptide bond. This is most active in pH 1 to 2. It gets almost inactivated by pH 5."}]