[{"url": "https://en.wikipedia.org/wiki/Leukopenia", "passage_text": "Neutropenia, a subtype of leukopenia, refers to a decrease in the number of circulating neutrophil granulocytes, the most abundant white blood cells. The terms leukopenia and neutropenia may occasionally be used interchangeably, as the neutrophil count is the most important indicator of infection risk.ow white cell count may be due to acute viral infections, such as with a cold or influenza. It can be associated with chemotherapy, radiation therapy, myelofibrosis and aplastic anemia (failure of white cell, red cell and platelet production)."}, {"url": "http://www.md-health.com/Leukopenia.html", "passage_text": "Leukopenia is a shortage of white blood cells in the system, which can be caused by anemia, menorrhagia, etc. A low white blood cell count, or leukopenia will have a direct effect on your body's immune system. White blood cells are used to fight off infections within the blood stream. Without an adequate number of white blood cells your body will have trouble ridding itself of bacteria or viral matter which can cause disease.ny disease or condition that disrupts the production or function of bone marrow will cause the body to develop leukopenia. Viral infections will often cause the body to slow bone marrow function. Viral infections can also lower the white blood cell count as the cells die off fighting the infection."}, {"url": "http://study.com/academy/lesson/leukopenia-leukocytosis-causes-types.html", "passage_text": "Let's review. Leukopenia is a decreased number of white blood cells. A person is said to have leukopenia when the total white blood cell count falls below 4,000 white blood cells per microliter of blood. There are basically two types of leukopenia. The main type is neutropenia, which is a decreased number of neutrophils."}, {"url": "http://www.seattlecca.org/diseases/leukopenia.cfm", "passage_text": "Leukopenia is the medical term for low white blood cell count. In most cases it is due to low neutrophils (neutropenia) and/or low lymphocytes (lymphocytopenia). Both of these cell types play roles in your body’s defense against infections.eukopenia. "}, {"url": "http://www.mayoclinic.org/symptoms/low-white-blood-cell-count/basics/definition/SYM-20050615", "passage_text": "Definition. A low white blood cell count, or leukopenia, is a decrease in disease-fighting cells (leukocytes) circulating in your blood. The threshold for a low white blood cell count varies from one medical practice to another. Some healthy people have white cell counts that are lower than what's considered normal."}, {"url": "https://en.wikipedia.org/wiki/Leukopenia", "passage_text": "Leukopenia (also known as leukocytopenia or leucopenia, from Greek λευκός white and πενία deficiency) is a decrease in the number of white blood cells (leukocytes) found in the blood, which places individuals at increased risk of infection.ow white cell count may be due to acute viral infections, such as with a cold or influenza. It can be associated with chemotherapy, radiation therapy, myelofibrosis and aplastic anemia (failure of white cell, red cell and platelet production)."}, {"url": "http://medical-dictionary.thefreedictionary.com/leukopenia", "passage_text": "Leukopenia. A condition in which the number of leukocytes circulating in the blood is abnormally low and which is most commonly due to a decreased production of new cells in conjunction with various infectious diseases or as a reaction to various drugs or other chemicals.eduction of the number of leukocytes in the blood. It is a common manifestation of a number of diseases, especially those caused by viruses, by a severe inflammatory lesion that draws off large numbers of leukocytes, a consumption leukopenia, and by toxins which depress bone marrow function."}, {"url": "http://www.buzzle.com/articles/what-is-leukopenia.html", "passage_text": "Leukopenia is a medical condition, in which an individual's white blood cell count or leukocyte count is decreased considerably. Considering the fact that low levels of white blood cells indicate a weakened immune system, the overall effect of leukopenia is an increased risk of infectious diseases.eukopenia is also known by a different name, leukocytopenia. Leukopenia is not actually a disease, rather it's a condition that increases the chances of getting affected by several diseases. Hence, correct diagnosis and taking appropriate treatment approaches are essential for every affected individual."}, {"url": "http://www.merriam-webster.com/dictionary/leukopenia", "passage_text": "Definition of LEUKOPENIA. : a condition in which the number of white blood cells circulating in the blood is abnormally low.— leu·ko·pe·nic \\-nik\\ adjective. ADVERTISEMENT."}, {"url": "https://www.patientslikeme.com/conditions/957-leukopenia", "passage_text": "Leukopenia is a condition in which the number of leukocytes (white blood cells) in the blood is reduced. Many medical conditions, especially infections, cause reduced counts. It may also be associated with nutritional deficiencies, certain medications and medical treatments (i.e. radiation therapy)."}]