[{"url": "http://medical-dictionary.thefreedictionary.com/Phagocytes", "passage_text": "A cell that can ingest bacteria, foreign particles, and other cells. Phagocytes ingest and kill microbes, present antigen to lymphocytes, scavenge degenerating material, and release mediators."}, {"url": "https://en.wikipedia.org/wiki/Phagocyte", "passage_text": "Non-professional phagocytes are more limited than professional phagocytes in the type of particles they can take up. This is due to their lack of efficient phagocytic receptors, in particular opsonins —which are antibodies and complement attached to invaders by the immune system."}, {"url": "https://simple.wikipedia.org/wiki/Phagocyte", "passage_text": "Scanning electron micrograph of a phagocyte (yellow: neutrophil) engulfing some bacteria (orange: anthrax bacilli). Phagocytes are the white blood cells that protect the body by eating (phagocytosing) dirt, bacteria and dead or dying cells. They are important for fighting infections. They are also important for becoming immune. Phagocytes are important in all animals and are very complex in vertebrates."}, {"url": "http://www.thefreedictionary.com/Phagocytic+cells", "passage_text": "Phagocytes in vertebrate animals include white blood cells called macrophages, which help the body fight disease by breaking down foreign particles and bacteria. ♦ The process by which phagocytes engulf and break down bacteria or particles, as of food, is called phagocytosis (făg′ə-sī-tō′sĭs)."}, {"url": "https://simple.wikipedia.org/wiki/Phagocyte", "passage_text": "Phagocytes of humans and other animals are called professional or non-professional, depending on how good they are at phagocytosis. The professional phagocytes are neutrophils, monocytes, macrophages, dendritic cells, and mast cells."}, {"url": "http://www.answers.com/Q/What_is_a_phagocyte", "passage_text": "Answer by Nik vik. Confidence votes 54. Phagocytes A type of white blood cell the eats dead cells, and other debris in the blood. ----------------------------- A phagocyte is a white blood cell that 'engulfs' not only dead cells and debris but also reacts against Pathogens (disease causing micro-organisms)."}]