[{"url": "https://en.wikipedia.org/wiki/Lapham_Peak_Unit,_Kettle_Moraine_State_Forest", "passage_text": "The park takes its name from a hill found within its borders. Lapham Peak has an elevation of 1,233 feet (376 m) above sea level, and is the highest point in Waukesha County. The Lapham Peak area was formed 10,000 years ago by a glacier that covered much of Wisconsin (see Wisconsin glaciation). Examples of moraines, eskers and kettles can be found in the park. The land was developed in 1851 by Charles Hanson as a tourist attraction."}, {"url": "http://dnr.wi.gov/topic/parks/name/lapham/trails.html", "passage_text": "Lapham Peak has more than 17 miles of loop trails in the forest that vary in difficulty. Trails may be combined to custom-create your own circuit or one-way hike. Most trails are open to hikers in the summer and cross-country skiers in the winter. There is a 2.5-mile lighted loop during winter for night skiing. "}, {"url": "http://www.laphampeakfriends.org/", "passage_text": "Welcome to the Friends of Lapham Peak. The Friends of Lapham Peak was founded in 1989 as a nonprofit group dedicated to supporting and promoting the Kettle Moraine State Forest – Lapham Peak Unit in a variety of ways. The park is located 3/4 mile south of I-94 on County Hwy C (Delafield exit). The main attraction of the park is the 45 foot observation tower atop the highest point in Waukesha County. The park’s glaciated topography provides excellent hiking, backpacking, mountain biking, and cross-country skiing on the lighted trails."}, {"url": "http://insteptrailraces.com/", "passage_text": "Lapham Peak. Lapham Peak’s glaciated topography provides excellent hiking, backpacking, and cross-country skiing on lighted trails. Climb a 45-foot observation tower atop the highest point in Waukesha County (1,233 feet above sea level). Check out the beautiful photos of the course"}, {"url": "http://www.travelwisconsin.com/state-parks-forests/kettle-moraine-state-forest-lapham-peak-204159", "passage_text": "View from tower. Lapham Peak Tower. Climb a 45-foot observation tower atop the highest point in Waukesha County. The park's glaciated topography provides excellent hiking, backpacking, skijoring on non-designated cross-country ski trails and cross-country skiing on lighted trails. Call ahead for rentals for x-country skiing."}, {"url": "http://dnr.wi.gov/topic/parks/name/lapham/", "passage_text": "The Kettle Moraine and Lapham Peak were formed 10,000 years ago when a glacier covered much of Wisconsin. Lapham Peak's glaciated topography provides excellent hiking, backpacking and cross-country skiing on lighted trails. "}, {"url": "http://www.visitwaukeshacounty.com/recreation/attraction-details.php?ID=1218", "passage_text": "7 a.m. to 9 p.m.spring, summer, and fall and from 7 a.m. to 10 p.m. in the winter. Climb a 45-foot observation tower atop the highest point in Waukesha County (1,233 feet above sea level). Lapham Peak Unit's glaciated topography provides excellent hiking, backpacking, and cross-country skiing on lighted trails. In the fall, Lapham Peak offers fall color both close up and in panoramic views. The Kettle Moraine and Lapham Peak were formed 10,000 years ago when a glacier covered much of Wisconsin. More than 1,000 acres of this hilly terrain are within the Lapham Peak boundaries. Lapham Peak has a variety of sights and activities to offer"}, {"url": "https://en.wikipedia.org/wiki/Lapham_Peak_Unit,_Kettle_Moraine_State_Forest", "passage_text": "Lapham Peak is a Wisconsin state park located in the Kettle Moraine State Forest. It is just south of Delafield and seven miles (11 km) west of Waukesha. The park entrance is two miles (3 km) north of the Glacial Drumlin State Trail. The Lapham Peak area was formed 10,000 years ago by a glacier that covered much of Wisconsin (see Wisconsin glaciation). Examples of moraines, eskers and kettles can be found in the park. The land was developed in 1851 by Charles Hanson as a tourist attraction."}]