[{"url": "http://www.livescience.com/22665-nervous-system.html", "passage_text": "The nervous system is a complex collection of nerves and specialized cells known as neurons that transmit signals between different parts of the body. It is essentially the body’s electrical wiring. Structurally, the nervous system has two components: the central nervous system and the peripheral nervous system. The peripheral nervous system consists of sensory neurons, ganglia (clusters of neurons) and nerves that connect to one another and to the central nervous system. Functionally, the nervous system has two main subdivisions: the somatic, or voluntary, component; and the autonomic, or involuntary, component."}, {"url": "http://study.com/academy/lesson/peripheral-nervous-system-definition-function-parts.html", "passage_text": "The peripheral nervous system includes all the nerves that go from the skin, muscle, and organs to the spinal cord and eventually the brain. However, the central nervous system is composed of the brain and spinal cord. The first is the central nervous system, which includes the brain and the spinal cord. The second nervous system, known as the peripheral nervous system, contains all the nerves in the body that lie outside of the spinal cord and brain."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_peripheral_nervous_system", "passage_text": "The function of the peripheral nervous system is to connect the  central nervous system to the limbs and organs. The peripheral  nervous system includes the nerves and ganglia that are outside of  the brain and spinal cord. The sensory division of the peripheral nervous system transmits impulses from sense organs to the central nervous system. The motor division transmits impulses from the centra … l nervous system to the muscles or glands."}, {"url": "http://www.wisegeek.com/what-are-the-functions-of-the-peripheral-nervous-system.htm", "passage_text": "The peripheral nervous system (PNS) is the network of nerves that send information from all parts of the body to the brain and spinal cord, a group called the central nervous system (CNS). The part of the PNS that is under voluntary control is called the somatic nervous system. Ad. Certain functions of the peripheral nervous system are automatic. These nerves make up the autonomic nervous system, and connect the internal organs and glands to the CNS."}, {"url": "http://biology.about.com/od/organsystems/ss/central-nervous-system.htm", "passage_text": "The central nervous system (CNS) is the processing center for the nervous system. It receives information from and sends information to the peripheral nervous system. The two main organs of the CNS are the brain and spinal cord. "}, {"url": "http://biology.about.com/od/organsystems/a/aa061804a.htm", "passage_text": "The nervous system consists of the brain, spinal cord, and a complex network of neurons. This system is responsible for sending, receiving, and interpreting information from all parts of the body. The nervous system monitors and coordinates internal organ function and responds to changes in the external environment. Motor nervous system cells carry information from the CNS to organs, muscles, and glands. The motor nervous system is divided into the somatic nervous system and the autonomic nervous system. The somatic nervous system controls skeletal muscle as well as external sensory organs such as the skin."}, {"url": "http://www.livescience.com/22665-nervous-system.html", "passage_text": "According to the National Institutes of Health, the central nervous system is made up of the brain, spinal cord and nerves. The peripheral nervous system consists of sensory neurons, ganglia (clusters of neurons) and nerves that connect to one another and to the central nervous system. Functionally, the nervous system has two main subdivisions: the somatic, or voluntary, component; and the autonomic, or involuntary, component."}, {"url": "http://thenervoussystemap.weebly.com/overall-function-of-nervous-system.html", "passage_text": "The nervous system is an organ system containing a network of specialized cells called neurons that coordinate the actions of an animal and transmit signals between different parts of its body. So, in a way, the nervous system is responsible for all life functions. The main functions of the nervous system are to receive sensory input from internal and external environment, integrate the input, and respond to stimuli. The brain communicates with the rest of the body through the spinal cord and the nerves"}, {"url": "http://thenervoussystemap.weebly.com/overall-function-of-nervous-system.html", "passage_text": "The central nervous system is made up of the brain and spinal cord. The brain and spinal cord are incredibly to life and functioning, so there are a number of protective barriers surrounding them starting with the bone (skull and spine). So, in a way, the nervous system is responsible for all life functions. The main functions of the nervous system are to receive sensory input from internal and external environment, integrate the input, and respond to stimuli. The brain communicates with the rest of the body through the spinal cord and the nerves"}]