[{"url": "http://www.simplyhired.com/salaries-k-clinical-psychologist-jobs.html", "passage_text": "Average Clinical Psychologist Salaries. The average salary for clinical psychologist jobs is $58,000. Average clinical psychologist salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term clinical psychologist anywhere in the job listing."}, {"url": "http://www.allpsychologycareers.com/salary/clinical-psychology-salary.html", "passage_text": "According to the U.S. Bureau of Labor Statistics, increased demand for psychology services translates into a 12% growth rate for psychology professionals through 2012-2022. And, depending on education, psychological specialty, and experience, salaries for clinical psychology positions are expected to remain high."}, {"url": "http://www.allpsychologycareers.com/salary/clinical-psychology-salary.html", "passage_text": "Competitive salaries for clinical psychologists. As per the Bureau of Labor Statistics (BLS), Occupational Outlook Handbook, 2014-15 Edition, clinical psychologists, categorized under the clinical, counseling, and school psychology job sector, earned a median wage of $74,030."}, {"url": "http://work.chron.com/average-salary-clinical-psychologist-work-hospital-setting-7109.html", "passage_text": "Salaries by State. The BLS reports that the top paying states for clinical psychologists are New Jersey, where the annual mean is $96,200; followed by Hawaii, with $94,960; California, with $84,580; New York, with $84,090; and Rhode Island, with $82,100."}, {"url": "http://www.allpsychologyschools.com/clinical-psychology/salary/", "passage_text": "According to the 2014-15 Occupational Outlook Handbook from the U.S. Bureau of Labor Statistics (BLS), the median national annual salary for clinical psychologists is $67,650. Actual salaries may vary greatly based on specialization within the field, location, years of experience and a variety of other factors."}, {"url": "http://work.chron.com/average-salary-clinical-psychologist-work-hospital-setting-7109.html", "passage_text": "Related Reading: The Average Salary of a Nationally Certified School Psychologist. The BLS reports that the top paying states for clinical psychologists are New Jersey, where the annual mean is $96,200; followed by Hawaii, with $94,960; California, with $84,580; New York, with $84,090; and Rhode Island, with $82,100."}, {"url": "http://careersinpsychology.org/becoming-a-clinical-psychologist/", "passage_text": "According to the U.S. Bureau of Labor Statistics the median annual salary of clinical psychologists was $67,800 in May of 2011, which amounts to an hourly wage of $35.14. 1  Sigmund Freud is often credited for inventing talk therapy and modern psychoanalysis."}, {"url": "http://www.allpsychologycareers.com/salary/clinical-psychology-salary.html", "passage_text": "For clinical psychologists working in the offices of other health practitioners, that median wage rises to $81,480. But salaries rise even higher as individuals in this field earn more credentials, experience, and certifications."}]