[{"url": "http://www.medifast1.com/one_medifast/medifast_weight_control_centers.jsp?cm_re=One+Medifast+121212+-+Grp+B-_-Banner+Block-_-MWCC+Division", "passage_text": "Our Medifast Weight-Loss Counselors are certified with a comprehensive two-week course that covers our program and protocols as well as nutrition, exercise, healthy eating habits, and effective counseling skills. "}, {"url": "http://www.thebestschools.org/weight-loss-careers/", "passage_text": "Some weight-loss counselors have a bachelor’s degree in health and nutrition science. Weight-loss counselors typically receive an hourly wage and commissions, with about 50% of their earnings coming from commissions. The national hourly pay rate for the profession in 2012 is from $8.07 to $39.73 per hour (PayScale). 17. Obesity is the number 2 cause of preventable death in the United States (number 1 is tobacco, number 3 is alcohol). The medical costs associated with being overweight top $150 billion annually. In addition, people spend over $60 billion annually on non-medical attempts to control weight."}, {"url": "http://jobstat.net/jobs/weight-loss-counselor/", "passage_text": "Bonuses for a Weight Loss Counselor are based on the years of experience using statistics from the U.S. as of 2015. The average bonus recorded was $0 from people with 15+ years of experience. The lowest salary reported was $16412. These figures will vary on a state to state basis as these are averages across all 50 states. Median hourly wage for a Weight Loss Counselor is $14.09 based on statistics in the U.S. as of 2015. The highest hourly rate recorded was $28.73. The lowest hourly rate recorded was $8.16. These figures will vary on a state to state basis as these are averages across all 50 states"}, {"url": "https://www.open.edu.au/careers/healthcare-medical-pharmaceuticals/weight-loss-consultants", "passage_text": "1 Average salary: $75,000 P/A. * 2  Wages will vary according to your level of skill, experience and employer. 3  Employment level: 5,100 as of November 2012 (Projected employment levels in 2017 of 5,700). 4  Average weekly hours: Average weekly hours worked for a full time Weight Loss Consultant is 46.7 hours. 1 Average weekly hours: Average weekly hours worked for a full time Weight Loss Consultant is 46.7 hours. 2  Employment by region: The top three regions for employment as a Weight Loss Consultant include: QLD: 31.8% VIC: 29.3% NSW: 26.3%. 3  QLD: 31.8%."}, {"url": "http://www.indeed.com/q-Nutrition-Weight-Loss-Counselor-jobs.html", "passage_text": "Weight Loss Counselor. Knowledge and experience in weight loss, weight management, or nutrition. We are looking for a Weight loss counselor to spearhead this program.... 1 Salary Search: Part Time Weight Control Counselor salaries in San Marcos, CA. 2  Related forums: Medifast Weight Control Centers-SAN Marcos, California - -."}, {"url": "http://jobstat.net/jobs/weight-loss-counselor/", "passage_text": "Average annual salary for a Weight Loss Counselor is $28340 based on statistics in the U.S. as of 2015. The highest salary recorded was $57779. The lowest salary reported was $16412. These figures will vary on a state to state basis as these are averages across all 50 states. Median hourly wage for a Weight Loss Counselor is $14.09 based on statistics in the U.S. as of 2015. The highest hourly rate recorded was $28.73. The lowest hourly rate recorded was $8.16. These figures will vary on a state to state basis as these are averages across all 50 states"}, {"url": "http://www.indeed.com/q-Weight-Loss-Counselor-jobs.html", "passage_text": "Weight Loss Counselor and Sales position available in Bethel Park – full time. Candidate should be outgoing, energetic, inspiring and have an interest in health... MedShape Weight Loss Clinics in Minnesota, currently has Full-Time opening for a Weight Loss Counselor in our Minnesota locations which are Maple Grove and..."}, {"url": "http://www.indeed.com/q-Nutrition-Weight-Loss-Counselor-jobs.html", "passage_text": "1 Salary Search: Weight Loss Counselor salaries in Lexington, KY. 2  Related forums: Lexington, Kentucky-Ageless Center Medical WeightLoss & MedSpa - -. 1 Salary Search: Part Time Weight Control Counselor salaries in San Marcos, CA. 2  Related forums: Medifast Weight Control Centers-SAN Marcos, California - -."}, {"url": "http://jobstat.net/jobs/weight-loss-counselor/", "passage_text": "These are the highest paying cities for a Weight Loss Counselor. These numbers are based off the median annual salary as of 2015. This chart outlines the average annual salary of a Weight Loss Counselor from the past 5 years. In 2015 the average annual salary was $28340 while in 2007 it was just $26282.02. The lowest salary reported was $16412. These figures will vary on a state to state basis as these are averages across all 50 states. Median hourly wage for a Weight Loss Counselor is $14.09 based on statistics in the U.S. as of 2015. The highest hourly rate recorded was $28.73. The lowest hourly rate recorded was $8.16. These figures will vary on a state to state basis as these are averages across all 50 states"}]