[{"url": "https://en.wikipedia.org/wiki/Eastern_equine_encephalitis_virus", "passage_text": "From Wikipedia, the free encyclopedia. Eastern equine encephalitis virus (EEE) , commonly called Triple E or, sleeping sickness (not to be confused with Trypanosomiasis) is a zoonotic alphavirus and arbovirus present in North, Central and South America and the Caribbean. EEE is capable of infecting a wide range of animals including mammals, birds, reptiles and amphibians. The virus is maintained in nature through a bird-mosquito cycle. There are two mosquito species primarily involved in this portion of the cycle, they are Culiseta melanura and Cs. morsitans."}, {"url": "http://healthvermont.gov/prevent/arbovirus/eee/eee_public.aspx", "passage_text": "EEE virus is transmitted by the bite of an infected mosquito. EEE virus typically infects birds, and in most years it remains in bird populations, posing minimal danger to humans and horses. Mosquitoes become infected by feeding on infected birds. If an infected mosquito bites a horse, human or other susceptible animal, the animal or person can become sick. The virus that causes EEE is only spread by mosquitoes. People, horses and deer do not spread the disease."}, {"url": "http://medical-dictionary.thefreedictionary.com/EEE", "passage_text": "EEE found near cemetery off Rt. 135; Mosquito spraying intensified by Telegram & Gazette (Worcester, MA). is a rare but serious disease that causes an inflammation of the brain tissue. "}, {"url": "https://en.wikipedia.org/wiki/Asus_Eee_PC", "passage_text": "The Asus Eee PC is a netbook computer line from ASUSTeK Computer Incorporated, and a part of the Asus Eee product family. At the time of its introduction in late 2007, it was noted for its combination of a lightweight, Linux-based operating system, solid-state drive (SSD), and relatively low cost. The Eee PC 904HD was one of the first Eee PC models which features an 80 GB HDD instead of an SSD. It features an Intel Celeron M running at 900 MHz and gets power from a 6-cell battery. Like other Eee PC 90x models, it features 802.11 b/g WLAN and a 1.3M pixel webcam. MS Windows XP comes pre-installed."}, {"url": "http://www.cdc.gov/EasternEquineEncephalitis/tech/symptoms.html", "passage_text": "Symptoms. The incubation period for Eastern equine encephalitis virus (EEEV) disease (the time from infected mosquito bite to onset of illness) ranges from 4 to 10 days. EEEV infection can result in one of two types of illness, systemic or encephalitic (involving swelling of the brain, referred to below as EEE). Symptoms & Treatment. The incubation period for Eastern equine encephalitis virus (EEEV) disease (the time from infected mosquito bite to onset of illness) ranges from 4 to 10 days."}, {"url": "http://www.cdc.gov/EasternEquineEncephalitis/gen/qa.html", "passage_text": "EEE is a rare disease that is caused by a virus spread by infected mosquitoes. EEE virus (EEEV) is one of a group of mosquito-transmitted viruses that can cause inflammation of the brain (encephalitis). In the United States, approximately 5-10 EEE cases are reported annually. Severe cases of EEEV infection (EEE, involving encephalitis, an inflammation of the brain) begin with the sudden onset of headache, high fever, chills, and vomiting. The illness may then progress into disorientation, seizures, and coma."}, {"url": "https://www.health.ny.gov/diseases/communicable/eastern_equine_encephalitis/fact_sheet.htm", "passage_text": "Eastern equine encephalitis (EEE) is a rare but serious viral disease spread by mosquitoes that can affect people and horses. EEE can also cause disease in captive birds such as the ring-necked pheasant, emu, ostriches, quail and ducks. EEE infection and disease can occasionally occur in other livestock, deer, dogs, other mammals, reptiles and amphibians. There is no specific treatment for EEE. Antibiotics are not effective against viruses, and no effective anti-viral drugs have been discovered for the treatment of EEE. Severe illnesses are treated by supportive therapy, which may include hospitalization, respiratory support, IV fluids and prevention of other infections."}, {"url": "http://healthvermont.gov/prevent/arbovirus/eee/eee_public.aspx", "passage_text": "Eastern equine encephalitis (EEE) is a rare but serious disease caused by a virus and spread by infected mosquitoes. The disease most commonly affects people and horses, but illness has been reported in other animals including alpacas, llamas, donkeys, pheasants and emus. Mosquitoes become infected by feeding on infected birds. If an infected mosquito bites a horse, human or other susceptible animal, the animal or person can become sick. The virus that causes EEE is only spread by mosquitoes. People, horses and deer do not spread the disease."}, {"url": "https://www.health.ny.gov/diseases/communicable/eastern_equine_encephalitis/fact_sheet.htm", "passage_text": "EEE is transmitted by the bite of an infected mosquito. Mosquitoes become infected by feeding on infected birds. Infected mosquitoes will then occasionally feed on horses, humans and other mammals. Several species of mosquitoes can become infected with the EEE virus (EEEV). There is no specific treatment for EEE. Antibiotics are not effective against viruses, and no effective anti-viral drugs have been discovered for the treatment of EEE. Severe illnesses are treated by supportive therapy, which may include hospitalization, respiratory support, IV fluids and prevention of other infections."}]