[{"url": "https://www.iaea.org/newscenter/focus/fukushima/status-update", "passage_text": "Radioactivity in water near the Fukushima Daiichi nuclear power plant has remained low and stable from 6 to 8 September 2015, according to the regular update provided by Japan's Nuclear Regulation Authority (NRA) to the IAEA. The Japanese Government has provided the IAEA with a report that summarizes the events and highlights the progress related to recovery operations at the Fukushima Daiichi Nuclear Power Station. The IAEA provided its assessments, which are contained in full at the end of the report."}, {"url": "https://en.wikipedia.org/wiki/Nuclear_power_in_Japan", "passage_text": "Problems in stabilizing the triple reactor meltdowns at Fukushima I nuclear plant hardened attitudes to nuclear power. As of June 2011, more than 80 percent of Japanese now said they were anti-nuclear and distrusted government information on radiation. Problems in stabilizing the Fukushima Daiichi nuclear power plant have hardened attitudes to nuclear power. As of June 2011, more than 80 percent of Japanese now say they are anti-nuclear and distrust government information on radiation ."}, {"url": "https://www.iaea.org/newscenter/focus/fukushima/status-update", "passage_text": "Radioactivity in water near the Fukushima Daiichi nuclear power plant has remained low and stable from 1 to 5 September 2015, according to the regular update provided by Japan's Nuclear Regulation Authority (NRA) to the IAEA. The Japanese Government has provided the IAEA with a report that summarizes the events and highlights the progress related to recovery operations at the Fukushima Daiichi Nuclear Power Station. The IAEA provided its assessments, which are contained in full at the end of the report."}, {"url": "http://mashable.com/2014/03/11/three-years-after-fukushima/", "passage_text": "By Andrew Freedman. The disaster at Fukushima Daiichi Nuclear Plant in Japan on March 11, 2011, destroyed tens of thousands of lives and had ripple effects around the world as nations reliant upon or considering nuclear power rethought their plans. A Tokyo Electric Power Co. (TEPCO) employee in a protective suit and a mask visits the suppression chamber area at the basement of the No. 5 reactor building of the TEPCO's tsunami-crippled Fukushima Dai-ichi nuclear power plant in Okuma, Fukushima prefecture, northeastern Japan, Monday, March 10, 2014."}, {"url": "http://www.elp.com/articles/2014/10/after-fukushima-japan-has-renewable-energy-boom.html", "passage_text": "Japan's energy policy, rewritten after the Fukushima crisis, set a goal for renewable energy including solar, wind, water and geothermal power to provide about 20 percent of energy needs by 2030. Before Fukushima, renewable energy in Japan had been virtually zero. "}, {"url": "http://abcnews.go.com/topics/news/fukushima-nuclear-power-plant.htm", "passage_text": "Tue, 3 Sep 2013. and a tsunami in 2011, the Fukushima Daiichi nuclear power plant has leaked 300 tons of radioactive ..... properly address the handling of Fukushima. Instead of leaving this ..... said that the situation in Fukushima will not affect Tokyo. Images of ..... Effects from the Fukushima radiation disaster ..... of Japan's Fukushima Daiichi plant. Find ..... the March 2011 Fukushima nuclear power plant meltdown."}, {"url": "https://en.wikipedia.org/wiki/Fukushima_Daiichi_Nuclear_Power_Plant", "passage_text": "Fukushima was the first nuclear plant to be designed, constructed and run in conjunction with General Electric, Boise, and Tokyo Electric Power Company (TEPCO). The plant suffered major damage from the magnitude 9.0 earthquake and tsunami that hit Japan on March 11, 2011. First commissioned in 1971, the plant consists of six boiling water reactors (BWR). These light water reactors drove electrical generators with a combined power of 4.7 GWe, making Fukushima Daiichi one of the 15 largest nuclear power stations in the world."}, {"url": "https://en.wikipedia.org/wiki/Nuclear_power_in_Japan", "passage_text": "Nuclear energy was a national strategic priority in Japan, but there had been concern about the ability of Japan's nuclear plants to withstand seismic activity. The Kashiwazaki-Kariwa Nuclear Power Plant was completely shut down for 21 months following an earthquake in 2007. Problems in stabilizing the Fukushima Daiichi nuclear power plant have hardened attitudes to nuclear power. As of June 2011, more than 80 percent of Japanese now say they are anti-nuclear and distrust government information on radiation ."}, {"url": "https://en.wikipedia.org/wiki/Nuclear_power_in_Japan", "passage_text": "As of September 2015, Japan has one nuclear power plant in operation. Prior to the earthquake and tsunami of March 2011, and the nuclear disasters that resulted from it, Japan had generated 30% of its electrical power from nuclear reactors and planned to increase that share to 40%. Problems in stabilizing the Fukushima Daiichi nuclear power plant have hardened attitudes to nuclear power. As of June 2011, more than 80 percent of Japanese now say they are anti-nuclear and distrust government information on radiation ."}]