[{"url": "http://www.answers.com/Q/Salary_for_a_lowes_store_manager", "passage_text": "Budget does affect the salary bonus of all managers, not just the store manager, but it also directly affects how many hours each department is allowed to schedule their employees and the amount of yearly raises. Answer 3. As late as early January, a Lowe's CSA level III can make as much as 10.00 an hour. A new store manager starts at around $70,000 a year with a small bonus. An Executive assistant manager is salaried about $55,000 a year. An EXA is a person who does assistant manager duties along with store manager duties. They are in training to become a store manager, and on average work about 50 hours per week. They also receive a small bonus on top of their salary. An established store manager of Walgreen's who runs a store well is salaried about $80,000 a year, and can easily make over $30,000 in bonus. They work about 45 hours a week"}, {"url": "http://www.salarylist.com/company/Lowes-Salary.htm", "passage_text": "Lowe's Salary. Lowe's average salary is $66,874, median salary is $65,544 with a salary range from $27,976 to $199,545. Lowe's salaries are collected from government agencies and companies. Each salary is associated with a real job position. Lowe's salary statistics is not exclusive and is for reference onl"}, {"url": "http://www.payscale.com/research/US/Employer=Lowe%27s_Home_Improvement_Inc./Hourly_Rate", "passage_text": "For those with five to nine years of experience, average earnings amount to $13.08 per hour. The largest fraction of Lowe's Home Improvement Inc. people (40 percent) have been working for one to four years and earn about $11.38 per hour on average. When overtime pay is included, this wage rises to $21.48. Lowe's Home Improvement Inc. paychecks are largely negotiated based on what you do at the company, though where you live and your experience level are also considered."}, {"url": "http://www.answers.com/Q/How_much_does_a_Lowe%27s_manager_make", "passage_text": "It is possible for a store manager to earn $200,000 per year. Not likely, but possible. Most will make around $100k. Co managers base between $45k and 65k, with up to 100% of there base as a bonus opportunity and assistant managers make between $35k and 60k and are eligible for up to 60% of their base. Expect to work 50-60 hours per week. It is a very hands on management style. How much money does a Lowe's employee make? The prevailing wage or minimum wage would apply. The reported averages from this year are from $ 9.34 an hour for retail cashiers to $ 13.20 or $ 13.24 an hour for Sales Speci … alists and Associates."}, {"url": "http://www.answers.com/Q/Salary_for_a_lowes_store_manager", "passage_text": "Most Store Manager salaries are dependent on store volume and how well that manager performs. As a general figure most new store managers earn at least $35,000 a year. M … ore experienced managers may earn up to $50,000 a year. A new store manager starts at around $70,000 a year with a small bonus. An Executive assistant manager is salaried about $55,000 a year. An EXA is a person who does assistant manager duties along with store manager duties. They are in training to become a store manager, and on average work about 50 hours per week. They also receive a small bonus on top of their salary. An established store manager of Walgreen's who runs a store well is salaried about $80,000 a year, and can easily make over $30,000 in bonus. They work about 45 hours a week"}, {"url": "http://www.payscale.com/research/US/Employer=Lowe%27s_Home_Improvement_Inc./Hourly_Rate", "passage_text": "Read More. On average, Lowe's Home Improvement Inc. employees receive $12.58 per hour. When overtime pay is included, this wage rises to $21.48. Lowe's Home Improvement Inc. paychecks are largely negotiated based on what you do at the company, though where you live and your experience level are also considered."}]