[{"url": "http://ghr.nlm.nih.gov/condition/rippling-muscle-disease", "passage_text": "In addition to rippling muscle disease, CAV3 gene mutations can cause other caveolinopathies including CAV3 -related distal myopathy, limb-girdle muscular dystrophy, isolated hyperCKemia, and a heart disorder called hypertrophic cardiomyopathy. Rippling muscle disease can be caused by mutations in the CAV3 gene. Muscle conditions caused by CAV3 gene mutations are called caveolinopathies."}, {"url": "http://simplybreastimplants.com/breast_augmentation_risks/rippling_wrinkling_breast_implant.html", "passage_text": "Traction rippling occurs only with textured breast implants. Textured implants are meant to adhere to your tissues. This adherence can cause pulling on the breast tissues and capsule, which can result in traction rippling. Basically, the textured shell of the breast implant grabs onto your tissues and pulls it. It isn't uncommon for smooth breast implants to ripple, but the rippling may not be able to be seen unless you bend over forward or are in a position in which your breasts are hanging down somewhat. Visible rippling may be seen in this position, but the rippling may be felt in any position."}, {"url": "http://www.diseaseinfosearch.org/Rippling+muscle+disease/6340", "passage_text": "Rippling muscle disease (RMD) is a rare muscle disorder characterised by muscle stiffness, exercise induced myalgia, and cramp-like sensations. It is genetically heterogeneous and can be acquired, but most cases show autosomal dominant inheritance due to mutations in the caveolin-3 ... Go To URL. "}, {"url": "http://ghr.nlm.nih.gov/condition/rippling-muscle-disease", "passage_text": "Rippling muscle disease is a condition in which the muscles are unusually sensitive to movement or pressure (irritable). The muscles near the center of the body (proximal muscles) are most affected, especially the thighs. Rippling muscle disease can be caused by mutations in the CAV3 gene. Muscle conditions caused by CAV3 gene mutations are called caveolinopathies."}, {"url": "http://medical-dictionary.thefreedictionary.com/rippling", "passage_text": "Rippling. A skin deformity characterised by ridging on the upper surface of the breast due to thin skin or underfilling or leakage of a breast implant. "}, {"url": "http://infoplasticsurgery.com/breast/augmentation/risks/rippling-wrinkling/", "passage_text": "Rippling. Dr. Loftus provide information on the risk of the rippling and wrinkling of a breast implant and how it is treated. They offer valuable information on what causes some women to experience wrinkling breast implants while others may experience rippling breast implants after a breast augmentation surgery. It is important to know beforehand that you may experience rippling and wrinkling problems after breast augmentation surgery and what you may do to reduce the risk. In a saline breast implant, the liquid moves freely within the shell and can cause small waves like those seen on the surface of a pond."}, {"url": "http://ghr.nlm.nih.gov/condition/rippling-muscle-disease", "passage_text": "Rippling muscle disease is usually inherited in an autosomal dominant pattern, but it is occasionally inherited in an autosomal recessive pattern. Autosomal dominant inheritance means that one copy of an altered CAV3 gene in each cell is sufficient to cause the disorder. Rippling muscle disease can be caused by mutations in the CAV3 gene. Muscle conditions caused by CAV3 gene mutations are called caveolinopathies."}, {"url": "http://simplybreastimplants.com/breast_augmentation_risks/rippling_wrinkling_breast_implant.html", "passage_text": "Breast implant rippling is exactly what it sounds like, rippling of the breast implant surface that may be see and/or felt. Most of the time, rippling is felt along the outer side of the breast and the inner side of the breast next to the cleavage. It isn't uncommon for smooth breast implants to ripple, but the rippling may not be able to be seen unless you bend over forward or are in a position in which your breasts are hanging down somewhat. Visible rippling may be seen in this position, but the rippling may be felt in any position."}]