[{"url": "http://www.babynamespedia.com/meaning/Kayla/f", "passage_text": "Kayla is also a form of the English Katherine. Kayla is also a form of the English and German Kay in the English language. Kayla is also a form of the English and Irish Kayley in the English language. Kayla is also a form of the English and Irish Kelly in the English language. "}, {"url": "https://answers.yahoo.com/question/index?qid=20081016091238AAGt5pb", "passage_text": "Best Answer: Kayla is a female given name, meaning pure in Greek, beloved in Gaelic, wise child in Arabic, crown of laurels in Latin, and full of joy in Hebrew. Relevance. Rating Newest Oldest. Best Answer: Kayla is a female given name, meaning pure in Greek, beloved in Gaelic, wise child in Arabic, crown of laurels in Latin, and full of joy in Hebrew. Variants include Kaela, Kaila, and Cayla."}, {"url": "http://www.meaning-of-names.com/irish-names/kayla.asp", "passage_text": "Meaning of Kayla. Irish name. In Irish, the name Kayla means-pure and beloved. Other origins for the name Kayla include-Irish, English, African-American.The name Kayla is most often used as a girl name or female name. Irish Name Meaning-pure and beloved. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Kayla", "passage_text": "Kayla /kay-la/ [2 sylls.] as a girls' name is pronounced KAY-la. It is of Irish and Gaelic origin, and the meaning of Kayla is slim and fair . From Caoilainn. Also used as a modern variant of Kayley and Katherine, or as a diminutive of Michaela. Also possibly from the Yiddish name Kelila, meaning  crown of laurel . Initial popularity of the name is due to the character named Kayla on the daytime TV drama Days of Our Lives. "}, {"url": "http://www.thenamemeaning.com/kayla/", "passage_text": "The first thing you should know if you are considering Kayla for your baby's name is that in most countries all over the world the name Kayla is a girl name. Popularity of the Name Kayla. Below you will find the popularity of the baby name Kayla displayed annually, from 1880 to the present day in our name popularity chart. Hover over or click on the dots that represent a year to see how many babies were given the name for that year, for both genders, if available."}, {"url": "http://www.thenamemeaning.com/kayla/", "passage_text": "Also note the spelling and the pronunciation of the name Kayla and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Kayla is fascinating, learn more about it. Popularity of the Name Kayla. Below you will find the popularity of the baby name Kayla displayed annually, from 1880 to the present day in our name popularity chart. Hover over or click on the dots that represent a year to see how many babies were given the name for that year, for both genders, if available."}, {"url": "http://babynames.allparenting.com/list/American_Baby_Names/Kayla/details/", "passage_text": "The name Kayla is a baby girl name. The name Kayla comes from the English origin. In English The meaning of the name Kayla is: Variants of Kay: keeper of the keys; pure. Famous bearer: Kayla is a character on daytime TV series 'Days of Our Lives."}, {"url": "http://www.thenamemeaning.com/kayla/", "passage_text": "Instead, we recommend that you pay a greater attention to the origin and meaning of the name Kayla. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Kayla, spread the love and share this with your friends. Popularity of the Name Kayla. Below you will find the popularity of the baby name Kayla displayed annually, from 1880 to the present day in our name popularity chart. Hover over or click on the dots that represent a year to see how many babies were given the name for that year, for both genders, if available."}, {"url": "http://www.sheknows.com/baby-names/name/kayla", "passage_text": "In Greek the meaning of the name Kayla is: Pure. American Meaning: The name Kayla is an American baby name. In American the meaning of the name Kayla is: Pure. English Meaning: The name Kayla is an English baby name. In English the meaning of the name Kayla is: Variants of Kay: keeper of the keys; pure. Famous bearer: Kayla is a character on daytime TV series 'Days of Our Lives"}]