[{"url": "http://www.medfem.co.za/information/what-is-infertility/pregnancy-rates-and-age", "passage_text": "The pregnancy risk for women in their late 30’s is much higher than for younger women, evidenced by an increase in the miscarriage rate and a higher rate of genetic abnormalities. At 35+ the miscarriage rate is roughly 25% and the risk of Downs syndrome becomes about 1/350. There is a very sharp decline in a woman’s ability to fall pregnant once over the age of 40. The fertility rate per month is only about 5% per month and even with IVF the pregnancy rate is only about 10% per try."}, {"url": "http://www.advocatesforyouth.org/publications/publications-a-z/467-pregnancy-and-childbearing-among-younger-teens", "passage_text": "Pregnancy Rate for Younger Teens Is Increasing. 1  The pregnancy rate among females age 14 and under rose from 13.5 (per 1,000 females age 14) in 1973 to 17.1 in 1992. 2  4. 3  Approximately nine percent of sexually experienced females age 14 and under become pregnant each year. 1 1. 2  The sexual activity rate among younger teens is increasing. 3  Among males who turned 20 between 1970 and 1972, 20 percent had had sexual intercourse by age 15, compared to 27 percent of those who turned 20 between 1985 and 1987."}, {"url": "http://www.childtrends.org/?indicators=teen-pregnancy", "passage_text": "Differences by Age. Older teens have much higher pregnancy rates than younger teens. In 2010, teens ages 18 to 19 had a pregnancy rate of 96.2, compared with rates of 30.1 among teens ages 15 to 17 years, and 1.1 among teens under age 15. [9] (Appendix 1). "}, {"url": "http://www.advocatesforyouth.org/publications/publications-a-z/467-pregnancy-and-childbearing-among-younger-teens", "passage_text": "1 The pregnancy rate among females age 14 and under rose from 13.5 (per 1,000 females age 14) in 1973 to 17.1 in 1992. 2  4. 3  Approximately nine percent of sexually experienced females age 14 and under become pregnant each year. 4  1. 1 1. 2  The sexual activity rate among younger teens is increasing. 3  Among males who turned 20 between 1970 and 1972, 20 percent had had sexual intercourse by age 15, compared to 27 percent of those who turned 20 between 1985 and 1987."}, {"url": "http://www.parenting.com/article/pregnancy-at-20-30-40", "passage_text": "Risks to your baby. The miscarriage rate is 10 percent, only slightly higher than for women five years younger. At age 25, your chances of delivering a baby with Down syndrome are 1 in 1,250, and there's a 1 in 476 chance of having a baby with any chromosomal abnormality. The risk of high blood pressure during pregnancy is about double for women over 35 compared with younger ones; hypertension affects about 10 to 20 percent of pregnant women in this age group."}, {"url": "http://www.cdc.gov/nchs/data/nvsr/nvsr60/nvsr60_07.pdf", "passage_text": "Fetal loss rates increased slightly. Pregnancy outcomes by age and race and Hispanic origin + Overall, 65 percent of pregnancies ended in a live birth in 2008, 18 percent in an induced abortion, and 17 percent in fetal loss (Table 3)."}, {"url": "http://www.advocatesforyouth.org/publications/publications-a-z/467-pregnancy-and-childbearing-among-younger-teens", "passage_text": "1 The sexual activity rate among younger teens is increasing. 2  Among males who turned 20 between 1970 and 1972, 20 percent had had sexual intercourse by age 15, compared to 27 percent of those who turned 20 between 1985 and 1987. 1 1. 2  The sexual activity rate among younger teens is increasing. 3"}, {"url": "http://www.parenting.com/article/pregnancy-at-20-30-40", "passage_text": "If you need infertility treatment, your chances of success are higher than they are for an older woman. For women under age 35 the success rate of in vitro fertilization (IVF), for example, is 25 to 28 percent; for those over age 40, that rate drops to 6 to 8 percent. The risk of high blood pressure during pregnancy is about double for women over 35 compared with younger ones; hypertension affects about 10 to 20 percent of pregnant women in this age group."}, {"url": "http://www.medfem.co.za/information/what-is-infertility/pregnancy-rates-and-age", "passage_text": "This is due to the greatly reduced number of genetically normal eggs remaining in the ovaries of a woman over forty. The pregnancy risk for women in their early 40’s is again much higher, with miscarriage rates at roughly 35%, and the risk of Downs syndrome about 1/38. For this reason many women in their 40’s choose to use an egg donor to become pregnant, with success rates of about 80% per cycle. There is a very sharp decline in a woman’s ability to fall pregnant once over the age of 40. The fertility rate per month is only about 5% per month and even with IVF the pregnancy rate is only about 10% per try."}, {"url": "http://www.cdc.gov/nchs/data/nvsr/nvsr60/nvsr60_07.pdf", "passage_text": "Discussion This report presents pregnancy rates for women in age groups 10–14 through 40–44 years in the United States for the years 1990 2008. Estimates are presented for pregnancy outcomes, byage group, race andHispanic origin, marital status. Pregnancy outcomes by age and race and Hispanic origin + Overall, 65 percent of pregnancies ended in a live birth in 2008, 18 percent in an induced abortion, and 17 percent in fetal loss (Table 3)."}]