[{"url": "http://www.alexinwanderland.com/2011/12/05/where-to-stay-in-phnom-penh/", "passage_text": "From uber-trendy design hotels on the riverfront to hidden-jem boutique guesthouses tucked away down quiet streets, there is something for everyone in the country’s capital. The following are my top picks for where to stay in Phnom Penh. If you can’t afford to stay at this super stylish hotel, you can at least have dinner or a drink in one of its two restaurants, one of which is located on the rooftop. From $85/130, Sisowath Quay, thequayhotel.com. Disclaimer: I was hosted by The Mad Monkey, Alibi Guesthouse, and Boddhi Tree in exchange for reviews."}, {"url": "http://grantourismotravels.com/2014/12/13/where-to-stay-in-phnom-penh-best-boutique-hotels/", "passage_text": "Lara Dunston. We were just in Cambodia ’ s capital, Phnom Penh – my, how it’s changing fast – so we thought it was time to provide you with an update to our first where to stay in Phnom Penh guide of a few years ago. Villa Langka was one of the first of Phnom Penh’s old villas to be converted into a boutique hotel – a big trend now – and it remains one of the best despite the proliferation of new openings in the last two years."}, {"url": "http://grantourismotravels.com/2014/12/13/where-to-stay-in-phnom-penh-best-boutique-hotels/", "passage_text": "best boutique hotels boutique hotels Cambodia Cambodia accommodation Cambodia hotels hotels Phnom Penh Phnom Penh accommodation where to stay in Phnom Penh. Villa Langka was one of the first of Phnom Penh’s old villas to be converted into a boutique hotel – a big trend now – and it remains one of the best despite the proliferation of new openings in the last two years."}, {"url": "http://www.cntraveller.com/guides/asia/cambodia/phnom-penh/where-to-stay", "passage_text": "296 Boulevard Mao Tse Toung, Phnom Penh (00 855 23 424 888). A five-star hotel located conveniently in Phnom Penh's bustling city centre, the InterContinental has everything you need for a comfortable stay. With 346 rooms, it is far from intimate, but you can make use of the spa, health and fitness centre, and the restaurants are good. Price rating: 2/5. 313 Sisowath Quay, Phnom Penh (00 855 23 218 189). This hotel took almost a quarter of a century to complete. Begun around 1967, when Prince Sihanouk was chief of state, the unfinished structure and its spacious grounds were used as a military base by the Lon Nol government."}, {"url": "http://www.lonelyplanet.com/cambodia/phnom-penh/hotels/best-places-to-stay-in-phnom-penh", "passage_text": "Best places to stay in Phnom Penh. Accommodation in Phnom Penh, as in the rest of the country, is terrific value no matter your budget and there are hundreds of guesthouses and hotels to choose from. Lonely Planet authors highlight their favourites here. Check in date."}, {"url": "http://www.tourismcambodia.com/travelguides/provinces/phnom-penh/where-to-stay.htm", "passage_text": "There is no shortage of accommodation in Phnom Penh, with an increasing number of guesthouses and hotels across the city catering for all pockets and tastes, from basic rooms with fans to opulent colonial suites with every luxury. Guesthouses/Budget places: If you're on a short pocket travelling and looking for a cheap accommodation the Lake Side next to the only lake of Phnom Penh will be the place to pop in. There is plenty of very basic budget and mid-range guesthouses from US$1.5-10 per room and night."}, {"url": "https://www.expedia.com/Phnom-Penh-Hotels.d6191801.Travel-Guide-Hotels", "passage_text": "Expedia.com offers a selection of 267 hotels in Phnom Penh. You are sure to find cheap deals and discount rates among them with our Best Price Guarantee. No matter what type of hotel strikes your fancy, we will let you search for your preferred one to accommodate your travel needs. Expedia.com will not only save you time, but also money when booking your stay at a hotel in Phnom Penh."}, {"url": "http://www.worldtravelguide.net/cambodia/hotels", "passage_text": "Where to stay in Cambodia. Hotels : Hotels in Cambodia are inexpensive, and standards have vastly improved in recent years, especially in Phnom Penh, Siem Reap and Sihanoukville, which offer a variety of hotels and hostels, and numerous international hotel chains. Various options are available in Phnom Penh, Siem Reap and Sihanoukville, while comparable lodgings are easily found throughout the country, in smaller villages and off-the-beaten-track locations. Many companies offer villas for long stay breaks"}, {"url": "http://www.alexinwanderland.com/2011/12/05/where-to-stay-in-phnom-penh/", "passage_text": "While it might not have quite the plethora of accommodation that Siem Reap offers, Phnom Penh will not leave you out on the streets. If you can’t afford to stay at this super stylish hotel, you can at least have dinner or a drink in one of its two restaurants, one of which is located on the rooftop. From $85/130, Sisowath Quay, thequayhotel.com. Disclaimer: I was hosted by The Mad Monkey, Alibi Guesthouse, and Boddhi Tree in exchange for reviews."}, {"url": "http://www.alexinwanderland.com/2011/12/05/where-to-stay-in-phnom-penh/", "passage_text": "It is centrally located just moments away from the Royal Palace, saving you lots of tuk-tuk rides! Rooms are bright and airy, and the villa itself is very elegant. There is a lovely garden patio area where breakfast is served in the morning and a pool table beckons in the evening. If you can’t afford to stay at this super stylish hotel, you can at least have dinner or a drink in one of its two restaurants, one of which is located on the rooftop. From $85/130, Sisowath Quay, thequayhotel.com. Disclaimer: I was hosted by The Mad Monkey, Alibi Guesthouse, and Boddhi Tree in exchange for reviews."}]