[{"url": "http://animals.nationalgeographic.com/animals/mammals/walrus/", "passage_text": "The walrus' scientific name, Odobenus rosmarus, is Latin for tooth-walking sea-horse.. Size relative to a 6-ft (2-m) man: The mustached and long-tusked walrus is most often found near the Arctic Circle, lying on the ice with hundreds of companions. Walruses use their iconic long tusks for a variety of reasons, each of which makes their lives in the Arctic a bit easier. They use them to haul their enormous bodies out of frigid waters, thus their tooth-walking label, and to break breathing holes into ice from below."}, {"url": "https://en.wikipedia.org/wiki/Walrus", "passage_text": "The walrus has played a prominent role in the cultures of many indigenous Arctic peoples, who have hunted the walrus for its meat, fat, skin, tusks, and bone. During the 19th century and the early 20th century, walruses were widely hunted and killed for their blubber, walrus ivory, and meat. Surrounding the tusks is a broad mat of stiff bristles ('mystacial vibrissae '), giving the walrus a characteristic whiskered appearance. There can be 400 to 700 vibrissae in 13 to 15 rows reaching 30 cm (12 in) in length, though in the wild they are often worn to much shorter lengths due to constant use in foraging."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/walrus/", "passage_text": "Their blubbery bodies allow them to live comfortably in the Arctic region—walruses are capable of slowing their heartbeats in order to withstand the polar temperatures of the surrounding waters. The two subspecies of walrus are divided geographically. Walruses use their iconic long tusks for a variety of reasons, each of which makes their lives in the Arctic a bit easier. They use them to haul their enormous bodies out of frigid waters, thus their tooth-walking label, and to break breathing holes into ice from below."}, {"url": "http://www.walrus-world.com/walrus-habitat/", "passage_text": "Walrus Habitat and distribution. You will find the walrus living in areas where it is very cold. They are found in the Arctic Ocean as well as the sub Arctic regions. They tend to stay in the shallow parts of the water. They tend to feed at the bottom of the water they are in and so it needs to be no more than 265 feet deep."}, {"url": "http://animals.nationalgeographic.com/animals/mammals/walrus/", "passage_text": "Atlantic walruses inhabit coastal areas from northeastern Canada to Greenland, while Pacific walruses inhabit the northern seas off Russia and Alaska, migrating seasonally from their southern range in the Bering Sea—where they are found on the pack ice in winter—to the Chukchi Sea. Walruses use their iconic long tusks for a variety of reasons, each of which makes their lives in the Arctic a bit easier. They use them to haul their enormous bodies out of frigid waters, thus their tooth-walking label, and to break breathing holes into ice from below."}, {"url": "https://en.wikipedia.org/wiki/Walrus", "passage_text": "This species is subdivided into three subspecies: the Atlantic walrus (O. r. rosmarus) which lives in the Atlantic Ocean, the Pacific walrus (O. r. divergens) which lives in the Pacific Ocean, and O. r. laptevi, which lives in the Laptev Sea of the Arctic Ocean. Surrounding the tusks is a broad mat of stiff bristles ('mystacial vibrissae '), giving the walrus a characteristic whiskered appearance. There can be 400 to 700 vibrissae in 13 to 15 rows reaching 30 cm (12 in) in length, though in the wild they are often worn to much shorter lengths due to constant use in foraging."}, {"url": "http://www.livescience.com/27442-walrus-facts.html", "passage_text": "Classification/taxonomy. There are three subspecies of walrus. Atlantic walruses live in the coastal areas along northeastern Canada to Greenland. Pacific walruses live in the northern seas near Russia and Alaska. Laptev walruses live in the Laptev Sea of Russia. Some scientists contest that the Laptev walrus is not a third subspecies, and say that it should be lumped together with the Pacific walrus, according to the International Union for Conservation of Nature's (IUCN) Red List. Walruses are carnivores, but they aren't ferocious hunters. The walrus' favorite food is shellfish. They dive underwater and use their whiskers to detect the shellfish in the dark waters of the ocean. According to the Smithsonian Institution's Arctic Study Center, a walrus can eat up to 4,000 clams in one feeding."}, {"url": "https://en.wikipedia.org/wiki/Walrus", "passage_text": "The species name rosmarus is Scandinavian. The Norwegian manuscript Konungsskuggsja, thought to date from around AD 1240, refers to the walrus as rosmhvalr in Iceland and rostungr in Greenland (walruses were by now extinct in Iceland and Norway, while the word evolved on in Greenland). Surrounding the tusks is a broad mat of stiff bristles ('mystacial vibrissae '), giving the walrus a characteristic whiskered appearance. There can be 400 to 700 vibrissae in 13 to 15 rows reaching 30 cm (12 in) in length, though in the wild they are often worn to much shorter lengths due to constant use in foraging."}]