[{"url": "http://www.webmd.com/cancer/tc/leukemia-topic-overview", "passage_text": "Symptoms may depend on what type of leukemia you have, but common symptoms include: 1  A new lump or swollen gland in your neck, under your arm, or in your groin. 2  Frequent nosebleeds, bleeding from the gums or rectum, more frequent bruising, or very heavy menstrual bleeding. 3  Frequent fevers. 4  Night sweats. 5  Bone pain. Leukemia is cancer of the blood cells. It starts in the bone marrow, the soft tissue inside most bones. Bone marrow is where blood cells are made. 1  White blood cells help your body fight infection. 2  Red blood cells carry oxygen to all parts of your body."}, {"url": "http://www.ehow.com/how-does_5525713_final-stages-aml-elderly.html", "passage_text": "Symptoms. Acute Myeloid Leukemia, or AML, is a rapidly progressing disease specific to elderly people. AML attacks the DNA of red blood cells while they are forming in the bone marrow. The body is then unable to produce enough red blood cells and platelets to sustain life. Early symptoms of AML are also symptoms of aging. Early symptoms include lethargy, bruising easily and shortness of breath."}, {"url": "http://nihseniorhealth.gov/leukemia/symptomsanddiagnosis/01.html", "passage_text": "Other Common Symptoms. Other common symptoms of leukemia include headache, weight loss, pain in the bones or joints, swelling or discomfort in the abdomen (from an enlarged spleen), and swollen lymph nodes, especially in the neck or armpit. Symptoms of acute leukemia may include vomiting, confusion, loss of muscle control, and seizures. "}, {"url": "https://www.caring.com/blogs/caring-currents/leukemia-in-seniors", "passage_text": "Symptoms of leukemia can be easy to overlook because they can mimic symptoms of the flu or a bad cold. To tell the difference, ask the person in your care about any possible bone pain or tenderness, swollen lymph nodes, shortness of breath, loss of appetite or weight, and abdominal pain from an enlarged spleen. Like the blobby looking cells in this photo, the leukemia cells eventually crowd out healthy white cells, sapping the body's infection-fighting capabilties. Over time, leukemia cells also crowd out red blood cells and platelets, impairing the blood's ability to carry oxygen and clot."}, {"url": "http://www.cancer.gov/types/leukemia/patient/adult-aml-treatment-pdq", "passage_text": "1 Adult acute myeloid leukemia (AML) is a type of cancer in which the bone marrow makes abnormal myeloblasts (a type of white blood cell), red blood cells, or platelets. Adult acute myeloid leukemia (AML) is a cancer of the blood and bone marrow. This type of cancer usually gets worse quickly if it is not treated."}, {"url": "https://www.caring.com/blogs/caring-currents/leukemia-in-seniors", "passage_text": "Leukemia is a cancer of the blood cells that starts in the bone marrow, causing the marrow to produce abnormal white blood cells. Like the blobby looking cells in this photo, the leukemia cells eventually crowd out healthy white cells, sapping the body's infection-fighting capabilties. Over time, leukemia cells also crowd out red blood cells and platelets, impairing the blood's ability to carry oxygen and clot."}, {"url": "http://www.mayoclinic.org/diseases-conditions/leukemia/basics/symptoms/CON-20024914", "passage_text": "Leukemia symptoms vary, depending on the type of leukemia. Common leukemia signs and symptoms include: 1  Fever or chills. 2  Persistent fatigue, weakness. 3  Frequent or severe infections. 4  Losing weight without trying. 5  Swollen lymph nodes, enlarged liver or spleen. 6  Easy bleeding or bruising. 7  Recurrent nosebleeds. 8  Tiny red spots in your skin (petechiae). 9  Excessive sweating, especially at night. 10  Bone pain or ..."}, {"url": "http://www.cancer.gov/types/leukemia/patient/adult-all-treatment-pdq", "passage_text": "1 Adult acute lymphoblastic leukemia (ALL) is a type of cancer in which the bone marrow makes too many lymphocytes (a type of white blood cell). 2  Leukemia may affect red blood cells, white blood cells, and platelets. 3  Previous chemotherapy and exposure to radiation may increase the risk of developing ALL. "}, {"url": "http://asheducationbook.hematologylibrary.org/content/2010/1/62.full", "passage_text": "Acute myeloid leukemia (AML) presents at all ages, but is mainly a disease of the elderly, with a median age of 69 years in the white US population. In the Swedish Acute Leukemia Registry, 68% of patients diagnosed with AML since 1973 were over age 60 years; between 1997 and 2005, 75% was aged 60 years or more. Prognosis worsens every decade beginning at age 30 to 40."}]