[{"url": "http://www.foodrepublic.com/2013/01/21/whats-the-difference-between-smoked-salmon-and-lox/", "passage_text": "Lox refers to salmon cured in a salt-sugar rub or brine (like gravlax) . Nova is cured and then cold-smoked (unlike lox or gravlax). There’s also hot-smoked salmon, which is cured, then fully cooked with heated wood smoke. Now, to acknowledge the purists. Smoked salmon is a blanket term for any salmon: wild, farmed, fillet, steak, cured with hot or cold smoke. Lox refers to salmon cured in a salt-sugar rub or brine (like gravlax)."}, {"url": "https://en.wikipedia.org/wiki/LOX", "passage_text": "Liquid oxygen — abbreviated LOx, LOX or Lox in the aerospace, submarine and gas industries — is one of the physical forms of elemental oxygen. "}, {"url": "http://www.jewishfoods.org/lox.html", "passage_text": "Lox is salmon, typically a filet, that has been cured, and then often it is cold smoked. The cold smoking does not cook the fish, resulting in its characteristic smooth texture similar to the raw product. Variations on the name are lox (Yiddish), lax (Swedish), laks (Norwegian and Danish) and lachs (German). Then the fish may be cold smoked. Nova or Nova Scotia lox: Similar to regular lox, but cured with a milder brine. The fish is then cold smoked. The name dates from a time when much of the salmon in New York came from Nova Scotia."}, {"url": "http://www.wisegeek.org/what-is-lox.htm", "passage_text": "Lox is commonly served with cream cheese on a bagel. Lox is a thin filet of cured, cold smoked salmon. Sliced apples are often served with lox. Lox canapes canapés with creme, crème fraiche fraîche. caviar and dill Lox is a thin filet of cured, cold smoked salmon. Sliced apples are often served with lox. Lox canapes canapés with creme, crème fraiche fraîche. Caviar and dill red onions are often used to garnish bagels with lox. And cream cheese a lox bagel can be made at home, using, an onion garlic or. other savory bagel"}, {"url": "http://www.foodrepublic.com/2013/01/21/whats-the-difference-between-smoked-salmon-and-lox/", "passage_text": "Learn the different kinds of smoked salmon. Food Republic. Smoked salmon is a blanket term for any salmon: wild, farmed, fillet, steak, cured with hot or cold smoke. Lox refers to salmon cured in a salt-sugar rub or brine (like gravlax). Nova is cured and then cold-smoked (unlike lox or gravlax)"}, {"url": "http://www.jewishrecipes.org/jewish-foods/lox.html", "passage_text": "Lox is salmon, typically a filet, that has been cured, and then often it is cold smoked. The cold smoking does not cook the fish, resulting in its characteristic smooth texture similar to the raw product. Variations on the name are lox (Yiddish), lax (Swedish), laks (Norwegian and Danish) and lachs (German). Also See: Lox Recipes. It is often served with cream cheese and / or on bagels. Types of lox. Regular: Brined in a solution of water, salt, sometimes sugars and spices (the brine). This is called wet brining. Then the fish may be cold smoked. Nova or Nova Scotia lox: Similar to regular lox, but cured with a milder brine. The fish is then cold smoked. The name dates from a time when much of the salmon in New York came from Nova Scotia"}, {"url": "http://www.wisegeek.org/what-is-lox.htm", "passage_text": "Lox is a thin filet of cured, cold smoked salmon. Sliced apples are often served with lox. Lox canapes canapés with creme, crème fraiche fraîche. Caviar and dill red onions are often used to garnish bagels with lox. and cream cheese Lox is a thin filet of cured, cold smoked salmon. Sliced apples are often served with lox. Lox canapes canapés with creme, crème fraiche fraîche. Caviar and dill red onions are often used to garnish bagels with lox. And cream cheese a lox bagel can be made at home, using, an onion garlic or. other savory bagel"}, {"url": "http://www.jewishfoods.org/lox.html", "passage_text": "It is often served with cream cheese and / or on bagels. Types of lox. Regular: Brined in a solution of water, salt, sometimes sugars and spices (the brine). This is called wet brining. Then the fish may be cold smoked. Nova or Nova Scotia lox: Similar to regular lox, but cured with a milder brine. The fish is then cold smoked. The name dates from a time when much of the salmon in New York came from Nova Scotia."}, {"url": "http://www.wisegeek.org/what-is-lox.htm", "passage_text": "Although lox is cured and smoked, it is not cooked. Therefore, the fish remains smooth and pink. It does not resemble fillets of cooked salmon. In the United States, lox is served in very thin slices and is enjoyed primarily as a breakfast food. One of the most common ways that Americans enjoy this fish is with bagels. Lox is a thin filet of cured, cold smoked salmon. Sliced apples are often served with lox. Lox canapes canapés with creme, crème fraiche fraîche. Caviar and dill red onions are often used to garnish bagels with lox. And cream cheese a lox bagel can be made at home, using, an onion garlic or. other savory bagel"}]