[{"url": "http://www.webmd.com/dvt/tc/deep-vein-thrombosis-topic-overview", "passage_text": "Deep vein thrombosis (DVT) is a blood clot (thrombus) in a deep vein, usually in the legs. Clots can form in superficial veins and in deep veins. Blood clots with inflammation in superficial veins (called superficial thrombophlebitis or phlebitis) rarely cause serious problems. Blood clots most often form in the calf and thigh veins, and less often in the arm veins or pelvic veins. This topic focuses on blood clots in the deep veins of the legs, but diagnosis and treatment of DVT in other parts of the body are similar."}, {"url": "http://www.fluther.com/91569/what-does-a-blood-clot-in-the-arm-feel-like-and/", "passage_text": "With blood clots you could get swelling, pain, and warmth to the area, but not necessarily. The only sure way to know if you have a clot or not is with an ultrasound. Your symptoms sound more like they are neurological though. The numbness and tingling generally come with nerve problems. I’m concernered I have a clot in my arm. My arm is almost numb and tingling real bad from my shoulder blade through my shoulder hurting most under my upper arm and all he way Down to my hand and fingers with a hot sensations like a burning when you hit you re funny bone. I also had this feeling in my inner thigh."}, {"url": "http://www.majordiseases.com/blood-clot-in-arm-dangers-prevention-treatment/", "passage_text": "1 Blood clot in arm symptoms can be dangerous if missed. 2  Clots inside a vein or artery can block the flow of blood, and this could lead to a stroke or heart attack. 3  It blocking an artery in the lungs can cause pulmonary embolism, which can be fatal. 4  Patients who develop a cough could end up coughing blood. Major Dangers. 1 "}, {"url": "http://www.livestrong.com/article/207284-blood-clot-in-arm-symptoms/", "passage_text": "A blood clot, also known as deep vein thrombosis (DVT), occurs when blood accumulates or clots in one of the deep veins of the body. According to the Mayo Clinic, blood clots are a serious concern because they can detach themselves from the veins and travel through the bloodstream to the lungs. Redness or Warmth. Many patients notice a warm spot near the area where the blood clot has formed. It may feel like a warm sensation or the area may actually feel warm to the touch. In addition, the area may appear red and inflamed."}, {"url": "http://www.medicinenet.com/blood_clots/article.htm", "passage_text": "1 Blood clots can cause heart attack or stroke; or pain, swelling, redness and tenderness in the area of the clot. 2  The diagnosis is suggested by the history and physical examination and often confirmed with an imaging test. 3  Treatment may require surgery, anti-coagulation medications, or a combination of the two. 1 A blood clot is a mass formed by platelets and fibrin in the blood to stop bleeding. 2  There are a variety of risk factors and illness that can lead to blood clot formation. 3  Causes of blood clots may include: 4  certain heart conditions, 5  pregnancy, 6  prolonged immobility, 7  smoking, 8  certain medications, 9  surgery, and."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=bloodclot", "passage_text": "1 Legs and arms: Symptoms of blood clots in the legs and arms vary and may include pain or cramping, swelling, tenderness, warmth to the touch and bluish-or red-colored skin. 2  Clots that occur in larger veins are called deep vein thrombosis (DVT). When a blood clot forms, it can be stationary (called a thrombosis) and block blood flow or break loose (called an embolism) and travel to various parts of the body. There are two different types of clots: 1  Arterial clots are those that form in the arteries."}, {"url": "http://www.medicinenet.com/blood_clots/page2.htm", "passage_text": "Symptoms of a blood clot in the venous system can include swelling of the affected area, warmth, redness, and pain. Venous blood clots occur most commonly in the arms and legs. Symptoms of an arterial blood clot result from a lack of or decrease in oxygen delivery to the tissues supplied by the involved artery. Pain in the involved area is often the first symptom."}, {"url": "http://www.livestrong.com/article/207284-blood-clot-in-arm-symptoms/", "passage_text": "Swelling. Once the blood clot forms in a vein of the arm, it is common for patients to experience swelling in the affected part of the arm or the entire arm. This swelling stems from the inflammation of the vein that contains the blood clot. Redness or Warmth. Many patients notice a warm spot near the area where the blood clot has formed. It may feel like a warm sensation or the area may actually feel warm to the touch. In addition, the area may appear red and inflamed."}]