[{"url": "https://www.medicare.gov/sign-up-change-plans/get-parts-a-and-b/special-conditions/special-conditions.html", "passage_text": "You may want to delay Part B if you or your spouse still work and have employer or union group health plan coverage. If you drop Part B, you can sign up for it again in the future during a Special Enrollment Period."}, {"url": "http://www.medicarerights.org/PartB-Enrollment-Toolkit/Part-1-QA-General.pdf", "passage_text": "You can do this online, over the phone or in person at your local Social Security office. Call 800-772-1213 to sign up for Parts A and B of Medicare or to find the location of your local Social Security office. If you want Medicare Part D prescription drug coverage, you must actively enroll in it yourself."}, {"url": "http://www.ehealthmedicare.com/about-medicare/enrollment/", "passage_text": "How to enroll in Medicare. You can enroll in Medicare Part A and/or Medicare Part B in the following ways: 1  Online at www.SocialSecurity.gov. 2  By calling Social Security at 1-800-772-1213 (TTY users 1-800-0778), Monday through Friday, from 7AM to 7PM. 3  In-person at your local Social Security office."}, {"url": "http://www.ehealthmedicare.com/about-medicare/enrollment/", "passage_text": "If you're already collecting Railroad Retirement Board or Social Security retirement benefits when you turn 65, you will automatically be enrolled Medicare Part A (hospital insurance) and Medicare Part B (medical insurance) if you sign up for Medicare Part B at the time you sign up for retirement benefits."}, {"url": "http://www.ssa.gov/medicare/", "passage_text": "If you already have Medicare Part A and wish to sign up for Medicare Part B, please complete form CMS 40-B, Application for Enrollment in Medicare-Part B (Medical Insurance) , and take or mail it to your local Social Security office. Anyone who has Medicare can get Medicare prescription drug coverage."}, {"url": "http://socialsecurityhop.com/en/pubs/medicare-booklet/05-signing-up-for-medicare", "passage_text": "You can sign up for Medicare even if you do not plan to retire at age 65. Once you are enrolled in Medicare, you will receive a red, white and blue Medicare card showing whether you have Part A, Part B or both. Keep your card in a safe place so you will have it when. you need it."}, {"url": "https://www.medicare.gov/sign-up-change-plans/get-parts-a-and-b/special-conditions/special-conditions.html", "passage_text": "Yes, you can enroll in Medicare. But if you've worked less than 10 years in Medicare-covered employment, you'll have to pay a monthly premium for Part A. If you choose Part B, you’ll also have to pay the Part B premium. Enroll in Part A and Part B or find out how much your Part A premium will be."}]