[{"url": "https://en.wikipedia.org/wiki/Monism", "passage_text": "Substance monism is the philosophical view that a variety of existing things can be explained in terms of a single reality or substance. Another definition states that all existing things go back to a source that is distinct from them (e.g. in Neoplatonism everything is derived from The One). 1 Partial monism, within a given realm of being (however many there may be) there is only one substance. 2  Existence monism, the view that there is only one concrete object token (The One, τὸ ἕν or the Monad)."}, {"url": "https://en.wikipedia.org/wiki/Monism", "passage_text": "Another distinction is the difference between substance and existence monism, or stuff monism and thing monism. Substance monism posits that only one kind of stuff (e.g. matter or mind) exists, although many things may be made out of this stuff. Existence monism posits that, strictly speaking, there exists only a single thing (e.g. the universe), which can only be artificially and arbitrarily divided into many things. 1 Partial monism, within a given realm of being (however many there may be) there is only one substance. 2  Existence monism, the view that there is only one concrete object token (The One, τὸ ἕν or the Monad)."}, {"url": "http://mb-soft.com/believe/txn/monism.htm", "passage_text": "Metaphysical monism allows that only one being or type of being exists. A substantial metaphysical monism asserts that the variety in our phenomenal experience is due to the different states of a single all-encompassing substance, for example, Parmenides' Plenum or Baruch Spinoza's God or Nature. Epistemological monism identifies that which is immediately present to the knowing mind with the real object known. Either the content of the mind is equated with the object known (epistemological realism), or the object known is equated with the knowing mind (epistemological idealism)."}, {"url": "http://mb-soft.com/believe/txn/monism.htm", "passage_text": "Substantival monism (one thing) is the view that there is only one substance and that all diversity is ultimately unreal. This view was maintained by Spinoza, who claimed that there is only one substance, or independently existing thing, and that both God and the universe are aspects of this substance. Epistemological monism identifies that which is immediately present to the knowing mind with the real object known. Either the content of the mind is equated with the object known (epistemological realism), or the object known is equated with the knowing mind (epistemological idealism)."}, {"url": "http://www.merriam-webster.com/dictionary/monism", "passage_text": "Definition of MONISM. 1. a: a view that there is only one kind of ultimate substance b: the view that reality is one unitary organic whole with no independent parts. 2. : monogenesis. 3. : a viewpoint or theory that reduces all phenomena to one principle. — mo·nist \\ˈmō-nist, ˈmae-\\ ˈmä. — noun·mo·nis \\tic-mō-ˈnis, tik-\\ mae. mä adjective Definition of MONISM. 1. a: a view that there is only one kind of ultimate substance b: the view that reality is one unitary organic whole with no independent parts. 2. : monogenesis. 3. : a viewpoint or theory that reduces all phenomena to one principle. — mo·nist \\ˈmō-nist, ˈmae-\\ ˈmä. noun"}, {"url": "http://www.newadvent.org/cathen/10483a.htm", "passage_text": "Monism is a philosophical term which, in its various meanings, is opposed to Dualism or Pluralism. Wherever pluralistic philosophy distinguishes a multiplicity of things, Monism denies that the manifoldness is real, and holds that the apparently many are phases, or phenomena, of a one. The term Monism is not much used in theology because of the confusion to which its use would lead. Polytheism, the doctrine that there are many gods, has for its opposite Monotheism, the doctrine that there is but one God."}, {"url": "http://www.philosophybasics.com/branch_monism.html", "passage_text": "Back to Top. Monism is the metaphysical and theological view that all is one, that there are no fundamental divisions, and that a unified set of laws underlie all of nature. The universe, at the deepest level of analysis, is then one thing or composed of one fundamental kind of stuff"}, {"url": "https://en.wikipedia.org/wiki/Metaphysical", "passage_text": "For other uses, see Metaphysics (disambiguation) . Metaphysics is a traditional branch of philosophy concerned with explaining the fundamental nature of being and the world that encompasses it, although the term is not easily defined. Traditionally, metaphysics attempts to answer two basic questions in the broadest possible terms: "}, {"url": "http://www.newadvent.org/cathen/10483a.htm", "passage_text": "In metaphysics. The ancient Hindu philosophers stated as a fundamental truth that the world of our sense-experience is all illusion (maya), that change, plurality, and causation are not real, that there is but one reality, God. This is metaphysical Monism of the idealistic-spiritual type, tending towards mysticism. The term Monism is not much used in theology because of the confusion to which its use would lead. Polytheism, the doctrine that there are many gods, has for its opposite Monotheism, the doctrine that there is but one God."}]