[{"url": "http://www.brainz.org/what-melanin/", "passage_text": "Melanin is the body’s own natural pigment. It is a substance that is responsible for giving the skin and hair its color. Melanin is also responsible for the colors that we see in the iris of the eye – and in animals, the feathers and scales. In the skin, melanin is produced by cells called melanocytes. There are certain conditions in the body that involve melanin. For example, albinism is a condition where the body lacks melanin. In albinism, the normal amounts of pigment in the body are not there. It is not only humans that suffer from albinism."}, {"url": "https://en.wikipedia.org/wiki/Melanin", "passage_text": "Melanin /ˈmɛlənɪn/ (Greek: μέλας - melas, black, dark) is a broad term for a group of natural pigments found in most organisms (arachnids are one of the few groups in which it has not been detected). The most common type of melanin is eumelanin. There are two types of eumelanin—brown eumelanin and black eumelanin. Pheomelanin is a cysteine-containing red polymer of benzothiazine units largely responsible for red hair, among other pigmentation."}, {"url": "http://study.com/academy/lesson/what-is-melanin-definition-production-function.html", "passage_text": "Melanin is a pigment that is produced by cells known as melanocytes in the skin of most animals. It comes in two basic forms: eumelanin (brownish color) and pheomelanin (reddish-brown color). The production of melanin is affected by UV exposure, genetic make-up, size of melanocytes, and disease conditions. Melanin is a pigment produced in the skin of almost all animals on earth. Its role in animal survival is critical, and varies depending on the organism. This article addresses melanin function and expression in humans and other organisms, and its role in survival."}, {"url": "http://www.news-medical.net/health/What-is-Melanin.aspx", "passage_text": "Types of melanin. Some of the different types of melanin include eumelanin, pheomelanin and neuromelanin. Eumelanin is found in the hair, skin and dark areas around the nipples. It is particularly abundant among black populations and provides black and brown pigment to the hair, skin and eyes. Melanin is found in several areas of the human body including: 1  Skin where it provides skin color. 2  Hair. 3  Pupils or irises of the eyes. 4  Stria vascularis of the inner ear. 5  Areas of the brain, the substantia nigra and locus coeruleus."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4340", "passage_text": "Melanin: The pigment that gives human skin, hair, and eyes their color. Dark-skinned people have more melanin in their skin than light-skinned people have. Melanin is produced by cells called melanocytes. It provides some protection again skin damage from the sun, and the melanocytes increase their production of melanin in response to sun exposure. Freckles, which occur in people of all races, are small, concentrated areas of increased melanin production."}, {"url": "http://study.com/academy/lesson/what-is-melanin-definition-production-function.html", "passage_text": "Production and Function. Melanin is a pigment that is produced by cells known as melanocytes in the skin of most animals, including humans. This pigment comes in different shades, depending on the genetic makeup of the individual. Melanin comes in two basic forms and can range from yellowish-red to dark brown. Melanin is a pigment produced in the skin of almost all animals on earth. Its role in animal survival is critical, and varies depending on the organism. This article addresses melanin function and expression in humans and other organisms, and its role in survival."}, {"url": "http://www.wisegeek.org/what-is-melanin.htm", "passage_text": "Also called pigment, melanin is a substance that gives the skin and hair its natural color. It also gives color to the iris of the eye, feathers, and scales. In humans, those with darker skin have higher amounts of melanin. By contrast, those with less pigment have lighter or more fair skin coloring. Melanin, sometimes referred to as a chemical, is formed as part of the process of metabolizing an amino acid called tyrosine. In the skin, melanin is formed by cells called melanocytes. Certain medical conditions, such as albinism, are associated with the lack of melanin. Albinism is a condition marked by the absence of a normal amount of pigment in the body. Animals, humans, and even plants can have albinism"}, {"url": "http://www.brainz.org/what-melanin/", "passage_text": "Melanin is formed through the process of metabolization of tyrosine, which is an amino acid. In the skin, melanin is produced by cells called melanocytes. There are certain conditions in the body that involve melanin. For example, albinism is a condition where the body lacks melanin. In albinism, the normal amounts of pigment in the body are not there. It is not only humans that suffer from albinism."}]