[{"url": "http://samson.kean.edu/~breid/enzyme/enzyme.html", "passage_text": "1 Amylase from our salivary glands and pancreas digests starch to maltose in our mouth and small intestine. 2  Lipase from the pancreas digests lipids to fatty acids and glycerol in our small intestine. 3  Pepsin is a protease that begins digestion of proteins, breaking them into peptides and amino acids."}, {"url": "http://healthyeating.sfgate.com/enzymes-used-break-down-carbohydrates-2211.html", "passage_text": "Salivary Amylase. Chewing breaks food into small molecules that combine with saliva secreted by the salivary glands in the mouth. Along with mucin and buffers, saliva contains the enzyme salivary amylase, which acts on the starch in food and breaks it down to maltose."}, {"url": "http://samson.kean.edu/~breid/enzyme/enzyme.html", "passage_text": "Amylase is an enzyme which catalyzes the hydrolysis of the polysaccharide starch to the disaccharide maltose. Salivary amylase is produced by the salivary glands and pancreatic amylase is produced by the pancreas. If amylase is added to a solution of starch, the starch will be digested to form maltose."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080309081150AAwnuxW", "passage_text": "starch is broken into simpler molecules by enzymes in the saliva, in juice produced by the pancreas, and in the lining of the small intestine. Starch is digested in two steps. First, an enzyme in the saliva and pancreatic juice breaks the starch into molecules called maltose. Then an enzyme in the lining of the small intestine splits the maltose into glucose molecules that can be absorbed into the blood."}, {"url": "http://digestivehealthguide.com/enzyme-to-digest-starch/", "passage_text": "Fact is, enzymes are essential for our digestion as they help break down food into smaller particles for our bodies to absorb. There are three major enzyme strains and the enzyme that digests starch is called amylase. The others are lipase, the fat digesting enzyme and protease which breaks down proteins into a amino acids. Starch is a carbohydrate that comes from plants such as vegetables and grains. Starch cannot be absorbed by the body in its original form as it has to be broken down into simple sugars such as glucose."}]