[{"url": "http://www.merriam-webster.com/dictionary/executive%20officer", "passage_text": "Definition of EXECUTIVE OFFICER. : the officer second in command of a military or naval organization or vessel. ADVERTISEMENT."}, {"url": "http://www.fdic.gov/regulations/laws/rules/7500-1500.html", "passage_text": "The board of directors of member banks should receive reports from any executive officer who is indebted to foreign banks in excess of the amounts specified in section 22(g) of the Federal Reserve Act. The term bank as used in section 22(g)(6) includes foreign banks. STAFF OP. of Dec. 10, 1979. Section 22(g) of the Federal Reserve Act does not apply to officers or trustees who are not beneficiaries, because fiduciary standards of state laws satisfy the legislative intent of Regulation O. However, whenever officers or trustees are beneficiaries, section 22(g) is applicable and prohibits the loan."}, {"url": "https://en.wikipedia.org/wiki/Chief_executive_officer", "passage_text": "A chief executive officer (CEO in American English) or managing director (MD in British English) describes the position of the most senior corporate officer, executive, or administrator in charge of managing a non-profit or for-profit organization. The CEO of a corporation or company typically reports to the board of directors and is charged with maximizing the value of the entity. Titles also often given to the holder of the CEO position include president and chief executive (CE)."}, {"url": "https://en.wikipedia.org/wiki/Executive_officer", "passage_text": "There are executive officer slots in each company, battalion, and brigade, though generally not at higher levels of command until the army level of command. The XO is typically the second-in-command, and serves as the day-to-day manager of the command staff. An executive officer (often abbreviated XO) is generally a person responsible for running an organization, although the exact nature of the role varies depending on the organization. Contents."}, {"url": "http://www.fdic.gov/regulations/laws/rules/7500-1500.html", "passage_text": "Titles VIII and IX authorize the federal banking agencies to issue regulations to require the reporting and public disclosure of information concerning extensions of credit by a bank or by a bank's correspondent banks to the executive officers and principal shareholders of the bank. Section 22(g) of the Federal Reserve Act does not apply to officers or trustees who are not beneficiaries, because fiduciary standards of state laws satisfy the legislative intent of Regulation O. However, whenever officers or trustees are beneficiaries, section 22(g) is applicable and prohibits the loan."}, {"url": "http://www.federalreserve.gov/bankinforeg/regocg.htm", "passage_text": "Requires an executive officer or director of a member bank, if the bank's shares are not publicly traded, to report annually to the board of directors of the bank the outstanding amount of any credit that has been extended to the executive officer or director and was secured by shares of the member bank. Such loans, in the aggregate, must not exceed 2.5 percent of the bank's unimpaired capital and unimpaired surplus or $25,000, whichever is larger; in no event may the total exceed $100,000. Such extensions of credit must be promptly reported to the member bank's board of directors."}, {"url": "http://www.federalreserve.gov/bankinforeg/regocg.htm", "passage_text": "Section 215.5 Additional restrictions on loans to executive officers of member banks. Sets a limit on loans to an executive officer of a member bank, unless the loan is for a stipulated purpose or is secured in a stipulated manner. Such loans, in the aggregate, must not exceed 2.5 percent of the bank's unimpaired capital and unimpaired surplus or $25,000, whichever is larger; in no event may the total exceed $100,000. Such extensions of credit must be promptly reported to the member bank's board of directors."}, {"url": "http://www.fdic.gov/regulations/laws/rules/7500-1500.html", "passage_text": "The restrictions of section 22(g) of the Federal Reserve Act do not apply to loans made by a member bank to executive officers from funds held in trust by the bank under an employee profit-sharing plan that extends the privilege of borrowing to any employee who chooses to participate in the plan. BD. Section 22(g) of the Federal Reserve Act does not apply to officers or trustees who are not beneficiaries, because fiduciary standards of state laws satisfy the legislative intent of Regulation O. However, whenever officers or trustees are beneficiaries, section 22(g) is applicable and prohibits the loan."}, {"url": "http://www.fdic.gov/regulations/laws/rules/7500-1300.html", "passage_text": "(b) Purpose and scope --(1) This part governs any extension of credit made by a member bank to an executive officer, director, or principal shareholder of the member bank, of any company of which the member bank is a subsidiary, and of any other subsidiary of that company. Any member bank, or any officer, director, employee, agent, or other person participating in the conduct of the affairs of the bank, that violates any provision of this part (other than § 215.9) is subject to civil penalties as specified in section 29 of the Federal Reserve Act (12 U.S.C. 504)."}]