[{"url": "http://www.thefreedictionary.com/hoagie", "passage_text": "1. hoagie-a large sandwich made of a long crusty roll split lengthwise and filled with meats and cheese (and tomato and onion and lettuce and condiments); different names are used in different sections of the United States."}, {"url": "https://en.wikipedia.org/wiki/Submarine_sandwich", "passage_text": "A submarine sandwich, also known as a sub, wedge, hoagie, grinder, long sandwich, or one of the many regional naming variations, is a type of sandwich that consists of a long roll of bread split widthwise into two pieces, and filled with a variety of meats, cheeses, vegetables, seasonings, and sauces."}, {"url": "http://www.wisegeek.org/what-is-a-hoagie.htm", "passage_text": "The secret to Philadelphia Hoagies and cheese steaks is the roll. If you start with one that you need to scoop out, you are using the wrong roll! Hoagie or Hogie is a shortened version of Hog Island ship yard where they were first sold by a vendor who made them at home to sell to the workers at the shipyard."}, {"url": "https://www.wawa.com/Hoagies.aspx", "passage_text": "Hoagies. Savor Wawa's hot hoagies, including Meatball and Cheesesteak. All hot hoagies are Built-to-Order ® and are available in three sizes to suit every appetite: Junior Hoagie ® (4-inch), Shorti Hoagie ® (6-inch), and Classic Hoagie ® (10-inch). Check out your store's daily Hot Hoagie Menu. Show All Varieties."}, {"url": "http://whatscookingamerica.net/History/HoagieSubmarinePoBoy.htm", "passage_text": "Hoagies are built-to-order sandwiches filled with meat and cheese, as well as lettuce, tomatoes, and onions, topped off with a dash of oregano-vinegar dressing on an Italian roll."}, {"url": "http://whatscookingamerica.net/History/HoagieSubmarinePoBoy.htm", "passage_text": "Hoagie Sandwiches Hoagies are built-to-order sandwiches filled with meat and cheese, as well as lettuce, tomatoes, and onions, topped off with a dash of oregano-vinegar dressing on an Italian roll. A true Italian Hoagie is made with Italian ham, prosciutto, salami, and provolone cheese, along with all the works."}]