[{"url": "http://www.answers.com/Q/How_much_money_does_the_average_American_spend_on_fitness", "passage_text": "ADDENDUM: this is probably way inaccurate. For the average American  to spend $100 a day, the average family of four would have to make  $146,000 per year. That is not the average salary. The mean  household income is more like $46,000 per year..."}, {"url": "http://www.fitness.gov/resource-center/facts-and-statistics/", "passage_text": "1 The national average for regular exercise is 51.6%. 2  Children now spend more than seven and a half hours a day in front of a screen (e.g., TV, videogames, computer). 3  Nationwide, 25.6% of persons with a disability reported being physically inactive during a usual week, compared to 12.8% of those without a disability."}, {"url": "http://www.fitness.gov/resource-center/facts-and-statistics/", "passage_text": "1 Less than 5% of adults participate in 30 minutes of physical activity each day; only one in three adults receive the recommended amount of physical activity each week. 2  Only 35 – 44% of adults 75 years or older are physically active, and 28-34% of adults ages 65-74 are physically active."}, {"url": "http://www.answers.com/Q/How_much_money_does_the_average_American_spend_on_fitness", "passage_text": "You  know the AVERAGE American can spend up to $96 per day. But you  would also have to consider in how much debt the Average American  accumulates per year. You would also have to figure in how much the  Average American puts in a Savings account each year."}, {"url": "http://www.answers.com/Q/How_much_money_does_the_average_American_spend_on_fitness", "passage_text": "Making the world better, one answer at a time. The average cost for a gym membership in America is $55.00. The average American spends $270 to $300 on weight loss and fitness products."}, {"url": "http://coolefitness.com/blog/how-much-money-americans-spend-for-gym-memberships/", "passage_text": "The average cost of a gym membership as of 2012 is $55. Typically, people tend to go twice a week, which comes out to eight times per month. At this rate, they are paying $6.88 for each visit to the gym. Of course, those who go three or even four times a week are getting a better deal in terms of payment for usage."}, {"url": "http://www.fitness.gov/resource-center/facts-and-statistics/", "passage_text": "1 Those who are obese have medical costs that are $1,429 more than those of normal weight on average (roughly 42% higher). 2  The annual cost of being overweight is $524 for women and $432 for men; annual costs for being obese are even higher: $4,879 for women and $2,646 for men."}]