[{"url": "http://www.youtube.com/watch?v=G-hwbGseU9I", "passage_text": "- Learn how to make delicate edible lace in minutes with Sweet Lace Express. The icing lace can be coloured, shaped and even made into delicate lace butterflies. 1  People & Blogs. https://www.cakecraftworld.co.uk/shop... - Learn how to make delicate edible lace in minutes with Sweet Lace Express. The icing lace can be coloured, shaped and even made into delicate lace butterflies. 1  People & Blogs. 2  Standard YouTube License."}, {"url": "http://cakelace.co.uk/product_info.php/cake-lace-white-original-mix-500g-p-62", "passage_text": "Add to Cart. Cake Lace is an innovate new method of adding edible lace decorations to your cake! Cake Lace is so easy to use, simply make to manufacturers instructions, spread onto the mat and place in the oven at 80°C. Bake for 12 to 15 minutes, take out of the oven and cool for five minutes, it is then ready to use. A: You certainly can! If you are using the Gold Cake Lace, you may need to use a tiny amount of edible glue to adhere this to the chocolate, however. Ingredients: Wheat, Starch, Fructose, Glucose, Thickener E440, Colouring E171, Flavour Vanilla, Preservative E202 Emulsifier E433."}, {"url": "http://cakelace.co.uk/product_info.php/cake-lace-white-original-mix-500g-p-62", "passage_text": "7. Cake Lace can be air dried (6-8 hours) or placed in a preheated oven at between 70°C - 80°C (15 to 18 minutes). 8. When the Cake Lace is ready to be released, place face down on a greaseproof paper. A: You certainly can! If you are using the Gold Cake Lace, you may need to use a tiny amount of edible glue to adhere this to the chocolate, however. Ingredients: Wheat, Starch, Fructose, Glucose, Thickener E440, Colouring E171, Flavour Vanilla, Preservative E202 Emulsifier E433."}, {"url": "http://www.cakecraftworld.co.uk/shop/8/937/", "passage_text": "Mix on high for 4-6 minutes until Cake Lace looks smooth. 7. Spread some of the Edible Cake Lace onto your chosen mat using a spreading knife. Work the mixture in all directions to ensure that there is an even coverage. Remove any excess with the spreading knife. 12. To fix the Edible Cake Lace to your cake, brush a little cooled, boiled water straight onto your sugar paste covered cake and then presses the Edible Cake Lace gently onto the cake. A small amount of Part B will be left; you can optionally add this to create a softer lace."}, {"url": "http://www.craftsy.com/blog/2013/12/how-to-store-a-cake/", "passage_text": "So be sure to wait until the cake has reached room temperature, then wrap tightly all over with plastic. Do not wrap it on top of a plate or platter — be sure the plastic is sealing in all sides of the cake. For cupcakes or loaf cakes, if they’ll fit and the seal closes, you can use a freezer-type bag with a seal. Learning how to store a cake properly is an important part of the baking and cake decorating process. Read on to learn how to store a cake at the different stages of life: just baked, decorated but uncut, and how to store cake leftovers. It will help you make the most of the cake for the maximum amount of time possible."}, {"url": "http://cakelace.co.uk/product_info.php/cake-lace-pearlised-white-pre-mixed-500g-p-115", "passage_text": "2. Spread your Cake Lace mix onto the mat, using a Cake Lace spreading knife. Work the mix in all directions to ensure there is even coverage. 3. Remove any excess with the Cake Lace spreading knife. 4. Place into your pre-heated oven for 8-10 minutes to dry your Cake Lace. 5. Remove from the oven and set aside for 5 minutes for the Cake Lace to cool. 6. Check that the Cake Lace is ready by peeling the edge of the Cake Lace from the mat. It should release easily. If it does not, the Cake Lace is not dry, so place it back in the oven for another two minutes, and test again. 7. Place the dried Cake Lace face down onto a clean surface and using the spreading knife, release it from the mat. 8. A: You certainly can! If you are using the Gold Cake Lace, you may need to use a tiny amount of edible glue to adhere this to the chocolate, however. Ingredients: Water; Anti-caking agent: E555; Humectant: E1520; Thickener: E466; Emulsifier: E433; Colourings: E171; Acidifier: E330; Preserver: E202."}, {"url": "http://www.youtube.com/watch?v=Ntr1BLHz6Dk", "passage_text": "Please try again later. Cake Lace is so easy to use, simply make to manufacturers instructions, spread onto the mat and place in the oven at 70-80°C. Bake for 10 to 15 minutes, take out of the oven and cool for five minutes, it is then ready to use. From start to finish your Cake Lace could be ready to use in less than 30 minutes. If you are interested in more cake lace goodies, please visit our website here-http://www.thecakedecoratingcompany.c.."}, {"url": "http://www.cakecraftworld.co.uk/shop/8/937/", "passage_text": "If it does not, the Cake Lace is not dry yet, so place it back in the oven for another 4 minutes, and then test again. 11. Place the dried Edible Cake Lace face down onto a clean surface and using the Cake spreading knife, release it from the mat. Edible Cake Lace can be air dried and will take between 6-8 hours. 12. To fix the Edible Cake Lace to your cake, brush a little cooled, boiled water straight onto your sugar paste covered cake and then presses the Edible Cake Lace gently onto the cake. A small amount of Part B will be left; you can optionally add this to create a softer lace."}]