[{"url": "http://www.hellawella.com/5-vitamins-help-build-muscle-strength-and-tone-body", "passage_text": "1 B2 (riboflavin) is involved in energy metabolism, glucose metabolism, the oxidation of fatty acids, with some effects on protein metabolism. 2  B2 nutrients can be found in cheese, eggs, milk, and peas. 3  B3 (niacin) is essential for energy production. 4  B3 nutrients can be found in milk, eggs, fish, legumes, and potatoes."}, {"url": "http://www.livestrong.com/article/477960-what-vitamin-is-good-for-muscle-pains/", "passage_text": "Other Vitamins and Minerals. Other nutrients can also help relieve muscle pains. A magnesium deficiency can cause muscle weakness and pain, while a lack of other B vitamins, like riboflavin, can also lead to muscle cramps and pain."}, {"url": "http://www.hellawella.com/5-vitamins-help-build-muscle-strength-and-tone-body", "passage_text": "B vitamins. An array of B vitamins are essential to muscle strength and tone: 1  B1 (thiamin) is important for protein metabolism and the formation of hemoglobin. 2  Hemoglobin carries oxygen to cells, including muscle cells, and without oxygen energy, production is compromised."}, {"url": "http://www.shape.com/healthy-eating/diet-tips/7-nutrients-help-increase-muscle-tone", "passage_text": "Calcium is one of the two most important nutrients our body needs for healthy and strong bones and muscles, Dr. Popovitz says. Every time you lift a dumbbell, your muscle contracts, and this mineral gives muscles that cue to contract—and, therefore, grow."}, {"url": "https://www.muscleandstrength.com/articles/10-commandments-muscle-building-nutrition.html", "passage_text": "Directly after a workout your muscles are broken down and crying out for nutrients. A good dose of protein is a must (40-50 grams) and carbohydrates also play an important role because they are needed for an insulin spike which will release growth hormone."}, {"url": "http://niams.nih.gov/Health_Info/Kids/healthy_muscles.asp", "passage_text": "You really don’t need a special diet to keep your muscles in good health. Eating a balanced diet will help manage your weight and provide a variety of nutrients for your muscles and overall health."}, {"url": "http://www.shape.com/healthy-eating/diet-tips/7-nutrients-help-increase-muscle-tone", "passage_text": "Vitamin E. The handful of almonds you reach for after a workout not only provides protein, healthy fats, and fiber, it's also a good source of vitamin E. This antioxidant helps cell membrane recovery from oxidative stress, such as exercise, Cuomo says. And the fast your muscles recover, the faster they'll grow."}]