[{"url": "http://www.tradingeconomics.com/brazil/population", "passage_text": "Million. Yearly. The population of Brazil represents 2.85 percent of the world´s total population which arguably means that one person in every 35 people on the planet is a resident of Brazil. This page provides-Brazil Population-actual values, historical data, forecast, chart, statistics, economic calendar and news. "}, {"url": "https://en.wikipedia.org/wiki/Demographics_of_Brazil", "passage_text": "According to the 2008 PNAD (National Household Sample Survey), conducted by the IBGE, the Brazilian Statistics bureau, there were about 189,953,000 inhabitants in 2008. As of the latest (2010) census, the Brazilian government estimates its population at 190.8 million. The population of Brazil is estimated based on various sources from 1550 to 1850. The first official census took place in 1872. From that year, every 10 years (with some exceptions) the population is counted. The South of Brazil is the region with the largest percentage of Whites. According to the 2005 census, people of European ancestry account for 79.6% of the population. In colonial times, this region had a very small"}, {"url": "http://www.statista.com/statistics/263763/total-population-of-brazil/", "passage_text": "This statistic shows the total population of Brazil from 2010 to 2014. In 2012, the total population of Brazil amounted to 199.24 million inhabitants. Population of Brazil. Despite being home to the largest number of Catholics in the world, Brazil has a surprisingly low (and decreasing) population growth rate. "}, {"url": "http://www.answers.com/Q/What_is_the_population_of_Brazil", "passage_text": "According to the CIA official figure, the population of Brazil in August 2000 (the last official census) was 169,872,855. The current estimate for July 2010 is 198,739,269. Brazil ranks fifth in population in the world. Forty-one percent of the total population of Brazil live in the states of Rio de Janeiro, Sao Paulo, and Minas Gerais. The southeastern part of the country is the most populated area. The majority of Brazilians live near coastal areas. "}, {"url": "http://worldpopulationreview.com/world-cities/rio-de-janeiro-population/", "passage_text": "Rio de Janeiro has an estimated 2014 population of 6.35 million, which ranks 2nd in Brazil. It is also the third largest metro area and agglomeration in South America, and the 6th largest city in the Americas. "}, {"url": "http://www.worldometers.info/world-population/brazil-population/", "passage_text": "1 Brazil's population is equivalent to 2.79% of the total world population. 2  Brazil ranks number 5 in the list of countries by population. 3  The population density in Brazil is 24 people per Km2. 4  85% of the population is urban (172,549,088 people in 2014). 5  The median age in Brazil is 30.7 years. 1 Brazil ranks number 5 in the list of countries by population. 2  The population density in Brazil is 24 people per Km2. 3  85% of the population is urban (172,549,088 people in 2014). 4"}, {"url": "http://worldpopulationreview.com/countries/brazil-population/", "passage_text": "The current estimate for 2015 is just over 203.6 million. Brazil has an estimated 2015 population of 203.6 million, up from the 2008 population of 190 million. Most of Brazil is sparsely populated with a population density of 24 people per square kilometer (62/square mile), which ranks 190th in the world. It had an official population of 11.3 million in 2011 and, as well as being Brazil’s largest city, it is the largest city in the Southern Hemisphere and the world’s seventh largest city. Rio de Janeiro, perhaps the most famous city in Brazil, is the country’s second city when it comes to population."}, {"url": "http://www.worldometers.info/world-population/brazil-population/", "passage_text": "1 The population of Brazil is estimated at 202,033,670 as of July 1 2014. 2  Brazil's population is equivalent to 2.79% of the total world population. 3  Brazil ranks number 5 in the list of countries by population. 4  The population density in Brazil is 24 people per Km2. 1 Brazil ranks number 5 in the list of countries by population. 2  The population density in Brazil is 24 people per Km2. 3  85% of the population is urban (172,549,088 people in 2014). 4  The median age in Brazil is 30.7 years."}, {"url": "https://en.wikipedia.org/wiki/Demographics_of_Brazil", "passage_text": "The population of Northeast Brazil is a result of an intensive race mixing, which has occurred in the region for more than four centuries. According to the 2006 census people reported as brown make up 62.5% of the population. Those reported as Black account for 7.8%. The South of Brazil is the region with the largest percentage of Whites. According to the 2005 census, people of European ancestry account for 79.6% of the population. In colonial times, this region had a very small"}, {"url": "http://worldpopulationreview.com/countries/brazil-population/", "passage_text": "The largest city in Brazil is Sao Paulo. It had an official population of 11.3 million in 2011 and, as well as being Brazil’s largest city, it is the largest city in the Southern Hemisphere and the world’s seventh largest city. Rio de Janeiro, perhaps the most famous city in Brazil, is the country’s second city when it comes to population. Slightly over half the size of Sao Paulo, it has a population of 6,355,949. Between 1793 and 1960, Rio was the capital city of Brazil. Salvador, Brazil’s first capital city, is currently the third largest city in Brazil, with 2,693,605 inhabitants"}]