[{"url": "http://www.thegardenhelper.com/nandina.html", "passage_text": "Heavenly Bamboo Plants are completely unrelated to Bamboo. Their common name comes only from it's resemblance to bamboo due to the fine lacy foliage, and the cane-like growth pattern of the plant. Multiple plantings of Nandina can be used as a screen or hedge."}, {"url": "http://homeguides.sfgate.com/different-types-nandina-shrubs-42890.html", "passage_text": "Nandina is an evergreen shrub with stalks and leaves that resemble bamboo canes, which is why it is also called heavenly bamboo. The plants grow in U.S. Department of Agriculture plant hardiness zones 6 through 10, are drought-tolerant and their slow growth makes them easy to care for."}, {"url": "http://www.brighterblooms.com/category/nandina/", "passage_text": "Nandinas are the perfect landscape plant for beginners or experienced gardeners. Heavenly Bamboo Nandina – A virtual rainbow of red-tinted colors in one sun-loving shrub that is semi-evergreen. Fire Power Nandina – This is a compact shrub of contrasts."}, {"url": "http://www.brighterblooms.com/category/nandina/", "passage_text": "And our Nandinas pack some color punch! Nandinas are known for their fall foliage, which can take on brilliant red colors and hold much of the color through winter, making them the perfect holiday plant in the landscape. Nandinas love sun, but can handle temperature ranges in zones 6 through 10."}, {"url": "http://www.uaex.edu/yard-garden/in-the-garden/reference-desk/shrubs/nandina.aspx", "passage_text": "The plants are indeed nandinas, only different varieties than the ones you have. What you have is a standard nandina. The small plants are dwarf nandinas. There are quite a few different varieties including 'Harbor Dwarf', 'Nana', and 'Fire Power'."}, {"url": "http://www.brighterblooms.com/category/nandina/", "passage_text": "Nandinas are a favorite hedge shrub and should be placed about 2 to 3 feet apart to allow for mature plant size. If you have a berry-producing type of Nandina, it is more likely to produce fruit if placed in a hedge or other group planting than as a single shrub in your garden."}, {"url": "http://www.clemson.edu/extension/hgic/plants/landscape/shrubs/hgic1071.html", "passage_text": "Nandina grows 6 to 10 feet high and spreads 3 to 5 feet. The plant looks like bamboo in its lightly branched, cane-like stems and delicate, fine-textured foliage. The leaves are divided into many 1- to 2- inch, pointed, oval leaflets, creating a lacy pattern."}, {"url": "http://homeguides.sfgate.com/different-types-nandina-shrubs-42890.html", "passage_text": "Dwarf Nandina. Dwarf nandina plants range from the tiny Alba, which grows to only 6 inches tall to the 4-foot-tall Woods Dwarf or Compacta.. For a 4-foot dwarf with a lovely display of reds and yellow foliage in the fall, opt for Sienna Sunrise.. Fire Power reaches only 2 feet tall."}]