[{"url": "http://oceanservice.noaa.gov/education/kits/estuaries/estuaries03_ecosystem.html", "passage_text": "Estuaries and their surrounding wetlands are also buffer zones. They stabilize shorelines and protect coastal areas, inland habitats and human communities from floods and storm surges from hurricanes. When flooding does occur, estuaries often act like huge sponges, soaking up the excess water. Ecosystem services are fundamental life-support processes upon which all organisms depend (Daily et al., 1997). Two ecosystem services that estuaries provide are water filtration and habitat protection. Habitats associated with estuaries, such as salt marshes and mangrove forests, act like enormous filters."}, {"url": "http://omp.gso.uri.edu/ompweb/doee/science/descript/whats.htm", "passage_text": "Estuaries are partially enclosed bodies of water along coastlines where fresh water and salt water meet and mix. They act as a transition zone between oceans and continents. An estuary has a free connection with the ocean. Fresh water input from land sources (usually rivers) dilutes the estuary's salt content."}, {"url": "https://en.wikipedia.org/wiki/Estuary", "passage_text": "An estuary is a partly enclosed coastal body of brackish water with one or more rivers or streams flowing into it, and with a free connection to the open sea. Estuaries form a transition zone between river environments and maritime environments. An estuary is a dynamic ecosystem with a connection with the open sea through which the sea water enters with the rhythm of the tides. The sea water entering the estuary is diluted by the fresh water flowing from rivers and streams."}, {"url": "http://omp.gso.uri.edu/ompweb/doee/science/descript/whats.htm", "passage_text": "Estuaries are important for the health of the oceans. Estuaries can filter sediment and pollutants from the water before it flows into the oceans. Excess nutrients are removed in bordering salt marshes, resulting in cleaner water for people and marine organisms. Estuaries act as a buffer between the ocean and the land. They act as a transition zone between oceans and continents. An estuary has a free connection with the ocean. Fresh water input from land sources (usually rivers) dilutes the estuary's salt content."}, {"url": "http://www.learnnc.org/lp/pages/544", "passage_text": "Estuaries are a type of environmental filter as plants and animals in estuaries filter pollutants out of the water. Particles in the water are either removed by chemical processes (aerobic respiration, sulfate reduction, methanogenesis) or by the feeding of estuarine animals and bacteria. But more typically, an estuary is defined as a partially enclosed coastal body of water, having an open connection with the ocean (for example, via a river), where freshwater from inland is mixed with saltwater from the sea."}, {"url": "http://oceanservice.noaa.gov/education/kits/estuaries/estuaries02_economy.html", "passage_text": "Estuaries are also important recreational areas. Millions of people visit estuaries each year to boat, swim, watch birds and other wildlife, and fish. Coastal recreation and tourism generate from $8-$12 billion per year in the United States alone (National Safety Councils Environmental Center, 1998). Healthy estuaries are critical for the continued survival of many species of fish and other aquatic life, birds, mammals, and reptiles. All of the animals pictured above live in the Rookery Bay National Estuarine Research Reserve."}, {"url": "http://www.learnnc.org/lp/pages/544", "passage_text": "1 North Carolina Division of Water Quality Monitors and protects the state's water resources. 2  Albemarle-Pamlico National Estuary Program The. , 3  established by the United States Environmental Protection Agency in 1987, is dedicated to identifying, restoring, and protecting the estuaries of northern North Carolina. But more typically, an estuary is defined as a partially enclosed coastal body of water, having an open connection with the ocean (for example, via a river), where freshwater from inland is mixed with saltwater from the sea."}, {"url": "http://www.chesapeakebay.net/discover/bayecosystem/estuarysystem", "passage_text": "The Estuary System. An estuary is a partially enclosed body of water where fresh water from rivers and streams mixes with salt water from the ocean. Estuaries are areas of transition between the land and the sea. They are often called bays, harbors, inlets or sounds"}]