[{"url": "http://www.wisegeek.com/what-does-a-litigation-lawyer-do.htm", "passage_text": "A commercial litigation lawyer may specialize in one area such as real estate and tenant-landlord lawsuits. Real estate litigation lawyers clearly explain legal rights and obligations to clients and point out faults in the construction of leases. A litigation lawyer may handle cases involving contract disputes. A litigation lawyer takes lawsuits to court and tries to win the cases. A senior litigation lawyer usually has four or more years of litigation experience."}, {"url": "http://www.answers.com/Q/What_is_commercial_litigation", "passage_text": "Litigation attorneys are lawyers who carry out lawsuits in the court. A lawsuit can be filed to resolve legal disputes between individuals, business entities, or non-profit or … ganizations. Litigation attorneys are also called litigators and they represent both the complainant and the defendant in the court of law. Commercial litigation is in general any type of legal controversy related to business issues. Cases that fall under the heading of Commercial Litigation include:"}, {"url": "https://www.contactlaw.co.uk/commercial-litigation-lawyers.html", "passage_text": "Commercial litigation lawyers will have expertise in all types of commercial litigation. Commercial litigation relates to any type of dispute within the business world and the dispute may be in the UK or in a foreign jurisdiction. If you have found yourself in the middle of a commercial dispute, call us and we will be able to help your business."}, {"url": "http://work.chron.com/duties-litigation-paralegal-14644.html", "passage_text": "Litigation. Litigation is the process of taking a case to court. Some lawyers do not engage in trial practice, for example, lawyers who specialize in document preparation, estates and corporate law. "}, {"url": "https://www.contactlaw.co.uk/commercial-litigation-lawyers.html", "passage_text": "For the required legal knowledge the plaintiff should take the assistance of a litigation lawyer. Commercial litigation involves the handling of disputes arising between businesses. It is in these situations that you, as the plaintiff, will require the assistance of a professional commercial litigation lawyer. Commercial litigation lawyers will deal with issues like: 1  Commercial disputes. Commercial litigation relates to any type of dispute within the business world and the dispute may be in the UK or in a foreign jurisdiction. If you have found yourself in the middle of a commercial dispute, call us and we will be able to help your business."}, {"url": "https://en.wikipedia.org/wiki/Commercial_law", "passage_text": "(December 2010). Commercial law, also known as business law, is the body of law that applies to the rights, relations, and conduct of persons and businesses engaged in commerce, merchandising, trade, and sales. It is often considered to be a branch of civil law and deals with issues of both private law and public law. Many countries have adopted civil codes that contain comprehensive statements of their commercial law. In the United States, commercial law is the province of both the United States Congress, under its power to regulate interstate commerce, and the states, under their police power."}, {"url": "http://www.wisegeek.com/what-does-a-litigation-lawyer-do.htm", "passage_text": "A litigation lawyer may specialize in personal injury lawsuits. A litigation lawyer may handle cases involving contract disputes. A litigation lawyer takes lawsuits to court and tries to win the cases. A senior litigation lawyer usually has four or more years of litigation experience."}, {"url": "http://www.wisegeek.com/what-does-a-business-litigation-lawyer-do.htm", "passage_text": "A business litigation lawyer may work for a law firm hired by a corporation, or may work as in-house counsel for the given corporation. Most often, though, such lawyers are outside counsel since the majority of businesses do not engage in litigation often enough to require an in-house litigation attorney. A business litigation lawyer represents corporations or other business entities who become involved in litigation. Litigation refers to any type of lawsuit, from a product liability lawsuit to a lawsuit by a disgruntled employee to a lawsuit by the Internal Revenue Service or tax-enforcing bod"}, {"url": "http://www.marsdens.net.au/marsdens-commercial_litigation_law", "passage_text": "Commercial Litigation Law. Disputes are a part of doing business. In order to minimise the impact, businesses need swift and accurate advice focused on all aspects of the dispute, not the least of which are outcomes. "}]