[{"url": "https://en.wikipedia.org/wiki/Clearing_account", "passage_text": "A clearing account is usually a temporary account containing costs or amounts that are to be transferred to another account. An example is the income summary account containing revenue and expense amounts to be transferred to retained earnings at the close of a fiscal period. "}, {"url": "http://docs.oracle.com/cd/A60725_05/html/comnls/us/fa/gls.htm", "passage_text": "CIP assets. See construction-in-process assets. clearing account An account used to ensure that both sides of an accounting transaction are recorded. For example, when you purchase an asset, your payables group creates a journal entry to the asset clearing account. "}, {"url": "http://community.dynamics.com/gp/f/32/t/38214", "passage_text": "There is a GL Posting routine in the financial series for fixed assets. Running this creates the journal entry to move the asset amounts out of the clearing account and in to a Fixed Asset account on the balance sheet. Purchase via POP or accounts payable, code to FA Clearing: DR FA Clearing. CR Accounts Payable. Add the asset to Fixed Assets and select correct Account and Book information. Use the GL posting routine to post the transaction to the GL."}, {"url": "http://scn.sap.com/thread/1324290", "passage_text": "Hi, Clearing account. The system uses this account to clear the net revenue (without sales. tax) which results from asset sales. The offsetting account for this clearing account is the revenue from. asset sale account that you enter during the retirement posting (debit. customer, credit revenue). The system uses this revenue/revenue clearing. posting with its zero balance to internally determine gain/loss without. sales tax. An eg. "}, {"url": "http://community.dynamics.com/gp/f/32/t/38214", "passage_text": "The usual process is: Purchase via POP or accounts payable, code to FA Clearing: DR FA Clearing. CR Accounts Payable. Add the asset to Fixed Assets and select correct Account and Book information. Use the GL posting routine to post the transaction to the GL. DR Assets Additions. CR FA Clearing. There could be a number of reasons why it won't post from FA."}, {"url": "https://support.microsoft.com/en-us/kb/865914", "passage_text": "Step 1: Set up Fixed Asset Management before you add any kind of asset information. 1  In Microsoft Dynamics GP 10.0, point to Tools on the Microsoft Dynamics GP menu, point to Setup, point to Fixed Assets, and then click the name of the window that you want to open. Before you can add any kind of asset information to Fixed Asset Management, you must enter and then complete the required setup information. Other setup information is conditionally required, depending on the needs of the company. You enter setup information in several windows in Fixed Asset Management."}, {"url": "http://community.dynamics.com/gp/f/32/t/38214", "passage_text": "I received an item through receivings transaction entry, where i Capitalized the item on the purchase order and updated the Inventory Account, using the Clearing account number. However, after adding the item to Fixed Assets, I then checked the clearing account and it still has a debit balance. Purchase via POP or accounts payable, code to FA Clearing: DR FA Clearing. CR Accounts Payable. Add the asset to Fixed Assets and select correct Account and Book information. Use the GL posting routine to post the transaction to the GL."}, {"url": "http://www.businessdictionary.com/definition/clearing-account.html", "passage_text": "Use clearing account in a sentence. Show more usage examples... It looks like my main bank account is a little low on funds this month, so I will transfer some funds from my clearing account to my main account, to make up for the loss. 4 people found this helpful. You may want to make sure that you keep a good clearing account so that you can always have a place for your money to go. 4 people found this helpful. I had all the money in a clearing account because I would be moving it to a new one pretty soon."}]