[{"url": "https://uk.answers.yahoo.com/question/index?qid=20120326021011AAKeUm9", "passage_text": "If the bearings have gone you'll have a high pressure oil leak so your oil pressure will be low (bad) and quickly you'll have pumped all your oil out on the road (very bad) and then your whole engine will be dead (you can guess how bad that it!). Tim S · 4 years ago. Thumbs up. 0. Thumbs down."}, {"url": "http://www.fd3s.net/boost_problems.html", "passage_text": "Put a hose on the tube, and run it to a standard vacuum/pressure test gauge. Drive the car, and if you see more than 2-3 lbs of backpressure, you may have a clogged cat. My numbers are estimates, I haven't tried this on a known good car yet to see what baseline pressures would be."}, {"url": "https://answers.yahoo.com/question/index?qid=20110402113523AAcKzFZ", "passage_text": "Well, I got my car diagnosed at the VW dealership. I have an 03 Turbo Passat, it has 3 different things but the newest thing that seems to be causing the engine light is a vacuum leak. They want to replace all the hoses and valves for like 1100 and that's just plain nuts. I live in Flagstaff, AZ, and I work 3..."}, {"url": "http://www.answers.com/Q/Will_driving_with_a_blown_turbo_damage_the_car", "passage_text": "Making the world better, one answer at a time. Yes you can damage the car by driving with a blown turbo. The most damage would be done to the engine because at high rpms it can begin to scrape metal on metal causing shards of the turbo to enter into the engine. Also if you accelerate at i high rate, it may begin to smoke because of the oil in the turbo. Damage may also be done to the exhaust."}, {"url": "http://www.turbotechnics.com/turbo/tips.htm", "passage_text": "1 Rubbing compressor wheel marks. 2  If you can get the owners permission to remove the air filter hose, check signs of the rotating compressor wheel making contact with or rubbing the housing. 3  This indicates excessive wear in the turbo bearings and means a turbo rebuild is imminent."}]