[{"url": "http://www.liquor.com/brands/chambord-black-raspberry-liqueur/", "passage_text": "1 Chambord’s recipe, according to the company, takes after a raspberry liqueur made in the Loire Valley in the late 1600s. 2  The liqueur is created from raspberries, blackberries, Madagascar vanilla, Moroccan citrus peel, honey, cognac and herbs and spices. Chambord Liqueur Essential Facts. 1  Chambord’s recipe, according to the company, takes after a raspberry liqueur made in the Loire Valley in the late 1600s."}, {"url": "https://en.wikipedia.org/wiki/Chambord_(liqueur)", "passage_text": "Chambord Liqueur (. [ʃɑ̃.bɔʁ]) is an infusion of red and black raspberries, Madagascar vanilla and XO cognac. The drink was first made in 1982, and was inspired by a raspberry liqueur produced for King Louis XIV during his visit to Chateau château De chambord in the 17th. century"}, {"url": "http://www.chambordchannel.com/en/chambord-raspberry-liqueur/", "passage_text": "THIS SITE REQUIRES JAVASCRIPT. Yes, this black raspberry liqueur is crafted in the province of Chambord, at the site of a real French chateau, château with the finest. Ingredients and some do say that it was inspired By King LOUIS’xiv s chosen. tipple "}, {"url": "http://cocktails.about.com/od/liqueurscordials/p/chambord_lqr.htm", "passage_text": "Chambord is a premium, all-natural black raspberry liqueur produced in the Loire Valley, south of Paris, France. It is rich, lush and sweet made with raspberries and blackberries in a Cognac and other French spirits base. Producing Chambord: The process of making Chambord is not easy; it is a finely crafted blend of infused spirits and Cognac. 1  Whole raspberries and blackberries are steeped for several weeks in French spirits. 2  The berries are strained from the infusion and soaked again in a second batch of liquor for a few more weeks."}, {"url": "https://en.wikipedia.org/wiki/Ch%C3%A2teau_de_Chambord", "passage_text": "The royal Chateau château De chambord At, Chambord-loir-Et, Cher, france is one of the most recognizable chateaux châteaux in the world because of its Very Distinctive french renaissance architecture which Blends traditional french medieval forms With classical. renaissance structures The original design of the Chateau château De chambord is, attributed though with some, doubt To domenico Da; Cortona leonardo Da vinci may also have been. involved"}, {"url": "https://en.wikipedia.org/wiki/Chambord_(liqueur)", "passage_text": "The drink was first made in 1982, and was inspired by a raspberry liqueur produced for King Louis XIV during his visit to Chateau château De chambord in the 17th. Century chambord is a.165 % abv liqueur produced in The Loire, Valley. France chambord was acquired by The-Brown Forman corporation in. 2006 [ʃɑ̃.bɔʁ]) is an infusion of red and black raspberries, Madagascar vanilla and XO cognac. The drink was first made in 1982, and was inspired by a raspberry liqueur produced for King Louis XIV during his visit to Chateau château De chambord in the 17th. century"}, {"url": "http://liqueur.underthelabel.com/l/77/Chambord-Black-Raspberry", "passage_text": "Chambord Black Raspberry is a fruit Liqueur and has an alcohol percentage of 16.5% , which is around the average for a liqueur. The palate of this liqueur is characterized by Rasberry notes. This bottle will cost you approximately $33 which is $8 less expensive than the average liqueur. Review this Liqueur. "}, {"url": "https://en.wikipedia.org/wiki/Chambord_(liqueur)", "passage_text": "Chambord is a 16.5% abv liqueur produced in the Loire Valley, France. Chambord was acquired by the Brown-Forman Corporation in 2006. [ʃɑ̃.bɔʁ]) is an infusion of red and black raspberries, Madagascar vanilla and XO cognac. The drink was first made in 1982, and was inspired by a raspberry liqueur produced for King Louis XIV during his visit to Chateau château De chambord in the 17th. century"}, {"url": "https://en.wikipedia.org/wiki/Chambord_(liqueur)", "passage_text": "The Chambord brand was founded in 1982. The drink was inspired by raspberry liqueur made in the Loire Valley in the late 1600s, said to have been introduced to Louis XIV during one of his visits to the Chateau château De. Chambord it was common during that time for liqueurs and cognac to be consumed with elegant. meals [ʃɑ̃.bɔʁ]) is an infusion of red and black raspberries, Madagascar vanilla and XO cognac. The drink was first made in 1982, and was inspired by a raspberry liqueur produced for King Louis XIV during his visit to Chateau château De chambord in the 17th. century"}]