[{"url": "http://www.mnn.com/earth-matters/wilderness-resources/stories/what-are-blood-diamonds", "passage_text": "(Photo: Swamibu /Flickr). Blood diamonds, also referred to as conflict or war diamonds, are diamonds that originate from war zones and end up being traded on the black market to fund rebel fighters and insurgencies. The practice is most often associated with conflicts in Africa. The treatment of the workers in the conflict diamond industry is frequently reported as being inhumane, with rampant disease, violence and starvation. The controversy surrounding blood diamonds was brought to light in the 1990s with civil wars in Sierra Leone, Angola, the Republic of Congo, and Liberia."}, {"url": "http://diamondfacts.org/index.php?option=com_content&view=article&id=128&Itemid=134&lang=en", "passage_text": "Conflict diamonds are diamonds illegally traded to fund conflict in war-torn areas, particularly in central and western Africa. During this time, it is estimated that conflict diamonds represented approximately 4% of the world's diamond production. Illicit rough diamonds have also been used by rebels to fund conflicts in Angola, Liberia, Ivory Coast, the Democratic Republic of Congo and the Republic of Congo (also known as Congo Brazzaville)."}, {"url": "https://en.wikipedia.org/wiki/Blood_diamond", "passage_text": "The Kimberley Process has ultimately failed to stem the flow of blood diamonds, leading key proponents such as Global Witness to abandon the scheme. In addition, there is no guarantee that diamonds with a Kimberley Process Certification are in fact conflict-free. The term is used to highlight the negative consequences of the diamond trade in certain areas, or to label an individual diamond as having come from such an area. Diamonds mined during the recent civil wars in Angola, Ivory Coast, Sierra Leone, and other nations have been given the label"}, {"url": "https://en.wikipedia.org/wiki/Blood_diamond", "passage_text": "Play media. Unsustainable diamond mining in Sierra Leone. Blood diamonds (also called conflict diamonds, converted diamonds, hot diamonds, or war diamonds) is a term used for a diamond mined in a war zone and sold to finance an insurgency, an invading army's war efforts, or a warlord 's activity. The term is used to highlight the negative consequences of the diamond trade in certain areas, or to label an individual diamond as having come from such an area. Diamonds mined during the recent civil wars in Angola, Ivory Coast, Sierra Leone, and other nations have been given the label"}, {"url": "http://financial-dictionary.thefreedictionary.com/Blood+diamonds", "passage_text": "A diamond used to finance a war or rebellion. Blood diamonds are most common in Africa, where diamonds are plentiful and where there a great deal of conflict has taken place in the late 20th and early 21st centuries. Trade in blood diamonds is illegal. In 2003, the United Nations put in place the Kimberley Process to certify diamonds as legitimate. Blood diamonds are also called conflict diamonds"}, {"url": "http://financial-dictionary.thefreedictionary.com/Blood+diamond", "passage_text": "A diamond used to finance a war or rebellion. Blood diamonds are most common in Africa, where diamonds are plentiful and where there a great deal of conflict has taken place in the late 20th and early 21st centuries. Trade in blood diamonds is illegal. In 2003, the United Nations put in place the Kimberley Process to certify diamonds as legitimate."}, {"url": "http://www.urbandictionary.com/define.php?term=blood%20diamonds", "passage_text": "Slang for conflict diamonds. Blood diamonds are used to fund the rebel groups, the National Union for the Total Independence of Angola (UNITA) and the Revolutionary United Front (RUF). These groups terrorize the peoples of Angola and Sierra Leone"}]