[{"url": "http://www.answers.com/Q/In_World_War_1_why_did_Germany_invade_neutral_Belgium", "passage_text": "It was the other way around. Germany invaded Belgium in World War I  as the first act of aggression. Germany invaded Belgium as a way to  circumvent French defenses along th … e German border (the Maginot  Line). "}, {"url": "https://answers.yahoo.com/question/index?qid=20090804190401AALKTvq", "passage_text": "Best Answer: Germany went through Belgium in oder to outflank the French armies and quickly capture Paris. The Schlieffen Plan, as it was know, called for this to take 39 days and then for France to declare defeat on day 42, thus ending the threat in the West. So, Germany invaded Belgium in 1914 in order to knock France out of the war quickly, thus avoiding a 2 front war.The major flaw in the plan was that Germany did not think invading Belgium would bring Britain into the war against them. ammianus · 6 years ago. Thumbs up. 4."}, {"url": "https://answers.yahoo.com/question/index?qid=20091116171747AARb4xe", "passage_text": "France and England declared war on Germany on September 3, 1939, two days after Germany invaded Poland. Technically, Germany was already at war with France when the German army attacked in May 1940. They invaded Holland and Belgium to keep the French and British from attacking Germany from there."}, {"url": "https://en.wikipedia.org/wiki/German_invasion_of_Belgium", "passage_text": "The German invasion of Belgium began on August 4, 1914. Earlier, on July 24, the Belgian government had announced that if war came it would uphold its neutrality. The Belgian government mobilised its armed forces on July 31 and a state of Kriegsgefahr (danger of war) was proclaimed in Germany. On August 1 the German government sent an ultimatum to Belgium, demanding passage through the country and German forces invaded Luxembourg."}, {"url": "http://history.stackexchange.com/questions/8488/why-did-germany-attack-neutral-belgium-in-the-first-world-war", "passage_text": "Neutral Belgium rejected this idea, so the Germans decided to invade through Belgium instead. France also wanted to move their troops into Belgium, but Belgium originally rejected this suggestion as well, in the hope of avoiding any war on Belgian soil. The Germans in fact made such a request. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090804190401AALKTvq", "passage_text": "Why did they Attack neutral Belgium, when it was Neutral and it Caused Britain and the British Commonwealth... I don't understand, why would you attack a neutral country causing the world superpower to declare war when you already have France and Russia to defeat.... So, Germany invaded Belgium in 1914 in order to knock France out of the war quickly, thus avoiding a 2 front war.The major flaw in the plan was that Germany did not think invading Belgium would bring Britain into the war against them. ammianus · 6 years ago. Thumbs up. 4."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070923151309AAnpDYa", "passage_text": "Best Answer: In World War I Belgium was neutral and they rejected Germany's demand to use Belgium as an invasion route into France. Britain had treaty ties guaranteeing the neutrality of Belgium. So then Britain warned Germany to call off the planned invasion by midnight of August 4, 1914 or the two countries would be at war. Germany's ruler, Kaiser Wilhelm, pretty much just laughed at Britain and they invaded Belgium anyway."}, {"url": "http://www.historycentral.com/Europe/InvadesBelgium.html", "passage_text": "Contact US. Germany Invades Belgium The German invasion plan for France called for an attack through Belgium, instead of through the heavily defended Franco-German border. Belgium was neutral and its neutrality was protected by treaty with Great Britain. The Germans attacked on August 3rd."}, {"url": "https://answers.yahoo.com/question/index?qid=20090804190401AALKTvq", "passage_text": "RE: Why did Germany invade Belgium during WW1? Why did they Attack neutral Belgium, when it was Neutral and it Caused Britain and the British Commonwealth... I don&#39;t understand, why would you attack a neutral country causing the world superpower to declare war when you already have France and Russia to defeat.... So, Germany invaded Belgium in 1914 in order to knock France out of the war quickly, thus avoiding a 2 front war.The major flaw in the plan was that Germany did not think invading Belgium would bring Britain into the war against them. ammianus · 6 years ago. Thumbs up. 4."}]