[{"url": "http://www.file-extensions.org/mfw-file-extension", "passage_text": "The MFW file extension is associated with the MSS Box for Motorola mobile phones. A *.mfw file contains firmware for Motorola phones. Help how to open MFW files: Due the variability and uncertainty of this file type group, there is no general information available, about how to open this various data file format. However most files with extension from this group are usually not meant to be opened or viewed directly."}, {"url": "http://knowyourmeme.com/memes/my-face-when", "passage_text": "Search Interest. Google search queries for “My Face When” and “mfw” both yielded a significant spike in between March and April 2010, around the same time the reaction image blog MyFaceWhen.com went live. Chanarchive – Syd. Urban Dictionary – Definition of mfw. Spread. The Urban Dictionary. “mfw” threads have since spread beyond the realm of 4chan culture and similar “reaction image” threads can be found on a number of other online communities like Tumblr, Terraria Online, Xbox360 Achievement and Bungie forums among others."}, {"url": "http://www.urbandictionary.com/define.php?term=mfw&page=2", "passage_text": "mfw. mfw, or MFW, stands for Mikey Fuckin' Way, which is a nickname for Mikey Way, the bassist for New Jersey alternative band My Chemical Romance. Term became widely known when a black t-shirt featuring 'MIKEY FUCKIN' WAY' was worn by him and was being sold on the MCR merch website"}, {"url": "http://knowyourmeme.com/memes/my-face-when", "passage_text": "About. “My Face When…” (also shortened as “ ”) is a colloquial phrase commonly used on 4chan imageboards as the opening line of reply posts and greentext stories in particular. Spread. The Urban Dictionary. “mfw” threads have since spread beyond the realm of 4chan culture and similar “reaction image” threads can be found on a number of other online communities like Tumblr, Terraria Online, Xbox360 Achievement and Bungie forums among others."}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/mfw", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. "}, {"url": "http://www.pbslearningmedia.org/resource/phy03.sci.phys.mfw.zweightlessness/what-is-quotweightlessness/", "passage_text": "This video is available in both English and Spanish audio, along with corresponding closed captions. There's no need to don a space suit if you want to experience weightlessness. In this video segment adapted from ZOOM, two members of the cast drop a cup of water with holes in it to demonstrate how free fall can create a momentary condition of weightlessness. "}, {"url": "http://www.file-extensions.org/mfw-file-extension", "passage_text": "How to convert file with extension MFW: Due the variability and uncertainty of this file type group, there is no general information available, about how to convert this various data file format. Help how to open MFW files: Due the variability and uncertainty of this file type group, there is no general information available, about how to open this various data file format. However most files with extension from this group are usually not meant to be opened or viewed directly."}, {"url": "http://www.abbreviations.com/MFW", "passage_text": "We've found a total of 24 definitions for MFW : Filter by: Select category from list... ────────── All Internet (1) London Stock Exchange (1) Management (1) NYSE Symbols (1) Media (1) Sports (1) Texting (1) Software (2) Chat (3) Physiology (1) Unclassified (10) Airport Codes (1) Sort by:PopularityAlphabeticallyCategory. "}]