[{"url": "https://en.wikipedia.org/wiki/Chemical_polarity", "passage_text": "A polar molecule has a net dipole as a result of the opposing charges (i.e. having partial positive and partial negative charges) from polar bonds arranged asymmetrically. Water (H 2 O) is an example of a polar molecule since it has a slight positive charge on one side and a slight negative charge on the other. The dipoles do not cancel out resulting in a net dipole. Due to the polar nature of the water molecule itself, polar molecules are generally able to dissolve in water. Not every molecule with polar bonds is a polar molecule. Carbon dioxide (CO 2) has two polar C-O bonds, but the geometry of CO 2 is linear so that the two bond dipole moments cancel and there is no net molecular dipole moment; the molecule is non-polar."}, {"url": "http://www.biology.arizona.edu/biochemistry/tutorials/chemistry/page3.html", "passage_text": "Water is a polar molecule, meaning that there is an uneven distribution of electron density. Water has a partial negative charge () near the oxygen atom due the unshared pairs of electrons, and partial positive charges () near the hydrogen atoms. "}, {"url": "http://preparatorychemistry.com/Bishop_molecular_polarity.htm", "passage_text": "When there are no polar bonds in a molecule, there is no permanent charge difference between one part of the molecule and another, and the molecule is nonpolar. For example, the Cl2 molecule has no polar bonds because the electron charge is identical on both atoms. It is therefore a nonpolar molecule. "}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter5/lesson1", "passage_text": "1 The unequal sharing of electrons gives the water molecule a slight negative charge near its oxygen atom and a slight positive charge near its hydrogen atoms. 2  When a neutral molecule has a positive area at one end and a negative area at the other, it is a polar molecule. 1 When a neutral molecule has a positive area at one end and a negative area at the other, it is a polar molecule. 2  Water molecules attract one another based on the attraction between the positive end of one water molecule and the negative end of another."}, {"url": "https://answers.yahoo.com/question/index?qid=20081129113136AATMjkB", "passage_text": "H2O, for example, is a polar molecule because 1) it has lone pairs 2) the oxygen is pulling the electrons from the hydrogen into its vicinity making it have a slightly negative charge while the two hydrogens have a slightly positive charge. Source(s): "}, {"url": "http://www.school-for-champions.com/chemistry/polar_molecules.htm", "passage_text": "Water is a polar molecule because of the way the atoms bind in the molecule such that there are excess electrons on the Oxygen side and a lack or excess of positive charges on the Hydrogen side of the molecule. Water is a polar molecule with positive charges. on one side and negative on the other. If this is the case, the molecule is called a polar molecule, meaning that it has electrical poles. Otherwise, it is called a non-polar molecule. Whether molecules are polar or non-polar determines if they will mix to form a solution or that they don't mix well together."}, {"url": "http://www.biology-online.org/dictionary/Polar_molecule", "passage_text": "noun, plural: polar molecules. A molecule with a net dipole as a result of the opposing charges (i.e. having partial positive and partial negative charges) from polar bonds arranged asymmetrically. Supplement. Molecules can either be polar or nonpolar depending on the arrangement of bonds producing a net dipole. Water is an example of a polar molecule since it has a slight positive charge on one side and a slight negative charge on the other. The dipoles do not cancel out resulting in a net dipole. Synonym: 1  dipole"}, {"url": "http://www.wisegeek.org/what-is-a-polar-molecule.htm", "passage_text": "These 10 facts about space will blow your mind. A polar molecule is a molecule that has a mostly positive charge on one side and a mostly negative charge on the other. This charge difference allows the positive end of the molecule to attract to the negative end of another. A hydrogen bond, a special attraction between some polar molecules, is another important characteristic. It is this bond that helps to make deoxyribonucleic acid (DNA)’s double helix possible."}, {"url": "https://answers.yahoo.com/question/index?qid=20100501112953AAKCJ3G", "passage_text": "Best Answer: A polar molecule is any molecule that has a charge--thus, it is polarized. For example, water is a polar molecule--this is because the oxygen atom is more electronegative (pulls electrons towards itself) than the two hydrogen atoms. Report Abuse. The arrangement or geometry of the atoms in some molecules is such that one end of the molecule has a positive electrical charge and the other side has a negative charge. If this is the case, the molecule is called a polar molecule, meaning that it has electrical poles."}, {"url": "http://www.wisegeek.org/what-is-a-polar-molecule.htm", "passage_text": "Polar molecules sometimes form hydrogen bonds. A polar molecule cannot bond with a non-polar molecule. Because the oxygen side is negatively charged, water is an example of a polar molecule. Bonds help make DNA's double helix structure possible. This charge difference allows the positive end of the molecule to attract to the negative end of another. A hydrogen bond, a special attraction between some polar molecules, is another important characteristic. It is this bond that helps to make deoxyribonucleic acid (DNA)’s double helix possible."}]