[{"url": "http://www.onlinellm.org/llm-master-of-law-average-salary.html", "passage_text": "Since experience goes a long way also in determining the amount of money in terms of salary that one is to get, it is surprising that holders of masters in law degrees for between five to nine years earn more than those whose experience is between ten to nineteen years. Since there are various disciplines in master o law degrees, their salary level varies in regard to the type of discipline in which one has chosen to follow."}, {"url": "http://www.usnews.com/education/best-graduate-schools/the-short-list-grad-school/articles/2014/04/01/10-law-schools-where-salaries-for-grads-most-outweigh-debt", "passage_text": "Alumni who graduated in 2012 and worked in the private sector had a median salary of $45,000 while 2013 graduates with student loans for law school carried an average debt of $150,360. The school's salary-to-debt ratio is 0.299. [Learn how law schools are changing to make students more employable .]. "}, {"url": "http://study.com/articles/Salary_Info_for_a_Business_Law_Degree_Program_Graduates.html", "passage_text": "According to the U.S. Bureau of Labor Statistics (BLS), in May 2013 the median annual salary for this career was $79,870 (www.bls.gov). In addition, the BLS reports that the lowest ten percent in this profession earned $45,200, with the highest ten percent earning more than $145,920. Graduates typically focus on the legal applications of business operations and salary will range greatly depending on the size of the corporation or firm that an international lawyer will be employed by. For example, the BLS reported that in May 2013 the average annual salary of a lawyer was roughly $131,990. In addition, the BLS reported that in the same year a graduate of a business law degree program could anticipate a salary of around $164,270 if working directly for a company or enterprise"}, {"url": "http://study.com/articles/Salary_and_Career_Info_for_a_Masters_in_Criminal_Justice.html", "passage_text": "Salary Info. The median annual wage for postsecondary teachers of criminal justice and law enforcement was $57,200 in 2014, according to the U.S. Bureau of Labor Statistics (BLS). The job outlook for all postsecondary teachers is expected to increase by 19% from 2012-2022, according to the BLS. Salary and Career Info for a Masters in Criminal Justice. Master's degree education in criminal justice typically covers criminology and law enforcement. Find out about the curricula of these programs, and learn about career options, job growth and salary info for criminal justice graduates."}, {"url": "http://www.mastersinlegalstudies.com/your-average-salary-with-masters-in-legal-studies.html", "passage_text": "Topics covered within a master of legal studies program are often similar to the topics covered by a first year J.D. candidate, and may include constitutional law, civil procedure, and contracts. While J.D. programs typically last three years, many masters in legal studies programs last just one. The number one factor that effect the salary you’ll earn after you graduate with a masters in legal studies is the position you take. Typically, if you earn this type of degree, you don’t work in a strictly law-based career, but rather in a career where the law matters, such as healthcare, real estate, or commerce."}, {"url": "http://www.mastersinlegalstudies.com/your-average-salary-with-masters-in-legal-studies.html", "passage_text": "You can also earn this type of degree if you have aspirations of working in a law-related position, but do not want to become a lawyer. For example, as a paralegal, you can expect to earn an average of $43,040 and up to around $70,000 if you work for a larger law firm and gain experience in the field. The number one factor that effect the salary you’ll earn after you graduate with a masters in legal studies is the position you take. Typically, if you earn this type of degree, you don’t work in a strictly law-based career, but rather in a career where the law matters, such as healthcare, real estate, or commerce."}, {"url": "http://www.mastersincriminology.com/what-is-your-average-salary-with-a-masters-in-criminologycriminal-justice", "passage_text": "An average salary for a masters in criminology or criminal justice would be misleading. The salary that you can make with a criminal justice degree can start out at about $24,000 a year and with experience and the most lucrative positions in this field you could end up making as much as $170,000 a year. "}, {"url": "http://www.onlinellm.org/llm-master-of-law-average-salary.html", "passage_text": "Research has revealed that those with between five to nine years experience earn between 90-100,000 dollars per annum. The older experienced ones, that is, between 10-19 years of experience, earn an LL.M (Master of Law) Average Salary of between 80-90,000 dollars per year. Interestingly, those with over twenty years experience practicing law have varying levels of LL.M (Master of Law) Average Salary based on their specialty. Since there are various disciplines in master o law degrees, their salary level varies in regard to the type of discipline in which one has chosen to follow."}]