[{"url": "http://www.livability.com/tx/college-station", "passage_text": "City of College Station, TX College Station is located in Brazos County in Texas. The median income is $31,596 and the median home value is $175,700. The population is 67% White, 6% Black, 9% Asian and 0% Native American or Native Hawaiian. 4% identify as another race or ethnicity, or two or more races."}, {"url": "http://www.zillow.com/college-station-tx/home-values/", "passage_text": "The median home value in College Station is $187,500. College Station home values have gone up 7.6% over the past year and Zillow predicts they will rise 4.5% within the next year. The median rent price in College Station is $1,495, which is higher than the College Station Metro median of $1,400. Read more. Mortgage delinquency is the first step in the foreclosure process."}, {"url": "http://www.har.com/collegestation/realestate", "passage_text": "1 The average list price for a home in College Station is $400,530. 2  The number of active real estate listings in the College Station for Rent is 100. 3  A home in the College Station has a median square footage of 2,516."}, {"url": "http://www.trulia.com/real_estate/College_Station-Texas/market-trends/", "passage_text": "The average listing price for College Station homes for sale on Trulia was $311,195 for the week ending Sep 30, which represents an increase of 1.6%, or $4,855, compared to the prior week and an increase of 0.1%, or $294, compared to the week ending Sep 09."}, {"url": "http://www.trulia.com/home_prices/Texas/College_Station-heat_map/", "passage_text": "See home prices and popularity trends in College Station, TX by neighborhood or ZIP—sort by average listing price, average sales price, median sales price, average price/sqft and search popularity. Choose between seeing the actual prices or year-over-year (y-o-y) percentage changes on the map."}, {"url": "http://www.zillow.com/college-station-tx/home-values/", "passage_text": "The median rent price in College Station is $1,495, which is higher than the College Station Metro median of $1,400."}]