[{"url": "http://www.careerexplorer.net/education-experience/education-experience-of-emt", "passage_text": "Find career training from an accredited EMT school. EMT Training. Formal training and certification is necessary to become an EMT. A high school diploma is required to get an EMT education. Specific EMT responsibilities depend on your level of training. The first level of training is EMT-Basic or EMT-1. Entry-level EMT classes will teach you emergency skills, such as managing respiratory, trauma, and cardiac emergencies. EMT-Paramedic education prepares you to take the NREMT examination and become certified as a Paramedic. Extensive related coursework and clinical and field experience will be required. Refresher courses and continuing education are available for EMTs and paramedics at all levels."}, {"url": "http://learn.org/articles/What_Education_Do_I_Need_to_Be_a_Paramedic.html", "passage_text": "EMT-Basic. With a high school diploma in hand, you can begin the education required to become an EMT-Basic as long as you are 18 years of age or older. You may find an accredited program at your local community college or hospital. You may not need an EMT-Intermediate license to enroll in a paramedic program, but you must have an EMT-Basic license. You must also meet anatomy and physiology course requirements, either as prerequisites or as part of the paramedic program."}, {"url": "http://study.com/articles/Emergency_Medical_Technician_Educational_Requirements.html", "passage_text": "Learn about the education and preparation needed to become an EMT (emergency medical technician). Get a quick view of the requirements as well as details about training, job duties and certification to find out if this is the career for you. View 10 Popular Schools ». "}, {"url": "http://www.ems1.com/careers/articles/1058465-What-are-the-requirements-to-be-a-paramedic/", "passage_text": "The first of the training requirements to be a paramedic is to get certified as an EMT-B, which is the first and most basic level of EMT training. The EMT-B training is available through many community colleges and other institutions. It usually takes about six months to complete the 120 to 150 hours of training. After that, you take a state certification test. As an EMT, you can be employed providing emergency treatment in ambulances and many other venues. Paramedic education. The educational requirements to be a paramedic are rigorous. Many community colleges have two-year degree programs in paramedic training. Oftentimes there’s a pre-requisite of college-level biology, math and English in order to be accepted in a paramedic program."}, {"url": "http://www.ems1.com/careers/articles/1058465-What-are-the-requirements-to-be-a-paramedic/", "passage_text": "Some paramedic programs require you to have worked as an EMT for six months or so before gaining entrance. Paramedic education. The educational requirements to be a paramedic are rigorous. Many community colleges have two-year degree programs in paramedic training. Oftentimes there’s a pre-requisite of college-level biology, math and English in order to be accepted in a paramedic program."}, {"url": "http://www.answers.com/Q/What_education_and_training_is_needed_to_become_an_EMT", "passage_text": "In order to become an EMT-Basic, or EMT-B you need a high school diploma or equivalent (although it is possible to begin the certification process while still in school). In t … he United States, certification requires at least 110 hours of classroom time. Workers must complete a formal training and certification process. Education and training. A high school diploma is usually required to enter a formal emergency medical technician training program. Training is offered at progressive levels: EMT-Basic, EMT-Intermediate, and EMT-Paramedic."}, {"url": "http://www.peelregion.ca/paramedics/becoming/1-2-2-becom-education.htm", "passage_text": "Education and Training. To become a paramedic in the province of Ontario, you must be a high school graduate and attend a recognized paramedic program at an Ontario college. Generally colleges require the following prerequisites to become enrolled: 1  Senior high school biology. 2  Senior high school science. "}, {"url": "http://www.answers.com/Q/What_education_and_training_is_needed_to_become_an_EMT", "passage_text": "Generally, a high school diploma is required to enter a training program to become an EMT or paramedic. Workers must complete a formal training and certification process. Education and training. A high school diploma is usually required to enter a formal emergency medical technician training program. Training is offered at progressive levels: EMT-Basic, EMT-Intermediate, and EMT-Paramedic."}, {"url": "http://study.com/emt_requirements.html", "passage_text": "EMT-Basic is the minimum level of certification for a career in emergency medical services. Training courses typically include 100 hours of training in urgent situations, such as cardiac and respiratory emergencies, childbirth and major disasters. EMT-Paramedic Training. The highest level of emergency service training is EMT-Paramedic. Paramedic-level training programs can take up to two years to complete and lead to certificates or associate's degrees in"}, {"url": "http://firelink.monster.com/training/articles/1476-becoming-an-emt-training", "passage_text": "Generally, a high school diploma is required to enter a training program to become an EMT or paramedic. Workers must complete a formal training and certification process. A high school diploma is usually required to enter a formal emergency medical technician training program. Training is offered at progressive levels: EMT-Basic, EMT-Intermediate, and Paramedic."}]