[{"url": "https://en.wikipedia.org/wiki/Palermo", "passage_text": "The city is noted for its history, culture, architecture and gastronomy, playing an important role throughout much of its existence; it is over 2,700 years old. Palermo is located in the northwest of the island of Sicily, right by the Gulf of Palermo in the Tyrrhenian Sea. The city was founded in 734 BC by the Phoenicians as Ziz ('flower'). Palermo International Airport, also known as Falcone-Borsellino Airport or Punta Raisi Airport, is dedicated to Giovanni Falcone and Paolo Borsellino, two anti-mafia judges killed by the mafia in the early 1990s, is located 32 km (20 mi) west of Palermo (Punta Raisi)."}, {"url": "http://palermo.com/getting-to-palermo/palermo-airport/", "passage_text": "Palermo airports have a long history in Sicily. The first airport was built here in the 1920’s, and with the opening of the Palermo airport Sicily was well and truly linked to the mainland. Palermo’s Boccadifalco airport was located in the outskirts of town in those days, and was one of Italy’s first airfields. However, Boccadifalco was unable to keep up with Palermo’s swift pace of growth and development."}, {"url": "https://www.linkedin.com/company/palermos-pizza", "passage_text": "It's free! Palermo’s Pizza located in the beautiful Menomonee Valley in the city of Milwaukee, WI is an entrepreneurial and innovative pizza manufacturer that celebrates Italian Culture. What began as a small ethnic bakery featuring authentic Italian pizza, has become a renowned name in the frozen pizza industry."}, {"url": "http://www.palermospizza.com/about-us/pizzeria-store", "passage_text": "Villa Palermo is located on the right about 1 mile down the road. From Madison, take I-94 east and exit at Miller Park Way (Exit 308B). Stay in the far right lane and turn right onto Canal Street. Villa Palermo is located on the right about 1 mile down the road. "}, {"url": "http://www.lifeinitaly.com/tourism/sicily/palermo", "passage_text": "Located on the Gulf of Palermo (north-west coast of Sicily), in the Conca d'Oro, Palermo is well known for its fertile lands planted with citrus groves. Fountain in Palermo's Piazza della Vergogna, called so because of the ... nakedness of the fountain's statues. View of Palermo. Palermo is the capital of Sicily in Italy and one of the biggest cities in the country. Palermo is unique in its own right; its raw pulsating energy cannot be matched by many cities in Italy."}, {"url": "http://wikitravel.org/en/Palermo", "passage_text": "Palermo International Airport [2] (IATA: PMO) is located some 32 km west of the city at Punta Raisi and has flights incoming from other Italian centres and major European cities on a regular basis. Half hourly shuttle buses (displaying prestia e commande) provide inexpensive transport into the city centre (€6.10). The capital of Sicily was founded by Phoenicians under the name of Ziz (= Flower, but the meaning is still uncerain) and later renamed by Greeks Panormos, which means all port."}, {"url": "https://en.wikipedia.org/wiki/Palermo", "passage_text": "1 Church of the Gesu, Palermo (Church of the Jesus): Located in the city centre, in 1564 the church was built in late-Renaissance style by the Jesuits. 2  It was built over a pre-existing convent of Basilian monks. 3  Alterations in 1591 were completed in a Sicilian Baroque. Palermo International Airport, also known as Falcone-Borsellino Airport or Punta Raisi Airport, is dedicated to Giovanni Falcone and Paolo Borsellino, two anti-mafia judges killed by the mafia in the early 1990s, is located 32 km (20 mi) west of Palermo (Punta Raisi)."}, {"url": "https://en.wikipedia.org/wiki/Palermo,_Buenos_Aires", "passage_text": "Palermo is a neighborhood, or barrio of the Argentine capital, Buenos Aires. It is located in the northeast of the city, bordering the barrios of Belgrano to the north, Almagro and Recoleta to the south, Villa Crespo and Colegiales to the west and the Rio río de La plata river to the. east Four commuter railway lines go through the neighborhood: Retiro-Jose José Leon (León Suarez), Suárez-Mitre (Line Retiro), Tigre-Mitre (Line Retiro Pilar), san Martin-Martín Line (And Retiro Villa). Rosa belgrano norte line a total of five railway Stations. are located in palermo"}]