[{"url": "https://en.wikipedia.org/wiki/Trochlear_nerve", "passage_text": "Trochlear nerve. From Wikipedia, the free encyclopedia. The trochlear nerve, also called the fourth cranial nerve or cranial nerve IV, is a motor nerve (a somatic efferent nerve) that innervates only a single muscle: the superior oblique muscle of the eye, which operates through the pulley-like trochlea. The trochlear nerve carries axons of type GSE, general somatic efferent, which innervate skeletal muscle of the superior oblique muscle. The superior oblique muscle ends in a tendon that passes through a fibrous loop, the trochlea, located anteriorly on the medial aspect of the orbit."}, {"url": "https://en.wikipedia.org/wiki/Trochlear_nerve", "passage_text": "The trochlear nerve is unique among the cranial nerves in several respects: 1  It is the smallest nerve in terms of the number of axons it contains. 2  It has the greatest intracranial length. 3  It is the only cranial nerve that exits from the dorsal (rear) aspect of the brainstem. The trochlear nerve carries axons of type GSE, general somatic efferent, which innervate skeletal muscle of the superior oblique muscle. The superior oblique muscle ends in a tendon that passes through a fibrous loop, the trochlea, located anteriorly on the medial aspect of the orbit."}, {"url": "http://teachmeanatomy.info/head/cranial-nerves/trochlear-nerve/", "passage_text": "The trochlear nerve arises from the trochlear nucleus of the brain, and emerges from the posterior aspect of the midbrain (it is the only cranial nerve to exit from the posterior midbrain). The trochlear nerve is examined in conjunction with the oculomotor and abducens nerves by testing the movements of the eye. The patient is asked to follow a point (commonly the tip of a pen) with their eyes without moving their head."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7603", "passage_text": "Trochlear nerve: The nerve that controls the superior oblique muscle of the eye, one of the muscles that move the eye (extraocular muscles). Paralysis of the trochlear nerve results in rotation of the eyeball upward and outward (and, therefore, in double vision). The trochlear nerve is the fourth cranial nerve, and it is the only cranial nerve that arises from the back of the brain stem."}, {"url": "http://www.improve.com/Trochlear-Nerve-Cranial-Nerve-IV/4231", "passage_text": "As the longest nerve, as well as the nerve with the smallest diameter, the trochlear nerve is also the only nerve to exit the brain dorsally, or from the top and posterior (back) of the brain. The term trochlear nerve comes from the Latin word trochlea, which means pulley.. It is responsible for innervating the superior oblique muscle of the eye, which acts as a sort of a pulley system. The superior oblique muscle allows the eye to move toward the midline of the body and downward simultaneously. In other words, using the superior oblique muscles will cause the eyes to become crossed.. If the trochlear nerve is harmed, a condition called trochlear nerve palsy (or fourth nerve palsy) may result. This condition causes the affected eye to rotate upwards and towards the midline when the person is looking straight ahead."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_trochlear_nerve", "passage_text": "The trochlear nerve is also known as cranial nerve IV (CN-IV). It is the only cranial nerve that emerges dorsally from the brain, which also makes it the longest pathway. It i … s the smallest nerve to service the eye. CN-IV passes through superior orbital fissure, and it provides for only a motor function."}, {"url": "http://www.healthline.com/human-body-maps/trochlear-nerve", "passage_text": "Trochlear nerve. The trochlear nerve is also known as cranial nerve IV (CN-IV) . It is the only cranial nerve that emerges dorsally from the brain (near the back), giving it the longest pathway. It is the smallest nerve to service the eye. CN-IV passes through the superior orbital fissure, and it provides motor function, or movement. Without the use of the nerve, the superior oblique eye muscle will no longer function properly. The muscle, not the trochlear nerve, is what physically moves the eyeball. Double vision, otherwise known as diplopia, results from problems with either the muscle or the nerve"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7604", "passage_text": "Nerve, trochlear: The trochlear nerve controls the superior oblique muscle of the eye, one of the extraocular muscles, the muscles that move the eye. Paralysis of the trochlear nerve results in rotation of the eyeball upward and outward (and, therefore, double vision). The trochlear nerve is the fourth cranial nerve. (The twelve cranial nerves emerge from or enter the skull as opposed to the spinal nerves which emerge from the vertebral column). The trochlear nerve is the only cranial nerve that arises from the back of the brain stem."}, {"url": "http://www.improve.com/Trochlear-Nerve-Cranial-Nerve-IV/4231", "passage_text": "Together with the abducens nerve, the sixth cranial nerve, the trochlear nerve helps the eye move in a lateral (toward the midline) direction. The trochlear nerve controls the superior oblique muscle, which is one of the six extraocular muscles that influence eye movement. If the trochlear nerve is harmed, a condition called trochlear nerve palsy (or fourth nerve palsy) may result. This condition causes the affected eye to rotate upwards and towards the midline when the person is looking straight ahead."}]