[{"url": "https://en.wikipedia.org/wiki/Gleaning", "passage_text": "In eighteenth century England, gleaning was a legal right for cottagers. In a small village the sexton would often ring a church bell at eight o'clock in the morning and again at seven in the evening to tell the gleaners when to begin and end work. This legal right effectively ended after a legal case in 1788. When people glean and distribute food, they may be bringing themselves legal risk; in the Soviet Union, the Law of Spikelets (sometimes translated law on gleaning) criminalised gleaning, under penalty of death, or 20 years of forced labour in exceptional circumstances."}, {"url": "http://www.definitions.net/definition/gleaning", "passage_text": "gleaning (Noun). The act of collecting leftover crops from farmers' fields after they have been commercially harvested or on fields where it is not economically profitable to harvest. gleaning (Noun). The catching of insects and other invertebrates by plucking them from within foliage, or sometimes from the ground. "}, {"url": "http://www.huffingtonpost.com/eve-turow/what-you-need-to-know-about-gleaning_b_7603482.html", "passage_text": "Gleaning is the process of collecting excess farm crops for distribution, but is being used to describe the more general practice of food recovery, where many kinds of food, including packaged perishable and non-perishable goods, are collected and distributed to the hungry and poor. The Society of St. Andrew, the largest gleaning group in the U.S. , harvests or gathers 30 million pounds of food each year to distribute to a network of pantries. Feeding America is another national food recovery organization to get in touch with."}, {"url": "https://en.wikipedia.org/wiki/Gleaning", "passage_text": "Gleaning (formerly 'leasing') is the act of collecting leftover crops from farmers' fields after they have been commercially harvested or on fields where it is not economically profitable to harvest. Some ancient cultures promoted gleaning as an early form of a welfare system. When people glean and distribute food, they may be bringing themselves legal risk; in the Soviet Union, the Law of Spikelets (sometimes translated law on gleaning) criminalised gleaning, under penalty of death, or 20 years of forced labour in exceptional circumstances."}, {"url": "http://legal-dictionary.thefreedictionary.com/Gleaning", "passage_text": "GLEANING. The act of gathering such grain in a field where it grew, as may, have been left by the reapers after the sheaves were gathered. 2. There is a custom in England, it is said, by which the poor are allowed to enter and glean upon another's land after harvest without being guilty of a trespass. The 1996 law encourages and protects gleaning by excluding from civil or criminal liability a person or nonprofit food organization that, in good faith, donates or distributes donated foods for food relief."}, {"url": "http://www.growforagecookferment.com/what-is-gleaning/", "passage_text": "Another type of gleaning is when a fruit tree that is on private property is dropping fruit either onto public property (such as the sidewalk or street), or directly onto your property. That is the case with this plum tree. The tree is on the neighbors property, but it is clearly dropping fruit over the fence. What is Gleaning and How to do it. by Colleen 2 Comments. You may have heard the word “gleaning” before, or maybe you haven’t. In a world where people still suffer from hunger and malnutrition, it amazes me how much food is thrown away or let go to waste each and every day."}, {"url": "http://classic.net.bible.org/dictionary.php?word=gleaning", "passage_text": "GLEANING [SMITH]. GLEANING [ISBE] GLEANING-glen'-ing (laqat, `alal): The custom of allowing the poor to follow the reapers in the field and glean the fallen spears of grain is strikingly illustrated in the story of Ruth (Ruth 2:2-23). "}, {"url": "http://www.usda.gov/documents/usda_gleaning_toolkit.pdf", "passage_text": "U nited W e s erve ToolkiT 2 I. Introduction What Is Gleaning? Gleaning is simply the act of collecting excess fresh foods from farms, gardens, farmers markets, grocers, restaurants, state/county fairs, or any other sources in order to provide it to those in need. In addition, because gleaning requires effort from and coordination between many different individuals (volunteers with community groups, gardeners and/or farmers, agencies that serve the hungry, etc.), it helps foster strong local community food systems."}, {"url": "https://en.wikipedia.org/wiki/Gleaning", "passage_text": "Gleaning in rural France has been represented in the paintings Des Glaneuses (1857) by Jean-Francois François millet And le rappel des (glaneuses) 1859 By Jules (breton), image and explored in a 2000/documentary experimental, Film The gleaners And, i By Agnes. varda When people glean and distribute food, they may be bringing themselves legal risk; in the Soviet Union, the Law of Spikelets (sometimes translated law on gleaning) criminalised gleaning, under penalty of death, or 20 years of forced labour in exceptional circumstances."}, {"url": "http://av1611.com/kjbp/kjv-dictionary/glean.html", "passage_text": "Let me now go to the field, and glean ears of. corn---Ruth 2. 2. To collect things thinly scattered; to gather what is left in small parcels or numbers, or what is found in detached parcels; as, to glean a few passages from an author. "}]