[{"url": "https://en.wikipedia.org/wiki/Scandinavian_design", "passage_text": "This is probably most completely realized in post-WWII Scandinavian design. The ideological background was the emergence of a particular Scandinavian form of social democracy in the 1950s, as well as the increased availability of new low-cost materials and methods for mass production. The concept of Scandinavian design has been the subject of many scholarly debates, exhibitions and marketing agendas during the last 50 years, but many of the democratic design ideals that were the central theme of the movement survived and are reflected in contemporary Scandinavian and international design. Contents."}, {"url": "https://en.wikipedia.org/wiki/Scandinavian_design", "passage_text": "The Lunning Prize, awarded to outstanding Scandinavian designers between 1951 and 1970, was instrumental in both making Scandinavian design a recognized commodity, and in defining the profile of Scandinavian design. Since 2006, the tradition of a pan-Nordic design award has been resumed with the Forum AID Award. The concept of Scandinavian design has been the subject of many scholarly debates, exhibitions and marketing agendas during the last 50 years, but many of the democratic design ideals that were the central theme of the movement survived and are reflected in contemporary Scandinavian and international design. Contents."}, {"url": "http://www.thingzcontemporary.com/blogs/news/16818216-what-is-contemporary-scandinavian-design", "passage_text": "Scandinavian Design emerged in the 1950’s and is still a design theme that resonates with the furniture design world. This modern decorative bowl is a great piece that falls under Scandinavian design. White with a simplistic design and use, this Lana decorative bowl from Thingz would work well in any modern home. To add an extra pop of color, you can add colored beads, fruits, or even vegetables."}, {"url": "https://medium.com/@MyBaze/the-pioneers-of-scandinavian-design-feffe35c52d", "passage_text": "Scandinavian design has been perhaps most widely recognized in furniture. Subtle, minimalist and functional forms characterized by clean lines and light colors draw inspiration from the Nordic nature and the way of life that, for centuries, revolved around the home. The Pioneers of Scandinavian Design. Simple, clean lines, light and pale color palette, minimalist, nature-inspired design, democratic, highly functional and with a high quality — these are all key attributes of what has been known since the mid-20th century as “Scandinavian design”."}, {"url": "http://www.scandinaviandesign.as/", "passage_text": "Scandinavian Design has specialized in design, production, and sales of quality sofas and wooden products. Our goal is to offer a complete furniture collection based on today’s shape and color trends, at a competitive price. The constant focus on product development allows us to create fresh and innovative collections. "}, {"url": "https://en.wikipedia.org/wiki/Scandinavian_design", "passage_text": "The term Scandinavian design emerged in the 1950s to describe design from the Scandinavian countries Denmark, Norway, Sweden and Finland. It is a design movement characterized by simplicity, minimalism and functionality. The concept of Scandinavian design has been the subject of many scholarly debates, exhibitions and marketing agendas during the last 50 years, but many of the democratic design ideals that were the central theme of the movement survived and are reflected in contemporary Scandinavian and international design. Contents."}, {"url": "http://freshome.com/2014/09/15/10-design-lessons-you-can-learn-from-scandinavian-interiors/", "passage_text": "Scandinavian design extends to the countries of Denmark, Norway, Sweden and Finland—offering a vast and eclectic taste that personifies this design movement and is characterized by simplicity, functionality and minimalism. "}, {"url": "https://medium.com/@MyBaze/the-pioneers-of-scandinavian-design-feffe35c52d", "passage_text": "These Nordic designers have laid the foundations and established criteria of what is known worldwide as “Scandinavian design”. They have produced so many design classics during the fifties, sixties and seventies of the 20th century that stand as reference points in the history of modern design. The Pioneers of Scandinavian Design. Simple, clean lines, light and pale color palette, minimalist, nature-inspired design, democratic, highly functional and with a high quality — these are all key attributes of what has been known since the mid-20th century"}, {"url": "http://www.thingzcontemporary.com/blogs/news/16818216-what-is-contemporary-scandinavian-design", "passage_text": "Many famous contemporary Scandinavian furniture designers focus their furniture on the colors white and off white. This modern decorative bowl is a great piece that falls under Scandinavian design. White with a simplistic design and use, this Lana decorative bowl from Thingz would work well in any modern home. To add an extra pop of color, you can add colored beads, fruits, or even vegetables."}, {"url": "https://medium.com/@MyBaze/the-pioneers-of-scandinavian-design-feffe35c52d", "passage_text": "In the past, Scandinavia has been defined as the three kingdoms — Denmark, Norway and Sweden — while today most includes Finland and Iceland, rarely Greenland, as parts of the region. The design movement which emerged in the 1950s known as Scandinavian design corresponds to this modern definition of the region. The very term “Scandinavian design” originates from a design exhibition that traveled the USA and Canada under that name from 1954 to 1957. The Pioneers of Scandinavian Design. Simple, clean lines, light and pale color palette, minimalist, nature-inspired design, democratic, highly functional and with a high quality — these are all key attributes of what has been known since the mid-20th century as “Scandinavian design”."}]