[{"url": "http://home.costhelper.com/programmable-thermostat.html", "passage_text": "If you are in the Baltimore Gas & Electric (BGE) service area, you can get a FREE programmable thermostat and up to $100 in bill credits for signing up for the Peak Rewards program. I get on that works with my heat pump and cut $100-200 off of my monthly bill. http://peakrewards.bgesmartenergy.com/. 1 Prices start around $25-$80 for a basic programmable thermostat that lets you set a daily temperature schedule."}, {"url": "http://www.networx.com/cost-guide/install-a-thermostat", "passage_text": "Cost to install a thermostat will normally include: 1  Materials: A manual or digital thermostat is the main expense here. 2  Labor: Thermostat installation or replacement will require the services of a professional electrician, who can install several thermostats in the course of one service call, as necessary. Cost Breakdown. Cost to install a thermostat will normally include: 1  Materials: A manual or digital thermostat is the main expense here. 2  There will also be fairly minor costs for supplies such as connectors, fittings, or mounting hardware, if necessary."}, {"url": "http://home.costhelper.com/programmable-thermostat.html", "passage_text": "1 A heating/air conditioning contractor may charge $75-$150 (depending on local rates) to remove an existing thermostat and install a programmable one, bumping the total cost to $100-$400. 1 Prices start around $25-$80 for a basic programmable thermostat that lets you set a daily temperature schedule."}, {"url": "http://www.masssave.com/en/residential/heating-and-cooling/offers/wireless%20thermostat%20and%20installation%20incentive", "passage_text": "Incentives are limited to the first 3 thermostats installed. Additional wireless enabled thermostats are available at the retail value listed. The installation cost (labor) of all thermostats purchased will be fully subsidized by your utility sponsor (a value of $125.00). "}, {"url": "http://www.networx.com/cost-guide/install-a-thermostat", "passage_text": "The cost to install a thermostat typically ranges from $210 to $310 including the thermostat, supplies, and labor. Thermostat installation means setting up a control for the temperature of a home heating and cooling system. Cost Breakdown. Cost to install a thermostat will normally include: 1  Materials: A manual or digital thermostat is the main expense here. 2  There will also be fairly minor costs for supplies such as connectors, fittings, or mounting hardware, if necessary."}, {"url": "http://www.homewyse.com/services/cost_to_install_thermostat.html", "passage_text": "$347.25. Get an INSTANT estimate of the cost to Install a Thermostat! Our free calculator uses recent, trusted data to estimate costs for your Thermostat Installation project. For a basic 1 thermostat project in zip code 47474, the benchmark cost to Install a Thermostat ranges between $237.03 - $347.25 per thermostat. To estimate costs for your project:"}, {"url": "http://www.thermostatcenter.com/how-to-install/", "passage_text": "I know a lot of you will look at the panel sitting on your wall at the moment and think that you’ll have to first spend money on a new thermostat and then budget for the additional cost so a professional can install it for you. But! For a start, the wiring is already in place on your old one so you don’t have to go looking for them. Plus, many models of thermostat on the market are pretty standard in size so the most you might have to do is make a couple of new holes to fit the new one."}, {"url": "http://home.costhelper.com/programmable-thermostat.html", "passage_text": "1 Many basic units can be installed by a do-it-yourselfer with simple wiring skills, although other folks may prefer to hire a pro. 2  A heating/air conditioning contractor may charge $75-$150 (depending on local rates) to remove an existing thermostat and install a programmable one, bumping the total cost to $100-$400. 1 Prices start around $25-$80 for a basic programmable thermostat that lets you set a daily temperature schedule."}, {"url": "http://www.networx.com/cost-guide/install-a-thermostat", "passage_text": "1 Labor: Thermostat installation or replacement will require the services of a professional electrician, who can install several thermostats in the course of one service call, as necessary. 2  Cleanup and debris removal is minimal. Cost Breakdown. Cost to install a thermostat will normally include: 1  Materials: A manual or digital thermostat is the main expense here. 2  There will also be fairly minor costs for supplies such as connectors, fittings, or mounting hardware, if necessary."}]