[{"url": "http://healthyeating.sfgate.com/5-main-food-groups-3976.html", "passage_text": "The dairy food group is mostly comprised of dairy products that are high in calcium. All types of yogurt, most cheeses and all liquid milk products are part of the dairy group, as are calcium-rich milk-based desserts such as ice cream and pudding. The five main food groups are a central component of the dietary recommendations set forth by the U.S. Department of Agriculture. Food group guidelines were introduced in 1916, more than a decade before the establishment of recommended dietary allowances, or RDA, for the daily intake of calories and essential nutrients."}, {"url": "http://healthy-kids.com.au/food-nutrition/5-food-groups/", "passage_text": "5 Food Groups. The key to healthy eating is to enjoy a variety of nutritious foods from each of the 5 food groups. The Australian Guide to Healthy Eating displays the 5 food groups on a plate, in the proportion that you should be eating them throughout your day"}, {"url": "https://en.wikipedia.org/wiki/Food_group", "passage_text": "Nutrition guides typically divide foods into food groups and recommend daily servings of each group for a healthy diet. In the United States for instance, USDA has described food as being in from 4 to 11 different groups. 1 Confections, also called sugary foods and sometimes categorized with fats and oils, is typically a very small category in nutrition guides, if present at all, and is sometimes listed apart from other food groups. 2  Examples include candy, soft drinks, and chocolate."}, {"url": "http://medical-dictionary.thefreedictionary.com/five+food+groups", "passage_text": "five food groups. Nutrition. An addition to the four food groups (vegetables and fruits, milk, meat, and cereals and breads) promulgated in 1956 by the US Department of Agriculture, the fifth group consists of fats, carbohydrate-rich foods (sweets), alcohol and other foods that do not fall into the basic four. five food groups, n.pl a rough guide to good daily nutrition, comprising the following groups: meat/nuts/legumes, breads/cereals, vegetables/fruit, dairy products, and fats."}, {"url": "http://healthyeating.sfgate.com/5-main-food-groups-3976.html", "passage_text": "The fruit food group encompasses a wide range of fresh fruits and fruit products, including dried, frozen and canned fruit, and 100 percent fruit juice. Berries and melons, which tend to be particularly nutrient-dense, are highlighted as important subgroups of the fruit group. The five main food groups are a central component of the dietary recommendations set forth by the U.S. Department of Agriculture. Food group guidelines were introduced in 1916, more than a decade before the establishment of recommended dietary allowances, or RDA, for the daily intake of calories and essential nutrients."}, {"url": "http://www.answers.com/Q/What_are_the_three_basic_food_groups_and_their_definition", "passage_text": "The three basic food groups are grow foods(body-building foods), go foods(energy-giving foods), and glow foods(body-regulating foods). Sources of grow foods are meat and mea … t products, milk and milk products, seafoods and legumes..Sources of go foods are cereals, starchy foods, root crops and sweets. the three basic food groups are Go,Glow and Grow..   GO FOOD GROUP gives our body heat and energy. Foods rich in  carbohydrates and starchy foods such as rice, corn,bread … , oatmeal,  macaroni, noodles, potatoes, camote, gabi, cassava and others."}, {"url": "https://en.wikipedia.org/wiki/Food_group", "passage_text": "Vegetables, the second largest food group in many nutrition guides, come in a wide variety of shapes, colors and sizes. A food group is a collection of foods that share similar nutritional properties or biological classifications. 1 Confections, also called sugary foods and sometimes categorized with fats and oils, is typically a very small category in nutrition guides, if present at all, and is sometimes listed apart from other food groups. 2  Examples include candy, soft drinks, and chocolate."}, {"url": "http://medical-dictionary.thefreedictionary.com/food+group", "passage_text": "food group. A general term for a category of food that shares something in common with other members of the group, which includes: • Carbohydrates (bread, cereals, rice, oats, pastas); • Citrus fruits (grapefruits, lemons, melon, oranges, papaya, strawberries, tomatoes);"}, {"url": "http://www.definitions.net/definition/food%20group", "passage_text": "Food group. A food group is a collection of foods that share similar nutritional properties or biological classifications. Nutrition guides typically divide foods into food groups and recommend daily servings of each group for a healthy diet. "}]