[{"url": "http://talk.collegeconfidential.com/princeton-university/97350-princeton-act-scores.html", "passage_text": "Princeton says they will take the ACT along with an SAT score...and apply the chart breakdown...I dont know the address...Try a google search for ACT to SAT conversion table...Generally a 32 = 1400 and a 36 = 1600 you can extrapolate from there. I don't think it could hurt you to send it along with an SAT. I would say the average ACT score is about 33-34 based on the average SAT scores and a backward application of the"}, {"url": "http://collegeapps.about.com/od/collegeprofiles/p/Princeton_prfil.htm", "passage_text": "Princeton, a member of the Ivy League, often vies with Harvard for the top spot on national rankings of top universities. Located in a town of about 30,000 people, Princeton's beautiful 500-acre campus sits about an hour away from both New York City and Philadelphia. "}, {"url": "http://www.princetonreview.com/college-advice/good-sat-score-act-score", "passage_text": "Well, it all depends on the colleges you are considering. A 23 on the ACT or a 1800 on the SAT may be above average at one university but below average at another. The higher your score, the more options are open to you. Above average SAT/ACT scores will improve your chances of getting into a more selective school. Scores below an 1100 on the SAT or a 15 on ACT are considered low at just about any four-year college. You can overcome low scores with good grades or an outstanding application"}, {"url": "http://www.prepscholar.com/sat/s/colleges/Princeton-SAT-scores-GPA", "passage_text": "Average SAT: 2250. The average SAT score composite at Princeton is a 2250. The 25th percentile SAT score is 2120, and the 75th percentile SAT score is 2390. In other words, a 2120 places you below average, while a 2390 will move you up to above average. The average GPA at Princeton is 3.9. This makes Princeton Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.9, Princeton requires you to be at the top of your class"}, {"url": "http://www.prepscholar.com/act/s/colleges/Princeton-ACT-scores-GPA", "passage_text": "Average ACT: 33. The average ACT score composite at Princeton is a 33. The 25th percentile ACT score is 31, and the 75th percentile ACT score is 35. In other words, a 31 places you below average, while a 35 will move you up to above average. There's no absolute ACT requirement at Princeton, but they really want to see at least a 31 to have a chance at being considered. This makes Princeton Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.9, Princeton requires you to be at the top of your class. You'll need nearly straight A's in all your classes to compete with other applicants."}, {"url": "http://www.prepscholar.com/act/s/colleges/Princeton-ACT-scores-GPA", "passage_text": "The average GPA at Princeton is 3.9. This makes Princeton Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.9, Princeton requires you to be at the top of your class. You'll need nearly straight A's in all your classes to compete with other applicants."}, {"url": "http://collegeapps.about.com/od/GPA-SAT-ACT-Graphs/ss/princeton-admission-gpa-sat-act.htm", "passage_text": "In the graph above, the blue and green dots representing accepted students are concentrated in the upper right corner. Most students who got into Princeton had GPAs close to a 4.0, SAT scores (CR+M+W) above 2100, and ACT composite scores above 30. Also realize that a lot of red dots are hidden beneath the blue and green in the upper right corner of the graph -- many students with a 4.0 GPA and extremely high standardized test scores get rejected from Princeton. For this reason, even strong students should consider Princeton a reach school."}]