[{"url": "https://en.wikipedia.org/wiki/Carolina_Panthers", "passage_text": "The Panthers have three main jersey colors: black, white, and blue. Their blue jerseys, designated their alternate uniforms, are the newest and were introduced in 2002. NFL regulations allow the team to use the blue jersey up to two times in any given season. The Panthers first competed in 1995. The team played its home games at Memorial Stadium, located on the campus of Clemson University in Clemson, South Carolina, during the 1995 season while awaiting the completion of their home stadium in Charlotte."}, {"url": "https://en.wikipedia.org/wiki/Carolina_Panthers", "passage_text": "The Carolina Panthers are a professional American football team based in Charlotte, North Carolina. The Panthers are part of the South division of the National Football Conference (NFC) in the National Football League (NFL). The club is owned by Jerry Richardson, who also founded it. The Panthers first competed in 1995. The team played its home games at Memorial Stadium, located on the campus of Clemson University in Clemson, South Carolina, during the 1995 season while awaiting the completion of their home stadium in Charlotte."}, {"url": "http://www.answers.com/Q/What_color_is_a_panther", "passage_text": "Although many believe black is the only color panthers come in, this is untrue. Panthers can be golden yellow like lions, brown, dark gray.... For more info, type panther f … ur color into Google. Below, I have included a link to Google in case you want to check it out. Confidence votes 10. The panther is a tan color. The tawny color is richer on the back and lighter on the belly. The adult Florida panther has amber-colored eyes and a long, black-tipped tail. The name black panther is a common name referring to a large, black cat. The only two large wild cats that can have an all-black coat are the leopard and jaguar"}, {"url": "http://www.answers.com/Q/What_color_are_panthers", "passage_text": "The panther is a tan color. The tawny color is richer on the back and lighter on the belly. The adult Florida panther has amber-colored eyes and a long, black-tipped tail. Melanistic leopards or jaguars are actually a dark chocolate color and still have their spots, which can be seen in adequate sunlight. Melanism is not known to occur in panthers or any other puma subspecies.             Pink. 7 people found this usefu"}, {"url": "http://www.panthers.com/news/article-1/panthers-true-jersey-colors/9f35b611-c771-48fb-828a-56ccaf6edf3e", "passage_text": "The Panthers will wear all three of their jerseys – black, white and blue – at least three times each during the 2009 preseason and regular season, including blue for their preseason home opener against Baltimore on Saturday. 1:00 p.m. Black. The NFL permits each team to wear its alternate jersey once in the preseason and up to two times in the regular season. Carolina owns an all-time regular-season record of 67-65 when wearing white jerseys, 36-43 when dressing in black jerseys and 6-7 when sporting the blue tops."}, {"url": "http://www.answers.com/Q/What_color_are_panthers", "passage_text": "Confidence votes 688. Although many believe black is the only color panthers come in, this is untrue. Panthers can be golden yellow like lions, brown, dark gray.... For more info, type panther fur color into Google. Below, I have included a link to Google in case you want to check it out. Melanistic leopards or jaguars are actually a dark chocolate color and still have their spots, which can be seen in adequate sunlight. Melanism is not known to occur in panthers or any other puma subspecies.             Pink. 7 people found this useful"}, {"url": "https://en.wikipedia.org/wiki/Black_panther", "passage_text": "Melanism is the result of a dominant allele and remains relatively rare in jaguars. A black panther is the melanistic color variant of any Panthera species. Black panthers in Asia and Africa are leopards (Panthera pardus) and black panthers in the Americas are black jaguars (Panthera onca). Melanism in the jaguar (Panthera onca) is conferred by a dominant allele, and in the leopard (Panthera pardus) by a recessive allele."}, {"url": "http://www.panthers.com/news/article-1/panthers-true-jersey-colors/9f35b611-c771-48fb-828a-56ccaf6edf3e", "passage_text": "Carolina wore white tops in its first two preseason games and will also wear white in the team’s preseason finale versus Pittsburgh on Sept. 3. During the regular season, the Panthers will wear white jerseys eight times, black on six occasions and blue twice. They will sport white jerseys for their first two regular-season home games before dressing in black for five of the last six. 1:00 p.m. Black. The NFL permits each team to wear its alternate jersey once in the preseason and up to two times in the regular season. Carolina owns an all-time regular-season record of 67-65 when wearing white jerseys, 36-43 when dressing in black jerseys and 6-7 when sporting the blue tops."}]