[{"url": "https://answers.yahoo.com/question/index?qid=20091211113956AAOoRDq", "passage_text": "Best Answer: The time it takes for the body to eliminate one half of a caffeine dose is normally between 3 to 12 hours. It is called the half-life of caffeine. Several factors can shorten or lengthen the half life of caffeine. Smoking, medications and diseases are some factors. "}, {"url": "http://www.dotfit.com/content-35789.html", "passage_text": "Print Version. The half-life, which is the time required by the body to metabolize or inactivate 1/2 of a substance activity, for caffeine (doses lower than 4.50mg/lb) ranges from 2.5 to 10hrs. "}, {"url": "https://www.healthtap.com/topics/length-of-time-caffeine-stays-in-body", "passage_text": "How long does it take for caffeine to be eliminated from the body? 6. Get help from a doctor now ›. 12-16 hours: Caffeine has a half-life of about 6 hours, meaning half of the caffeine will be left in your system 6 hours after ingestion, and half of whats left 6 hours later so on and so forth."}, {"url": "http://www.med-health.net/How-Long-Does-Caffeine-Last.html", "passage_text": "How Long Does Caffeine Stay in the Body? In most cases, caffeine has a half-life of about 5 hours (meaning 5 hours is needed to eliminate half the coffee amount). However, it might take longer – for instance, a pregnant woman might have caffeine in her system up to 20 hours after she ingests it. That’s because no matter how long caffeine stays in the body of the mother, it might stay even longer in the baby. The American Journal of Obstetrics and Gynecology found that when women drink 200 milligrams or more of caffeine, they double their risk of miscarriage. However, other studies dispute that."}, {"url": "http://www.answers.com/Q/How_long_does_caffeine_stay_in_your_body_after_drinking_4_cups_of_coffee_in_the_morning", "passage_text": "Confidence votes 821. There're 90-105 mg of caffeine in 8oz of coffee. The body retains up to 300mg at any time. Of course that depends on how fast you drink the coffee, and how fast you can detox it. Depending on the person, it would last in the body 4-6 hours. After someone drinks a cup of coffee or tea, it only takes about 10 to 15 minutes for them to start feeling the effects of the caffeine in their system, such as being more ale … rt and awake."}, {"url": "http://www.caffeineinformer.com/caffeine-metabolism", "passage_text": "Caffeine From the First Sip. Caffeine easy passes through body membranes so from the first sip the caffeine is entering your bloodstream through the lining of your mouth, throat, and stomach. Advertisement. It only takes 45 minutes for 99% of the caffeine to be absorbed through these membranes. In humans the half-life for caffeine is anywhere from 4 to 6 hours on average, which explains why the average energy drink or coffee’s effect lasts about 4 to 6 hours. "}, {"url": "http://www.med-health.net/How-Long-Does-Caffeine-Last.html", "passage_text": "Pregnant women need to consume less caffeine for the sake of the baby. Between 150 and 200 milligrams is considered safe in most studies, but many doctors recommend pregnant women avoid caffeine altogether. That’s because no matter how long caffeine stays in the body of the mother, it might stay even longer in the baby. The American Journal of Obstetrics and Gynecology found that when women drink 200 milligrams or more of caffeine, they double their risk of miscarriage. However, other studies dispute that."}, {"url": "http://www.livestrong.com/article/272782-how-long-does-coffee-caffeine-stay-in-your-system/", "passage_text": "Onset and Duration. It takes approximately 15 to 45 minutes for caffeine to reach its peak levels in your bloodstream. Caffeine has a half-life of approximately five to six hours, meaning that it takes this long for its concentration in your bloodstream to reduce by half. Amounts of caffeine up to 250 milligrams show very few ill effects and may help individuals feel more alert. Doses exceeding 1,000 milligrams may affect sleep and cognitive performance."}, {"url": "http://neutral-izer.blogspot.com/2007/09/how-long-does-caffeine-stay-in-your.html", "passage_text": "As long as caffeine is in your blood, it's effects will also manifest. The time it takes for the body to eliminate one half of a caffeine dose is normally between 3 to 12 hours. It is called the half-life of caffeine. Several factors can shorten or lengthen the half life of caffeine. Smoking, medications and diseases are some factors. If you regularly drink a cup of coffee or tea in the morning and another in the evening, you can expect to have caffeine in your blood every hour of the day. The effect of caffeine in your body will be active 24/7."}]