[{"url": "https://en.wikipedia.org/wiki/Sociology", "passage_text": "Sociologists' approach to culture can be divided into a sociology of culture and cultural sociology—the terms are similar, though not entirely interchangeable. The sociology of culture is an older term, and considers some topics and objects as more-or-less cultural than others. Human ecology deals with interdisciplinary study of the relationship between humans and their natural, social, and built environments. In addition to Environmental sociology, this field overlaps with architectural sociology, urban sociology, and to some extent visual sociology."}, {"url": "http://sociology.about.com/od/Dictionary/u/Key-Sociological-Terms.htm", "passage_text": "Key Sociological Terms. Some of the key terms and ideas that are fundamental to the field of sociology; a selection of terms curated from our site glossary. 1  Acculturation. 2  Agency. 3  Alienation. 4  Anomie. 5  Backstage and Frontstage. 6  Base and Superstructure. 7  Capital. 8  Capitalism"}, {"url": "https://en.wikipedia.org/wiki/Sociology", "passage_text": "Symbolic interaction; often associated with Interactionism, Phenomenological sociology, Dramaturgy, Interpretivism, is a sociological tradition that places emphasis on subjective meanings and the empirical unfolding of social processes, generally accessed through micro-analysis. Human ecology deals with interdisciplinary study of the relationship between humans and their natural, social, and built environments. In addition to Environmental sociology, this field overlaps with architectural sociology, urban sociology, and to some extent visual sociology."}, {"url": "http://www.sparknotes.com/sociology/glossary/terms.html", "passage_text": "Conflict theory-Marx’s theory that in any capitalist society there is eternal conflict between the owners of the means of production and the workers. Conflict view of deviance-The view that purports that equality in a capitalist society is an illusion. Symbolic interactionist perspective-A sociological framework that views society as a product of the everyday social interactions of individuals. Taboo-A norm so strongly held by a society that its violation brings extreme disgust."}, {"url": "http://www.sociologyguide.com/basic-concepts/", "passage_text": "Basic Concepts & Terms of Sociology. We have explained in details the various terms and concepts used in Sociology. Check out the alphatically listed terms of sociology for your reference. If there are any terms commonly used in Sociology and that have not been explained in out list of Sociology Terms, please write to us and we will add it to the list of terms of sociology for your benefit. After all it is the basic concepts of any subject that requires clarity and if your basic concepts of Sociology is not clear you are bound to remain unclear with many topics and underperform in your examination."}, {"url": "http://sociology.about.com/od/", "passage_text": "Profiles of Major Sociologists. Discover some of the major sociological works that helped define and shape the field of sociology. Here you will find major historical research studies and projects that have contributed to the way we think about social behavior. Sociology is a very broad and diverse field with many different topics and scopes. Learn more about the different areas of research and application within"}, {"url": "http://www.chegg.com/homework-help/definitions/social-sciences-sociology-s49", "passage_text": "To help you learn and understand key social sciences terms and concepts, we’ve identified some of the most important ones and provided detailed definitions for them, written and compiled by Chegg experts. In social sciences there are many key concepts and terms that are crucial for students to know and understand."}, {"url": "http://sociology.about.com/od/", "passage_text": "Major Sociological Works. Much of what we know about societies and social behavior has emerged thanks to various sociology theories. Sociology students typically spend a great deal of time studying these different theories. Some theories have fallen out of favor, while others remain widely accepted, but all have contributed tremendously to our understanding of society and social behavior. Sociology is a very broad and diverse field with many different topics and scopes. Learn more about the different areas of research and application within the field of sociology."}, {"url": "https://en.wikipedia.org/wiki/Sociology", "passage_text": "Sociology is the scientific or academic study of social behavior, including its origins, development, organization, and institutions. It is a social science that uses various methods of empirical investigation and critical analysis to develop a body of knowledge about social order, social disorder and social change. Human ecology deals with interdisciplinary study of the relationship between humans and their natural, social, and built environments. In addition to Environmental sociology, this field overlaps with architectural sociology, urban sociology, and to some extent visual sociology."}]