[{"url": "http://rhubarbinfo.com/seedpods", "passage_text": "Rhubarb plants will occasionally send up seed stalks with flowers in the middle of the plants. These stalks may not grow on young plants but are common on plants that are 3-4 years old and older. Some varieties of rhubarb are more likely to flower than others. Victoria is known to be a prolific flowering variety. photo credit. When you remove the flow stalks be sure to remove the complete stalk. These stalks don't pull off as easily as the leave stalks do, so you may need to use a knife. Cut the flower stalk off cleanly as close to the main plant as possible."}, {"url": "http://articles.mcall.com/2013-05-10/entertainment/mc-rhubarb-plants-blooms-flowers-20130510_1_trumpet-vines-rhubarb-plant-blooms", "passage_text": "—Carole Rohrbach. A: The blooms are the flowers of the rhubarb. They usually appear on mature plants and should be removed immediately if you are growing the rhubarb for eating. The flower stalk should be cut back at the base of the plant. Q: This is the second year for my rhubarb plant and it has several blooms (looks like a cauliflower) with the stalks."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/rhubarb/rhubarb-bolting.htm", "passage_text": "1 If you have an unusually warm spring, this can cause a rhubarb to start flowering. 2  Stress – Stress can also force a rhubarb to flower. 3  Stress can come in the form of a lack of water, pests, lack of nutrients or animal damage. 4  Anything that makes the plant feel threatened can cause it to start flowering. But there are some factors that can influence how often you get a flowering rhubarb. 1  Variety – Some varieties of rhubarb flower more than others. 2  Maturity – Plants need to reach a certain maturity in order to reproduce through seed. 3  Heat – Rhubarb plants grow best in cooler temperatures. 4"}, {"url": "http://rhubarbinfo.com/seedpods", "passage_text": "Contrary to popular opinion, rhubarb plants do NOT become poisonous after flowering starts. The leaf stalks can still be cut and used and the leaves themselves should be discarded (composted) as they are always poisonous. photo credit. When you remove the flow stalks be sure to remove the complete stalk. These stalks don't pull off as easily as the leave stalks do, so you may need to use a knife. Cut the flower stalk off cleanly as close to the main plant as possible."}, {"url": "http://www.almanac.com/plant/rhubarb", "passage_text": "My rhubarb plant had 8 tall flowering stalks and some stalks on the plant that were green, showing no red on the stalks. The flowering stalks started growing before the stalks at the base. What do I do to get rhubarb we are able to eat/ This plant is about 5 years olld and has done this every year. Rhubarb is a perennial vegetable, though it is generally used as a fruit in desserts and jams. You only eat the stalks, which have a rich tart flavor. The leaves of this plant are poisonous, so be sure that they are not ingested. Rhubarb is easy to grow, but needs cool weather to thrive"}, {"url": "http://www.rhubarb-central.com/rhubarb-flowers.html", "passage_text": "I think that the rhubarb flower stalk or seedpod is a very beautiful sight, and I really dislike the idea of removing it, however it must be cut out. Scroll down for directions on how to remove the flower stalk. The flower head that comes up from rhubarb plants should be removed immediately when you first observe it. This flower or seedpod usually comes up in the springtime. These flower stalks do not usually grow on younger plants, but are common on more mature plants that are 3 or more years older. If you do not cut the flower stalk off as low as possible, it may begin to rot and provide a home to slugs and other insects which may in turn damage the rhubarb plants. Scroll down and see what Helen did with the flower stalks from her rhubarb plant! I Love her idea!"}, {"url": "http://www.hort.purdue.edu/ext/rhubarbflowers.html", "passage_text": "It does appear that some rhubarb plants are more prone to flowering than others. Old-fashioned varieties, such as Victoria and MacDonald, are heavy seed stalk producers. Canada Red and Valentine are less likely to bolt. Plant maturity is also a factor, with more mature plants being more likely to bolt than youngsters. We humans can be so difficult to please. If plants flower when we want them to, we call it blooming. But if plants flowers when we don't want them to, we call it bolting. Flowering is an undesirable trait when growing rhubarb; therefore, bolting describes the event. Gardeners frequently ask why their rhubarb is bolting."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/rhubarb/rhubarb-bolting.htm", "passage_text": "When a rhubarb flowers, this is called bolting or going to seed. When rhubarb goes to seed, this is perfectly normal. The rhubarb plant is doing what plants are supposed to do and that is trying to reproduce. But there are some factors that can influence how often you get a flowering rhubarb. 1  Variety – Some varieties of rhubarb flower more than others. 2  Maturity – Plants need to reach a certain maturity in order to reproduce through seed. 3  Heat – Rhubarb plants grow best in cooler temperatures. 4  Stress – Stress can also force a rhubarb to flower."}]