[{"url": "http://www.answers.com/Q/What_is_the_optimum_temperature_of_amylase", "passage_text": "The optimum temperature of amylase is about 37.5oC, as it is inside the body it works at that temperature. It depends on the type of enzyme and where that enzyme is located. For example, an average enzyme in the human body prefers 98.6 degrees F plus or minus a few degrees dependin … g on where the enzyme is in the body. It is interesting to note that a high fever is fatal to the human body because the temperature of the body gets too high and the enzyme begins to unravel"}, {"url": "http://data.biitbook.com/BIOCHEM-LAB---Enzymatic-Activity-of-Salivary-Amylase.pdf", "passage_text": "The optimum temperature of the amylase was determined. B. Effect of pH One mL of acetate buffer (pH 4) and one mL 2% unbuffered starch were mixed in a large test tube. Two mL of the enzyme solution was added in a separate large test tube. Both the test tubes were incubated for ten minutes in a 37°C water bath. Results and Discussion The effect of temperature and pH on the enzymatic activity of salivary amylase was determined by measuring the rates of reaction in varying temperatures and pH. The 0.5% NaCl added in the enzyme solution activates the salivary amylase to perform its function – to hydrolyze starch."}, {"url": "http://www.answers.com/Q/What_is_the_optimum_pH_and_temperature_of_salivary_amylase", "passage_text": "Answer by Rimshakr27. Confidence votes 3.7K. Answer Amylase has an optimal pH range of 6.7 - 7.0 and an optimal temperature of around 37 degrees Celsius or 98.6 degrees Fahrenheit. This is what would be expected of an enzyme that needs to be in its most active form in the saliva of the mouth. Answer   It depends on what amylase you're talking about. For example, the amylase found in saliva has an optimum pH of around 5.6 whereas amylase from the pancrea … s has an optimum pH around 7."}, {"url": "https://en.wikipedia.org/wiki/Amylase", "passage_text": "An amylase (/ˈaemɨleɪs/) ˈæmɨleɪs is an enzyme that catalyses the hydrolysis of starch into. Sugars amylase is present in the saliva of humans and some other, mammals where it begins the chemical process of. digestion Amylase is present in the saliva of humans and some other mammals, where it begins the chemical process of digestion."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23236747", "passage_text": "CONCLUSION: The optimal temperature in alimentary tract of Wh. pigra for lipase and amylase was 37 degrees C, and the responding temperature for protease was 42 degrees C. The optimal pH value in alimentary tract of Wh. pigra for lipase and amylase was pH 8.2 and pH 5.2, respectively. While pH 3.2 or 9.2 seems to be both favorable for high protease activity. "}, {"url": "http://www.answers.com/Q/What_is_the_optimum_temperature_of_amylase", "passage_text": "Answer     Amylase has an optimal pH range of 6.7 - 7.0 and an optimal temperature of around 37 degrees Celsius or 98.6 degrees Fahrenheit. This is what would be expect … ed of an enzyme that needs to be in its most active form in the saliva of the mouth. + 32 others found this useful. Christine Hanson. It depends on the type of enzyme and where that enzyme is located. For example, an average enzyme in the human body prefers 98.6 degrees F plus or minus a few degrees dependin … g on where the enzyme is in the body. It is interesting to note that a high fever is fatal to the human body because the temperature of the body gets too high and the enzyme begins to unravel"}, {"url": "https://answers.yahoo.com/question/index?qid=20091011015020AANFB9G", "passage_text": "Report Abuse. Amylase is an enzyme, which you can find in your mouth. It catalyses the hydrolysis of starch. Rates of enzyme-catalysed reactions depend on pH and temperature. The optimum temperature is about 40oC because the average human body temperature is 37oC. The optimum pH is the neutral one because your mouth has a 7 pH."}, {"url": "http://data.biitbook.com/BIOCHEM-LAB---Enzymatic-Activity-of-Salivary-Amylase.pdf", "passage_text": "Figure 1 shows that the optimum temperature of salivary amylase ranges from 32°C to 37°C.This applies to the human body since salivary amylase is suitable to function within these temperatures. After 37°C, the graph then steeply declines as a result of loss of activity. At 50°C and 70°C, salivary amylase is denatured. Results and Discussion The effect of temperature and pH on the enzymatic activity of salivary amylase was determined by measuring the rates of reaction in varying temperatures and pH. The 0.5% NaCl added in the enzyme solution activates the salivary amylase to perform its function – to hydrolyze starch."}]