[{"url": "http://www.explainthatstuff.com/biofuels.html", "passage_text": "First-generation biofuels include such things as vegetable oil, biodiesel, ethanol, and methanol. Ethanol and methanol are very strong alcohols made from sugar, wheat, or corn in a process similar to brewing. Vegetable oil made from such things as peanuts and soybeans can be burned directly as a fuel, or it can be turned into biodiesel, a gasoline substitute (or additive) that can help to reduce vehicle emissions."}, {"url": "http://environment.nationalgeographic.com/environment/global-warming/biofuel-profile/", "passage_text": "For decades, Brazil has turned sugarcane into ethanol, and some cars there can run on pure ethanol rather than as additive to fossil fuels. And biodiesel—a diesel-like fuel commonly made from palm oil—is generally available in Europe. On the face of it, biofuels look like a great solution. Biofuels are similar, except that they're made from plants grown today. Much of the gasoline in the United States is blended with a biofuel—ethanol. This is the same stuff as in alcoholic drinks, except that it's made from corn that has been heavily processed."}, {"url": "http://www.resilience.org/stories/2012-01-14/why-biofuels-are-not-good-idea", "passage_text": "If you have always been thinking that biofuels are not a good idea, this book by Mario Giampietro and Kozo Mayumi will tell you exactly why. The Biofuel Delusion The Fallacy of Large Scale Agro-Biofuels Production. By Mario Giampietro and Kozo Mayumi with Forewords by Vaclav Smil and Jerome Ravetz. Earthscan. If you have always been thinking that biofuels are not a good idea, this book by Mario Giampietro and Kozo Mayumi will tell you exactly why in their book, The Biofuel Delusion. 1  About. 2  Login. 3  Edit profile. 4  Edit group."}, {"url": "http://environment.nationalgeographic.com/environment/global-warming/biofuel-profile/", "passage_text": "Gasoline and diesel are actually ancient biofuels. But they are known as fossil fuels because they are made from decomposed plants and animals that have been buried in the ground for millions of years. Biofuels are similar, except that they're made from plants grown today. Much of the gasoline in the United States is blended with a biofuel—ethanol. This is the same stuff as in alcoholic drinks, except that it's made from corn that has been heavily processed."}, {"url": "http://www.streetdirectory.com/travel_guide/49376/mileage_and_fuel/6_reasons_to_use_biofuels.html", "passage_text": "By: drohilm. Biofuels is a nickname to renewable fuels from biological source, that can replace fuels that come from fossil fuels like gasoline and diesel. It is now possible to purchase or make yourself biodiesel for diesel engines or ethanol for gasoline engines. Better to the engine. Biofuels are not only healthier to the environment, but also much better to the engines. Much research done by the automobile industry shows that biodiesel and ethanol increase the efficiency of the engine and it life span. 6. Have good political implications."}, {"url": "http://environment.nationalgeographic.com/environment/global-warming/biofuel-profile/", "passage_text": "Photograph by Sarah Leen. Biofuels have been around as long as cars have. At the start of the 20th century, Henry Ford planned to fuel his Model Ts with ethanol, and early diesel engines were shown to run on peanut oil. But discoveries of huge petroleum deposits kept gasoline and diesel cheap for decades, and biofuels were largely forgotten. Biofuels are similar, except that they're made from plants grown today. Much of the gasoline in the United States is blended with a biofuel—ethanol. This is the same stuff as in alcoholic drinks, except that it's made from corn that has been heavily processed."}, {"url": "https://en.wikipedia.org/wiki/Biofuel", "passage_text": "A biofuel is a fuel that is produced through contemporary biological processes, such as agriculture and anaerobic digestion, rather than a fuel produced by geological processes such as those involved in the formation of fossil fuels, such as coal and petroleum, from prehistoric biological matter. Biodiesel can be used as a fuel for vehicles in its pure form, but it is usually used as a diesel additive to reduce levels of particulates, carbon monoxide, and hydrocarbons from diesel-powered vehicles. Biodiesel is produced from oils or fats using transesterification and is the most common biofuel in Europe."}, {"url": "http://www.ncpa.org/sub/dpd/index.php?Article_ID=24412", "passage_text": "Vast amounts of land are required to produce biofuels, because biofuels have a very low power density, just 0.3 watts per square meter. 1  For comparison, solar panels have a density of 6 watts per square meter, and an oil well producing 10 barrels of oil each day has a power density of 27 watts per square meter. But because ethanol contains less energy than oil, the actual energy produced by biofuels was the equivalent of 1.2 million barrels of oil per day. Global energy use from all sources, however, is equivalent to 250 million barrels of oil per day."}]