[{"url": "http://www.worldatlas.com/webimage/countrys/namerica/caribb/cuba/culand.htm", "passage_text": "Isla de la Juventud, or Isle of Youth is the second-largest Cuban island and the seventh-largest island in the West Indies. Overall Cuba's land is relatively flat, flowing gradually into hills, including a few hills of limestone shown to the right. Cuba's coastal areas are the most mountainous. In the Sierra de los Organos of the far-northwest the landscape is hilly with a few lower mountains. In the southwest the Sierra Maestra is a mountain range that rises sharply from the coast."}, {"url": "http://traveltips.usatoday.com/physical-landforms-caribbean-islands-105228.html", "passage_text": "The islands of the Caribbean, like all other islands, have water that surrounds them on every side. Individual islands and groups of islands belong to various nations. Puerto Rico and the American Virgin Islands belong to the United States. Among the territories of Britain are Bermuda and the British Virgin Islands."}, {"url": "http://traveltips.usatoday.com/physical-landforms-caribbean-islands-105228.html", "passage_text": "Cuba is not a very mountainous country, but it has a few mountain ranges. The Sierra Maestra in Cuba are on the easternmost diagonal coastline, and the Cordillera de Guaniguanico is on the west coast. The Grupo Guamuhaya are in the center and south-center of the island."}, {"url": "http://www.worldatlas.com/webimage/countrys/namerica/caribb/cuba/culand.htm", "passage_text": "Cuba Geography. Cuba is the largest country by land area in the Caribbean, and the main island is the sixteenth largest island in the world by land area. A handful of archipelagos (that include hound reds of island and cay's) ring its coastline north and south."}, {"url": "http://www.answers.com/Q/What_are_the_landforms_in_Cuba", "passage_text": "Landforms are features that make up the Earth's surface. There are many kinds of landforms. They can be locations, such as islands; terrain, such as mountains or valleys; or t … hose having specific qualities caused by climate, such as deserts, swamps, and glaciers."}, {"url": "http://www.ducksters.com/geography/country/cuba.php", "passage_text": "Major Landforms: Cuba is the 17th largest island in the world. Sierra Maestra mountain range, Sierra Cristal Mountains, Escambray Mountains, Pico Turquino Mountain, and Zapata Swamp."}, {"url": "http://www.answers.com/Q/What_are_the_physical_features_of_Cuba", "passage_text": "Answer by Starblast. Confidence votes 44. Cuba is an island with rugged mountains, rolling hills, plains, and of course, a coastline. Cuba is an archipelago of islands located in the northern Caribbean Sea at the confluence with the Gulf of Mexico and the Atlantic Ocean."}]