[{"url": "http://www.let.rug.nl/usa/presidents/abraham-lincoln/the-emancipation-proclamation-1863.php", "passage_text": "Although the Emancipation Proclamation did not end slavery in America--this was achieved by the passage of the 13TH Amendment to the Constitution on Dec. 18, 1865--it did make that accomplishment a basic war goal and a virtual certainty. This Emancipation Proclamation actually freed few people. It did not apply to slaves in border states fighting on the Union side; nor did it affect slaves in southern areas already under Union control. Naturally, the states in rebellion did not act on Lincoln's order."}, {"url": "http://emancipation.dc.gov/", "passage_text": "The DC Compensated Emancipation Act of 1862 ended slavery in Washington, DC, freed 3,100 individuals, reimbursed those who had legally owned them and offered the newly freed women and men money to emigrate. "}, {"url": "http://www.timeanddate.com/holidays/us/emancipation-day-dc", "passage_text": "Emancipation Day is a holiday in Washington DC to mark the anniversary of the signing of the Compensated Emancipation Act, which president Abraham Lincoln signed on April 16, 1862. It is annually held on April 16. In 2007, the observance Emancipation Day in Washington DC had the effect of nationally extending the 2006 income tax filing deadline from April 16 to April 17."}, {"url": "http://www.civilwar.org/education/history/emancipation-150/10-facts.html", "passage_text": "Fact #1: Lincoln actually issued the Emancipation Proclamation twice. Abraham Lincoln issued the preliminary Emancipation Proclamation on September 22nd, 1862. It stipulated that if the Southern states did not cease their rebellion by January 1st, 1863, then Proclamation would go into effect. When the Confederacy did not yield, Lincoln issued the final Emancipation Proclamation on January 1st, 1863. Fact #2: The Emancipation Proclamation only applied to the states in rebellion. President Lincoln justified the Emancipation Proclamation as a war measure intended to cripple the Confederacy."}, {"url": "https://en.wikipedia.org/wiki/Juneteenth", "passage_text": "Juneteenth, also known as Juneteenth Independence Day or Freedom Day, is a holiday that commemorates the announcement of the abolition of slavery in Texas in June 1865, and more generally the emancipation of African-American slaves throughout the Confederate South. During the American Civil War, President Abraham Lincoln issued the Emancipation Proclamation on September 22, 1862, with an effective date of January 1, 1863."}, {"url": "http://www.ushistory.org/us/34a.asp", "passage_text": "The Emancipation Proclamation evolved over time, with a preliminary proclamation in July 1862, further refinement in September 1862, and then the final document which was signed on New Year's Day 1863. This webpage from the Library of Congress gives the details. As a result, the British did not recognize the Confederate States of America, and Antietam became one of the war's most important diplomatic battles, as well as one of the bloodiest. Five days after the battle, Lincoln decided to issue the Emancipation Proclamation, effective January 1, 1863."}, {"url": "http://www.timeanddate.com/holidays/us/emancipation-day-dc", "passage_text": "By 1860, there were about four million slaves in the United States. On April 16, 1862, Abraham Lincoln, who was the US president at the time, signed the Compensated Emancipation Act, which freed more than 3000 slaves in the District of Columbia. In 2007, the observance Emancipation Day in Washington DC had the effect of nationally extending the 2006 income tax filing deadline from April 16 to April 17."}, {"url": "http://www.let.rug.nl/usa/presidents/abraham-lincoln/the-emancipation-proclamation-1863.php", "passage_text": "On Jan. 1, 1863, U.S. President Abraham Lincoln declared free all slaves residing in territory in rebellion against the federal government. This Emancipation Proclamation actually freed few people. It did not apply to slaves in border states fighting on the Union side; nor did it affect slaves in southern areas already under Union control. Naturally, the states in rebellion did not act on Lincoln's order."}, {"url": "http://www.thedailybeast.com/articles/2013/01/01/a-mighty-act-the-150th-anniversary-of-the-emancipation-proclamation.html", "passage_text": "Like most Americans then and now, Abraham Lincoln began his New Year’s day 150 years ago by attending a party, in this case his own. Illustration of President Abraham Lincoln signs the Emancipation Proclamation on Jan. 1, 1863 in Washington. (AP). But it was no ordinary party, and certainly no ordinary New Year’s. On Jan. 1, 1863, President Lincoln signed the Emancipation Proclamation freeing an estimated 500,000 slaves, changing the course of the Civil War, and revolutionizing America. Historian Harold Holzer on what happened on that fateful day—and the still raging debate over its achievements."}]