[{"url": "https://en.wikipedia.org/wiki/Antibody", "passage_text": "The membrane-bound form of an antibody may be called a surface immunoglobulin (sIg) or a membrane immunoglobulin (mIg). It is part of the B cell receptor (BCR), which allows a B cell to detect when a specific antigen is present in the body and triggers B cell activation. This region is known as the hypervariable region. Each of these variants can bind to a different antigen. This enormous diversity of antibody paratopes on the antigen-binding fragments allows the immune system to recognize an equally wide variety of antigens."}, {"url": "http://biology.about.com/od/molecularbiology/ss/antibodies.htm", "passage_text": "The antigen-binding site is the area of the antibody that recognizes the specific antigenic determinant and binds to the antigen. Since different antibodies recognize different antigens, antigen-binding sites are different for different antibodies. This area of the molecule is known as the variable region. Antibodies protect against substances prior to cell infection. Antibodies are produced by a type of white blood cell called a B cell (B lymphocyte). B cells develop from stem cells in bone marrow. When B cells become activated due to the presence of a particular antigen, they develop into cells called plasma cells."}, {"url": "http://www.news-medical.net/health/What-is-an-Antibody.aspx", "passage_text": "Immunoglobulins are basically proteins that function as antibodies. The terms antibody and immunoglobulin are often used interchangeably. Immunoglobulins are found in blood and other tissues and fluids. They are made by the plasma cells that are derived from the B cells of the immune system. B cells of the immune system become plasma cells when activated by the binding of a specific antigen on its antibody surfaces. The specific region on an antigen that an antibody recognizes and binds to is called the epitope, or antigenic determinant. An epitope is usually made up of a 5-8 amino acid long chain on the surface of the protein."}, {"url": "https://answers.yahoo.com/question/index?qid=20090222150256AAVvOrZ", "passage_text": "They are typically made of basic structural units—each with two large heavy chains and two small light chains—to form, for example, monomers with one unit, dimers with two units or pentamers with five units. Antibodies are produced by a kind of white blood cell called a B cell. There are several different types of antibody heavy chains, and several different kinds of antibodies, which are grouped into different isotypes based on which heavy chain they posses"}, {"url": "http://biology.about.com/od/molecularbiology/ss/antibodies.htm", "passage_text": "Plasma cells create antibodies that are specific to a specific antigen. Plasma cells generate the antibodies that are essential to the branch of the immune system known as the humoral immune system. Antibodies protect against substances prior to cell infection. Antibodies are produced by a type of white blood cell called a B cell (B lymphocyte). B cells develop from stem cells in bone marrow. When B cells become activated due to the presence of a particular antigen, they develop into cells called plasma cells."}, {"url": "http://biology.about.com/od/molecularbiology/ss/antibodies.htm", "passage_text": "Antibodies recognize specific antigens by identifying certain areas on the surface of the antigen known as antigenic determinants. Once the specific antigenic determinant is recognized, the antibody will bind to the determinant. The antigen is tagged as an intruder and labeled for destruction by other immune cells. Antibodies protect against substances prior to cell infection. Antibodies are produced by a type of white blood cell called a B cell (B lymphocyte). B cells develop from stem cells in bone marrow. When B cells become activated due to the presence of a particular antigen, they develop into cells called plasma cells."}, {"url": "http://www.answers.com/Q/How_are_antibodies_formed", "passage_text": "Antibodies are formed as the defence against antigen or pathogen which is consider as a foreign particle by body against whcih body immune system acts. Split and merge into it. Answer by Mahesh Ramaswamy. Confidence votes 922. Antibodies are formed in response to the antigen. Immune system is triggered when antigen is invaded to our body which in turn produces the antibodies."}, {"url": "https://answers.yahoo.com/question/index?qid=20090222150256AAVvOrZ", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Antibodies (also known as immunoglobulins) are gamma globulin proteins that are found in blood or other bodily fluids of vertebrates, and are used by the immune system to identify and neutralize foreign objects, such as bacteria and viruses. Antibodies are produced by a kind of white blood cell called a B cell."}, {"url": "https://en.wikipedia.org/wiki/Antibody", "passage_text": "Each antibody binds to a specific antigen; an interaction similar to a lock and key. An antibody (Ab), also known as an immunoglobulin (Ig), is a large, Y-shape protein produced by plasma cells that is used by the immune system to identify and neutralize pathogens such as bacteria and viruses. The antibody recognizes a unique molecule of the harmful agent, called an antigen, via the variable region. This region is known as the hypervariable region. Each of these variants can bind to a different antigen. This enormous diversity of antibody paratopes on the antigen-binding fragments allows the immune system to recognize an equally wide variety of antigens."}]