[{"url": "https://en.wikipedia.org/wiki/Nitrate", "passage_text": "Almost all inorganic nitrate salts are soluble in water at standard temperature and pressure. A common example of an inorganic nitrate salt is potassium nitrate (saltpeter). A rich source of inorganic nitrate in the human body comes from diets rich in leafy green foods, such as spinach and arugula. It is now believed that dietary nitrate in the form of plant-based foods is converted in the body to nitrite. While nitrate is much less toxic than ammonia, levels over 30 ppm of nitrate can inhibit growth, impair the immune system and cause stress in some aquatic species."}, {"url": "https://en.wikipedia.org/wiki/Nitrate", "passage_text": "Nitrites are produced by a number of species of nitrifying bacteria, and the nitrate compounds for gunpowder (see this topic for more) were historically produced, in the absence of mineral nitrate sources, by means of various fermentation processes using urine and dung. While nitrate is much less toxic than ammonia, levels over 30 ppm of nitrate can inhibit growth, impair the immune system and cause stress in some aquatic species."}, {"url": "https://simple.wikipedia.org/wiki/Nitrate", "passage_text": "Nitrate (NO 3 1-) is a polyatomic ion. It is made up of one nitrogen and three oxygen atoms. It is part of many important molecules. Potassium nitrate is a common nitrate, used in fertilizers because plants need nitrates to live and grow. Some nitrates are explosive. People make large amounts of nitrates from ammonia. Nitrates are similar to nitrites. Nitric acid has the formula HNO 3 and has no overall charge, because the hydrogen ion is positive"}, {"url": "https://en.wikipedia.org/wiki/Nitrate", "passage_text": "Nitrate is a polyatomic ion with the molecular formula NO 3 − and a molecular mass of 62.0049 g/mol. Nitrates also describe the organic functional group RONO 2. While nitrate is much less toxic than ammonia, levels over 30 ppm of nitrate can inhibit growth, impair the immune system and cause stress in some aquatic species."}, {"url": "https://simple.wikipedia.org/wiki/Potassium_nitrate", "passage_text": "It dissolves in water. It is a common source of the nitrate ion. Potassium nitrate is a strong oxidizer. It decomposes to potassium nitrite and oxygen when heated. Its pH is almost neutral. It burns with a lilac flame. "}, {"url": "http://www.theaquariumwiki.com/Nitrate", "passage_text": "Nitrate (NO3) is a nitrogen by-product of the nitrifying bacteria (Nitrospira) in a filter or substrate consuming Nitrite. It was previously thought species of Nitrobacter did this. but since 1998 it's considered to be species of Nitrospira. 1  Nitrate is far less toxic than nitrite and much less toxic than Ammonia. "}, {"url": "https://en.wikipedia.org/wiki/Nitrite", "passage_text": "Nitrite is also important in biochemistry as a source of the potent vasodilator nitric oxide. In organic chemistry the NO 2 group is present in nitrous acid esters and nitro compounds. Nitrites are also used in the food production industry for curing meat. Not to be confused with nitrate. The nitrite ion, which has the chemical formula NO 2 − , is a symmetric anion with equal N–O bond lengths and an O–N–O bond angle of approximately 120°. Upon protonation, the unstable weak acid nitrous acid is produced"}, {"url": "http://encyclopedia2.thefreedictionary.com/nitrate", "passage_text": "nitrate. chemical compound containing the nitrate (NO 3) radical radical,in chemistry, group of atoms that are joined together in some particular spatial structure and that take part in most chemical reactions as a single unit. Important inorganic radicals include ammonium, NH4; carbonate, CO3; chlorate, ClO3..... Click the link for more information. (KNO 3), sodium nitrate sodium nitrate,chemical compound, NaNO3, a colorless, odorless crystalline compound that closely resembles potassium nitrate (saltpeter or niter) in appearance and chemical properties."}, {"url": "https://en.wikipedia.org/wiki/Sodium_nitrate", "passage_text": "Sodium nitrate is the chemical compound with the formula Na N O 3. This salt is also known as Chile saltpeter or Peru saltpeter (due to the large deposits found in the Atacama desert in these countries) to distinguish it from ordinary saltpeter, potassium nitrate. "}]