[{"url": "http://blogs.cisco.com/smallbusiness/understanding-the-difference-between-wireless-encryption-protocols", "passage_text": "The WPA data encryption protocol you choose depends on your wireless network’s needs. It’s critically important to secure your wireless networks, but security can be complex, particularly when it comes to configuring each network component appropriately. Most small business routers let you choose which data encryption protocol you want to use, but in order to make the best choice for your network, you need to understand the differences between encryption protocols. For wireless networks, the data encryption protocol is WPA, or Wi-Fi Protected Access."}, {"url": "http://kb.netgear.com/app/answers/detail/a_id/1141/~/what-is-wep-wireless-encryption%3F", "passage_text": "Wired Equivalent Privacy (WEP), and its weaker security level is discussed here. Wired Equivalent Privacy (WEP) is a security protocol for wireless networks that encrypts transmitted data. The disadvantage is that without any security, your data can be intercepted without difficulty. If you run a network with only the default security, where WEP is turned off, any of your neighbors can immediately log on to your network and use your Internet connection. 1  For wireless devices to communicate, all of them must use the same WEP setting."}, {"url": "http://whoisonmywifi.com/more-info/additional-info/wireless-encryption/#!", "passage_text": "Wireless Encryption basically means to encrypt the messages that are sent between your computer’s wireless network adapter and the wireless router. Wireless Encryption is one of the important steps to help in Preventing Unknown computers from gaining access to your network."}, {"url": "http://mobileoffice.about.com/od/findingusinghotspots/f/wepwpa.htm", "passage_text": "It is provided by the network administrator or service provider. Using WEP/WPA/WPA2 on the wireless access point or router: Most wireless access points and routers today allow you to select during setup the security protocol to be used. Unfortunately, the default in many wireless devices is WEP--or, worse, nothing"}, {"url": "http://compnetworking.about.com/od/wirelesssecurity/f/what-is-wpa2.htm", "passage_text": "Answer: WPA2 is a security technology commonly used on Wi-Fi wireless networks. WPA2 (Wireless Protected Access 2) replaced the original WPA technology on all certified Wi-Fi hardware since 2006 and is based on the IEEE 802.11i technology standard for data encryption. WPA2 also improves the security of Wi-Fi connections by requiring use of stronger wireless encryption than what WPA requires. Specifically, WPA2 does not allow use of an algorithm called TKIP (Temporal Key Integrity Protocol) that has known security holes (limitations) in the original WPA implementation."}, {"url": "http://searchsecurity.techtarget.com/definition/Wired-Equivalent-Privacy", "passage_text": "vs. Digital Guardian. Wired Equivalent Privacy (WEP) is a security protocol, specified in the IEEE Wireless Fidelity (Wi-Fi) standard, 802.11 b, that is designed to provide a wireless local area network (WLAN) with a level of security and privacy comparable to what is usually expected of a wired LAN. "}, {"url": "https://en.wikipedia.org/wiki/Wireless_security", "passage_text": "The most common types of wireless security are Wired Equivalent Privacy (WEP) and Wi-Fi Protected Access (WPA). WEP is a notoriously weak security standard. The password it uses can often be cracked in a few minutes with a basic laptop computer and widely available software tools. WEP is an old IEEE 802.11 standard from 1999, which was outdated in 2003 by WPA, or Wi-Fi Protected Access."}, {"url": "http://kb.netgear.com/app/answers/detail/a_id/1141/~/what-is-wep-wireless-encryption%3F", "passage_text": "However, WEP was an early attempt to secure wireless networks, and better security is now available such as DES, VPN, and WPA. See the Guide to Internet Security to learn about network security. WEP has three settings: Off (no security), 64-bit (weak security), 128-bit (a bit better security). If you run a network with only the default security, where WEP is turned off, any of your neighbors can immediately log on to your network and use your Internet connection. 1  For wireless devices to communicate, all of them must use the same WEP setting."}, {"url": "http://compnetworking.about.com/od/wirelesssecurity/f/what-is-a-wireless-key.htm", "passage_text": "Answer: A wireless key is an encryption setting commonly used on wireless computer networks to increase their security. The two standard types of wireless keys support WEP and WPA encryption. "}]