[{"url": "https://www.medicare.gov/sign-up-change-plans/medicare-health-plans/medicare-advantage-plans/how-medicare-advantage-plans-work.html", "passage_text": "How Medicare Supplement Insurance (Medigap) policies work with Medicare Advantage Plans. Medigap policies can't work with Medicare Advantage Plans. Learn about your options related to Medigap policies and Medicare Advantage Plans. Medicare Advantage Plans, sometimes called Part C or MA Plans, are offered by private companies approved by Medicare. If you join a Medicare Advantage Plan, you still have Medicare. You'll get your Medicare Part A (Hospital Insurance) and Medicare Part B (Medical Insurance) coverage from the Medicare Advantage Plan and not Original Medicare"}, {"url": "https://en.wikipedia.org/wiki/Medicare_Advantage", "passage_text": "Most Medicare Advantage plans (sometimes referred to as Part C) include the Part D prescription drug benefit plan, and are known as a Medicare Advantage Prescription Drug plan or MAPD.. In contrast, Medicare Advantage is offered by commercial insurance companies, who receive compensation from the federal government, to provide all Part A and B benefits to enrollees, but do not process claims through the CMS."}, {"url": "http://www.ehealthmedicare.com/medicare-part-c-advantage/", "passage_text": "If you qualify for or are already enrolled in Original Medicare, you can choose to enroll in Medicare Part C, more commonly known as Medicare Advantage. Medicare Advantage plans are offered by private health insurance companies and provide Medicare Part A and Part B coverage (hospital and medical benefits). There can also be differences in the coverage you receive. Some Medicare Advantage plans include routine vision, routine dental, and/or wellness programs. Many plans also include prescription drug coverage; those plans are called Medicare Advantage Prescription Drug plans."}, {"url": "http://www.webmd.com/health-insurance/insurance-basics/medicare-advantage-private-health-insurance-through-medicare", "passage_text": "Medicare Advantage: Private Health Insurance Through Medicare. Medicare Advantage plans (''Part C'') are required to cover the same services that Original Medicare covers. Some may also cover prescription drugs and dental or vision care. Medicare Advantage plans may give you some discounts or pay for services that Original Medicare may not cover. However, Medicare Advantage plans are administered by private health insurers and you'll be required to follow your plan's rules."}, {"url": "http://www.consumerreports.org/cro/news/2014/10/medigap-vs-medicare-advantage-consumer-reports/index.htm", "passage_text": "Most Medicare Advantage plans also include Part D prescription drug coverage. With a Medicare Advantage plan, you continue to pay your Part B premium as usual. You may also pay an extra premium for the plan. You are not allowed to have a Medigap and Medicare Advantage plan simultaneously. Medicare Advantage plans typically come with deductibles and co-pays. Medicare Advantage. How it relates to Original Medicare Parts A & B. Private supplemental coverage that pays all or most Part A & B out-of-pocket costs. Private health plan that provides Part A & B benefits directly in place of Original Medicare."}, {"url": "https://www.medicare.gov/sign-up-change-plans/medicare-health-plans/medicare-advantage-plans/medicare-advantage-plans.html", "passage_text": "Medicare Advantage Plans. A type of Medicare health plan offered by a private company that contracts with Medicare to provide you with all your Part A and Part B benefits. If you’re enrolled in a Medicare Advantage Plan, most Medicare services are covered through the plan and aren’t paid for under Original Medicare. Most Medicare Advantage Plans offer prescription drug coverage. 1  Different types of Medicare Advantage Plans. 2  How to join a Medicare Advantage Plan."}, {"url": "https://en.wikipedia.org/wiki/Medicare_Advantage", "passage_text": "Medicare Advantage (MA) is a United States health insurance program of managed health care (preferred provider organization (PPO) or health maintenance organization (HMO)) that serves as a substitute for Original Medicare Parts A and B Medicare benefits. In contrast, Medicare Advantage is offered by commercial insurance companies, who receive compensation from the federal government, to provide all Part A and B benefits to enrollees, but do not process claims through the CMS."}, {"url": "http://www.cigna.com/medicare/faqs/medicare-advantage-plans", "passage_text": "Medicare Advantage plans (also known as Medicare Part C) provide Part A (hospital), Part B (medical) and typically Part D (drug) coverage. To enroll in a Medicare Advantage Plan, you must be enrolled in Original Medicare Part A and Part B. Medicare Advantage plans are part of the federal Medicare program and offered through approved private insurers, such as Cigna-HealthSpring, to provide extra coverage. There are various types of Medicare Advantage plans, such as HMO, PPO and Private Fee-for-Service plans."}]