[{"url": "http://www.definitions.net/definition/endovascular%20aneurysm%20repair", "passage_text": "Freebase (0.00 / 0 votes) Rate this definition: Endovascular aneurysm repair. Endovascular aneurysm repair is a type of endovascular surgery used to treat an abdominal aortic aneurysm or thoracic aortic aneurysm, the procedure then specifically termed TEVAR. 1 Search for Synonyms for endovascular aneurysm repair. 2  Quotes containing the term endovascular aneurysm repair. 3  Search for Phrases containing the term endovascular aneurysm repair. 4  Search for Abbreviation"}, {"url": "http://www.yourdictionary.com/endovascular", "passage_text": "endovascular. adjective. 1  Intravascular. 2  Of or relating to a surgical procedure in which a catheter containing medications or miniature instruments is inserted through the skin into a blood vessel for the treatment of vascular disease. 1 Intravascular. 2  Of or relating to a surgical procedure in which a catheter containing medications or miniature instruments is inserted through the skin into a blood vessel for the treatment of vascular disease. 3  Link/Cite."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7831", "passage_text": "Vascular: Relating to blood vessels. For example, the vascular system in the body includes all of the veins and arteries. And, a vascular surgeon is an expert at evaluating and treating problems of the veins and arteries. "}, {"url": "https://www.sharecare.com/health/aneurysms/what-thoracic-endovascular-aneurysm-repair", "passage_text": "A Dr. Mark Russo, MD, Gastroenterology, answered. A thoracic endovascular (TEVAR) stent graft repair is a treatment for aneurysms of the descending thoracic aorta. It is similar to the approach used for a cardiac catheterization of the coronary arteries. This procedure requires only small incisions in the groin. This procedure is very similar to that used to repair the upper portions of the aorta (EVAR). During the procedure they insert a catheter into an artery in the groin and, using x-ray guidance, thread the catheter to the damaged area of the aorta."}, {"url": "https://en.wikipedia.org/wiki/Endovascular_surgery", "passage_text": "The field of endovascular surgery arose from interventional radiology techniques to treat disease that is endovascular (inside blood vessels) and has become an alternative to vascular surgery for some conditions such as abdominal aortic aneurysm and peripheral artery disease. Interventional radiologist Charles Dotter, MD, known as the Father of Interventional Radiology for pioneering this technique, was nominated for the Nobel Prize in Physiology or Medicine in 1978."}, {"url": "http://www.thefreedictionary.com/vascular", "passage_text": "adj. 1. (Biology) biology anatomy of, relating to, or having vessels that conduct and circulate liquids: a vascular bundle; the blood vascular system. 2. (Anatomy) biology anatomy of, relating to, or having vessels that conduct and circulate liquids: a vascular bundle; the blood vascular system. Of, characterized by, or containing cells or vessels that carry or circulate fluids, such as blood, lymph, or sap, through the body of an animal or plant: vascular tissue; vascular disease. [From Latin. , diminutive of. , vessel .]."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/neurological/endovascular_neurosurgery_and_interventional_neuroradiology_135,39/", "passage_text": "The term endovascular means “inside a blood vessel.” Endovascular neurosurgery uses tools that pass through the blood vessels to diagnose and treat diseases and conditions rather than using open surgery. The surgeon often uses radiology images to help him or her to see the part of the body involved in the procedure. Endovascular neurosurgery is a subspecialty within neurosurgery that uses catheters and radiology to diagnose and treat various conditions and diseases of the central nervous system. The central nervous system is made up of the brain and the spinal cord. This medical specialty is also called neurointerventional surgery"}, {"url": "https://en.wikipedia.org/wiki/Vascular_surgery", "passage_text": "Vascular surgery is a surgical specialty in which diseases of the vascular system, or arteries and veins, are managed by medical therapy, minimally-invasive catheter procedures, and surgical reconstruction. This area of vascular surgery is called Endovascular Surgery or Interventional Vascular Radiology, a term that some in the specialty append to their primary qualification as Vascular Surgeon. Endovascular and endovenous procedures can now form the bulk of a vascular surgeon's practice."}]