[{"url": "http://www.jessieripollprimary.com/", "passage_text": "Welcome to the Jessie Ripoll Primary School Web Site. Jessie Ripoll Primary is located in the parish of Kingston. It is situated at the corner of South Camp and Deanery Roads. It is bordered in its urban setting by the Allman Town, Vineyard Town and Franklin Town communities. The Jessie Ripoll Primary School opened its doors to the public on September 24, 1979. It presently has a staff complement ...."}, {"url": "http://www.ancestry.com/name-origin?surname=ripoll", "passage_text": "Click on a circle in the chart to view Ripoll immigration records. You can find out when most of the Ripoll families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Ripoll families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists"}, {"url": "https://en.wikipedia.org/wiki/Shakira", "passage_text": "[ʃaˈkiɾa isaˈβel meβaˈɾak riˈpol] ; English /ʃəˈkɪərə/ ; born February 2, 1977) is a Colombian singer, songwriter, dancer, record producer, choreographer, and model. Born and raised in Barranquilla, she began performing in school, demonstrating Latin, Arabic, and rock and roll influences and belly dancing abilities. Shakira is a native Spanish speaker who speaks fluent English and good Portuguese, as well as some Italian, French, Catalan and Arabic. Shakira is a Roman Catholic, and met Pope John Paul II in 1998. She is interested in world history, and she frequently studies the history and languages of the countries she visits."}, {"url": "http://www.imdb.com/name/nm0787680/bio", "passage_text": "Grammy-winning Latina pop singer Shakira was born in Barranquilla, Colombia, on February 2, 1977. Her father is a Lebanese American immigrant and her mother a native of Colombia of Italian and Spanish descent. Shakira began her musical career at age 12 and quickly captured fans throughout Latin America. She won the 2001 Best Latin pop Grammy for her MTV Unplugged album"}, {"url": "http://www.maplandia.com/spain/cataluna/gerona/ripoll/", "passage_text": "detailed map of Ripoll and near places. Welcome to the Ripoll google satellite map! This place is situated in Gerona, Cataluna, Spain, its geographical coordinates are 42° 12' 0 North, 2° 12' 0 East and its original name (with diacritics) is Ripoll. See Ripoll photos and images from satellite below, explore the aerial photographs of Ripoll in Spain. Maplandia.com in partnership with Booking.com offers highly competitive rates for all types of hotels in Ripoll, from affordable family hotels to the most luxurious ones. Booking.com, being established in 1996, is longtime Europe’s leader in online hotel reservations."}, {"url": "https://en.wikipedia.org/wiki/Shakira", "passage_text": "Shakira Isabel Mebarak Ripoll was born on February 2, 1977 in Barranquilla, Colombia. She is the only child of Nidia Ripoll and William Mebarak Chadid. Her paternal grandparents emigrated from Lebanon to New York City, where her father was born. Her father then emigrated to Colombia at age 5. Shakira is a native Spanish speaker who speaks fluent English and good Portuguese, as well as some Italian, French, Catalan and Arabic. Shakira is a Roman Catholic, and met Pope John Paul II in 1998. She is interested in world history, and she frequently studies the history and languages of the countries she visits."}, {"url": "http://www.maplandia.com/spain/cataluna/gerona/ripoll/", "passage_text": "Ripoll hotel deals. Luxury hotels (including 5 star hotels and 4 star hotels) and cheap Ripoll hotels (with best discount rates and up-to-date hotel deals) are both available in separate lists. Always bear in mind that with Maplandia.com and Booking.com the best price is guaranteed! Maplandia.com in partnership with Booking.com offers highly competitive rates for all types of hotels in Ripoll, from affordable family hotels to the most luxurious ones. Booking.com, being established in 1996, is longtime Europe’s leader in online hotel reservations."}]