[{"url": "http://ipod.about.com/od/iphonehowtos/ss/syncing_iphone.htm", "passage_text": "The first step to sync the iPhone to computer is very simple: plug the cable that came with the iPhone into a USB port on your computer and the other end into the dock connector on the bottom of the iPhone. When you plug the cable in, your phone will begin to sync. The rest of the iPhone sync process happens in iTunes."}, {"url": "https://support.apple.com/en-us/HT204505", "passage_text": "1 Tap on your Apple Watch. 2  Your device's name should appear on the watch face. 3  On your iPhone, tap the 5-digit name that matches the one you see on your Apple Watch. 4  A six-digit code will appear on your Apple Watch. 5  Enter that code on your iPhone to pair the two devices. 6  Then continue the steps to set up."}, {"url": "http://www.cnet.com/news/apple-watch-without-your-iphone/#!", "passage_text": "You sync music with Apple Watch via your iPhone and the Apple Watch app, no Mac or iTunes required (but, the music must be on your phone in the Music app, or in iTunes in the Cloud)."}, {"url": "https://support.apple.com/en-us/HT204505", "passage_text": "After you put on your Apple Watch, choose a language, and tap Start Pairing on both devices, follow these steps: 1  Tap Pair Apple Watch Manually on your iPhone. 2  Tap on your Apple Watch. 3  On your iPhone, tap the 5-digit name that matches the one you see on your Apple Watch. 4  A six-digit code will appear"}, {"url": "http://www.imore.com/how-transfer-music-your-apple-watch", "passage_text": "By default you can stream all the music from your iPhone to your Apple Watch. If you want to leave your iPhone behind, however, you need to sync music over first. Whether you're heading out for a run, hitting the gym, doing rounds, or doing housework, your Apple Watch can hold up to 2 GB of music all on its own."}, {"url": "http://www.macworld.com/article/2942605/jam-out-to-apple-music-on-your-apple-watch-no-iphone-required.html", "passage_text": "How it works. Sync streaming playlists to your Apple Watch with Apple Music. First, build some playlists in the new Music app by tapping over to. Your playlist needs a name, of course, then you can add songs to it by searching for songs or whole albums."}, {"url": "http://www.imore.com/how-transfer-music-your-apple-watch", "passage_text": "How to sync music playlists from your iPhone to your Apple Watch. 1  Launch the Apple Watch app on your iPhone. 2  Tap on Music. 3  Tap on Synced Playlist. 4  Tap on the Playlist you want to sync."}, {"url": "https://support.apple.com/en-us/HT204505", "passage_text": "If you need to pair your devices manually. After you put on your Apple Watch, choose a language, and tap Start Pairing on both devices, follow these steps: 1  Tap Pair Apple Watch Manually on your iPhone. 2  Tap on your Apple Watch. 3  Your device's name should appear on the watch face."}]