[{"url": "http://www.booking.com/hotel/kr/incheon-airport-transit.html", "passage_text": "Hotel Incheon Airport is located in the Airport Town Square, 6 miles from Incheon International Airport. It offers a free 24-hour airport shuttle, free parking and free Wi-Fi in rooms. Incheon Airport Hotel 3-star hotel. Most recent booking for this hotel was today at 5:17 PM. Inside Incheon International Airport's departure lounge, Incheon Airport Transit Hotel provides modern air-conditioned rooms with free Wi-Fi, as well as a 24-hour check-in/out desk. A business center and 8 dining options are available"}, {"url": "https://www.expedia.com/Incheon-Hotels-Incheon-Airport-Hotel.h1061310.Hotel-Information", "passage_text": "Along with a restaurant, this hotel has a sauna and a steam room. Free WiFi in public areas is provided, as well as free self parking, a free airport shuttle, and free train station pick-up. Other amenities include a 24-hour business center, 24-hour room service, and a meeting room. A roundtrip airport shuttle and a train station pick-up service are complimentary for guests. Complimentary self parking is available on site. Incheon Airport Hotel has designated areas for smoking."}, {"url": "https://www.expedia.com/Incheon-Hotels-Incheon-Airport-Hotel.h1061310.Hotel-Information", "passage_text": "Get an overview of this hotel Family-friendly hotel with free airport shuttle and restaurant. Situated near the airport, in Incheon, this hotel is close to SKY72 Golf Club. Area attractions also include Wolmido Amusement Park and Incheon Bridge. A roundtrip airport shuttle and a train station pick-up service are complimentary for guests. Complimentary self parking is available on site. Incheon Airport Hotel has designated areas for smoking."}, {"url": "https://www.expedia.com/Incheon-Hotels-Incheon-Airport-Yegrina-Hotel.h7512340.Hotel-Information", "passage_text": "This hotel is located in Incheon (Eulwang-ri), near the airport, Silmido Island, and Eulwangri Beach. Area attractions also include Wangsan Beach and SKY72 Golf Club. A business center is on site. A shuttle from the airport to the hotel is complimentary to guests (available 24 hours). This Incheon hotel also offers tour/ticket assistance and barbecue grills. Incheon Airport Yegrina Hotel is a smoke-free property."}, {"url": "https://www.sixt.com/car-rental/south-korea/incheon/incheon-int-airport/", "passage_text": "Car rental from Incheon Int Airport. Avail yourself of an affordable car rental by using the Sixt service to rent a car at Incheon Int Airport. This is the place to find a convertible, 4x4, sports vehicle, or economy vehicle to use for your holiday. About Incheon Int Airport. Your arrival at Incheon Airport (ICN) just got easier with a car rental from Sixt, which provides the clear value in any price comparison."}, {"url": "http://www.worldairportguides.com/seoul-icn/airlines.php", "passage_text": "Introduction. Incheon International Airport is served by a host of international airlines. Boarding is generally from the central passenger terminal. For the convenience of travellers, listed below are the airlines that operate from the Incheon International Airport, with contact telephone numbers where available. Passenger Terminal. Please contact airport enquiries on +82 1577 2600 where airport contact details are not available. 1  Aeroflot - +82 32 744 8672. 2  Air Astana - +82 32 743 2620. 3  Air Canada - +82 32 744 0898."}, {"url": "http://www.booking.com/hotel/kr/numberone-guesthouse.html", "passage_text": "Hotel Incheon Airport is located in the Airport Town Square, 6 miles from Incheon International Airport. It offers a free 24-hour airport shuttle, free parking and free Wi-Fi in rooms. Incheon Airport Hotel 3-star hotel. Numberone Guesthouse offers spacious rooms with free Wi-Fi, only 0.9 miles from Incheon International Airport. Rooms feature a wooden floor and a large window, and they include a computer. Free parking is available"}]