[{"url": "http://americanhistory.about.com/od/abrahamlincoln/p/plincoln.htm", "passage_text": "Abraham Lincoln's Childhood and Education: Abraham Lincoln was born in Hardin County, Kentucky on February 12, 1809. He moved to Indiana in 1816 and lived there the rest of his youth. His mother died when he was nine but he was very close to his stepmother who urged him to read. Lincoln himself stated that he had about one year of formal education."}, {"url": "https://en.wikipedia.org/wiki/Abraham_Lincoln", "passage_text": "Abraham Lincoln was born February 12, 1809, the second child of Thomas and Nancy Hanks Lincoln, in a one-room log cabin on the Sinking Spring Farm in Hardin County, Kentucky (now LaRue County). He is a descendant of Samuel Lincoln, who migrated from Norfolk, England to Hingham, Massachusetts, in 1638. Born in Hodgenville, Kentucky, Lincoln grew up on the western frontier in Kentucky and Indiana. Largely self-educated, he became a lawyer in Illinois, a Whig Party leader, and a member of the Illinois House of Representatives, where he served from 1834 to 1846."}, {"url": "http://www.archives.com/genealogy/president-lincoln.html", "passage_text": "Lincoln Family History. Abraham Lincoln was born February 12, 1809 in Hardin County, Kentucky. He was the son of Thomas Lincoln and Nancy Hanks. The Lincolns are thought to be of English descent with many ancestors being of Puritan or Quaker beliefs. Thomas Lincoln was born January 6, 1778 in Rockingham County, Virginia to Abraham Lincoln and Bathsheba Herring. While a young child, the Lincolns moved the part of Virginia which later became Kentucky."}, {"url": "http://www.history.com/this-day-in-history/abraham-lincoln-is-born", "passage_text": "On this day in 1809, Abraham Lincoln is born in Hodgenville, Kentucky. Lincoln, one of America’s most admired presidents, grew up a member of a poor family in Kentucky and Indiana. "}, {"url": "http://www.civilwar.org/education/history/biographies/abraham-lincoln.html", "passage_text": "(National Archives). Abraham Lincoln, sixteenth President of the United States, was born near Hodgenville, Kentucky on February 12, 1809. His family moved to Indiana when he was seven and he grew up on the edge of the frontier. "}, {"url": "http://www.archives.com/genealogy/president-lincoln.html", "passage_text": "Abraham Lincoln Genealogy. Abraham Lincoln was born February 12, 1809 and died April 15, 1865. He was the sixteenth president of the United States of America serving from 1861 until his assassination in 1865. Thomas Lincoln was born January 6, 1778 in Rockingham County, Virginia to Abraham Lincoln and Bathsheba Herring. While a young child, the Lincolns moved the part of Virginia which later became Kentucky."}, {"url": "http://www.classroomhelp.com/lessons/Presidents/lincoln.html", "passage_text": "16th President. Abraham Lincoln was born in Hodgenville, Hardin County, Kentucky on February 12, 1809. He was the first President to be born in Kentucky. He was the first president to be born outside of the thirteen original states. He was born in a one room cabin with a dirt floor. He had no church affiliation. "}, {"url": "http://wonderopolis.org/wonder/where-was-abraham-lincoln-born/", "passage_text": "On February 12, 1809, Abraham Lincoln was born in a one-room log cabin on Sinking Spring Farm, which is located on Nolin Creek about three miles south of Hodgenville, Kentucky. He was the second child of Thomas and Nancy Hanks Lincoln. His sister Sarah was 2 years old when Abraham was born. February 12 marks the birthday of America’s 16 th president, Abraham Lincoln. Although he eventually became a lawyer and a politician, rising to the highest elected office in this country, he began life in the humblest of surroundings in rural Kentucky."}, {"url": "https://www.whitehouse.gov/1600/presidents/abrahamlincoln", "passage_text": "The son of a Kentucky frontiersman, Lincoln had to struggle for a living and for learning. Five months before receiving his party's nomination for President, he sketched his life: I was born Feb. 12, 1809, in Hardin County, Kentucky. "}]