[{"url": "http://www.northernlightsiceland.com/the-best-types-of-food-in-iceland/", "passage_text": "Fishing is one of the best activity in Iceland because first of all there are plenty of them to catch, second is that you can eat them by the traditional Icelandic method of preparing. One type is saltfiskur (Bacalao, which means salted fish). In preparation of the fish, it has to be dried and salted. The best types of food in Iceland. When someone talks about food, you will instantly say “Mmmmm…. Tasty!” When visiting Iceland, you can be sure you´ll find good and healthy food. Many of the dishes are traditional and have been around for ages, like the Icelandic meat soup."}, {"url": "http://www.food-links.com/foods-in-iceland/", "passage_text": "Foods in Iceland. ICELANDIC FOODS. DAIRY PRODUCTS. A glass of fresh cold milk is a common accompaniment to almost every meal, and soups made with milk and dried pureed fruits are often enjoyed. But the favorite dish of all and an Icelandic staple is skyr. It is made from pasteurized skim milk fermented with rennin. Icelanders have a deeply rooted objection to eating birds of any type, so the poultry that is raised supplies eggs but not meat to the Icelandic table. Eggs are often served with smoked mutton in the same way that bacon and eggs are used."}, {"url": "https://en.wikipedia.org/wiki/Icelandic_cuisine", "passage_text": "Hence, there are a number of restaurants in Iceland that specialise in seafood and at the annual Food and Fun chef's competition (since 2004) competitors create innovative dishes with fresh ingredients produced in Iceland. Points of pride are the quality of the lamb meat, seafood and (more recently) skyr. Fish dishes in Iceland are Icelandic fish which is caught in the waters of the North Atlantic Ocean. Fresh fish can be had all the year round. Icelanders eat mostly haddock, plaice, halibut, herring, and shrimp."}, {"url": "http://www.northernlightsiceland.com/the-best-types-of-food-in-iceland/", "passage_text": "Kjoetsupa (Kjötsúpa icelandic meat). Soup (Kjoetsupa kjötsúpa icelandic) meat soup is a traditional lamb Dish. In iceland (the meat the tough ones or you can use any part of) the lamb is slow cooked and is mixed, with herbs onion and root vegetables and served with rice barley or. rolled oats The best types of food in Iceland. When someone talks about food, you will instantly say “Mmmmm…. Tasty!” When visiting Iceland, you can be sure you´ll find good and healthy food. Many of the dishes are traditional and have been around for ages, like the Icelandic meat soup."}, {"url": "http://traveltips.usatoday.com/foods-iceland-21246.html", "passage_text": "Fish. Many types of fish and seafood are abundant in Iceland, with haddock, carpelin, herring, cod, plaice, lobsters, clams and shrimp being some of the most common varieties eaten. Fish is traditionally served boiled and accompanied by potatoes. Fish is often preserved by salting, smoking or drying. Singed sheep’s head and jam made from the sheep’s head, either fresh or pickled in whey, are traditional foods in Iceland. Many types of fish and seafood are abundant in Iceland, with haddock, carpelin, herring, cod, plaice, lobsters, clams and shrimp being some of the most common varieties eaten."}, {"url": "https://en.wikipedia.org/wiki/Icelandic_cuisine", "passage_text": "Wind-dried fish remains popular in Iceland. Icelandic cuisine, the cuisine of Iceland, has a long history. Important parts of Icelandic cuisine are lamb, dairy, and fish, due to Iceland's proximity to the ocean. Popular foods in Iceland include skyr, hangikjoet (hangikjöt smoked), lamb, kleinur laufabrauð and. bollur Fish dishes in Iceland are Icelandic fish which is caught in the waters of the North Atlantic Ocean. Fresh fish can be had all the year round. Icelanders eat mostly haddock, plaice, halibut, herring, and shrimp."}, {"url": "https://en.wikipedia.org/wiki/Hákarl", "passage_text": "Hakarl hákarl is served as part of a, þorramatur a selection of Traditional icelandic food served at þorrablot þorrablót. In midwinter it is readily Available in icelandic stores and is eaten. year round "}, {"url": "https://en.wikipedia.org/wiki/Icelandic_cuisine", "passage_text": "In Iceland the Christmas dinner is traditionally served on Christmas Eve. Traditional main courses are hangikjoet (hangikjöt smoked), lamb (hamborgarhryggur salted pork) rib and various types of, game especially ptarmigan, stew (puffin sometimes lightly) smoked and roast greylag goose where these are. available Fish dishes in Iceland are Icelandic fish which is caught in the waters of the North Atlantic Ocean. Fresh fish can be had all the year round. Icelanders eat mostly haddock, plaice, halibut, herring, and shrimp."}]