[{"url": "http://superuser.com/questions/760428/how-can-i-sort-my-data-while-keeping-paired-rows-together", "passage_text": "up vote 1 down vote. Set up a helper column to preserve the 2-row structure and sort this new helper column instead. The helper column (E in my example) references to the same column you want to filter for (e.g column C) but with one small improvement: Every second row your reference jumps one row above. You can speed up things by entering only two formulas, select both cells and drag them with auto-fill down."}, {"url": "http://smallbusiness.chron.com/sort-multiple-rows-columns-excel-40472.html", "passage_text": "You can sort all the rows in a worksheet by sorting the values in one column, simplifying the task of alphabetizing a list of employees by last name or reordering a list of customer transactions by invoice value. To deepen the value of a sorting process, use Excel to sort by more than one criterion at a time. Step 1. Step 2. Switch to the Data tab in the Microsoft Excel ribbon and locate the Sort & Filter group. Click on the Sort option. Related Reading: How to Include All Rows for Filters in Excel. Step 3. Click on the Sort By drop-down menu to select a column by name."}, {"url": "https://answers.yahoo.com/question/index?qid=20100121153923AAGh8yC", "passage_text": "Im making a spread sheet that i want to keep organized by date, and still sort the rest of the information in the respective rows. I know how to sort just the column, i'm just having trouble linking the whole row together. Add your answer. Source. "}, {"url": "http://muhlenberg.edu/pdf/main/aboutus/oit/excel_sorting_filters.pdf", "passage_text": "As long as the data is touching Excel will keep rows together. If you select a set of cells, Excel will sort only within the selection. The Sort dialog box shown above can be found under. This sort will only affect data cells that are touching or a selection of cells. This Sort window allows you to sort up to three levels. Excel usually assumes you have a header row, a first row of titles for your data. If you do not have a header row, you can sort without one, by choosing the option No header row."}, {"url": "http://smallbusiness.chron.com/sort-multiple-rows-columns-excel-40472.html", "passage_text": "1 If your data starts in row A, uncheck the My Data Has Headers option. 2  If your worksheet doesn't use headers, the list in the Sort By menu uses column references to identify your choices. 3  Use the arrows in the Sort dialog box to reorganize your sort criteria in a different order from the one in which you added them. Step 2. Switch to the Data tab in the Microsoft Excel ribbon and locate the Sort & Filter group. Click on the Sort option. Related Reading: How to Include All Rows for Filters in Excel. Step 3. Click on the Sort By drop-down menu to select a column by name."}, {"url": "http://smallbusiness.chron.com/lock-horizontal-rows-alphabetize-excel-38530.html", "passage_text": "Click the Freeze Panes button in the Window area of the ribbon. Click the Freeze Panes button that then appears in a pop-up menu. Step 4. Select the column letter or row number that corresponds to the information you want to alphabetize. Click the Data tab at the top of the screen, then click the Sort button. Open the Microsoft Excel 2010 spreadsheet that has the data you need to sort. Step 2. Click on the letter above the column you wish to alphabetize. Click the Data tab at the top of the screen and then click the Sort button."}, {"url": "http://superuser.com/questions/394674/how-do-i-group-rows-in-a-spreadsheet-and-keep-them-together-after-sorting", "passage_text": "Part of your problem may be that Excel links grouped rows to the row below the group, not the row above the group. First sort your data in descending order so that the item row is below the ingredients that belong to it. Group your ingredient rows. "}, {"url": "https://www.404techsupport.com/2012/08/how-to-sort-an-excel-spreadsheet-while-keeping-the-rows-intact/", "passage_text": "With previous versions of Excel or if you choose the wrong options in your configuration, it is easy to sort a single column but break the correlation between the data in that column and the rest of the entries in each row. Here’s how to sort the spreadsheet by a single column and get all of your data to move with it. "}, {"url": "http://smallbusiness.chron.com/lock-horizontal-rows-alphabetize-excel-38530.html", "passage_text": "Step 5. Click the Options button on the Sort window if you want to sort a row instead of a column, then choose Sort left to right.. Select the drop-down box next to Order and choose whether you want to alphabetize from A to Z or Z to A.. Click OK on the sort window and your information will be sorted. Step 1. Open the Microsoft Excel 2010 spreadsheet that has the data you need to sort. Step 2. Click on the letter above the column you wish to alphabetize. Click the Data tab at the top of the screen and then click the Sort button."}]