[{"url": "http://www.answers.com/Q/What_does_heme-negative_stool_mean", "passage_text": "Seeing blood in the toilet, on the outside of your stool, or with wiping after a bowel movement is common.Fortunately, most of the causes of such rectal bleeding are not life- … threatening; common causes include hemorrhoids and anal fissures. there could be a false positive on the guiac if you have had iron supplements or eaten somthing with a high amount of iron within 1-2 days prior to the test, as this is what the guiac test looks for. This is something that needs to be taken care of by your doctor."}, {"url": "http://www.wdxcyber.com/ncanc10.htm", "passage_text": "When the doctor does a rectal exam and smears a stool sample on a card to test for blood in the stool, or gives you a paper to drop into the toilet to look for a color change, this is known as testing for occult gastrointestinal bleeding. The guiac-based test will turn positive from bleeding anywhere in the GI tract but it will also turn positive if you have had a recent meal of red meat. Other dietary factors and even stool transit time can affect the test outcome."}, {"url": "http://www.aafp.org/afp/2004/0215/p875.html", "passage_text": "Occult gastrointestinal bleeding usually is discovered when fecal occult blood test results are positive or iron deficiency anemia is detected. Fecal occult blood testing methods vary, but all have limited sensitivity and specificity. It is normal to lose 0.5 to 1.5 mL of blood daily in the gastrointestinal tract, 3 and melena usually is identified when more than 150 mL of blood are lost in the upper gastrointestinal tract. 3 FOBTs have sufficient sensitivity to detect bleeding that is not visible in the stool."}, {"url": "https://en.wikipedia.org/wiki/Fecal_occult_blood", "passage_text": "Fecal occult blood (FOB) refers to blood in the feces that is not visibly apparent (unlike other types of blood in stool such as melena or hematochezia). In the event of a positive fecal occult blood test, the next step in the workup is a form of visualization of the gastrointestinal tract by one of several means: 1  Sigmoidoscopy, an examination of the rectum and lower colon with a lighted instrument to look for abnormalities, such as polyps."}, {"url": "http://www.mayoclinic.org/tests-procedures/fecal-occult-blood-test/basics/results/PRC-20014429", "passage_text": "1 A fecal occult blood test is considered positive if blood is detected in your stool samples. 2  You may need additional testing — such as a colonoscopy — to locate the source of the bleeding. 1 If you had the test to screen for colon cancer and you're at average risk — you have no colon cancer risk factors other than age — your doctor may recommend waiting one year and then repeating the test. 2  Positive result. 3 "}, {"url": "https://en.wikipedia.org/wiki/Fecal_occult_blood", "passage_text": "(December 2008). Fecal occult blood (FOB) refers to blood in the feces that is not visibly apparent (unlike other types of blood in stool such as melena or hematochezia). A fecal occult blood test (FOBT) checks for hidden (occult) blood in the stool (feces). Newer tests look for globin, DNA, or other blood factors including transferrin, while conventional stool guaiac tests look for heme. In the event of a positive fecal occult blood test, the next step in the workup is a form of visualization of the gastrointestinal tract by one of several means: 1  Sigmoidoscopy, an examination of the rectum and lower colon with a lighted instrument to look for abnormalities, such as polyps."}, {"url": "http://www.answers.com/Q/What_does_heme-negative_stool_mean", "passage_text": "Depends if it is a fresh blood or a digested one and its severity. Fresh ones are usally due to hemorrhoids but some do happen because of the cancers close to the anus … . Anything higher in the intestine will look black, due to its digestion. A severe ulcer bleeding might turn the whole stool black. there could be a false positive on the guiac if you have had iron supplements or eaten somthing with a high amount of iron within 1-2 days prior to the test, as this is what the guiac test looks for. This is something that needs to be taken care of by your doctor."}, {"url": "http://www.aafp.org/afp/2004/0215/p875.html", "passage_text": "Occult bleeding (i.e., gastrointestinal bleeding that is not visible to the patient or physician) typically is discovered when giron deficiency anemia is detected or the result of a fecal occult blood test (FOBT) is positive. It is normal to lose 0.5 to 1.5 mL of blood daily in the gastrointestinal tract, 3 and melena usually is identified when more than 150 mL of blood are lost in the upper gastrointestinal tract. 3 FOBTs have sufficient sensitivity to detect bleeding that is not visible in the stool."}, {"url": "https://en.wikipedia.org/wiki/Stool_guaiac_test", "passage_text": "The stool guaiac test or guaiac fecal occult blood test (gFOBT) is one of several methods that detect the presence of fecal occult blood (FOB) which is blood in the feces that cannot be seen. Heme, a component of hemoglobin found in blood, catalyzes this reaction, giving a result in about two seconds. Therefore, a positive test result is one where there is a quick and intense blue color change of the film."}, {"url": "http://www.wdxcyber.com/ncanc10.htm", "passage_text": "The most commonly used method is the guaiac-based fecal occult blood test. It usually picks up about a daily blood loss of about 10 ml (about two teaspoonfuls). Normally, there is only about 0.5 to 1.5 ml of blood a day that escapes blood vessels into the stool each day. There are more sensitive tests than the guiac such as a heme-porphyrin test or a immunochemical test, but the former test is not used much due to the high false positive rate. The guiac-based test will turn positive from bleeding anywhere in the GI tract but it will also turn positive if you have had a recent meal of red meat. Other dietary factors and even stool transit time can affect the test outcome."}]