[{"url": "http://busycooks.about.com/od/chickenrecipes/a/howtocookchixbr.htm", "passage_text": "You will have moister chicken if you cook to 160 degrees F. According to Dr. O. Peter Snyder, the chicken has to reach a temperature of 160 degrees F for 5.2 seconds to kill pathogens. Many experts recommend that chicken breast meat must be cooked to an internal temperature of 170 degrees F, but others say 160 degrees F is fine."}, {"url": "http://busycooks.about.com/od/chickenrecipes/a/howtocookchixbr.htm", "passage_text": "So cook the chicken to a safe internal temperature and your food will always be safe. So buy yourself a reliable meat thermometer you can buy at Amazon.com and get ready to always make moist, tender, and juicy boneless, skinless chicken breasts. Many experts recommend that chicken breast meat must be cooked to an internal temperature of 170 degrees F, but others say 160 degrees F is fine."}, {"url": "http://whatscookingamerica.net/Q-A/ChickenCook.htm", "passage_text": "I just ignore their inaccurate times and use the following logic: One and a half hours is much too long to cook the chicken at 350 degrees F. The time your chicken will bake in the oven does depend on the internal temperature and the size of your chicken or chicken pieces. Generally I bake chicken at 350 degrees F. for 30 to 40 minutes. Internal Description. Poultry. Remember that the chicken will continue to cook after it's removed from the heat and the internal temperature will rise about 5 to 10 degrees F. in the first few minutes it's off the heat."}, {"url": "http://bbq.about.com/od/chicken/ss/aa022109a.htm", "passage_text": "By about 30 minutes the chicken should be mostly cooked and ready for sauce. If you are not going to be putting barbecue sauce on your chicken then continue cooking until the internal temperature reaches 165 degrees F. (74 degrees C.) Go to step 9 for more details. You need to reach and internal temperature on 165 degrees F. (74 degrees C.). Check all the pieces of chicken to be certain that they are indeed, cooked. Once you have hit the target temperature remove the chicken from the grill. Cover and allow to rest for about 5 minutes then serve."}, {"url": "http://www.recipetips.com/kitchen-tips/t--911/chicken-cooking-times.asp", "passage_text": "The correct chicken cooking times and the precise temperatures for cooking chicken are extremely important. The optimum flavor and tenderness of chicken can be consistently achieved when care is taken to follow the recommended time and temperature guidelines for cooking chicken. Remove the chicken from the oven when the meat thermometer reaches 180 ° F. If it is necessary to use a turkey-size oven bag for a chicken, gather the oven bag loosely around the meat allowing room for heat circulation; then close the bag with a nylon tie, and cut away any excess oven bag."}, {"url": "http://ochef.com/1053.htm", "passage_text": "If you handle chicken properly, but cook it to a lower temperature, you may be exposing yourself to a very slight risk of food poisoning, but eating consistently tasty chicken. We try never to roast a chicken beyond 160°F in the breast, but that s our choice. This goes to the very heart of the liberal/conservative debate  and, as you can imagine, it s not pretty. Our government says that you should cook a whole chicken until the temperature measured in the thigh is 180°F (82°C). If you cook chicken pieces, the government says, the thigh, wings, and drumsticks should be 180°F, while the breast should reach 170°F (77°C)"}, {"url": "http://busycooks.about.com/od/chickenrecipes/a/howtocookchixbr.htm", "passage_text": "Now the USDA is recommending that, because of bird flu fears, chicken should be cooked to a temperature of 165 degrees F. Remember that the meat will continue to cook after it's removed from the heat; the internal temperature will rise about 5-10 degrees in the first few minutes it's off the heat. Many experts recommend that chicken breast meat must be cooked to an internal temperature of 170 degrees F, but others say 160 degrees F is fine."}, {"url": "http://www.thekitchn.com/the-right-internal-temperature-for-cooked-chicken-quick-kitchen-facts-216074", "passage_text": "165 degrees Fahrenheit is the safe internal temperature for both the white meat and dark meat. If you don't have a thermometer, an easy visual clue is that all the juices that come from the chicken should run clear and not be pink. Kitchen Fact Source: Safe Minimum Cooking Temperatures at Foodsafety.gov. And unlike beef or lamb which is okay to eat rare or medium rare, you want your chicken cooked through to avoid getting anyone sick. Kitchen Fact: The safe internal temperature for cooked chicken is 165° Fahrenheit (75° Celsius). A meat or instant-read thermometer is your best bet for determining the temperature of your chicken, and if you're cooking a whole bird, it should be inserted into the thickest part of the thigh but not touching bone"}]