[{"url": "http://digitalcommons.calpoly.edu/cgi/viewcontent.cgi?article=1043&context=socssp", "passage_text": "Topic: The history of the Indian caste system and its effects on India today c. Thesis: The Indian Caste System is historically one of the main dimensions where people in India are social differentiated through class, religion, region, tribe, gender, and language. He also explains the caste system and the role it plays in the division of labor in the Indian society. This book will really help me dive into the Indian caste system and will provide me with an overall and deeper view into the many aspects of the caste system and its effects on India today."}, {"url": "https://en.wikipedia.org/wiki/Caste_system_in_India", "passage_text": "A 1995 study notes that the caste system in India is a system of exploitation of poor low-ranking groups by more prosperous high-ranking groups. In India, 36.3% of people own no land at all, 60.6% own about 15% of the land, with a very wealthy 3.1% owning 15% of the land. The origin of caste system of modern form, in Bengal-region of India, may be traceable to this period, states Richard Eaton. The medieval era Islamic Sultanates in India, he writes, utilized social stratification to rule and collect tax revenue from non-Muslims."}, {"url": "http://www.wisegeek.org/what-is-a-caste-system.htm", "passage_text": "The caste system in India was most shameless practice in this world, worse than the racism. It was started as a classification on the basis of one's occupation. In that system, there could more than one caste in a family on the basis of one's occupation. The original caste system is a division of people into four essential groups, the spiritually inclined people (Brahmins), the security personnel (Kshatriyas), the producers of the means of livelihood (Visayas) and the instruction followers (Sudras)."}, {"url": "http://www.wisegeek.org/what-is-a-caste-system.htm", "passage_text": "10 hilariously insightful foreign words. A caste system is a type of social structure which divides people on the basis of inherited social status. Although many societies could be described in this way, within a caste system, people are rigidly expected to marry and interact with people of the same social class. The original caste system is a division of people into four essential groups, the spiritually inclined people (Brahmins), the security personnel (Kshatriyas), the producers of the means of livelihood (Visayas) and the instruction followers (Sudras)."}, {"url": "http://www.raceandhistory.com/historicalviews/casteindia.htm", "passage_text": "Trinicenter Special Abstract of Article Location: (www.hrw.org) India s caste system is perhaps the world s longest surviving social hierarchy. A defining feature of Hinduism, caste encompasses a complex ordering of social groups on the basis of ritual purity. "}, {"url": "https://en.wikipedia.org/wiki/Caste_system_in_India", "passage_text": "The caste system in India is a system of social stratification which has pre-modern origins, was transformed by the British Raj, and is today the basis of reservation in India. It consists of two different concepts, varna and jāti, which may be regarded as different levels of analysis of this system. The origin of caste system of modern form, in Bengal-region of India, may be traceable to this period, states Richard Eaton. The medieval era Islamic Sultanates in India, he writes, utilized social stratification to rule and collect tax revenue from non-Muslims."}, {"url": "http://asianhistory.about.com/od/india/p/indiancastesystem.htm", "passage_text": "The Caste System in Brief: The origins of the caste system in India and Nepal are shrouded, but it seems to have originated more than two thousand years ago. Under this system, which is associated with Hinduism, people were categorized by their occupations. Although originally caste depended upon a person's work, it soon became hereditary. "}, {"url": "http://digitalcommons.calpoly.edu/cgi/viewcontent.cgi?article=1043&context=socssp", "passage_text": "The Indian Caste System is considered a closed system of stratification, which means that a person’s social status is obligated to which caste they were born into. There are limits on interaction and behavior with people from another social status (Sekhon, 39). He also explains the caste system and the role it plays in the division of labor in the Indian society. This book will really help me dive into the Indian caste system and will provide me with an overall and deeper view into the many aspects of the caste system and its effects on India today."}, {"url": "http://www.mapsofindia.com/my-india/india/caste-system-in-india-and-its-changing-scenario", "passage_text": "Origin of Caste System in India. Earlier, the caste of a person in India used to define his or her occupation and till death the person had to stick to that occupation. People from upper caste were not allowed to mingle and marry a person from any other caste. Thereby, castes in India were exactly demarcating the society"}, {"url": "http://digitalcommons.calpoly.edu/cgi/viewcontent.cgi?article=1043&context=socssp", "passage_text": "Introduction The Indian Caste System is historically one of the main dimensions where people in India are socially differentiated through class, religion, region, tribe, gender, and language. He also explains the caste system and the role it plays in the division of labor in the Indian society. This book will really help me dive into the Indian caste system and will provide me with an overall and deeper view into the many aspects of the caste system and its effects on India today."}]