[{"url": "http://www.allbusinessschools.com/business-careers/marketing/salary/", "passage_text": "As with almost all careers, the higher degree you hold, the higher your salary: A can add $2,000 to $5,000 or more per year in earning potential, while an MBA can add yet another $7,000 to $11,000, though many MBAs start out in higher-level management jobs with more responsibility, and consequently earn a larger salary. A general brand manager will make about $5,000 less than a package design manager, even though package design is only one part of a brand manager's responsibilities. Marketing salaries at the highest levels of a marketing professional's career only tell part of the story. Stock options, bonuses, benefits and other company perks can increase the base salary by 10 percent or more. Here are some statistics on salaries, job growth, and employer types for marketing professionals"}, {"url": "http://www.allbusinessschools.com/business-careers/marketing/salary/", "passage_text": "The BLS reports that the upper 10 percent of marketing managers earned more than $187,200, as did managers in advertising and promotions. Market research analysts in the top ten percent earned more than $113,500. A general brand manager will make about $5,000 less than a package design manager, even though package design is only one part of a brand manager's responsibilities. Marketing salaries at the highest levels of a marketing professional's career only tell part of the story. Stock options, bonuses, benefits and other company perks can increase the base salary by 10 percent or more. Here are some statistics on salaries, job growth, and employer types for marketing professionals"}, {"url": "http://work.chron.com/much-finance-majors-make-right-out-college-23789.html", "passage_text": "The median-earning half of graduates with a master's in finance made between $58,600 and $83,900 out of the gate. Financial managers in the finance and insurance industry who held a master's degree in finance reported an average starting salary of $85,600 per year. Financial analysts with a bachelor's in finance started their jobs earning an average of $55,700 per year, while accountants and auditors averaged $50,400 per year to start."}, {"url": "http://money.usnews.com/careers/best-jobs/marketing-manager/salary", "passage_text": "Marketing managers earned a median annual wage of $123,220 in 2013, according to the BLS. The best-paid 10 percent in the field made more than $187,199 per year, while the bottom 10 percent made less than $64,440. The best-paying jobs are located in the metropolitan areas of San Jose, California; Williamsport, Pennsylvania; and New York City."}, {"url": "https://answers.yahoo.com/question/index?qid=20090504232446AAYoRCp", "passage_text": "Anyways, I really want to major in business so I was just curious and what are your thoughts on majoring in Marketing. How much does the average marketing major receive, what are some types of jobs they perform, and would it be a good base to get my MBA after. Anyways, I really want to major in business so I was just curious and what are your thoughts on majoring in Marketing. How much does the average marketing major receive, what are some types of jobs they perform,... show more I'm going to begin attending collage in the fall, Ill be graduating high school this yea"}, {"url": "http://www.sbbcollege.edu/s/mba-salary-guide/", "passage_text": "At present, the average starting salary for MBA graduates can be as high as $110,000 to $130,000 per year for those graduating from top ranked institutions, while MBA graduates from other schools can earn in the range of $75,000 to $90,000 per year. Across the US there has been a range of average salaries evident, based on the economy of a city or state, along with the economic growth and stability of that particular business, as well as the cost of living locally. Here are some average MBA graduate salaries based on state: 1  California – $96,599. 2  New York – $95,083."}, {"url": "http://work.chron.com/much-graphic-designer-make-year-3629.html", "passage_text": "Assuming 2,080 hours of a work a year, this translates to an average annual income of $48,690 a year. Graphic designers in the top 10 percent made more than $77,370, and workers in the bottom 10 percent made less than $26,210. Fifty percent of all graphic designers earned annual incomes between $33,410 and $59,410. "}, {"url": "http://www.ehow.com/info_12158775_much-money-marketing-graduate-masters-degree-make.html", "passage_text": "Marketing managers made salaries ranging from about $58,000 to $166,000 per year in 2010, according to the Bureau of Labor Statistics. This wide range reflects the pay earned by all marketing managers, regardless of education level. Those with a master's degree are more likely to make the median salary or higher. The bureau notes that the median salary for those working in this field was nearly $113,000 per year. Factors such as where the marketing MBA graduate received his education can have an influence on how much he is paid. For instance, the Fisher College of Business at Ohio State University reports an average salary of $78,040 per year and a salary range of $50,000 to $97,000, as of 2010"}]