[{"url": "http://support.xbox.com/xbox-one/apps/dvd-blu-ray-setup", "passage_text": "To watch Blu-ray or DVD movies on your Xbox One, you first have to install the Blu-ray app. To install the app, choose one of the following options. Install from Xbox Home. 1  From Xbox Home, go to Store."}, {"url": "http://support.xbox.com/xbox-one/apps/dvd-blu-ray-setup", "passage_text": "Overview. To watch Blu-ray or DVD movies on your Xbox One, you first have to install the Blu-ray app. To install the app, choose one of the following options. Install from Xbox Home. 1  From Xbox Home, go to Store. 2  Select the Apps category from the Categories section."}, {"url": "http://gaming.stackexchange.com/questions/42144/can-i-play-uk-region-2-dvds-on-a-us-region-1-xbox-360", "passage_text": "Your only option (short of modding the console, which you probably don't want to do if you play online) is to get a region-free DVD player or a region-free DVD-ROM and rip your DVDs into a video format that the Xbox recognizes to play them from an external drive or streamed from a computer."}, {"url": "http://www.ask.com/technology/xbox-360-play-blu-ray-discs-990ad526bb7ec990", "passage_text": "Xbox 360 consoles do not support Blu-ray disc playback. However, all Xbox 360 consoles do play DVDs. Each console follows international standards and is manufactured under a specific DVD region. The Xbox 360 also supports most digital movie file formats, such as AVI and MP4."}, {"url": "https://answers.yahoo.com/question/index?qid=20070412102607AAOmXSe", "passage_text": "The DVD Playback Kit checks the ESRB rating for the DVD, and ensures that it meets the content rating parameters set in your parental controls. The 360: To play DVD movies: Press the eject button on the Xbox 360 console (or select Open Tray from any area of the Xbox Dashboard) to open the disc tray. Place a DVD movie on the disc tray with the label facing up (to the right if the console is vertical). Press the eject button (or select Close Tray from any area of the Xbox Dashboard) to close the disc tray. The DVD movie will begin playing."}, {"url": "http://www.dummies.com/how-to/content/playing-dvds-on-your-xbox.html", "passage_text": "• Pop the DVD into the tray (like a game disc). • Switch the console power on with a DVD in the drive. 1  If you have a movie in the drive when you're using the Dashboard, you can pick the Play DVD option from the bottom of any of the blades."}, {"url": "http://www.ehow.com/facts_5311561_xbox-drive-play-bluray-disks.html", "passage_text": "Before you can watch a movie on your Xbox One, you'll need to install the Blu-ray/DVD app on the console. When inserting a movie for the first time, your console will prompt you to install the application. If you bypassed this screen, go to Store from the dashboard, followed by Apps.."}]