[{"url": "http://www.grammar-monster.com/lessons/interjections.htm", "passage_text": "Interjections are words used to express strong feeling or sudden emotion. They are included in a sentence (usually at the start) to express a sentiment such as surprise, disgust, joy, excitement, or enthusiasm. An interjection is not grammatically related to any other part of the sentence. An interjection is a word added to a sentence to convey an emotion or a sentiment such as surprise, disgust, joy, excitement, or enthusiasm. For example: An interjection is not grammatically related to any other part of the sentence. 1  No, go away. 2  Indeed, I intend to leave as soon as possible."}, {"url": "https://en.wikipedia.org/wiki/Interjection", "passage_text": "In grammar, an interjection or exclamation is a word used to express a particular emotion or sentiment on the part of the speaker (although most interjections have clear definitions). Filled pauses such as uh, er, um are also considered interjections. Interjections are often placed at the beginning of a sentence. An interjection is sometimes expressed as a single word or non-sentence phrase, followed by a punctuation mark. The isolated usage of an interjection does not represent a complete sentence in conventional English writing."}, {"url": "http://careersplay.com/what-is-an-interjection-kinds-and-list-with-examples/", "passage_text": "What is an interjection, kinds and list with examples. What is an interjection, kinds and list with examples: Sometimes we need to express our feelings with some extra amount of energy. From here the concept of interjection comes into action. These are very common words we use in our general English language. "}, {"url": "http://www.englishleap.com/grammar/interjections", "passage_text": "| Login. Interjections are small words that bear no grammatical connection with the sentences in which they are used. They express the emotions or sentiments of the speaker or convey hesitation or protest. They are usually followed by an exclamation mark. "}, {"url": "http://partofspeech.org/interjection/", "passage_text": "Interjection: Definition and Examples. The interjection is a part of speech which is more commonly used in informal language than in formal writing or speech. Basically, the function of interjections is to express emotions or sudden bursts of feelings. They can express a wide variety of emotions such as: excitement, joy, surprise, or disgust. "}, {"url": "http://grammar.about.com/od/il/g/interjecterm.htm", "passage_text": "Definition. A short utterance that usually expresses emotion and is capable of standing alone. Interjections are generally considered one of the traditional parts of speech. In writing, an interjection is typically followed by an exclamation point. Common interjections in English include oops, ouch, gee, oh, ah, ooh, eh, ugh, aw, yo, wow, brr, sh, and yippee. See Examples and Observations below. Also see:  1 Oh, Wow!: Notes on Interjections. 2  Asterismos. 3  Ecphonesis. 4  Exclamation. 5  Minor Sentence"}, {"url": "http://www.chompchomp.com/terms/interjection.htm", "passage_text": "To capture short bursts of emotion, you can use an interjection, which is a single word, phrase, or short clause that communicates the facial expression and body language that the sentence itself will sometimes neglect. Interjections are thus like emoticons. "}, {"url": "http://www.gallaudet.edu/tip/english-center/grammar-and-vocabulary/conjunctions-and-interjections.html", "passage_text": "Conjunctions and Interjections. A conjunction is a word that connects phrases, words, or clauses. Conjunctions are often used as transitions. An interjection is an exclamatory word (or words) that shows strong or sudden feeling and has no grammatical function in the construction of a sentence, such as Ah ha!."}, {"url": "http://www.grammar-monster.com/lessons/interjections.htm", "passage_text": "Search. An interjection is a word added to a sentence to convey an emotion or a sentiment such as surprise, disgust, joy, excitement, or enthusiasm. For example: An interjection is not grammatically related to any other part of the sentence. 1  No, go away. 2  Indeed, I intend to leave as soon as possible."}, {"url": "http://softschools.com/examples/grammar/interjections_examples/90/", "passage_text": "Interjections. Interjections are a part of speech that are exclamations. They usually come at the beginning of a sentence, and they are used to show strong emotion, surprise, or excitement. Interjections are not related to any other words in the sentence. They just serve to show emotion or to introduce the sentence. Interjections that do not show such strong emotion are still set apart from the sentence with a comma. Some interjections do not express very strong emotion, and they are used to introduce the sentence. They are introductory words."}]