[{"url": "http://www.athropolis.com/arctic-facts/fact-inuit-beliefs.htm", "passage_text": "The Spirits of All Things Traditional Inuit beliefs are a form of animism, according to which all objects and living things or beings have a spirit. The belief is that all things happen though the involvement of some spirit. Spirits can affect people's lives and can be controlled by magical charms and talismans. "}, {"url": "https://en.wikipedia.org/wiki/Inuit_religion", "passage_text": "Others would argue that the reverse is true, the Inuit having adapted Christianity to their worldview. Inuit traditional cosmology is not religion in the usual theological sense, and is similar to what most people think of as mythology only in that it is a narrative about the world and the place of people in it. In the words of Inuit writer Rachel Attituq Qitsualik: Since the arrival of Christianity among the Inuit, anirniq has become the accepted word for a soul in the Christian sense. This is the root word for other Christian terms: anirnisiaq means angel and God is rendered as anirnialuk, the great spirit."}, {"url": "https://en.wikipedia.org/wiki/Inuit_religion", "passage_text": "Inuit mythology has many similarities to the religions of other peoples of the North Polar region. Since the arrival of Christianity among the Inuit, anirniq has become the accepted word for a soul in the Christian sense. This is the root word for other Christian terms: anirnisiaq means angel and God is rendered as anirnialuk, the great spirit."}, {"url": "http://firstpeoplesofcanada.com/fp_groups/fp_inuit5.html", "passage_text": "1 The Inuit believed in animism: all living and non-living things had a spirit. 2  That included people, animals, inanimate objects, and forces of nature. 3  When a spirit died, it continued living in a different world-the spirit world. The Inuit lived in an area comprising a large part of northern Earth, including Northern Canada. Parts of the Yukon, NWT, Nunavut, Quebec and Labrador were settled by the first peoples of the Canadian Arctic. Religion. 1  The Inuit believed in animism: all living and non-living things had a spirit. 2  That included people, animals, inanimate objects, and forces of nature"}, {"url": "http://www.sacred-texts.com/nam/inu/index.htm", "passage_text": "Inuit is the term preferred for speaking of the people commonly known as Eskimo—the word Eskimo being derived from a derogatory term (meaning eaters of raw flesh) used by the Algonquin people of North America. "}, {"url": "http://www.studymode.com/essays/Inuit-Religion-121067.html", "passage_text": "Inuit religion has been around for as long as there have been Inuit. The Inuit religion is not the same as it was a thousand years ago. A thousand years ago the Inuit religion was basically referred to as animism. Animism is the belief that everything has a soul, including the animals (Watson, Bratton, no date). The Inuit religion of the past was centered on myths, rituals and beliefs. "}, {"url": "https://en.wikipedia.org/wiki/Inuit", "passage_text": "Inuit is not accepted as a term for the Yupik, and Eskimo is the only term that includes Yupik, Inupiat iñupiat And. Inuit, However aboriginal peoples In canada And greenland View eskimo as, pejorative And inuit has become more. common Inuit are the descendants of what anthropologists call the Thule culture, who emerged from western Alaska, after crossing from Siberia, around 1000 CE and spread eastwards across the Arctic. They displaced the related Dorset culture, the last major Paleo-Eskimo culture (in Inuktitut, called the Tuniit)."}, {"url": "https://www.uaf.edu/anlc/resources/inuit-eskimo/", "passage_text": "Most Alaskans continue to accept the name Eskimo, particularly because Inuit refers only to the Inupiat of northern Alaska, the Inuit of Canada, and the Kalaallit of Greenland, and it is not a word in the Yupik languages of Alaska and Siberia. 1  Comparative Yupik and Inuit. However, the people of Canada and Greenland prefer other names. Inuit, meaning people, is used in most of Canada, and the language is called Inuktitut in eastern Canada although other local designations are used also."}]