[{"url": "http://chemistryhomework.weebly.com/", "passage_text": "The Ostwald Process. The process I chose to research was the Ostwald process. The Ostwald process is a chemical process that in two stages, converts ammonia to nitric acid (also known as HNO3). In the process for step 1, ammonia is oxidized to form nitric oxide and also nitrogen dioxide. Then in step 2, the nitrogen dioxide that was formed is absorbed in water. This in-turn forms nitric acid(www.pem-news.de, n.d.).The Ostwald process has many well-known uses in both the industrial and health field."}, {"url": "http://www.bbc.co.uk/bitesize/standard/chemistry/plasticsandothermaterials/fertilisers/revision/7/", "passage_text": "Ostwald Process-oxidation of ammonia. As you have studied, reacting nitrogen and oxygen is not an economic way of making nitric acid. The chemist Ostwald discovered a way to react oxygen and ammonia-the first step in nitric acid manufacture."}, {"url": "http://ostwald.weebly.com/", "passage_text": "The Ostwald process is a chemical process that in two stages converts ammonia to nitric acid (also known as HNO3). Ammonia is oxidized to form nitric oxide and also nitrogen dioxide. Then nitrogen dioxide that was formed is absorbed in water, which forms nitric acid."}, {"url": "http://www.ch.ic.ac.uk/rzepa/mim/environmental/html/nitric_text.htm", "passage_text": "Nitric Acid. Nitric acid (HNO 3) is an extremely important chemical used in the manufacture of fertilisers and explosives. It is made from ammonia by the Ostwald Process (developed in 1902 by the German chemist Wilhelm Ostwald, who got the Nobel prize in 1909). This process reacts together O 2 and NH 3 at 850°C and 5 atmospheres pressure, with the help of Platinum and Rhodium catalysts, to make NO."}, {"url": "http://www.chm.bris.ac.uk/motm/nitric/nitrich.htm", "passage_text": "Nitric acid (HNO 3) is an extremely important chemical used in the manufacture of fertilisers and explosives. It is made from ammonia by the Ostwald Process which was developed in 1902 by the German chemist Wilhelm Ostwald (below, left), who got the Nobel prize for Chemistry in 1909."}, {"url": "http://www.reciprocalnet.org/recipnet/showsample.jsp?sampleId=27344705", "passage_text": "Layman's explanation: Nitric acid was first discovered in 1648 by a German chemist, Johann Rudolf. However, in 1901 Wilhelm Ostwald developed the Ostwald Process, which became the principle way of producing nitric acid."}]