[{"url": "https://en.wikipedia.org/wiki/Minority_business_enterprise", "passage_text": "A Minority Business Enterprise (MBE) is an American term which is defined as a business which is at least 51% owned, operated and controlled on a daily basis by one or more (in combination) American citizens of the following ethnic minority and/or gender (e.g. woman-owned) and/or military veteran classifications: "}, {"url": "http://www.inc.com/guides/2010/05/minority-owned-business-certification.html", "passage_text": "Many states and cities also have minority-owned business programs, which are often referred to as Minority Business Enterprise (MBE) programs. Maryland, for instance, has a legally mandated program that requires 25 percent of all government contracts to be filled by minority-owned businesses. How to Get Certified as a Minority-Owned Business. Having a minority-owned business certification can help you tap into a bevy of public and private sector programs. Here's how to apply."}, {"url": "http://blogs.findlaw.com/free_enterprise/2014/05/do-you-quality-as-a-minority-owned-business.html", "passage_text": "Follow @BrettASnider. Minority-owned businesses may be entitled to government benefits and special programs, but not every business will qualify. And claiming to be a minority-owned business when you're not is a terrible idea, as Moretech American Corporation has learned the hard way. 1 To apply for the 8(a) Business Development program as a minority-owned business, follow the steps listed on the SBA's website. 2  Be warned, even when applying online, this process will be time consuming."}, {"url": "http://askthemoneycoach.com/2009/03/how-to-qualify-for-certification-as-a-minority-owned-business/", "passage_text": "A Minority Business Enterprise (MBE) is any business that is at least 51% owned, operated and controlled by an American citizen or citizens of the following ethnic groups: 1  African American. 2  Asian American. 3  Latino/Hispanic American. "}, {"url": "http://www.inc.com/guides/2010/05/minority-owned-business-certification.html", "passage_text": "'It really is in the state's best interest to use all of our small businesses, including our minority-and woman-owned firms,' Jenkins says. Who is eligible: For most programs, at least 51 percent of a business needs to be owned by a member of a minority group in order to qualify for certification. How to Get Certified as a Minority-Owned Business. Having a minority-owned business certification can help you tap into a bevy of public and private sector programs. Here's how to apply."}, {"url": "http://www.nmsdc.org/mbes/mbe-certification/", "passage_text": "Criteria for Certification: 1  United States citizens. 2  Minority businesses must be at least 51% minority-owned operated and controlled. 3  For the purposes of NMSDC’s program, a minority group member is an individual who is at least 25% Asian, Black, Hispanic or Native American. 1 Minority businesses must be at least 51% minority-owned operated and controlled. 2  For the purposes of NMSDC’s program, a minority group member is an individual who is at least 25% Asian, Black, Hispanic or Native American. 3  Minority eligibility is established via a combination of screenings, interviews and site visits."}, {"url": "http://www.mwbe-enterprises.com/mbe/", "passage_text": "Note: Non-For-Profit companies DO NOT qualify for any certifications. Ownership by minority individuals means the business is at least 51% owned by such individuals or, in the case of a publicly-owned business, at least 51% of the stock is owned by one or more such individuals. Further, the management and daily operations are controlled by those minority group members. A minority-owned business is defined as being owned, capitalized, operated and controlled by a member of an identified minority group. The business must be a for-profit enterprise which physically resides in the United States or one of it territories."}, {"url": "http://www.mwbe-enterprises.com/", "passage_text": "MWBE Enterprises was established in 1998 is to assist Women-owned businesses and Minority-owned businesses in successfully achieving either Women's Business Enterprise certification (WBE), Minority Business Enterprises certification (MBE), Disadvantaged Business Enterprise (DBE) certification, 8a and or SDB designation. "}]