[{"url": "http://www.webmd.com/oral-health/guide/dental-bonding?page=2", "passage_text": "Generally, bonding can range in cost from $100 to $400 per tooth. Check with your dental insurance company to find out if the cost of bonding might be fully or partially covered. The lifespan of bonding materials for the teeth depends on how much bonding was done and your oral habits. Typically, however, bonding material lasts from three years up to about 10 years before needing to be touched up or replaced. Costs of dental bonding may vary depending on where you live."}, {"url": "http://www.howmuchisit.org/repairing-a-chipped-tooth-cost/", "passage_text": "1 The bigger the chip is, the more the procedure is going to cost. 2  For example, a composite bonding that requires maintenance every 7 to 10 years can cost anywhere from $100 to $400. 3  A crown or veneer option can last three times longer, and can cost anywhere from $650 to $1,400. 1 According to the website DentalStraightTalk.com, the cost to replace a chipped tooth can cost anywhere from $200 to $500 per tooth depending on the complexity of the issue. 2  This procedure will usually be done using a form of bonding to fix the chip. 3  A chipped tooth procedure can take more than one session"}, {"url": "http://www.everydayhealth.com/dental-health/cosmetic-dentistry/bonding.aspx", "passage_text": "1 The average cost of dental bonding ranges from $300 to $600 per tooth. “ 2 But many dental insurance plans cover most of the cost of bonding, particularly when it is done for structural reasons or to fill a cavity,” says Harms. 3  Speed. 4  Dental bonding typically requires only one office visit. 1 “But many dental insurance plans cover most of the cost of bonding, particularly when it is done for structural reasons or to fill a cavity,” says Harms. 2  Speed. 3  Dental bonding typically requires only one office visit. 4  The entire process can be accomplished in 30 to 60 minutes"}, {"url": "http://health.costhelper.com/dental-bonding.html", "passage_text": "1 Dental bonding is one of the easiest and least expensive cosmetic dental procedures, and unless the bonding is being used to fill a decayed tooth it can be done without anesthesia. 2  Composite bonds typically last about 7-11 years. Dental bonding is a relatively quick and easy procedure, and can be used for a tooth-colored filling in a decayed tooth or as a cosmetic process to improve the look of a discolored or chipped tooth, or to fill gaps between teeth."}, {"url": "http://health.costhelper.com/dental-bonding.html", "passage_text": "What should be included: Additional costs: 1  Dental bonding is one of the easiest and least expensive cosmetic dental procedures, and unless the bonding is being used to fill a decayed tooth it can be done without anesthesia. 2  Composite bonds typically last about 7-11 years. Dental bonding is a relatively quick and easy procedure, and can be used for a tooth-colored filling in a decayed tooth or as a cosmetic process to improve the look of a discolored or chipped tooth, or to fill gaps between teeth."}, {"url": "http://health.costhelper.com/dental-bonding.html", "passage_text": "1 Most dental insurance covers only 50%-80% of the cost of this type of dental bonding, although in some instances insurance may cover most or all of the cost if a composite filling is used to replace a cracked or broken old silver amalgam filling. Dental bonding is a relatively quick and easy procedure, and can be used for a tooth-colored filling in a decayed tooth or as a cosmetic process to improve the look of a discolored or chipped tooth, or to fill gaps between teeth."}, {"url": "http://health.costhelper.com/dental-bonding.html", "passage_text": "1 Dental bonding is best used to make minor corrections; if more extensive work is needed, instead of bonding it might require veneers at $500-$1,300 per tooth or crowns at $500-$3,000 per tooth. Dental bonding is a relatively quick and easy procedure, and can be used for a tooth-colored filling in a decayed tooth or as a cosmetic process to improve the look of a discolored or chipped tooth, or to fill gaps between teeth."}, {"url": "http://www.brynmawrdentalcare.com/bonding/", "passage_text": "The average cost of bonding ranges from $150 to $500 per tooth, while the average cost of a veneer ranges from $700 to $1200 per tooth. Bonding may be performed in one visit, unlike veneers, which are customized and made in a lab. "}, {"url": "http://www.everydayhealth.com/dental-health/cosmetic-dentistry/bonding.aspx", "passage_text": "1 Cost. 2  The average cost of dental bonding ranges from $300 to $600 per tooth. “ 3 But many dental insurance plans cover most of the cost of bonding, particularly when it is done for structural reasons or to fill a cavity,” says Harms. 4  Speed. 1 “But many dental insurance plans cover most of the cost of bonding, particularly when it is done for structural reasons or to fill a cavity,” says Harms. 2  Speed. 3  Dental bonding typically requires only one office visit. 4  The entire process can be accomplished in 30 to 60 minutes"}]