[{"url": "http://smallbusiness.chron.com/insert-ip-addresses-browser-48652.html", "passage_text": "Step 1. Launch your Web browser and click your mouse in the address bar at the top of the window. Ensure that any previously existing text in the address bar is either deleted or selected. Step 2. Type the string “http://” followed by the IP address and then a forward slash."}, {"url": "http://smallbusiness.chron.com/enter-ip-address-address-bar-48824.html", "passage_text": "Step 1. Click in the address bar in your browser. The address in the address bar should be highlighted. Step 2. Press the “Backspace” or “Delete” key to delete the address. Related Reading: How to Purchase a Static IP Address. Step 3. Type the appropriate prefix for the IP address. If you are attempting to access an Internet website or a router, type: http:// If you want to connect to a computer on your local network, type: \\\\ If the IP address is for a File Transfer Protocol file server, type: ftp://. Step 4. Type the numerical"}, {"url": "http://en-americas-support.nintendo.com/app/answers/detail/a_id/671/~/how-to-enter-network-ip-address-and-dns-settings", "passage_text": "1 Select IP Address, then hold down the left arrow to delete the existing IP Address (it defaults to zeros). 2  Enter the IP address listed in within your PC's network information, but add 10 to the last digit. 3  For example, if your PC had an IPv4 address listed as 192.168.1.2, this will become 192.168.1.12."}, {"url": "http://whatismyipaddress.com/using-proxies", "passage_text": "1 Under Proxy server, click to select the Use a proxy server for your LAN check box. 2  In the Address box, type the IP address of the proxy server. 3  In the Port box, type the port number that is used by the proxy server for client connections (by default, 8080)."}, {"url": "http://www.ehow.com/how_5831602_enter-ip-address-address-bar.html", "passage_text": "Instructions. Open your computer's web browser. Move your cursor to your address bar and click inside of it to type an address. If you have a home network using a wired or wireless router, access your router by typing its IP address in the following form: 192.168.2.1."}]