[{"url": "http://www.wisegeek.com/what-is-workplace-slander.htm", "passage_text": "For certain types of slander to be considered workplace slander, they must cause serious workplace defamation. This means the slander must cause serious damage to the employee’s reputation and character, especially in a way that jeopardizes that person’s career. Usually, for slander in the workplace to be considered defamation, it must be presented as fact. Therefore, not all slander in the workplace is actually considered workplace slander, in the legal sense, and can be better categorized as gossip."}, {"url": "http://www.hg.org/defamation.html", "passage_text": "Libel and slander are legal claims for false statements of fact about a person that are printed, broadcast, spoken or otherwise communicated to others. Libel generally refers to statements or visual depictions in written or other permanent form, while slander refers to verbal statements and gestures. "}, {"url": "http://www.justanswer.com/topics-workplace-harassment/", "passage_text": "Depending on the situation, slander is often considered a form of workplace harassment, especially if it is sexually oriented. Heinous lies, verbal attacks as well as vicious rumors can discredit a person and cause not only stress in the workplace, but in personal life as well. Workplace Harassment Law. Harassment at work is a form of employment discrimination, and it’s a violation of the 1964 Civil Rights Act. There are many forms of workplace harassment. In some cases, workplace harassment can be addressed in a court of law, though in many cases, it can be hard to prove."}, {"url": "https://en.wikipedia.org/wiki/Cyberstalking", "passage_text": "Cyberstalking is a criminal offense under various state anti-stalking, slander and harassment laws. A conviction can result in a restraining order, probation, or criminal penalties against the assailant, including jail. "}, {"url": "https://en.wikipedia.org/wiki/Slander", "passage_text": "Defamation —also calumny, vilification, and traducement —is the communication of a false statement that harms the reputation of an individual person, business, product, group, government, religion, or nation as well as other various kinds of defamation that retaliate against groundless criticism. Under common law, to constitute defamation, a claim must generally be false and have been made to someone other than the person defamed. Some common law jurisdictions also distinguish between spoken defamation, called slander, and defamation in other media such as printed words or images, called libel. False light laws protect against statements which are not technically false but misleading"}, {"url": "http://www.nolo.com/legal-encyclopedia/libel-vs-slander-different-types-defamation.html", "passage_text": "Enter Your Zip Code to Connect with a Lawyer Serving Your Area. Libel and slander are types of defamatory statements. Libel is a written defamatory statement, and slander is a spoken or oral defamatory statement. In this article, we'll look at where you might find a defamatory statement, provide some different examples of libel and slander, and more. (For an overview of this area of law, check out Defamation Law Made Simple .). "}, {"url": "http://www.wisegeek.com/what-is-workplace-slander.htm", "passage_text": "Workplace gossip that is presented as fact and hurts someone's reputation can be considered defamation of character. Workplace slander is not limited to the office. Workplace slander often refers to gossip. Workplace slander may cause harm to a person's employment. Usually, for slander in the workplace to be considered defamation, it must be presented as fact. Therefore, not all slander in the workplace is actually considered workplace slander, in the legal sense, and can be better categorized as gossip."}, {"url": "http://www.nolo.com/legal-encyclopedia/defamation-law-made-simple-29718.html", "passage_text": "Defamation is a catch-all term for any statement that hurts someone's reputation. Written defamation is called libel, and spoken defamation is called slander.. Defamation is not a crime, but it is a tort (a civil wrong, rather than a criminal wrong). A person who has been defamed can sue the person who did the defaming. (For in-depth information on defamation claims, check out Nolo's Defamation, Libel & Slander section.)."}]