[{"url": "http://www.balletterms.net/en-croix", "passage_text": "En croix. En croix – “In a cross”. Indicates that an exercise is performed making the shape of a cross – to the front, side, and back. For example, tendus at the barre en croix are performed to the font, then side, then back during the exercise. Comments Off on En croix. Filed under Uncategorized. Comments are closed"}, {"url": "http://www.youtube.com/watch?v=KJ_7qtwuVz0", "passage_text": "Learn how to do soutenu turns, soutenu pique turns and chaines turns from jazz dance expert Liz Piccoli in this Howcast dance video. Now I'm going to demonstrate some jazz turns for you. We're going to go over the sutanu, a sutanu pique turn, and chaine turn. Let's start with a sutanu. "}, {"url": "http://www.merriam-webster.com/dictionary/soutenu", "passage_text": "French, from past participle of soutenir to sustain, from Old French sustenir. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged. To access the complete Unabridged Dictionary, with an additional 300,000 words that aren't in our free dictionary, start a free trial."}, {"url": "http://www.merriam-webster.com/dictionary/soutenu", "passage_text": "Definition of SOUTENU. : executed in a drawn-out manner: sustained. Note that some information is displayed differently in the Unabridged. To access the complete Unabridged Dictionary, with an additional 300,000 words that aren't in our free dictionary, start a free trial."}, {"url": "http://www.translationdirectory.com/glossaries/glossary204.htm", "passage_text": "A. To the side or in second position. a à la seconde usually means a step that moves sideways or a movement done to the side such as grand battement a à. La seconde a technically challenging type of turn is pirouette a, à la seconde where the dancer spins with the working leg in second position. a à la hauteur To the side or in second position. a à la seconde usually means a step that moves sideways or a movement done to the side such as grand battement a à."}, {"url": "http://dance.about.com/od/balletterms/g/Soutenu.htm", "passage_text": "A series of quick turns in ballet. A soutenu begins with a deep plie with the leading leg extended in a tendu position. "}, {"url": "http://www.youtube.com/watch?v=rM_6YHpex_Y", "passage_text": "Soutenu - [soot-new'] Sustained. One leg is drawn smoothly to the other. The step can be performed in placed or turning. www.wish-upon-a-ballet.com. 1  Howto & Style. 2  Standard YouTube License"}, {"url": "http://ballethub.com/ballet-terms-dictionary/", "passage_text": "Dessous is a classical ballet term meaning “under.” This a term used with other terms to describe that a leg or arm should pass behind the other. For example, an assemble assemblé dessous would have the working leg close behind the supporting leg in the. Air it is the opposite of its, counterpart. dessus Passe passé is a classical ballet term “meaning.” Passed it refers to the movement when a dancer goes through a retire, retiré position which is when one leg is bent so it looks like a triangle with the foot placed near the’other leg. s knee"}, {"url": "http://www.step-by-step-dance.com/ballettermspronunciationdefinitions.html", "passage_text": "E. ecarte (ecarté'-ay-kar') Tay this means to step/aside to. Deviate a position where the leg is extended to the. side (echappe'-échappé-ay') Shah pay-to escape moving from 5th to 2nd position by sliding the feet to the ball of-the foot or as. a (jump-efface-effacé') Ay fah say a position with one leg either behind. or in front E. ecarte (ecarté'-ay-kar') Tay this means to step/aside to. Deviate a position where the leg is extended to the. side (echappe'-échappé-ay') Shah pay-to escape moving from 5th to 2nd position by sliding the feet to the ball of-the foot or as. a jump"}]