[{"url": "http://www.urinecolors.com/urine-consistency/cloudy-urine", "passage_text": "Kidney stones may cause cloudy urine. They can cause pus in the urine, which gives your pee that milky or cloudy look. If you have kidney stones, the pain of the stones may lead you to see a doctor more quickly than the cloudy urine. Some possible cloudy urine causes are: Food can cause a change in the consistency and color of your urine, although they are not the usual cause of cloudy urine. Blood in urine-When the blood is microscopic, it may not show bright red or dark red but rather it may appear as cloudy urine."}, {"url": "http://www.urinecolors.com/urine-consistency/cloudy-urine", "passage_text": "A urinary tract infection-a UTI can cause cloudy urine. The urinary tract infection may be accompanied with burning or painful urination. A bladder infection (a more specific type of urinary tract infection), also known as Cystitis, may cause cloudy urine. Some possible cloudy urine causes are: Food can cause a change in the consistency and color of your urine, although they are not the usual cause of cloudy urine. Blood in urine-When the blood is microscopic, it may not show bright red or dark red but rather it may appear as cloudy urine."}, {"url": "http://www.medicinenet.com/cloudy_urine/symptoms.htm", "passage_text": "Normal urine is clear and has a straw-yellow color. When the urine does not have its characteristic clear appearance, it is often referred to as cloudy, turbid, or foamy urine. Cloudy or foamy urine may occur occasionally due to mild dehydration; when it occurs in the absence of symptoms and goes away rapidly, it is usually of little consequence. Certain conditions can cause excess protein or crystalline substances in the urine, causing it to persistently appear cloudy or foamy. Infections anywhere in the urinary tract can cause blood and pus to appear in the urine, giving it a cloudy appearance. Additionally, many of the numerous causes of blood in the urine can yield a cloudy or murky appearance to the urine due to the presence of blood"}, {"url": "https://answers.yahoo.com/question/index?qid=20100328142233AAPFEqt", "passage_text": "Best Answer: Yellow is NOT a normal color, nor is cloudiness normal. If your urine is yellow, you're dehydrated. The normal color should be clear or perhaps the color of lemonade (just a slight hint of yellow that can't be seen easily). This is a serious condition. The medical community either overlooks the signs of dehydration or else ignores them completely."}, {"url": "http://www.healthgrades.com/symptoms/cloudy-urine", "passage_text": "Healthy urine is clear and light yellow in color. Urine may appear cloudy for a variety of reasons, some of which are not harmful, such as foaming of the urine that occurs temporarily when urinating rapidly."}, {"url": "http://www.healthgrades.com/symptoms/cloudy-urine", "passage_text": "Cloudy urine can be caused by a variety of conditions, including vaginal discharge, sexually transmitted diseases, dehydration, certain autoimmune disorders, as well as infection, inflammation, or other conditions of the urinary tract (kidneys, ureters, bladder and urethra). Urine may appear cloudy for a variety of reasons, some of which are not harmful, such as foaming of the urine that occurs temporarily when urinating rapidly."}, {"url": "http://symptomchecker.webmd.com/single-symptom?symptom=cloudy-urine-with-strong-odor&symid=52", "passage_text": "Cloudy urine with strong odor. WebMD Symptom Checker helps you find the most common symptom combinations and medical conditions related to cloudy urine with strong odor. Click on the combination that matches your symptoms to find the conditions that may cause these problems."}, {"url": "http://www.urinecolors.com/urine-consistency/cloudy-urine", "passage_text": "If your cloudy urine is caused by a urinary tract infection, or bladder infection, it is usually treated by simple antibiotics and clears up within a couple of weeks. If your cloudy urine is caused by a kidney stone… you’ll usually know it, as the pain can be pretty intense. Some possible cloudy urine causes are: Food can cause a change in the consistency and color of your urine, although they are not the usual cause of cloudy urine. Blood in urine-When the blood is microscopic, it may not show bright red or dark red but rather it may appear as cloudy urine."}, {"url": "http://www.urinecolors.com/urine-consistency/cloudy-urine", "passage_text": "There are a variety of cloudy urine causes. If your urine color is cloudy or looks like milky urine, it could be nothing to worry about … or it could be a sign of a serious illness. Keep in mind that cloudy urine is a symptom and not an illness by itself. Some possible cloudy urine causes are: Food can cause a change in the consistency and color of your urine, although they are not the usual cause of cloudy urine. Blood in urine-When the blood is microscopic, it may not show bright red or dark red but rather it may appear as cloudy urine."}]