[{"url": "http://www.mdjunction.com/forums/hypothyroidism-discussions/general-support/1851997-how-long-before-meds-work", "passage_text": "5 years ago. It is different for everyone how long the meds take to work. You should be scheduled for a blood test at about 6 - 8 weeks after starting levothyroxine. At that point your dosage may be adjusted, and then another blood test at 6 - 8 weeks."}, {"url": "http://www.healthboards.com/boards/thyroid-disorders/393149-how-long-before-thyroid-meds-start-work.html", "passage_text": "I was wondering how long it takes before the thyroid medicine starts working. I was diagnosed with Hashi's last week (TSH 65 - under 3 normal, FT4 and T3 under 1, Antibody 600 - normal under 40), and started taking 125 mcg of Synthroid Monday."}, {"url": "http://chriskresser.com/three-reasons-why-your-thyroid-medication-isnt-working/", "passage_text": "Summer…it can take a long time for the Synthroid to start working. Like say upwards of 3 months. We do tests for thryoid at my job and our patients have to be off their Synthroid for a minimum of 3 weeks before the test can be done. It takes a long time to get in and out of your system."}, {"url": "http://www.marksdailyapple.com/forum/thread95335.html", "passage_text": "Senior Member. It takes 6 weeks to have its full effect. You're doctor should have instructed you to come back for blood work at 6 weeks, then your dose can be adjusted if need be. Be patient, adjusting thyroid meds is a delicate process-and it can take 6 months to a year to get it right. I started on Armour about year ago-I felt better after a couple months-but it did nothing for my weight. 09-22-2013, 01:28 PM #3."}, {"url": "http://www.webmd.com/women/antithyroid-medications-for-hyperthyroidism", "passage_text": "How Well It Works. Antithyroid medicines do not always start working right away. Symptoms usually get better or go away 1 to 8 weeks after you start taking the medicine. It may take as long as 6 months for your thyroid hormone levels to become normal."}, {"url": "https://answers.yahoo.com/question/index?qid=20081123231352AA0hMXB", "passage_text": "As far as how long it will take to start working, that usually happens right away. Your doctor will take blood levels of your thyroid hormones to optimize your therapy. For everyone else out there, don't think taking thyroid meds to lose weight is a good idea."}]