[{"url": "http://www.bcp.org/admissions/admissions-inquiry/index.aspx", "passage_text": "Login Required. To gain access to parts of the Bellarmine College Preparatory website, you will need to log in below. We invite and encourage you to check your personal and contact information for accuracy and to provide updates as needed. Note: If you are an alum, please Login Here."}, {"url": "http://www.bellarmine.edu/admissions/", "passage_text": "At Bellarmine, you'll discover a liberal arts university on a beautiful campus in a world-class city. You'll discover faculty scholars who are experts in their fields but who are also personable, caring and passionate about teaching. You'll discover students who love to learn and who care about each other, their community and the world. We invite you to discover Bellarmine in person by scheduling a campus visit."}, {"url": "http://www.bellarmineprep.org/contact-us/", "passage_text": "Contact Us. Bellarmine Preparatory School Phone: (253) 752-7701. 2300 S. Washington Fax: (253) 756-3887. Tacoma, WA 98405-1304. Main School Office Hours: 7:30am-4:00pm School is closed during the month of July, although the Business/Financial Aid Office & Office of Advancement remain open. Office of Advancement Phone : (253) 761-3520Business/Financial Aid Office Phone: (253) 761-3529."}, {"url": "http://www.bcp.org/admissions/admissions-inquiry/index.aspx", "passage_text": "To gain access to parts of the Bellarmine College Preparatory website, you will need to log in below. We invite and encourage you to check your personal and contact information for accuracy and to provide updates as needed."}, {"url": "http://www.onlineeducation.net/school/bellarmine-university", "passage_text": "At Bellarmine University, 99.0% percent of first-time undergrads receive financial aid, 85.0% receive grants and/or scholarships (an average of $18,231), and 54% receive loans ($7,105 on average). On-campus room and board costs about $8,562. Off campus it is around $8,562."}]