[{"url": "http://www.baysideregenerativemedicine.com/hormonal-health/", "passage_text": "Our hormones and neurotransmitters determine how we think and feel. They influence how we are motivated, our eating patterns, sleep cycle, sexual desire, ability to learn and concentrate. Imbalances in hormones and neurotransmitters can result from age, stress, poor diet and genetic influence. "}, {"url": "http://depression.ygoy.com/2010/06/28/functions-of-neurotransmitters-and-hormones/", "passage_text": "Hormones and neurotransmitters help the brain balance the feelings and the signals which are sent to other organs in the body. The signal transmission is done only through neurotransmitters, these chemicals carry orders from the brain and are also responsible for triggering different kinds of emotions. It was initially evident that they are made of chemicals but in what combination was not clear. There are different types of hormones and neurotransmitters. The article gives a proper understanding of what these substances comprise of and their functions."}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK10957/", "passage_text": "The distinctive characteristics of neurotransmitters, compared to other signaling molecules, are made clearer by comparison with the actions of the hormones secreted by the endocrine system. Hormones typically influence target cells far removed from the hormone-secreting cell (see Chapter 8). The subsequent binding of neurotransmitters to specific receptors on postsynaptic neurons (or other classes of target cells) transiently changes the electrical properties of the target cells, leading to an enormous variety of postsynaptic effects (see Chapters 7 and 8)."}, {"url": "http://depression.ygoy.com/2010/06/28/functions-of-neurotransmitters-and-hormones/", "passage_text": "Functions of neurotransmitters and hormones are very important for the body to work properly mentally and physically. There are many other substances which are involved but these two substances are the main substances which play a major role in the proper functioning of the brain. It was initially evident that they are made of chemicals but in what combination was not clear. There are different types of hormones and neurotransmitters. The article gives a proper understanding of what these substances comprise of and their functions."}, {"url": "http://www.answers.com/Q/Why_are_hormones_and_neurotransmitters_different_from_each_other", "passage_text": "Answer by Wiganlad. Confidence votes 161. A hormone, by definition, is a compound produced by an endocrine gland and released into the bloodstream where it can find it's target cells at some distance from it's actual site of release. A neurotransmitter on the other hand is a compound released from a nerve terminal. Neurotransmitters travel across synapses in neuron while hormones travel across the blood stream. Hormones are secreted by glands while N.T.'s are secreted by vesicles in the … synaptic bulb. An example of a N.T. would be Norepinephrine. Epinephrine is a hormone"}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK10957/", "passage_text": "For example, vasopressin and oxytocin, two peptide hormones that are released into the circulation from the posterior pituitary, also function as neurotransmitters at a number of central synapses. A number of other peptides also serve as both hormones and neurotransmitters. The subsequent binding of neurotransmitters to specific receptors on postsynaptic neurons (or other classes of target cells) transiently changes the electrical properties of the target cells, leading to an enormous variety of postsynaptic effects (see Chapters 7 and 8)."}, {"url": "http://www.differencebetween.com/difference-between-neurotransmitters-and-vs-hormones/", "passage_text": "Nervous system and endocrine system are very important systems, which regulate the various activities of the body, and are dependent on the release of special chemicals either as neurotransmitters or hormones. These two specific chemicals are known as the two types of chemical messengers of the body. Also, certain neurotransmitters and hormones have similar origins (for example; amino acid derivatives). Furthermore, some hormones, as well as the neurotransmitters, are produced by the tissues in the Central Nervous System. Some molecules act as both hormones and neurotransmitters. For example, norepinephrine is released into the blood by the adrenal glands as a hormone, but it also released as a neurotransmitter by sympathetic nerve endings. While there are similarities between these two chemical messengers, there are some obvious differences"}, {"url": "http://www.differencebetween.com/difference-between-neurotransmitters-and-vs-hormones/", "passage_text": "• Neurotransmitters belong to the nervous system, whereas hormones belong to the endocrine system. • Transmission of neurotransmitters is across the synaptic cleft, whereas that of hormones is by blood. • Hormones are produced by endocrine glands while neurotransmitters are produced by neurons. Also, certain neurotransmitters and hormones have similar origins (for example; amino acid derivatives). Furthermore, some hormones, as well as the neurotransmitters, are produced by the tissues in the Central Nervous System. Some molecules act as both hormones and neurotransmitters. For example, norepinephrine is released into the blood by the adrenal glands as a hormone, but it also released as a neurotransmitter by sympathetic nerve endings. While there are similarities between these two chemical messengers, there are some obvious difference"}]