[{"url": "http://www.biokids.umich.edu/critters/Thamnophis_sirtalis/", "passage_text": "Common garter snakes are very widespread, highly adaptable and can survive extreme environmental conditions. Common garter snakes are found in a wide variety of habitats, including meadows, marshes, woodlands, and hillsides. They tend to prefer moist, grassy environments. Young common garter snakes are born at 12.5 to 23 cm long and are similar in appearance to the adults. There are many dozens of recognized regional populations of common garter snakes that have distinct color patterns. In some areas there are populations that have a high percentage of entirely black garter snakes."}, {"url": "http://www.livescience.com/44072-garter-snake.html", "passage_text": "Thamnophis sirtalis (common garter snake): The common garter snake has the largest range, occurring in most of the continental United States with several subspecies, according to Beane. They are found everywhere from Alaska to Florida, though they do not live in the Southwest. And their appearance really does depend on the species — Beane pointed out that some garter snakes are “virtually stripeless.”. Garter snakes are relatively small, usually between 23 and 30 inches (58 and 76 centimeters), though sometimes growing as long as 5 feet (1.5 meters)."}, {"url": "http://kidzone.ws/lw/snakes/facts-garter.htm", "passage_text": "GARTER SNAKES. One of the most commonly known snakes in Canada is the garter snake. They can be found anywhere in Canada and central United States and come in quite a few different colors and markings. Garter snakes are usually about 60 to 80 cm (23-30 inches) long, but they have been known to grow up to 135 cm. The main foods of the Garter snake are earthworms, frogs, fish, leeches, tadpoles and sometimes mice. Because they are quite small, they do have a lot to fear. They are hunted and eaten by bears, raccoons, skunks and especially birds."}, {"url": "http://www.livescience.com/44072-garter-snake.html", "passage_text": "Beane described garter snakes as generalists, inhabiting a wide variety of habitats.. They live in woodlands, meadows and grassy knolls and like to be near water, especially in the arid parts of the West, Beane said. And their appearance really does depend on the species — Beane pointed out that some garter snakes are “virtually stripeless.”. Garter snakes are relatively small, usually between 23 and 30 inches (58 and 76 centimeters), though sometimes growing as long as 5 feet (1.5 meters)."}, {"url": "https://en.wikipedia.org/wiki/Garter_snake", "passage_text": "Garter snakes are present throughout most of North America. They have a wide distribution due to their varied diets and adaptability to different habitats, with varying proximity to water; however, in the western part of North America, these snakes are more aquatic than in the eastern portion. T. sirtalis, T. marcianus and T. sauritus are the most popular species of garter snakes kept in captivity. Baby garter snakes shed their first skin almost immediately, and will begin eating soon after."}, {"url": "http://www.dnr.state.mn.us/reptiles_amphibians/snakes_turtles/commongartersnake.html", "passage_text": "Thamnophis sirtalis. The common garter snake is one of the most well known snakes in Minnesota. They live in many different rural and suburban areas and are found on hilltops, along rivers, and in backyards. "}, {"url": "http://wdfw.wa.gov/living/snakes.html", "passage_text": "Three species of garter snakes occur in Washington. Small garter snakes eat earthworms and slugs; larger snakes include amphibians, small rodents, nestling birds, and fish in their diet. Garter snakes survive in suburbia and towns because they give birth to live young, and so do not require safe places for their eggs. "}, {"url": "http://www.biokids.umich.edu/critters/Thamnophis_sirtalis/", "passage_text": "The average lifespan of wild common garter snakes is approximately two years. Most common garter snakes probably die in their first year of life. Common garter snakes reach sexual maturity, and maximum size, at 3 to 4 years of age. The lifespan of common garter snakes kept in captivity is longer, between 6 and 10 years. Young common garter snakes are born at 12.5 to 23 cm long and are similar in appearance to the adults. There are many dozens of recognized regional populations of common garter snakes that have distinct color patterns. In some areas there are populations that have a high percentage of entirely black garter snakes."}, {"url": "http://www.snake-removal.com/garter.html", "passage_text": "Garter Snake Diet: Garter snakes are carnivorous. Because of their size, they will eat anything they can overpower. The most common victims are snails, slugs, worms, crickets, grasshoppers, birds, and small mammals. Larger garter snakes can eat frogs and rodents. Garter Snake Facts: Garter snakes are the most common snake in North America. All garter snakes, regardless of base color, have a side and a back stripe. The name “garter snake” comes from the comparison of the serpent to the garters men wore years ago to hold up their stockings."}, {"url": "http://www.biokids.umich.edu/critters/Thamnophis_sirtalis/", "passage_text": "Common garter snakes are ovoviviparous (bearing live young). The young are incubated in the lower abdomen, about half way down from the snake's body. Gestation is usually two to three months. Most females in the northern parts of their range give birth to from 4 to 80 young between late July and October. Young common garter snakes are born at 12.5 to 23 cm long and are similar in appearance to the adults. There are many dozens of recognized regional populations of common garter snakes that have distinct color patterns. In some areas there are populations that have a high percentage of entirely black garter snakes."}]