[{"url": "http://www.horseforum.com/english-riding/medium-working-trot-70511/", "passage_text": "Ii) Working trot. This is a pace between the collected and the medium trot, in which a horse, not yet trained and ready for collected movements, shows himself properly balanced and remaining “on the bit”, goes forward with even, elastic steps and good hock action."}, {"url": "http://www.horseforum.com/english-riding/medium-working-trot-70511/", "passage_text": "Basicly the working trot is your horses natural trot (well when the horse is working in an outline) medium trot is a bit longer strides, a bit more swing through from the hind, more impulsion but NO more speed. I'm not very good at putting it into words."}, {"url": "https://ph.answers.yahoo.com/question/index?qid=20080501133100AAjeplk", "passage_text": "For an extended or medium trot, you and your horse need to understand the principles of collection. An extension is really only a release of the energy built during a collected trot. For this and shoulder in, the horse MUST be coming through from behind and you must be containing that impulsion in your hand."}, {"url": "http://www.yourhorse.co.uk/Improve-your-riding/Search-Results/Riding-advice/Dressage/How-to-achieve-medium-trot/", "passage_text": "Medium trot is between working and extended trot, with some lengthening of the stride but staying rounder than the latter. The horse will need to ‘open’ his frame and lower his head, carrying it slightly more forward of vertical than in working trot."}, {"url": "http://www.horseforum.com/dressage/how-do-you-81076/", "passage_text": "Aids for a medium trot, like Anebel, the same as for a collected trot or whatever other trot you're looking for! I expect the horse to travel how it does in collected trot, but with the frame a little more lengthened and slightly more into the hand."}, {"url": "http://www.youtube.com/watch?v=qOunYTVp2WU", "passage_text": "British rider Anna Ross-Davies demonstrates how to do a medium trot for dressage. This guide is ideal for anyone who is new or looking to improve their dressage. For information on Anna Ross-Davies visit http://www.altogetherequestrian.com. 1  Howto & Style. 2  Standard YouTube License."}, {"url": "http://www.dressage-academy.com/schooling-tips/trot-variations.php", "passage_text": "Pace refers to the variations of a gait. For example: Gait = Trot. Pace = Collected trot, Working trot, Medium trot or Extended trot. The length of the stride is what changes not the rhythm of the footfalls."}]