[{"url": "http://www.efile.com/tax-deduction/federal-standard-deduction/", "passage_text": "Dependents: Your standard deduction may be reduced if you are claimed as a dependent on another person's tax return. If you were another person's dependent during the tax year, your standard deduction will generally be limited to the greater of $1000 or your earned income plus $350. Age: If you are age 65 or older, you may increase your standard deduction by $1,550 if you file single or head-of-household. If you are married filing jointly and you OR your spouse is 65 or older, you may increase your standard deduction by $1,200."}, {"url": "https://www.irs.gov/publications/p529/ar02.html", "passage_text": "You can claim the amount of expenses that is more than 2% of your adjusted gross income. You figure your deduction on Schedule A by subtracting 2% of your adjusted gross income from the total amount of these expenses. Your adjusted gross income is the amount on Form 1040, line 38, or Form 1040NR, line 37. If an estate's total deductions in its last tax year are more than its gross income for that year, the beneficiaries succeeding to the estate's property can deduct the excess. Do not include deductions for the estate's personal exemption and charitable contributions when figuring the estate's total deductions."}, {"url": "http://www.efile.com/tax-deduction/", "passage_text": "The Standard Deduction and Itemized Deductions. When you file a tax return, you will either take the standard deduction for your filing status, or you will itemize deductions. Find out which is best for you. Your total deductions are subtracted from your taxable income in order to determine your total tax bill for the year. Tax credits are similar to tax deductions, but they reduce your tax bill dollar for dollar."}, {"url": "http://dor.wa.gov/content/findtaxesandrates/incometax/federaldeduction.aspx", "passage_text": "The deduction is available to taxpayers that itemize deductions, not those who take the standard deduction. The deduction is based on adjusted gross income and number of exemptions claimed. Taxpayers who keep all their receipts can deduct actual sales tax and use tax paid. Washington State taxpayers may deduct sales tax in 2014. Washington State residents may deduct state and local general-sales tax on their federal income returns for tax year 2014. The sales tax deduction was extended again in legislation H.B. 5771 (section 105) signed by President Obama on December 19, 2014."}, {"url": "http://www.efile.com/tax-deduction/federal-standard-deduction/", "passage_text": "Federal Standard Tax Deduction for 2014 and Other Tax Years If you choose not to itemize deductions on your federal tax return, you can claim the standard deduction. The federal standard tax deduction amounts for taxpayers who do not itemize deductions are listed below. Age: If you are age 65 or older, you may increase your standard deduction by $1,550 if you file single or head-of-household. If you are married filing jointly and you OR your spouse is 65 or older, you may increase your standard deduction by $1,200."}, {"url": "http://www.efile.com/tax-deduction/federal-standard-deduction/", "passage_text": "Increased Standard Deduction-Additional Standard Deductions. Age: If you are age 65 or older, you may increase your standard deduction by $1,550 if you file single or head-of-household. If you are married filing jointly and you OR your spouse is 65 or older, you may increase your standard deduction by $1,200."}, {"url": "https://www.irs.gov/publications/p529/ar02.html", "passage_text": "You can usually deduct tax preparation fees on the return for the year in which you pay them. Thus, on your 2014 return, you can deduct fees paid in 2014 for preparing your 2013 return. These fees include the cost of tax preparation software programs and tax publications. If an estate's total deductions in its last tax year are more than its gross income for that year, the beneficiaries succeeding to the estate's property can deduct the excess. Do not include deductions for the estate's personal exemption and charitable contributions when figuring the estate's total deductions."}, {"url": "http://www.efile.com/tax-deduction/", "passage_text": "You can also take a deduction for using your vehicle for charity. The Standard Deduction and Itemized Deductions When you file a tax return, you will either take the standard deduction for your filing status, or you will itemize deductions. Find out which is best for you. Your total deductions are subtracted from your taxable income in order to determine your total tax bill for the year. Tax credits are similar to tax deductions, but they reduce your tax bill dollar for dollar."}, {"url": "http://incometax.utah.gov/filing/deductions", "passage_text": "On your Utah return, your standard or itemized deductions are used in the calculation of the Taxpayer Tax Credit. Enter the amount of your federal standard or itemized deductions, whichever you claimed on your federal return, on line 12 of your Utah return. Note: If you itemized deductions on your federal return, you must also complete line 14 of your Utah return, if applicable. If you itemized your deductions on your federal return, enter that same amount on line 12 of your Utah return. This amount is found on your federal form: 1  1040, line 40. 2  1040NR, line 38."}]