[{"url": "http://www.freeworldmaps.net/africa/kenya/location.html", "passage_text": "Kenya location highlighted on the world map. Kenya is a country in east Africa, having a coastline on the Indian Ocean. The country is also bordered by Somalia, South Sudan, Ethiopia, Uganda and Tanzania."}, {"url": "http://www.nationsencyclopedia.com/economies/Africa/Kenya.html", "passage_text": "Jamhuri ya Kenya. Located in east Africa, Kenya has a total area of 582,650 square kilometers (224,962 square miles), rendering it slightly larger than twice the size of Nevada."}, {"url": "http://www.nationsencyclopedia.com/economies/Africa/Kenya.html", "passage_text": "With a coastline of 536 kilometers (333 miles), Kenya borders the Indian Ocean to the east, Somalia to the northeast, Ethiopia to the north, Sudan to the northwest, Uganda to the west, and Tanzania to the south. Nairobi, the capital of Kenya, is situated slightly south of the center point of the country."}, {"url": "http://www.answers.com/Q/Where_is_kenya", "passage_text": "Kenya is located on the eastern side of Africa. It is bordered by the Indian Ocean on the South East, Tanzania on the South, Uganda on the West, Sudan on the North West, Ethio … pia on the North and Somalian on the North East. found this useful. Cheryl Murdock."}, {"url": "http://www.infoplease.com/country/kenya.html", "passage_text": "Kenya lies across the equator in east-central Africa, on the coast of the Indian Ocean. It is twice the size of Nevada. Kenya borders Somalia to the east, Ethiopia to the north, Tanzania to the south, Uganda to the west, and Sudan to the northwest."}, {"url": "http://www.answers.com/Q/Where_is_kenya", "passage_text": "Answer by CatRox. Confidence votes 23.6K. Kenya is located in Africa, on the East, just below the horn that is Somalia. It's bordered by the Indian Ocean on the South East, Tanzania on the South, Uganda on the West, Sudan on the North West, Ethiopia on the North and Somalia on the North East. The equator divides Kenya roughly in two."}, {"url": "http://www.answers.com/Q/Which_hemisphere_is_Kenya_in", "passage_text": "Answer   Kenya is located in Africa, on the East, just below the horn that is Somalia. It's bordered by the Indian Ocean on the South East, Tanzania on the South, Ugand … a on the West, Sudan on the North West, Ethiopia on the North and Somalia on the North East."}]