[{"url": "http://www.biologyreference.com/Mo-Nu/Nucleotides.html", "passage_text": "The phosphate group is bonded to the 5 carbon of the sugar (see Figure 2), and when nucleotides are joined to form RNA or DNA, the phosphate of one nucleotide is joined to the sugar of the next nucleotide at its 3 carbon, to form the sugar-phosphate backbone of the nucleic acid. The sugar can be ribose, which is found in ribonucleotides and RNA, or deoxyribose, which is found in deoxyribonucleotides and DNA. The only difference between these two sugars is that deoxyribose has one fewer oxygen atom than ribose. The five carbon atoms in the sugar are numbered sequentially."}, {"url": "http://www.biologyreference.com/Mo-Nu/Nucleotides.html", "passage_text": "All nucleotides are composed of three parts: a five-carbon sugar, a phosphate, and a nitrogen-rich structure called a nitrogenous base. The sugar can be ribose, which is found in ribonucleotides and RNA, or deoxyribose, which is found in deoxyribonucleotides and DNA. The only difference between these two sugars is that deoxyribose has one fewer oxygen atom than ribose. The five carbon atoms in the sugar are numbered sequentially."}, {"url": "https://answers.yahoo.com/question/index?qid=20090513074423AAT89Ux", "passage_text": "Rating Newest Oldest. Best Answer: There are only two differences between the nucleotides of RNA and the nucleotides of DNA. In deoxyribonucleotides, the 2' carbon has two hydrogens bonded to it. In ribonucleotides, the 2' carbon has a hydroxy group and a hydrogen bonded to it. "}, {"url": "http://scienceprimer.com/nucleotides-rna", "passage_text": "These nucleotides have three parts: 1) a five carbon ribose sugar, 2) a phosphate molecule and 3) one of four nitrogenous bases: adenine, guanine, cytosine or uracil. RNA nucleotides form polymers of alternating ribose and phosphate units linked by a phosphodiester bridge between the #3 and #5 carbons of neighboring ribose molecules."}, {"url": "https://en.wikipedia.org/wiki/Nucleotide", "passage_text": "Nucleotides contain either a purine or a pyrimidine base. Ribonucleotides are nucleotides in which the sugar is ribose. Deoxyribonucleotides are nucleotides in which the sugar is deoxyribose. Nucleic acids are polymeric macromolecules made from nucleotide monomers. In DNA, the purine bases are adenine and guanine, while the pyrimidines are thymine and cytosine. This nucleotide contains the five-carbon sugar deoxyribose, a nitrogenous base called adenine, and one phosphate group. Together, the deoxyribose and adenine make up a nucleoside (specifically, a deoxyribonucleoside) called deoxyadenosine."}, {"url": "http://www.biologyreference.com/Mo-Nu/Nucleotides.html", "passage_text": "Photo by: Cybrain. Nucleotides are the subunits that are linked to form the nucleic acids ribonucleic acid (RNA) and deoxyribonucleic acid (DNA), which serve as the cell's storehouse of genetic information. The sugar can be ribose, which is found in ribonucleotides and RNA, or deoxyribose, which is found in deoxyribonucleotides and DNA. The only difference between these two sugars is that deoxyribose has one fewer oxygen atom than ribose. The five carbon atoms in the sugar are numbered sequentially."}, {"url": "http://biology.about.com/od/molecularbiology/ss/rna.htm", "passage_text": "RNA stands for ribonucleic acid and like DNA, RNA nucleotides contain three components: RNA nitrogenous bases include adenine (A), guanine (G), cytosine (C) and uracil (U). The five-carbon (pentose) sugar in RNA is ribose. RNA molecules are polymers of nucleotides joined to one another by covalent bonds between the phosphate of one nucleotide and the sugar of another. These linkages are called phosphodiester linkages. "}, {"url": "https://en.wikipedia.org/wiki/Nucleotide", "passage_text": "Nucleotides are organic molecules that serve as the monomers, or subunits, of nucleic acids like DNA and RNA. The building blocks of nucleic acids, nucleotides are composed of a nitrogenous base, a five-carbon sugar (ribose or deoxyribose), and at least one phosphate group. This nucleotide contains the five-carbon sugar deoxyribose, a nitrogenous base called adenine, and one phosphate group. Together, the deoxyribose and adenine make up a nucleoside (specifically, a deoxyribonucleoside) called deoxyadenosine."}, {"url": "https://dlc.dcccd.edu/biology1-3/nucleic-acid", "passage_text": "DNA contains deoxyribose nucleotides while RNA contains ribose nucleotides. DNA is more stable than RNA because of the reduction in reactive oxygen atoms. A 5-carbon sugar (ribose or deoxyribose) forms the central molecule in a nucleotide. RNA nucleotides are defined by the sugar ribose, and contain a slightly different set of nitrogenous bases: adenine, guanine, cytosine, and uracil. RNA molecules do not contain thymine. Unlike DNA, RNA is usually present in a single-stranded form."}, {"url": "http://scienceprimer.com/nucleotides-rna", "passage_text": "RNA nucleotides differ from DNA nucleotides by the presence of a hydroxyl group linked to the #2 carbon of the sugar. The presence of this hydroxyl group allows RNA polymers to assume a more diverse number of shapes compared to DNA polymers. RNA nucleotides form polymers of alternating ribose and phosphate units linked by a phosphodiester bridge between the #3 and #5 carbons of neighboring ribose molecules."}]