[{"url": "http://gawker.com/5877271/come-back-zooey-deschanel-we-dont-really-hate-you", "passage_text": "In the past we have called satchel of fairy dust Zooey Deschanel a living dog sweater, Bambi's rabbit friend, and hipster labradoodle with bangs, that doesn't mean we hate her. No, Zooey, we want you to come back and read Gawker. In their new cover story, Zooey told Allure, I can't go on Gawker. I actually think the writing is really funny, but there is a chance that somebody is undercutting me.. Aw, Zooey, don't do us like that. Those names aren't insults they're just whimsical descriptions"}, {"url": "http://www.etonline.com/news/156225_zooey_deschanel_pregnant/", "passage_text": "The New Girl is expecting a new baby! Just over a month after her sister Emily Deschanel confirmed she's pregnant with baby no. 2, Zooey Deschanel's rep confirms to ET that the 34-year-old actress and her beau Jacob Pechenik, 42, also have a baby on the way! PHOTOS: Stars Share Pics of Their Adorable Tots. Jacob and I are over the moon. "}, {"url": "https://en.wikipedia.org/wiki/Zooey_Deschanel", "passage_text": "Zooey Claire Deschanel (/ˈzoʊ.iː deɪʃəˈnɛl/ ; born January 17, 1980) is an American actress, singer-songwriter, model, and producer. In 1999, Deschanel made her film debut in Mumford, followed by her breakout role as Anita Miller in Cameron Crowe 's 2000 semi-autobiographical film Almost Famous. For a few years starting in 2001, Deschanel performed in the jazz cabaret act If All the Stars Were Pretty Babies with fellow actress Samantha Shelton. Besides singing, she plays keyboards, percussion, banjo, and ukulele."}, {"url": "http://www.sheknows.com/parenting/articles/1091575/zooey-deschanels-new-baby-announcement-comes-with-surprise-twist", "passage_text": "Her hit show New Girl is coming back for a fifth season this fall, and she's also still crooning addicting tunes as part of the musical duo She & Him. Deschanel and Pechenik are working on a new film together called Rock the Kasbah, coming out this fall with Bill Murray, Bruce Willis and Taylor Kinney. Zooey Deschanel shocks everyone with her baby news bonus. There are plenty of reasons to love America's favorite quirky girl Zooey Deschanel, and here are two big ones: New Girl star Deschanel reportedly got secretly married and welcomed a new baby girl in the same weekend."}, {"url": "http://www.webpronews.com/emily-deschanel-david-boreanaz-bones-to-return-for-11th-season-2015-05/", "passage_text": "Emily Deschanel and David Boreanaz will be back for an 11th season of Bones. Fans learned this week that 20th Century Fox TV closed deals with both Deschanel and Boreanaz. The show’s most recent showrunner, Stephen Nathan, is taking a leave. In addition to Emily Deschanel and David Boreanaz–TJ Thyne, Michaela Conlin, and John Boyd are all returning for the 11th season of Bones. Creator and executive producer Hart Hanson is coming back as well"}, {"url": "http://www.contactmusic.com/zooey-deschanel", "passage_text": "Shots of American actress Zooey Deschanel as she is back at work to film the new season of hit TV show New Girl she was spotted filming in downtown Los Angeles, California, United States-Tuesday 31st March 2015. Fox Picks Up 'New Girl' For A Fifth Season. Zooey Deschanel and Jacob Pechenik at the 66th Primetime Emmy Awards in August 2014.Read More: Fox Picks Up New Girl For A Fifth Season.Continue reading: Zooey Deschanel Welcomes First Child, Announces Marriage To Jacob Pechenik. There’s two lots of good news for fans of Zooey Deschanel."}, {"url": "http://www.huffingtonpost.com/news/zooey-deschanel/", "passage_text": "When Sophia Rossi launched the women's lifestyle site HelloGiggles back in 2011 with her friend Zooey Deschanel, media wasn't exactly interested in women playing nice with each other. In the movie world you would not expect a smallish screening for a movie like Rock the Kasbah to have a night like this, but Bill Murray has great karma. Rock legends turned out on Friday night: Sir Paul McCartney, Bruce Springsteen, Jon Bon Jovi, to start."}, {"url": "http://www.contactmusic.com/zooey-deschanel", "passage_text": "Zooey Deschanel, Jake Johnson and the gang will return for a fifth season of Fox's successful 'New Girl' in 2015-2016. Zooey Deschanel, Jake Johnson and the gang will return for a fifth season of Fox's successful 'New Girl' in 2015-2016. Fox’s successful comedy ‘New Girl’ has been given the green light for a fifth season, the network announced on Tuesday. Zooey Deschanel and Jacob Pechenik at the 66th Primetime Emmy Awards in August 2014.Read More: Fox Picks Up New Girl For A Fifth Season.Continue reading: Zooey Deschanel Welcomes First Child, Announces Marriage To Jacob Pechenik. There’s two lots of good news for fans of Zooey Deschanel."}]