[{"url": "http://byebyedoctor.com/liver-inflammation/", "passage_text": "Liver inflammation is the name for the liver disease which is better known medically as hepatitis. This article will perhaps answer any questions about what might cause inflammation of the liver, what the signs of liver inflammation, does inflammation liver hurt and how inflammation of the liver is treated. Liver inflammation can be caused by many conditions. The more recurrent cause is an infection that is viral, most infamously viral hepatitis A, B, C, D and E. Mononucleosis, amebic dysentery, cytomegalovirus, or yellow fever infections may also cause an inflamed liver."}, {"url": "https://en.wikipedia.org/wiki/Hepatitis", "passage_text": "Worldwide, viral hepatitis is the most common cause of liver inflammation. Other causes include autoimmune diseases and ingestion of toxic substances (notably alcohol), certain medications (such as paracetamol), some industrial organic solvents, and plants. Hepatitis (plural: hepatitides) is a medical condition defined by the inflammation of the liver and characterized by the presence of inflammatory cells in the tissue of the organ."}, {"url": "http://www.healthline.com/health/hepatitis", "passage_text": "Hepatitis refers to an inflammatory condition of the liver. It’s commonly caused by a viral infection, but there are other possible causes of hepatitis. These include autoimmune hepatitis and hepatitis that occurs as a secondary result of medications, drugs, toxins, and alcohol. "}, {"url": "http://www.sinomedresearch.org/hcv/articles/c2_LiverInflammation.htm", "passage_text": "Hepatitis is a general disease name for liver inflammation and can have many different causes. Among them, viral infection is one of the most common. 1. Viral infection: Many viruses can cause liver inflammation and they are infectious and transmittable. 2. Alcoholic hepatitis: Alcohol abuse can cause liver inflammation because alcohol and its metabolite are toxic to liver cells. If a person takes in 150g of alcohol daily for about 5 years, 90% of them will have various liver damages."}, {"url": "http://www.nhs.uk/conditions/Hepatitis/Pages/Introduction.aspx", "passage_text": "Introduction. Hepatitis is a term used to describe inflammation (swelling) of the liver. It can occur as the result of a viral infection or because the liver is exposed to harmful substances such as alcohol. Some types of hepatitis will pass without causing permanent damage to the liver. Other types can persist for many years and cause scarring of the liver (cirrhosis)."}, {"url": "http://www.ibuzzle.com/articles/liver-inflammation-symptoms.html", "passage_text": "Liver Inflammation Symptoms. Hepatitis comes from the Greek word 'hepar', meaning 'liver', and the Latin word 'itis' which translates into 'inflammation'. Hepatitis is when one's liver inflames, when the cells start to swell up within the organ. "}, {"url": "http://www.askanaturopath.com/faqs/liver-function-test/p/467", "passage_text": "Liver inflammation is characterised by the presence of inflammation of the liver. A blood test will reveal raised liver enzymes as an indication of inflammation present in the liver. There are commonly two types of liver inflammation classified as non-alcoholic liver disease or alcoholic liver disease. "}, {"url": "http://www.healthgrades.com/conditions/liver-inflammation", "passage_text": "Seek immediate medical care (call 911) for serious symptoms associated with complications of liver inflammation, such as confusion, hallucinations, extreme fatigue, fainting, fever (especially if combined with a swollen abdomen), vomiting blood, or severe mood changes (especially agitation). The initial symptoms of inflammation are similar to flu, but with the addition of jaundice, a yellowish discoloration of the skin and whites of the eyes. Left untreated, liver inflammation will begin to interfere with liver function and may progress to end-stage liver disease and liver failure."}, {"url": "http://www.healthgrades.com/conditions/liver-inflammation", "passage_text": "The word hepatitis refers to liver inflammation. Most forms of hepatitis result from viral infection, although in some cases it is caused by an autoimmune disorder, in which the body’s immune system attacks liver cells because it cannot tell the difference between harmful invaders and healthy liver tissue. The initial symptoms of inflammation are similar to flu, but with the addition of jaundice, a yellowish discoloration of the skin and whites of the eyes. Left untreated, liver inflammation will begin to interfere with liver function and may progress to end-stage liver disease and liver failure."}]