[{"url": "http://www.huffingtonpost.com/2014/04/14/the-walking-dead-jon-hamm-negan_n_5148981.html", "passage_text": "Robert Kirkman, creator of The Walking Dead, said in an interview with MTV that he is 99 percent sure that TWD comic book villain Negan is coming to the show and Jon Hamm would be perfect for the part."}, {"url": "http://www.hypable.com/who-will-play-negan-walking-dead-season-6/", "passage_text": "He’s got a bit of a temper, and is always ready to crack some skulls with his deadly weapon of choice. So, we take a look at 10 of the best actors to play Negan, the villain who will most likely be behind most of the most brutal carnage in The Walking Dead season 6."}, {"url": "http://www.youtube.com/watch?v=-ZCshSpLg7U", "passage_text": "James Purefoy-http://en.wikipedia.org/wiki/James_Pu... Let me know what you guys think of these choices and who you think would be the best. For me the actor that should play negan is between Patrick Warburton and Vinnie Jones. Either one would be perfect I think."}, {"url": "http://walkingdead.wikia.com/wiki/Negan", "passage_text": "Negan (pronounced KNEE-gan) is a main character first introduced in Issue 100 of Image Comics ' The Walking Dead and is the former leader of the Saviors and is a primary antagonist in the Comic Series."}, {"url": "http://www.ibtimes.com/walking-dead-season-5-spoilers-negan-appear-kevin-durand-reportedly-approached-play-comic-1697022", "passage_text": "Nuke the Fridge is reporting that “The Strain” star Kevin Durand was approached to play Negan on “The Walking Dead.” The Canadian actor, best known for his roles in “Lost” and “X-Men Origins: Wolverine,” allegedly shared the news during a conference call for his FX show."}, {"url": "http://walkingdead.wikia.com/wiki/Thread:225164", "passage_text": "If Negan is going to be an awesome villain in the TV series, they need a great actor to play him. Here are my three top choices to play Negan: 1.) Patrick Warburton-He's funny, he looks somewhat like him, a little... but I think he would make an awesome Negan because he's around the same size as Negan in the comics. So Patrick Warburton is my number 1 choice."}, {"url": "http://www.businessinsider.com/the-walking-dead-negan-is-coming-2014-7", "passage_text": "The recent one [rumor] that Jon Hamm was going to play Negan, who is a character coming up, a villain, said Gimple."}, {"url": "http://www.cleveland.com/entertainment/index.ssf/2015/03/jon_hamm_to_play_negan_on_the.html", "passage_text": "View/Post Comments. CLEVELAND, Ohio-The Internet went wild over the weekend when actor Jon Hamm addressed rumors that he could play Negan, the most infamous villain from Robert Kirkman's The Walking Dead comic book."}]