[{"url": "https://en.wiktionary.org/wiki/Appendix:Glossary_of_baseball_jargon_(S)", "passage_text": "In baseball, a stolen base (or steal) occurs when a baserunner successfully advances to the next base while the pitcher is delivering the ball to home plate. In baseball statistics, stolen bases are denoted by SB."}, {"url": "http://www.answers.com/Q/What_is_steal_in_baseball", "passage_text": "Stealing is the same thing as a stolen base in baseball/softball. It is when there is a person on 1st, 2nd, or 3rd and they run to the next base while the pitcher is in the middle of their pitch. If the runner advances to the next base without being thrown out by the catcher, then they have stolen that base."}, {"url": "http://www.yourdictionary.com/steal", "passage_text": "1 An example of steal is when you take someone's wallet. 2  An example of steal is when you pretend that someone else's ideas or work are your own. 3  An example of steal is when you give someone a spontaneous kiss when not expected."}, {"url": "http://www.thefreedictionary.com/steal", "passage_text": "3. Baseball A stolen base. 4. Basketball An act of gaining possession of the ball from an opponent. steal (someone's) thunder. To use, appropriate, or preempt the use of another's idea, especially to one's own advantage and without consent by the originator."}, {"url": "http://www.sportingcharts.com/dictionary/mlb/stealing-signs.aspx", "passage_text": "Stealing signs is not always against the rules. Major League baseball's prohibition pertains to stealing signs via electronic means only. Attempts by a team to steal signs during the game simply by observing or by other allowable means are permitted, but obviously risky and unpopular. There are a number of unwritten rules in baseball, one of them being that teams act in a sportsmanlike manner, inferring that sign stealing is a breach of etiquette."}, {"url": "http://www.yourdictionary.com/steal", "passage_text": "1 To take (the property of another) without right or permission. 2  To present or use (someone else's words or ideas) as one's own. 3  To get or take secretly or artfully: steal a look at a diary; steal the puck from an opponent. 4  To give or enjoy (a kiss) that is unexpected or unnoticed."}, {"url": "http://www.merriam-webster.com/dictionary/double%20steal", "passage_text": "This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}, {"url": "http://www.yourdictionary.com/steal", "passage_text": "verb. verb. 1  To take (the property of another) without right or permission. 2  To present or use (someone else's words or ideas) as one's own. 3  To get or take secretly or artfully: steal a look at a diary; steal the puck from an opponent. 4  To give or enjoy (a kiss) that is unexpected or unnoticed."}]