[{"url": "http://www.babycenter.com/400_when-do-you-ovulate-before-or-after-your-period-and-how-many_7366512_695.bc", "passage_text": "Every women is different and when you ovulate depends on how long your cycle is and if you are regular. But in general, if you have a 28 day cycle you would ovulate on or around day 14. To be safe, most trying to conceive guidelines will use day 10-20 as your fertile window. (Day 1 being the first day of your period)."}, {"url": "http://americanpregnancy.org/getting-pregnant/understanding-ovulation/", "passage_text": "On average, a woman’s cycle normally is between 28-32 days, but some women may have much shorter or much longer cycles. Ovulation can be calculated by starting with the first day of the last menstrual period (LMP) or by calculating 12-16 days from the next expected period."}, {"url": "http://www.ovulation-calendar.com/hlp-d01-ovulation-basics.html", "passage_text": "Your fertile period starts about 4-5 days before ovulation, and ends about 24-48 hours after it. This is because sperm can live in your body for approximately 4 to 5 days, and the egg can live for 24 to 48 hours after being released. You are most fertile on the day before and the day of ovulation."}, {"url": "http://americanpregnancy.org/getting-pregnant/ovulation-faq/", "passage_text": "During my ovulation time, how many days am I really fertile? During your window of ovulation, an egg is only available to be fertilized for about 12-24 hours. But since sperm can live in the body for 3-5 days after sex, and the egg is available for one day, your most fertile time is considered to be about 5-7 days."}, {"url": "http://americanpregnancy.org/getting-pregnant/understanding-ovulation/", "passage_text": "If fertilization does not occur the egg dissolves after 24 hours. At this time your hormone levels will decrease and your uterine lining will begin to shed about 12-16 days from ovulation. This is menstruation (menstrual period) and brings us back to day 1 of your cycle. The journey then begins all over again."}, {"url": "http://americanpregnancy.org/getting-pregnant/ovulation-faq/", "passage_text": "The Association estimates that ovulation occurs anywhere between 11-21 days after the first day of your last menstrual period (LMP), or 12-16 days from when you expect the next menstrual period to start. Order a Fertility Kit or Monitor."}, {"url": "http://www.babycentre.co.uk/ovulation", "passage_text": "Ovulation usually occurs between 12 and 14 days before your period starts (Fehring et al 2006) . This is an average, so it could be a couple of days earlier or later. For example, say you have a regular 28-day menstrual cycle. Count the first day of your period as day one."}, {"url": "http://www.amazingpregnancy.com/pregnancy-articles/257-html.html", "passage_text": "Ovulation typically takes place about 14 days after the first day of the start of a period and about 14 days prior to the onset of the next menstrual period. The exact timing of ovulation will often vary greatly from woman to women."}]