[{"url": "http://www.seriouseats.com/2014/05/how-katz-deli-makes-their-best-pastrami.html", "passage_text": "Like other cured meat, pastrami began as a way for poor folk (in this case Jewish immigrants) to preserve and improve the flavor and texture of cheap cuts of meat. While plenty of pastrami is made with any cut of beef brisket, aficionados will tell you that the real deal comes specifically from the navel end. Navel is particularly fatty and stands up well to the long cooking to come; save the rest of the brisket for corned beef."}, {"url": "http://recipes.howstuffworks.com/question298.htm", "passage_text": "To make pastrami, you start by making corned beef. Corned beef is a beef brisket soaked in brine (with some sugar and spices). According to The Joy of Cooking, corned beef has nothing to do with corn but got its name...when a granular salt the size of a kernel of wheat -- corn to a Briton -- was used to process it.. If you want to get poetic about it, pastrami is a way of going back in time. So is cheese, for that matter. Pastrami is a technology for preserving meat that our ancestors used before refrigerators."}, {"url": "http://healthyeating.sfgate.com/much-protein-turkey-pastrami-lunchmeat-7227.html", "passage_text": "Turkey pastrami is lower in saturated fat than beef pastrami. Pastrami is a type of deli meat usually made from beef, though it's also widely available made from turkey, which cuts the saturated fat content of the meat. Turkey pastrami contains a staggering amount of salt per serving, which decreases its nutritional value significantly. "}, {"url": "http://www.delidoneright.com/2013/01/14/corned-beef-or-pastrami-three-differences/", "passage_text": "1. Different cuts of meat. Traditionally, corned beef is made from beef brisket, which comes from the lower chest of the steer. Pastrami traditionally is made from beef navel, which is a small piece cut from the muscle known as the plate. I emphasize the word “traditionally” because pastrami in the 21st century is also made from other cuts of beef and poultry, including the ubiquitous turkey pastrami. United Meat & Deli, although widely known for Sy Ginsberg’s Corned Beef, also makes Gold Label pastrami."}, {"url": "http://blog.aicr.org/2012/02/23/what-is-processed-meat-anyway/", "passage_text": "Corned beef is a processed meat because it is cured through the curing brine. The brine contains both salt and usually a type of pink curing salt which contains sodium nitrite. The pink curing salt is what makes the corned beef a pink color. The amount of salt/sodium typically added to fresh meat is not enough for it to be considered processed meats. It is considerably less salt than is in luncheon meats. For example, the “enhanced” chicken breast meat would contain about 150 mg sodium per 3 oz, whereas 3 oz of deli chicken can contain more than 700 mg."}, {"url": "https://www.quora.com/What-are-the-differences-between-pastrami-corned-beef-roast-beef-and-Canadians-smoked-meat", "passage_text": "Corned beef is beef which has been cured with salt and spices (often pepper, allspice, and bay leaf), then simmered in water to cook it. It's traditionally made with the brisket, which has more fat than the ones usually used for most roast beef deli meat. It can also be made with other cuts. Pastrami is cured, like corned beef, often with a spice mixture heavy on the black pepper. Like corned beef, it's usually made from the brisket, which gives it that loose-grained texture. Unlike corned beef, it's then smoked."}, {"url": "http://www.wisegeek.com/what-is-pastrami.htm", "passage_text": "Pastrami is a deli meat made from a highly seasoned cut of smoked or steamed meat that's generally made from corned beef. There are a few variations on the process for making it, though almost all of them involve brining the meat, then boiling or steaming it. "}, {"url": "https://en.wikipedia.org/wiki/Pastrami", "passage_text": "Pastrami (Turkish: pastırma, Romanian: pastramă, Bulgarian: пастърма) is a meat product usually made from beef, and sometimes from pork, mutton or turkey. It is cured in brine, coated with a mix of spices such as garlic, coriander, black pepper, paprika, cloves, allspice, and mustard seed, and then smoked. Finally, the meat is steamed until the connective tissues within the meat break down into gelatin."}, {"url": "https://en.wikipedia.org/wiki/Pastrami", "passage_text": "Pastrami sandwich at the Carnegie Deli. Pastrami (Turkish: pastırma, Romanian: pastramă, Bulgarian: пастърма) is a meat product usually made from beef, and sometimes from pork, mutton or turkey. The raw meat is brined, partially dried, seasoned with herbs and spices, then smoked and steamed. In the United States, although beef plate is the traditional cut of meat for making pastrami, it is now common to see it made from beef brisket, beef round, and turkey. It is cured in brine, coated with a mix of spices such as garlic, coriander, black pepper, paprika, cloves, allspice, and mustard seed, and then smoked. Finally, the meat is steamed until the connective tissues within the meat break down into gelatin."}, {"url": "https://en.wikipedia.org/wiki/Pastrami", "passage_text": "Turkey pastrami is made by processing turkey breast (pale pink) or thigh (dark pink) in a fashion similar to red-meat pastrami, in an effort to simulate the red-meat deli product. It is cured in brine, coated with a mix of spices such as garlic, coriander, black pepper, paprika, cloves, allspice, and mustard seed, and then smoked. Finally, the meat is steamed until the connective tissues within the meat break down into gelatin."}]