[{"url": "http://costaricaweathercenter.com/costa-rica-rainfall/", "passage_text": "Average Rainfall In Costa Rica. The weather in Costa Rica is one of the many things that tourists try to look into before booking a trip to the country. With an average annual rainfall around 59 – 80 inches throughout Costa Rica rainfall is worth considering during a visit. Tourists naturally want to explore the many attractions of Costa Rica without worrying too much on the unpredictability of the weather. The provinces of Alajuela and Guanacaste belong to the northern point of Costa Rica. Temperature in this region varies depending on the altitude, with the higher areas experiencing temperature average of 15 to 19 degrees Celsius while the lowlands averaging 25 to 29 degrees Celsius."}, {"url": "http://www.costa-rica.climatemps.com/", "passage_text": "Climate, Average Weather of Costa Rica. 1  Of the land area, 36.4% has a tropical rainforest climate (Af), 63.6% has a tropical wet and dry/ savanna climate (Aw). 2  Of the population, 13.1% live in a tropical rainforest climate (Af), 86.9% live in a tropical wet and dry/ savanna climate (Aw). 1"}, {"url": "http://costaricaweathercenter.com/costa-rica-rainfall/", "passage_text": "Costa Rica Rainfall Windows. The northern Pacific side of Costa Rica includes the provinces of Alajuela, Guanacaste and Puntarenas. It is one of the more frequently visited areas of the country since it is here where some of the most picturesque beaches in Costa Rica are located such as the Flamingo, Samara and Tambor. The provinces of Alajuela and Guanacaste belong to the northern point of Costa Rica. Temperature in this region varies depending on the altitude, with the higher areas experiencing temperature average of 15 to 19 degrees Celsius while the lowlands averaging 25 to 29 degrees Celsius."}, {"url": "http://costarica.com/travel/climate/", "passage_text": "Last updated: Jun 13, 2015. Tropical sunshine, Pacific trade wind breezes and cool misty mountains are just a part of Costa Rica's temperate tropical climate. Nestled into Central America, Costa Rica's north of the equator with a climate marked by two seasons: the dry season (Dec.-April) and the wet season (May-Nov.). Despite its proximity to the equatorial sun, average daily temperatures range between 71 and 81 degrees"}, {"url": "http://costa-rica-guide.com/maps/rainfall-contour-maps/", "passage_text": "Rainfall Contour Maps. The contour maps of Costa Rica below show the average monthly Rainfall, Hours of Sunshine per day, and Average Number of Sunny Days for each month of the year and every region of Costa Rica color coded by the legend at the bottom of each. "}, {"url": "http://www.guanacastecostarica.com/climate.html", "passage_text": "More information about weather in San Jose, Costa Rica Today's weather in Costa Rica Today's weather in San Jose Today's weather in Heredia Today's weather in Cartago Today's weather in Puntarenas Today's weather in Liberia Today's weather in Limon The climate of Guanacaste is highly seasonal. "}, {"url": "http://www.worldweatheronline.com/San-Jose-weather-averages/San-Jose/CR.aspx", "passage_text": "Average Rainfall for San Jose, Costa Rica. Note: The data for charts above are taken from year 2000 to 2012. Pricing Try Now. Premium API delivers advanced and in-depth weather data as XML, JSON, JSON-P etc. "}, {"url": "http://www.govisitcostarica.com/travelInfo/climate.asp", "passage_text": "While the average rainfall in the country is around 100 inches, some mountainous areas get as much as 25 feet of rainfall on a yearly basis. Also remember to keep in mind as we mentioned before that Costa Rica s Caribbean coast is rather unique and has its own microclimate. Although Costa Rica is a small country in terms of area, there is a lot going on here in terms of weather in Costa Rica. With a climate that is diverse and varied, Costa Rica can be divided into several climatic zones, each of which are distinct and individual"}]