[{"url": "http://www.petpoisonhelpline.com/pet-safety-tips/are-lilies-poisonous-to-cats/", "passage_text": "Please use EXTREME caution when bringing in flowers, bouquets, and new plants into your cat-friendly household. Easter lilies are extremely poisonous to cats, and just 1-2 leaves (or even the pollen) can kill a cat! Even small ingestions can result in severe kidney failure. Sources of poisoning: Many plants of the Lilium and Hemerocallis species are very poisoning. Commonly known as the Tiger, Day, Asiatic, Easter, or Japanese Show lily, these plants result in severe acute kidney failure. Mechanism of action: The exact toxin has not been identified, but is known to be water soluble. All parts of the plant – the leaf, pollen, stem, flower are considered poisonous. "}, {"url": "http://www.fda.gov/AnimalVeterinary/ResourcesforYou/AnimalHealthLiteracy/ucm206751.htm", "passage_text": "The entire lily plant (leaf, pollen, and flower) is considered to be toxic for cats. If you have lilies in your home this Easter, make sure that your cat doesn’t eat any part of the plants. Symptoms of lily toxicity in cats include lethargy (decreased activity), vomiting, and loss of appetite. "}, {"url": "http://homeguides.sfgate.com/lilium-hybrids-poisonous-cats-77953.html", "passage_text": "Lilies (Lilium spp.) of all kinds, including hybrids, are highly toxic to cats if ingested. Depending on the species, lilies flourish in U.S. Department of Agriculture plant hardiness zones 2 through 9; you can also grow them indoors as houseplants. Other lilies like calla lilies (Zantedeschia aethiopica) and peace lilies (Spathiphyllum spp.), which are not in the Lilium genus, are considered toxic to cats, according to the ASPCA."}, {"url": "http://www.noliliesforcats.com/faq1.pml", "passage_text": "What parts of the lily are poisonous to cats? All parts of the lily-including the stem, leaves, petals, stamens and pollen-are poisonous to cats. Even minor exposures (cat chewing on a leaf or getting pollen on his or her haircoat or whiskers) can be fatal. What are the signs of lily poisoning in cats? Many cats vomit after chewing or eating parts of a lily."}, {"url": "http://www.vetmed.ucdavis.edu/whatsnew/images/liliespoison_flyer.pdf", "passage_text": "Most cat owners don’t know it, but lilies are lethally toxic to cats. In fact, they’re so poisonous that a cat can suffer fatal kidney failure just from biting into a lily leaf or petal, licking lily pollen from its paws, or drinking water from a vase with cut lilies in it. "}, {"url": "http://goodcats.com/lilies.html", "passage_text": "All parts of these lilies are considered toxic to cats and consuming even small amounts can cause severe poisoning. If there is a lily in your home, there is always the chance that your cat could be accidentally exposed. "}, {"url": "http://www.petpoisonhelpline.com/poison/lilies/", "passage_text": "Share. There are benign and dangerous lilies out there, and it’s important to know the difference. Benign lilies include the Peace, Peruvian, and Calla lilies; these contain insoluble oxalate crystals that cause minor signs such as tissue irritation to the mouth, tongue, pharynx, and esophagus. Clinical signs of drooling, pawing at the mouth, foaming, and vomiting may be transiently seen."}, {"url": "http://www.yourcat.co.uk/Outdoor-cats/why-are-lilies-dangerous-to-cats.html", "passage_text": "Lilies are toxic to cats. Lilies are a big 'no-no' for feline-friendly homes and gardens. Just one lily leaf, if eaten, can kill your cat — but any part of the plant is dangerous, including the pollen and flower. Simply brushing by the plant, then grooming the pollen off his coat, can prove lethal to a cat. "}, {"url": "http://vetmedicine.about.com/od/toxicology/a/Lily-Toxicity-In-Cats-And-Dogs.htm", "passage_text": "If you suspect that your cat has ingested any part of the lily plant, including pollen, consult your veterinarian immediately. The toxic element of lilies is not known at this time, so there is no antidote. Treatment goals are aggressive IV fluid therapy and protection of the gastrointestinal tract. poisonous. Especially for cats. These lilies, and their botanical relatives, including Easter lily, Day lily, Asian lily and Tiger lily, are popular choices for holiday bouquets and are the favorites of many gardeners."}, {"url": "http://www.petpoisonhelpline.com/poison/lilies/", "passage_text": "Examples of some of these dangerous lilies include the tiger, day, Asiatic hybrid, Easter, Japanese Show, rubrum, stargazer, red, Western, and wood lilies – all of which are highly toxic to cats! Benign lilies include the Peace, Peruvian, and Calla lilies; these contain insoluble oxalate crystals that cause minor signs such as tissue irritation to the mouth, tongue, pharynx, and esophagus. Clinical signs of drooling, pawing at the mouth, foaming, and vomiting may be transiently seen."}]