[{"url": "http://www.ipwatchdog.com/2013/09/14/the-benefits-of-a-provisional-patent-application/id=45156/", "passage_text": "A fairly typical quote for a nonprovisional patent application (through filing) for a software innovation is $8,500 for attorneys fees plus the cost of the nonprovisional filing fee (typically $800) and the cost of any professional illustrations desired (typically $300 to $500). If we did the provisional the client has already paid $2,500 in attorneys fees, so the attorneys fees for the nonprovisional preparation and filing would be $6,000. Thus the total attorney fee does not change at all whether you start with a provisional or a nonprovisional patent application."}, {"url": "http://www.ipwatchdog.com/2013/09/14/the-benefits-of-a-provisional-patent-application/id=45156/", "passage_text": "A fairly typical quote for a provisional patent application (through filing) for a moderately complex mechanical innovation is $2,5000 for attorneys fees plus the cost of the provisional filing fee (typically $130) and the cost of any professional illustrations desired (typically $200 to $300). If we did the provisional the client has already paid $2,500 in attorneys fees, so the attorneys fees for the nonprovisional preparation and filing would be $6,000. Thus the total attorney fee does not change at all whether you start with a provisional or a nonprovisional patent application."}, {"url": "http://www.ipwatchdog.com/2015/04/04/the-cost-of-obtaining-a-patent-in-the-us/id=56485/", "passage_text": "1 Filing fee to the USPTO for provisional patent application = $130 (small entity). 2  Nonprovisional patent application based off provisional filing = $10,000 to $12,000. 3  Filing fee to the USPTO for nonprovisional patent application = $800 to $1,250 (small entity). The filing fee is $130 for a small entity and drawings typically cost $100 to $125 per page, so a high quality provisional patent application for a mechanical or electrical device can typically be prepared and filed for $2,500 to $3,000."}, {"url": "http://colitz.com/site/fees.html", "passage_text": "Drafting Fees: $125 per sheet. The cost then later for filing your non-provisional patent application would be an additional $1,500 in attorney fees plus $400 in a government fee. A non-refundable fee of $1,500 is required before we begin work on your provisional application. Consideration should also be given to a relatively new procedure which defers costs. Such procedure involves an initial filing of provisional patent application. Your cost would be $1,900 in attorney fees plus $65 in a government fee plus $250, if needed, as an estimated drafting fee for two sheets."}, {"url": "http://www.oppedahl.com/cost/", "passage_text": "Click for information on the purpose of this page. As of October 2008, the patent office filing fee is $220, or $110 for small entities. Some firms are willing to assist inventors in filing provisional applications, in which case the total cost of the provisional filing includes the attorney's fees. "}, {"url": "http://www.ipwatchdog.com/2013/09/14/the-benefits-of-a-provisional-patent-application/id=45156/", "passage_text": "Software —. A fairly typical quote for a provisional patent application (through filing) for a software innovation is $5,000 for attorneys fees plus the cost of the provisional filing fee (typically $130) and the cost of any professional illustrations desired (typically $300 to $500). If we did the provisional the client has already paid $2,500 in attorneys fees, so the attorneys fees for the nonprovisional preparation and filing would be $6,000. Thus the total attorney fee does not change at all whether you start with a provisional or a nonprovisional patent application."}, {"url": "http://www.invents.com/how-much-does-a-patent-cost/", "passage_text": "The patent application filing fee for a basic utility patent is $330, which is in addition to a $540 utility patent search fee and a $220 examination fee, plus patent maintenance fees of $980 after three years. Tweets by @InventsCompany. Patent applications involve lots of text and drawings, even for simpler inventions. The first step in the patent application process is to file a non provisional patent application, which involves paying attorney fees in the range of $5000 to $15,000 or more, depending on the intricacies of the invention. The amount you spend on a patent application will also depend on the market opportunities"}]