[{"url": "https://in.answers.yahoo.com/question/index?qid=20080618084402AArgRbb", "passage_text": "There is no agreement on what constitutes a subcontinent. Generally, however, a subcontinent is split from the rest of a continent by something like a mountain range or by tectonic plates. a large and distinctive landmass (as India or Greenland) that is a distinct part of some continent. 1. A large landmass, such as India, that is part of a continent but is considered either geographically or politically as an independent entity. 2. A large landmass, such as Greenland, that is smaller than a continent. Source(s): http://www.answers.com/topic/subcontinen..."}, {"url": "http://www.answers.com/Q/Why_is_India_called_a_subcontinent", "passage_text": "Confidence votes 1.1K. Nothing but life. A place is classed as a subcontinent when it is part of a continent but is considered either geographically or politically as an independent entity or it is smaller than a continent. India is often called a subcontinent because it is a distinct landmass, not just a country. While it has many features of a continent, it is not as big as one, so is not considered a continent. India was once a continent (or at least a very large island)."}, {"url": "http://www.thefreedictionary.com/subcontinent", "passage_text": "A large landmass, such as India, that is part of a continent but is considered either geographically or politically as an independent entity. 2. A large landmass, such as Greenland, that is smaller than a continent. sub′con·ti·nen′tal (-nĕn′tl) adj. 1. a large, relatively self-contained landmass forming a subdivision of a continent: the subcontinent of India. 2. a large landmass, as Greenland, that is smaller than any of the usu. recognized continents. [1860–65]. sub`con•ti•nen′tal (-tnˈɛn tl) adj."}, {"url": "http://www.thefreedictionary.com/subcontinental", "passage_text": "Noun. 1. subcontinent-a large and distinctive landmass (as India or Greenland) that is a distinct part of some continent. Greenland, Gronland, Kalaallit Nunaat-the largest island in the world; lies between the North Atlantic and the Arctic Ocean; a self-governing province of Denmark. 1. a large, relatively self-contained landmass forming a subdivision of a continent: the subcontinent of India. 2. a large landmass, as Greenland, that is smaller than any of the usu. recognized continents."}, {"url": "http://www.definitions.net/definition/subcontinent", "passage_text": "A subcontinent is a large, relatively self-contained landmass forming a subdivision of a continent. By dictionary entries, the term subcontinent signifies having a certain geographical or political independence from the rest of the continent, or a vast and more or less self-contained subdivision of a continent.. Wiktionary (0.00 / 0 votes) Rate this definition: subcontinent (Noun). A large landmass which is either smaller than a continent (such as Greenland), or part of an even larger continent (such as the Indian subcontinent)."}, {"url": "http://www.thefreedictionary.com/subcontinent", "passage_text": "Noun. 1. subcontinent-a large and distinctive landmass (as India or Greenland) that is a distinct part of some continent. Greenland, Gronland, Kalaallit Nunaat-the largest island in the world; lies between the North Atlantic and the Arctic Ocean; a self-governing province of Denmark. 1. a large, relatively self-contained landmass forming a subdivision of a continent: the subcontinent of India. 2. a large landmass, as Greenland, that is smaller than any of the usu. recognized continents. [1860–65]. sub`con•ti•nen′tal (-tnˈɛn tl) adj."}, {"url": "https://en.wikipedia.org/wiki/Subcontinent", "passage_text": "A continent is one of several very large landmasses on Earth. They are generally identified by convention rather than any strict criteria, with up to seven regions commonly regarded as continents. These are (from largest in size to smallest): Asia, Africa, North America, South America, Antarctica, Europe, and Australia. "}, {"url": "https://en.wikipedia.org/wiki/Indian_subcontinent", "passage_text": "The Indian subcontinent or the subcontinent is a southern region of Asia, mostly situated on the Indian Plate and projecting southwards into the Indian Ocean from the Himalayas. Definitions of the extent of the Indian subcontinent differ but it usually includes the core lands of India, Pakistan, and Bangladesh; Nepal, Bhutan, Sri Lanka, and the Maldives are often included as well. The region is also called by a number of other names including South Asia, a name that is increasingly popular"}]