[{"url": "http://www.behindthename.com/name/persephone", "passage_text": "Meaning unknown, probably of Pre-Greek origin, but perhaps related to Greek περθω (pertho) to destroy and φονη (phone) murder. In Greek myth she was the daughter of Demeter and Zeus. She was abducted to the underworld by Hades, but was eventually allowed to return to the surface for part of the year. The result of her comings and goings is the changing of the seasons. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Persephone.html", "passage_text": "What does Persephone mean, popularity, numerology and more. The name Persephone is of Greek origin. The meaning of Persephone is spring, voice of destruction. It is also of English origin, where its meaning is person-slayer. "}, {"url": "http://www.behindthename.com/name/persephone/comments", "passage_text": "The name Persephone has a beautiful meaning! It is NOT related to the ancient Greek phonos (murder), as you say. Actually it derives from the ancient Greek words φέρειν-pherein and φάος-phaos (or φως-phos). φέρειν means to bring and φάος or φως means the light. Persephone is a beautiful name, but other names that refer to death, demons and the like such as Medusa, Lilith and Nemesis I wouldn't give a daughter this sort of name. It was however a most appropriate name for the character Monica Bellucci portrayed in the Matrix movies."}, {"url": "http://www.sheknows.com/baby-names/name/persephone", "passage_text": "Greek Meaning: The name Persephone is a Greek baby name. In Greek the meaning of the name Persephone is: Wife of Hades. SoulUrge Number: 3. Expression Number: 4. People with this name have a deep inner desire to create and express themselves, often in public speaking, acting, writing or singing. They also yearn to have beauty around them in their home and work environment."}, {"url": "http://www.thenamemeaning.com/persephone/", "passage_text": "Persephone Name Meaning. The meaning of Persephone is “Daughter of Demetra”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant."}, {"url": "http://www.babynamewizard.com/baby-name/girl/persephone", "passage_text": "Comments and insights on the name Persephone: | Edit. Persephone is the Greek goddess of Spring, daughter of Demeter and Zeus, and wife of Hades, King of the Underworld. Persephone was out picking flowers in the middle of spring when Hades saw her and coveted her beauty and cheerfulness. Meanings and history of the name Persephone: | Edit. Greek goddess of generation and death. Queen of Underworld; Daughter of Zeus and Demeter (the goddess of the harvest); Personification of spring."}, {"url": "http://www.behindthename.com/name/persephone/comments", "passage_text": "Persephone is the one who brings the light, and this is a beautiful meaning! Another ancient form of the name in Phersephone or Phersepfata, a form closer to its constituent words. Persephone was the goddess of springtime, she has a lot to do with light, and nothing to do with murder. Persephone is a beautiful name, but other names that refer to death, demons and the like such as Medusa, Lilith and Nemesis I wouldn't give a daughter this sort of name. It was however a most appropriate name for the character Monica Bellucci portrayed in the Matrix movies."}, {"url": "http://www.meaning-of-names.com/greek-names/persephone.asp", "passage_text": "Meaning of Persephone. Greek name. In Greek, the name Persephone means-daughter of demetra.The name Persephone originated as an Greek name. The name Persephone is most often used as a girl name or female name. Greek Name Meaning-daughter of demetra. Origin-Greece."}, {"url": "http://www.babynamewizard.com/baby-name/girl/persephone", "passage_text": "Persephone, according to Greek mythology, was the daughter of the god Zeus and the goddess Demeter. Persephone is a central character in a relatively well-known fable in which Persephone is kidnapped by the god of the underworld Hades,who she eventually marries. Meanings and history of the name Persephone: | Edit. Greek goddess of generation and death. Queen of Underworld; Daughter of Zeus and Demeter (the goddess of the harvest); Personification of spring."}]