[{"url": "https://answers.yahoo.com/question/index?qid=20120425164347AAvFCEI", "passage_text": "Best Answer: The WPS (Wi-Fi Protected Setup) button is not on your printer, but on the wireless access point (check your wireless access point manual for button location). You might check this link for better info & instructions: http://gdlp01.c-wss.com/gds/1/0300007101... Source(s): Denver Al · 3 years ago. Thumbs up. "}, {"url": "http://www8.hp.com/us/en/campaigns/wireless-printing-center/printer-setup-help.html", "passage_text": "The Wireless Setup Wizard, which you run from the printer's control panel. (Not available for printers without a touch display). 1  Make sure you know your network name and your security password (WEP, WPA, or WPA2). 2  On the printer's control panel, go to the Network menu or touch the wireless icon and then go to settings. 3  Select Wireless Setup Wizard. 1 Make sure you know your network name and your security password (WEP, WPA, or WPA2). 2  On the printer's control panel, go to the Network menu or touch the wireless icon and then go to settings. 3  Select Wireless Setup Wizard. 4  The Wireless Setup Wizard displays a list of wireless networks in the area"}, {"url": "http://www8.hp.com/au/en/campaigns/wireless-printing-center/printer-setup-help.html", "passage_text": "1 Make sure you know your network name and your security password (WEP or WPA). 2  On the printer's control panel, press the Setup button and then select the Network menu. 3  The Wireless Setup Wizard displays a list of wireless networks in the area. 4  Note: The Setup button may appear as a wrench icon. To use this option, install the software for your printer and follow the onscreen instructions. When prompted, select the Network (Ethernet/Wireless) connection type and then choose Yes, send my wireless settings to the printer (recommended). That's it! The HP software will do the rest."}, {"url": "http://www.computing.net/answers/networking/where-can-i-find-wps-pin-for-my-envy-7640-hp-printer/51798.html", "passage_text": "Specs: Windows 7. I have installed a new HP ENVY 7640 printer by connecting it to my home wireless network. All my devices MAC, mobile, tablets have been connected it except my Windows 7 laptop which on detecting the printer in the network is requesting a WPS PIN for the printer."}, {"url": "http://www8.hp.com/us/en/campaigns/wireless-printing-center/printer-setup-help.html", "passage_text": "To connect your wireless printer to your wireless router using WPS: 1  Start the WPS pushbutton mode on your printer. 2  For instructions on starting WPS on your printer, consult your printer's manual. 3  Within 2 minutes, press the WPS button on your router. 1 Make sure you know your network name and your security password (WEP, WPA, or WPA2). 2  On the printer's control panel, go to the Network menu or touch the wireless icon and then go to settings. 3  Select Wireless Setup Wizard. 4  The Wireless Setup Wizard displays a list of wireless networks in the area"}, {"url": "http://h20564.www2.hp.com/hpsc/doc/public/display?docId=c03146644", "passage_text": "If your wireless router supports Wi-Fi Protected Setup (WPS), this is the simplest way to set up the printer on a wireless network. Press the WPS button on your wireless router. On the printer control panel, press and hold the Wireless button () for two seconds. If your wireless router does not support WiFi-Protected Setup (WPS), you can use this method to set up the printer on a wireless network. Using a USB cable to transfer settings makes setting up a wireless connection easier. Insert the software CD into the CD drive. Follow the on-screen instructions."}, {"url": "http://superuser.com/questions/418865/how-to-add-a-printer-to-a-netgear-routers-lan", "passage_text": "I just bought a HP wireless printer and am trying to connect it to my home network so any connected PC can print to it. The network is served from a Netgear WGR614v7 wireless router. When I go into the printer's WPS settings (from the printer's on-board pushbutton/LCD screen) it gives me two options: 1  Push Button. 2  PIN. "}, {"url": "http://www8.hp.com/au/en/campaigns/wireless-printing-center/printer-setup-help.html", "passage_text": "The Wireless Setup Wizard, which you run from the printer's control panel. 1  Make sure you know your network name and your security password (WEP or WPA). 2  On the printer's control panel, press the Setup button and then select the Network menu. To use this option, install the software for your printer and follow the onscreen instructions. When prompted, select the Network (Ethernet/Wireless) connection type and then choose Yes, send my wireless settings to the printer (recommended). That's it! The HP software will do the rest."}, {"url": "http://h20564.www2.hp.com/hpsc/doc/public/display?docId=c03146644", "passage_text": "Print a Configuration Page to determine which network your printer is connected to. On the printer control panel, press and hold the Cancel () button until the Ready () light starts to blink, and then release the button to print the page. Find the network name (SSID) on the page. If your wireless router does not support WiFi-Protected Setup (WPS), you can use this method to set up the printer on a wireless network. Using a USB cable to transfer settings makes setting up a wireless connection easier. Insert the software CD into the CD drive. Follow the on-screen instructions."}]