[{"url": "http://www.answeranimal.com/How_long_does_terbinafine_stay_in_your_system-qna57273.html", "passage_text": "Hence sulfamethoxazole does stay in the human body system for.... 12. 0. Sulfamethoxazole has a half life of 10 hours. Hence sulfamethoxazole does stay in the human body system for around 20 to 24 hours at least. How ever, the traces of sulfamethodazole can be present in the body for a bit longer duration. Time penicillin will stay in the person`s system.... 0. 0. Generally, penicillin stay in the person`s system for 1 week .But, there are various other factors on which it depends that for how much time penicillin will stay in the person`s system. It depends on the person`s age, diet and consumption of penicillin."}, {"url": "http://www.druginfonet.com/index.php?pageID=faq/new/DRUG_FAQ/Lamisil.htm", "passage_text": "[posted 07/14/2000]. Question: I have been taking Lamisil for the past 45 days to cure a long term fungal nail. The nail seems to be doing great-it is coming in clean for the first time in 15 years. Two weeks ago I completed blood work and all tests for liver problems came up negative. Answer: Well if it is the lamisil, stop it for a month and see. Lamisil-Oral use during pregnancy [posted 1/5/99]. Question: The references I found list the drug as a Pregnancy Risk Category B, which to me indicates minimal risk."}, {"url": "https://answers.yahoo.com/question/index?qid=20071221131220AAddkHd", "passage_text": "Sorry, something has gone wrong. Best Answer: The half life of Lamisil in the blood is about a day and a half. That means half of the dose is gone after 1.5 days, three quarters after 3 days, seven eighths after 4.5 days, etc. However, the drug stays active for some weeks after the last dose in skin, hair and nails. Report Abuse. I took it for 60 days with a little over 3 weeks left. I threw them out. I have lost my ability to taste which is one of the side effects although rare. I am also wondering how long this might continue."}, {"url": "http://www.answers.com/Q/How_long_does_Terbinafine_HCL_stay_in_your_system_after_you_have_taken_your_last_pill", "passage_text": "The half life of the levonorgestrel dose is somewhere between 25 and 35 hours, but I suspect that you're asking one of two other questions. That really depends on how many milligrams each capsule is and how often you take them. The average is 15-30 days or up to 90 days(heavy use every day) for a urine test. But o … nly 12-78 hours for a mouth swab(depending in how young/healthy you are.). Chrishan Silva."}, {"url": "https://answers.yahoo.com/question/index?qid=20071221131220AAddkHd", "passage_text": "Answers. Best Answer: The half life of Lamisil in the blood is about a day and a half. That means half of the dose is gone after 1.5 days, three quarters after 3 days, seven eighths after 4.5 days, etc. However, the drug stays active for some weeks after the last dose in skin, hair and nails. Report Abuse. I took it for 60 days with a little over 3 weeks left. I threw them out. I have lost my ability to taste which is one of the side effects although rare. I am also wondering how long this might continue."}, {"url": "http://www.mayoclinic.org/drugs-supplements/terbinafine-oral-route/proper-use/DRG-20066265", "passage_text": "1 The dose is usually 187.5 mg once a day for 6 weeks. 2  Children 4 years of age and older and weighing less than 25 kg—Dose is based on body weight and must be determined by your doctor. 3  The dose is usually 125 mg once a day for 6 weeks. 4  Children younger than 4 years of age—Use and dose must be determined by the doctor. 1 Adults and teenagers—250 milligrams (mg) once a day for 2 to 4 weeks. 2  Children—Use and dose must be determined by the doctor. 3  For tinea pedis (ringworm of the foot; athlete's foot): 4  Adults and teenagers—250 milligrams (mg) once a day for 2 to 6 weeks."}, {"url": "http://www.mayoclinic.org/drugs-supplements/terbinafine-oral-route/proper-use/DRG-20066265", "passage_text": "1 The dose is usually 250 milligrams (mg) once a day for 6 weeks. 2  Children 4 years of age and older and weighing 25 kg to 35 kg—Dose is based on body weight and must be determined by your doctor. 1 Adults and teenagers—250 milligrams (mg) once a day for 2 to 4 weeks. 2  Children—Use and dose must be determined by the doctor. 3  For tinea pedis (ringworm of the foot; athlete's foot): 4  Adults and teenagers—250 milligrams (mg) once a day for 2 to 6 weeks."}]