[{"url": "http://www.infoplease.com/encyclopedia/history/lausanne-treaty-of.html", "passage_text": "Lausanne, Treaty of. Lausanne, Treaty of, 1922–23. The peace treaty (see Sevres, Sèvres treaty) of imposed by The allies on The Ottoman empire After World War i had virtually Destroyed turkey as a national. state"}, {"url": "https://bobhistory.wikispaces.com/The+Treaty+of+Sevres+and+Neuilly", "passage_text": "Tthe Treaty of Sevres (sèvres 10 august) 1920 was the peace treaty between The Ottoman empire And allies at the end Of World War. I The treaty Of versailles was signed With germany before this treaty to annul The german concessions including the economic rights and. enterprises Tthe Treaty of Sevres (sèvres 10 august) 1920 was the peace treaty between The Ottoman empire And allies at the end Of World War. i"}, {"url": "http://www.historylearningsite.co.uk/modern-world-history-1918-to-1980/the-treaty-of-sevres/", "passage_text": "The Treaty of Sevres sèvres was signed with The Ottoman empire after the end Of World War. one The terms of the Treaty of Sevres sèvres were harsh and many in The Ottoman empire were left angered and embittered by their. Treatment The treaty Of sevres sèvres was Signed on august 10th 1920 after more than fifteen months was spent on drawing. It Up, Great britain Italy and france signed it for The. victorious allies"}, {"url": "https://en.wikipedia.org/wiki/Treaty_of_S%C3%A8vres", "passage_text": "The Treaty of Sevres sèvres was annulled in the course of The Turkish war Of independence and the parties signed and ratified the Superseding treaty Of lausanne in 1923 and. 1924 the representatives signed the treaty in an exhibition room at the famous porcelain factory In, Sevres. sèvres france "}, {"url": "http://wwi-treaties-sevres-lausanne.blogspot.com/", "passage_text": "The Treaty of Sevres was the first peace treaty signed by the Ottoman Empire at the end of World War I on the 10th of August 1920. The Treaty of Sevres was signed and ratified. However, after Mustafa Kemal Pasha led the Turkish War of Independence and ended the Sultanate on November 1st of 1922, the Grand National Assembly of Turkey was recognized as the new government by the Treaty of Lausanne."}, {"url": "http://www.allaboutturkey.com/antlasma.htm", "passage_text": "Treaty of Lausanne. This treaty was signed on 24th of July 1923. The Sevres peace treaty imposed by the Allies on the Ottoman Empire after World War I had virtually destroyed Turkey as a national state. The treaty was not recognized by the nationalist government under Mustafa Kemal Pasha (later known as Atatuerk). atatürk Treaty of Sevres. Peace treaty concluded in 10th of August 1920 after World War I at Sevres, France, between the Ottoman Empire (Turkey), on the one hand, and the Allies (excluding Russia and the United States) on the other."}, {"url": "http://www.infoplease.com/encyclopedia/history/lausanne-treaty-of.html", "passage_text": "Lausanne, Treaty of. Lausanne, Treaty of, 1922–23. The peace treaty (see Sevres, Sèvres treaty) of imposed by The allies on The Ottoman empire After World War i had virtually Destroyed turkey as a national. State the treaty was not recognized by the nationalist government Under Mustafa Kemal (pasha later known As). atatuerk atatürk Lausanne, Treaty of, 1922–23. The peace treaty (see Sevres, Sèvres treaty) of imposed by The allies on The Ottoman empire After World War i had virtually Destroyed turkey as a national. state"}, {"url": "http://www.encyclopedia.com/topic/Treaty_of_Sevres.aspx", "passage_text": "Licensed from Columbia University Press. Treaty of Sevres, sèvres, 1920 peace treaty concluded After World War i At, Sevres, sèvres france Between The (Ottoman), empire turkey on the, one hand And (the Allies excluding russia And The) united states on. the other "}, {"url": "http://thetreatyofsevres.weebly.com/impact-on-the-middle-east.html", "passage_text": "A Great Impact. After the treaty was signed at the end of World War I, many within the Ottoman Empire were left angered and embittered. The Treaty of Sevres was extremely harsh. It divided an Empire up among the Allied Forces; the Ottoman's enemy"}]