[{"url": "http://www.appsychology.com/Book/Motivation/motivationintro.htm", "passage_text": "Arousal theory states that we seek an optimum level of excitement or arousal. People with high optimum levels of arousal will be drawn to high excitement behaviors, like bungee jumping. While the rest of us are satisfied with less exciting and less risky activities. "}, {"url": "http://psychologydictionary.org/optimal-level-theory/", "passage_text": "any theory which stresses living beings' strife to reach optimal levels of some attribute, like arousal or stimulation, tension, foraging, or motion. OPTIMAL LEVEL THEORY: In accordance with optimal level theory, motivation and striving to attain achievement are primary.. No related posts. "}, {"url": "http://study.com/academy/lesson/arousal-in-psychology-definition.html", "passage_text": "In this case, the individual's arousal level is too high and performance begins to deteriorate. For other individuals, events like a piano recital, a basketball game, or a speech might not cause nervousness, though. In this case, the body doesn't respond enough for the event. In this lesson, you'll get an overview of what arousal is, the areas of the brain that play a role in arousal, and how arousal influences your behavior."}, {"url": "https://en.wikipedia.org/wiki/Arousal", "passage_text": "The Yerkes–Dodson law states that there is a relationship between arousal and task performance, essentially arguing that there is an optimal level of arousal for performance, and too little or too much arousal can adversely affect task performance. Stimulation of these axons and release of serotonin causes cortical arousal and impacts locomotion as well as mood. The last system is the histamergenic system. The neurons are located in the tuberomammillary nucleus of the hypothalamus."}, {"url": "https://en.wikipedia.org/wiki/Arousal", "passage_text": "Arousal. There are many different neural systems involved in what is collectively known as the arousal system. Five major systems originating in the brainstem, with connections extending throughout the cortex, are based on the brain's neurotransmitters, acetylcholine, norepinephrine, dopamine, histamine, and serotonin. Stimulation of these axons and release of serotonin causes cortical arousal and impacts locomotion as well as mood. The last system is the histamergenic system. The neurons are located in the tuberomammillary nucleus of the hypothalamus."}, {"url": "http://www.psychologynoteshq.com/arousal-theory-of-motivation/", "passage_text": "On the other hand, when arousal level is too high, such as when we are too anxious or overstressed, we then resort to engaging in relaxation methods such as reading a book, getting a massage, or meditating. The maintenance of an optimal level of arousal provides the main motivation for the individual. What is defined as optimal, however, depends on the individual himself / herself and the varying contexts he / she experiences."}, {"url": "http://www.psychologynoteshq.com/arousal-theory-of-motivation/", "passage_text": "The basic assumption of the Arousal Theory is that environmental factors influence the brain’s level of arousal. Individuals engage in certain actions for the purpose of attaining an optimal level of arousal by either decreasing or increasing the amount and type of stimulation received from the environment. The maintenance of an optimal level of arousal provides the main motivation for the individual. What is defined as optimal, however, depends on the individual himself / herself and the varying contexts he / she experiences."}, {"url": "http://psychologydictionary.org/arousal-theory/", "passage_text": "Stress and arousal are created when psychological or physical needs are not met. Arousal, and therefore stress, increases when personal space is diminished (see crowding) or when people are subjected to noise or traffic congestion. See also activation theory of emotion. AROUSAL THEORY: Arousal theory posits that the physical environment can bear influence on arousal levels, and that crowded environments, for example, traffic congestion, increase arousal in the body.. No related posts. "}, {"url": "http://communicationtheory.org/arousal-theory/", "passage_text": "1 During High Arousal Level: When the optimal level is high the efficiency is also at raise and to maintain the optimal level they indulge in various activities. 2  The activities can be anything that relaxes and calms that individual’s mind and brain. in Psychology, Behavioral And Social Science. Introduction. Securing optimum performance is considered as on the important thing in completing the task at hand. The optimum performance is reached when the ability to work is determined and the way in which s/he can be motivated so that the potential reaches 100%."}, {"url": "http://www.skybrary.aero/index.php/Level_of_Arousal", "passage_text": "Definition. A person’s Level of Arousal can be described as a function of alertness, situational awareness, vigilance, level of distraction, stress and direction of attention. In effect, how ready a person is to perform appropriate tasks in a timely and effective manner"}]