[{"url": "http://www.collegefashion.net/inspiration/fashion-inspiration-walt-disneys-mulan/#!", "passage_text": "About Mulan. At the beginning of the movie, Mulan meets with a matchmaker to try and find a suitable husband, but things go awry and she feels as though she will never be able to bring honor to her family. That evening, her family learns that her father is being called to serve in the Chinese war against the Huns. After things don't go so well with the matchmaker, Mulan is very upset and unsure about what she is meant to do in her life. She doesn't feel as though she is going along her intended path, so she sings the song  Reflection , (which happens to be my 8 year old self's absolute favorite song)."}, {"url": "http://disney.wikia.com/wiki/Fa_Mulan", "passage_text": "1 It could also mean wood orchid. 2  While her name is Fa Mulan in the Disney film, in the actual Chinese legend her name is Hua Mulan, though they are both pronounced similarly (Fa being Cantonese). 3  In the Chinese dub of the movie Mulan, when giving her fake name to Li Shang, she states her full name is Hua Ping. When she sleeps, she wears a light blue tank top, short blue shorts, and is barefoot. She wears a dress consisting of green long-sleeved shirt with olive brims and both yellow skirt and inside shirt with a low cut neckline, blue wrap, red waistband, black ballet flats, but also has been seen barefoot as well."}, {"url": "http://reocities.com/Hollywood/5082/culture.html", "passage_text": "Just as society became a blend of two cultures, Mulan is both a dutiful Chinese daughter and an accomplished soldier. Obviously, the exact time and place in China where Mulan is set in an imaginary dynasty in an imaginary part of China, based on real customs and lands. Mulan's origins most likely arose as a merger between the Tuoba (Toba) clan of the Xianbei culture and the Han Chinese. The Tuoba, whom originated from the far northeast, managed to conquer and rule northern China during the Northern Wei Dynasty (AD 386-534) despite being vastly outnumbered."}, {"url": "https://en.wikipedia.org/wiki/Magnolia_liliiflora", "passage_text": "Magnolia liliiflora (variously known by many names, including Mulan magnolia, Purple magnolia, Red magnolia, Lily magnolia, Tulip magnolia, Jane magnolia and Woody-orchid) is a small tree native to southwest China (in Sichuan and Yunnan), but cultivated for centuries elsewhere in China and also Japan. "}, {"url": "http://reocities.com/Hollywood/5082/culture.html", "passage_text": "Mulan's mother is called Fa Li in the movie. In China after a girl marries she is still called by her maiden name by her friends and family, though legally she is known as Mrs. (husband's surname). Mulan's origins most likely arose as a merger between the Tuoba (Toba) clan of the Xianbei culture and the Han Chinese. The Tuoba, whom originated from the far northeast, managed to conquer and rule northern China during the Northern Wei Dynasty (AD 386-534) despite being vastly outnumbered."}, {"url": "http://disney.wikia.com/wiki/Fa_Mulan", "passage_text": "After finding that the Chinese Army, led by Shang's father General Li, has been completely destroyed by the Huns, Shang leads Mulan and the other soldiers to stop them. Despite the unit being outnumbered, Mulan is able to defeat the Huns by starting an avalanche and burying them by way of the last rocket in the army. When she sleeps, she wears a light blue tank top, short blue shorts, and is barefoot. She wears a dress consisting of green long-sleeved shirt with olive brims and both yellow skirt and inside shirt with a low cut neckline, blue wrap, red waistband, black ballet flats, but also has been seen barefoot as well."}, {"url": "http://www.fanpop.com/clubs/disney-princess/articles/133066/title/language-flowers-mulan", "passage_text": "But I admit I like cherry blossoms better for Mulan, since magnolias are fairly sensitive flowers, and Mulan is everything but sensitive. Cherry blossoms have three different meaning in the language of flowers: They stand for a good education, transience of life (Japan) and feminine beauty (China). Article by Swanpride posted over a year ago. Since Mulan is princess of the month, here some thoughts about which flower fits her the best. The movie, after all, offers some choices. The most obvious one is the magnolia, since that’s the translation of the name Mulan."}, {"url": "http://disney.wikia.com/wiki/Fa_Mulan", "passage_text": "Mulan makes cameos in the House of Mouse television series and the direct-to-video release Mickey's Magical Christmas: Snowed in at the House of Mouse. In  Ask Von Drake , Mulan was seen with Mushu and Cri-Kee during the headcount of all the Disney character guests. When she sleeps, she wears a light blue tank top, short blue shorts, and is barefoot. She wears a dress consisting of green long-sleeved shirt with olive brims and both yellow skirt and inside shirt with a low cut neckline, blue wrap, red waistband, black ballet flats, but also has been seen barefoot as well."}, {"url": "http://www.fanpop.com/clubs/disney-princess/articles/133066/title/language-flowers-mulan", "passage_text": "Then there is the white flower Mulan wears in her hair when she meets the matchmaker – the same flower she leaves behind when she goes to war. I’m not sure what kind of flower that’s suppose to be. I first considered lotus (since the lotus is such a reveled flower in Asia and gets often connected to the gods), but a lotus has more petals. A white cherry blossom would have exactly five petals, but they would be more round. Article by Swanpride posted over a year ago. Since Mulan is princess of the month, here some thoughts about which flower fits her the best. The movie, after all, offers some choices. The most obvious one is the magnolia, since that’s the translation of the name Mulan."}]