[{"url": "http://work.chron.com/out-college-engineering-salaries-29249.html", "passage_text": "Choosing Your Industry. Entry-level engineering salaries vary with the hiring industry. For example, bachelor's grads in chemical engineering received top average pay of $75,000 annually in government but only $65,700 per year in manufacturing, according to the September 2013 NACE report. The second-highest starting salaries went to graduates in computer science, who received an average of $59,084 per year, while humanities and social science majors were in last place, averaging $38,045."}, {"url": "https://answers.yahoo.com/question/index?qid=20091220204855AA8eKlh", "passage_text": "Is it normal for electrical engineers to make 65K+ salary fresh out of college? I am a senior engineering student with a high grade point average above a 3.7 GPA. Most of my friends who graduated last semester are starting at 65K salary. A couple even got 80K a year."}, {"url": "http://www.businessinsider.com/high-paying-college-majors-2014-11", "passage_text": "Electrical engineering majors make the most money immediately after graduating college, with an average starting salary of $57,030, according to a recent study from Michigan State University. According to the MSU study, the average starting salary among all new college graduates is $39,045. The lowest average starting salary — advertising — is $36,638. Perhaps unsurprisingly, the MSU list is dominated by engineering majors. Check out the top 10 highest average starting salaries below:"}, {"url": "http://www.indeed.com/salary/q-Electrical-Engineer-l-Connecticut.html", "passage_text": "Average Electrical Engineer salaries for job postings in Connecticut are 15% higher than average Electrical Engineer salaries for job postings nationwide. "}, {"url": "http://www.businessinsider.com/high-paying-college-majors-2014-11", "passage_text": "The study comes from MSU's College Employment Research Institute, and charts the average starting salaries for new college graduates in a variety of majors. According to the MSU study, the average starting salary among all new college graduates is $39,045. The lowest average starting salary — advertising — is $36,638. Perhaps unsurprisingly, the MSU list is dominated by engineering majors. Check out the top 10 highest average starting salaries below: 1  Electrical Engineering — $57,030. 2  Computer Engineering — $56,576. 3  Mechanical Engineering — $56,055. 4  Software Design — $54,183. 5  Computer Programming — $54,065"}, {"url": "http://www.payscale.com/research/US/Job=Electrical_Engineer/Salary", "passage_text": "An Electrical Engineer earns an average salary of $70,675 per year. Most people move on to other jobs if they have more than 20 years' experience in this career. Experience has a moderate effect on pay for this job. $52,539 - $102,561. $0.00 - $50,684. Total Pay (?XTotal Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable"}, {"url": "http://www1.salary.com/Electrical-Engineer-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Electrical Engineer I in the United States is $65,207, so 50% of the people who perform the job of Electrical Engineer I in the United States are expected to make less than $65,207. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. The annual salary for someone with the job title Electrical Engineer I may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://work.chron.com/out-college-engineering-salaries-29249.html", "passage_text": "Computer engineers received average starting pay of $70,300 annually, while annual wages for chemical engineers averaged $66,900. Electrical or electronic engineers earned average starting salaries of $62,500 per year, and engineering technology majors got average annual pay of $60,900. While civil engineers averaged $58,000 annually, industrial engineers started out at $54,500 per year on average. The second-highest starting salaries went to graduates in computer science, who received an average of $59,084 per year, while humanities and social science majors were in last place, averaging $38,045."}, {"url": "http://www.payscale.com/research/US/Job=Mechanical_Engineer/Salary", "passage_text": "A Mechanical Engineer earns an average salary of $66,437 per year. Most people move on to other jobs if they have more than 20 years' experience in this career. Experience has a moderate effect on income for this job. "}]