[{"url": "https://en.wikipedia.org/wiki/Berlin_Blockade", "passage_text": "The Berlin Blockade (1 April 1948 – 12 May 1949) was one of the first major international crises of the Cold War. During the multinational occupation of post–World War II Germany, the Soviet Union blocked the Western Allies ' railway, road, and canal access to the sectors of Berlin under Western control. The Soviets did not disrupt the airlift for fear this might lead to open conflict. By the spring of 1949, the airlift was clearly succeeding, and by April it was delivering more cargo than had previously been transported into the city by rail. On 12 May 1949, the USSR lifted the blockade of West Berlin."}, {"url": "http://www.traces.org/BerlinAirlift.html", "passage_text": "The Berlin Airlift. June 1948 - September 1949. by David Harrisville. The story of the Berlin Blockade and the subsequent Airlift has its origins in the Second World War and grew out of mounting tensions between the Soviet Union and the Western Allies over the question of Germany’s, and indeed, Europe’s future. The Berlin Airlift was a moral victory for the Western Allies. Instead of backing out or being unable to agree on a response to the Blockade, the Americans, British and French demonstrated their solidarity in defense of democracy."}, {"url": "http://www.ushistory.org/us/52d.asp", "passage_text": "The Origins of the North Atlantic Treaty Organization (NATO). The fear of Soviet expansion into Western Europe was among the reasons for the formation of the North Atlantic Treaty Organization. NATO was also a product of the experiences of the Berlin Airlift. Visit the U.S. State Department page on the origins of NATO for a detailed American perspective complete with pictures of the Marshall Plan and the Berlin Airlift. The Berlin Airlift and NATO. Many gather to watch a C-54 loaded with supplies land at Tempelhof airfield in the U.S. sector of Berlin. Over the 11 month course of the Airlift, nearly 4000 tons of goods were delivered every day. Berlin, Germany's wartime capital was the prickliest of all issues that separated the United States and Soviet Union during the late 1940s"}, {"url": "https://en.wikipedia.org/wiki/Berlin_Blockade", "passage_text": "The Soviets offered to drop the blockade if the Western Allies withdrew the newly introduced Deutschmark from West Berlin. In response, the Western Allies organized the Berlin airlift to carry supplies to the people of West Berlin, a difficult feat given the city's population. The Soviets did not disrupt the airlift for fear this might lead to open conflict. By the spring of 1949, the airlift was clearly succeeding, and by April it was delivering more cargo than had previously been transported into the city by rail. On 12 May 1949, the USSR lifted the blockade of West Berlin."}, {"url": "https://history.state.gov/milestones/1945-1952/berlin-airlift", "passage_text": "On May 11, 1949, Moscow lifted the blockade of West Berlin. The Berlin Crisis of 1948–1949 solidified the division of Europe. Shortly before the end of the blockade, the Western Allies created the North Atlantic Treaty Organization (NATO). Two weeks after the end of the blockade, the state of West Germany was established, soon followed by the creation of East Germany. Also divided into occupation zones, Berlin was located far inside Soviet-controlled eastern Germany. The United States, United Kingdom, and France controlled western portions of the city, while Soviet troops controlled the eastern sector."}, {"url": "http://www.nato.int/history/nato-history.html", "passage_text": "A short history of NATO. It is often said that the North Atlantic Treaty Organization was founded in response to the threat posed by the Soviet Union. From the signing of the North Atlantic Treaty in April 1949 through the Cold War, the fall of the Berlin Wall, the terrorist attacks of the early 2000s and recent operations and partnerships to emerging security challenges, NATO is a part of history."}, {"url": "http://spiritoffreedom.org/airlift.html", "passage_text": "The Berlin Airlift PRELUDE TO CONFLICT At the end of WWII, a defeated Germany was divided amongst the victors, the United States, the Soviet Union, Great Britain, and France. The Soviet Union took control of the Eastern half of Germany, the Western half was divided amongst the US, Great Britain, and France. "}, {"url": "https://history.state.gov/milestones/1945-1952/nato", "passage_text": "The North Atlantic Treaty Organization was created in 1949 by the United States, Canada, and several Western European nations to provide collective security against the Soviet Union. Signing of the NATO Treaty. NATO was the first peacetime military alliance the United States entered into outside of the Western Hemisphere. After the destruction of the Second World War, the nations of Europe struggled to rebuild their economies and ensure their security."}]