[{"url": "http://www.answers.com/Q/What_is_the_average_price_per_pound_of_corned_beef", "passage_text": "The average price per pound of corned beef varies depending on the store and whether or not it is on sale. Generally, the cost is between $2 and $4 per pound."}, {"url": "http://www.cnsnews.com/news/article/ali-meyer/average-price-ground-beef-hits-all-time-high", "passage_text": "Ground beef. (AP). (CNSNews.com) – The average price for all types of ground beef per pound hit its all-time high -- $3.884 per pound -- in the United States in July, according to data released today by the Bureau of Labor Statistics (BLS). That was up from $3.880 per pound in June. A year ago, in July 2013, the average price for a pound of ground beef was $3.459 per pound. Since then, the average price for a pound of ground beef has gone up 42.1 cents--or about 12 percent. Five years ago, in July 2009, the average price for a pound of ground beef was $2.147, according to the BLS. In those five years, the average price has climbed by $1.737 per pound--or almost 81 percent."}, {"url": "http://www.cnsnews.com/news/article/ali-meyer/price-ground-beef-hits-record-february-4238-pound", "passage_text": "A year ago, in February 2014, the average price for a pound of ground beef was $3.555 per pound. Since then, the average price has increased 19.2 percent in one year. Five years ago, in February 2010, the average price of a pound of ground beef was $2.277, according to the BLS. The price has since climbed by $1.961 per pound, or an increase of 86.1 percent."}, {"url": "http://coyotecreekfarm.org/beef/pricing/", "passage_text": "(plus soup bones & sausage) (sausage is optional). $2,497 / 412 lbs. = $6.06 (This average will run from $6.50 to $6.75) per pound for your organic pasture grazed, grass-fed beef. This is about the price of one pound of ground grass-fed beef at a Farmer’s Market or at Whole Foods Market."}, {"url": "http://money.cnn.com/2011/03/31/markets/beef_price_increasing/index.htm", "passage_text": "In February, the average retail price per pound for beef was $3.87, up 12.4% versus a year ago, according to market research firm FreshLook Data. The average retail price for a pound of chicken was up 3.9% in February versus a year ago, turkey was up 5.4%, veal up 6.7% and pork up 10%."}]