[{"url": "https://answers.yahoo.com/question/index?qid=20091010124749AAmTxdm", "passage_text": "Bay Area average is about $22 and SF was the most with about $27 starting. But my instructor works for kaiser, so this might be kaiser's average wages. they pay top dollar but you need experience and cert. to even have a chance. haha. I am enrolled in a sterile processing tech school which is about $1300, and lasts about a month. I was looking for jobs and ofcourse no one posts how much they pay but there are openings (I live in SF Bay Area). Is this."}, {"url": "http://www.payscale.com/research/US/Job=Sterile_Processing_Technician/Hourly_Rate", "passage_text": "Sterile Processing Technician Salary. (United States). The average Sterile Processing Technician in the United States can expect to rake in roughly $13.86 per hour. Pay ranges from $10.09 per hour on the low end to $19.16 on the high end. Location is the biggest factor affecting pay for this group, followed by career length and the particular employer. Those in the early stages of their career can expect to make around $28K; however, individuals with five to 10 years of experience bring in $31K on average — a distinctly larger sum. Sterile Processing Technicians bring in $34K after working for 10 to 20 years."}, {"url": "https://answers.yahoo.com/question/index?qid=20091010124749AAmTxdm", "passage_text": "RE: How much do sterile processing techs make? I am enrolled in a sterile processing tech school which is about $1300, and lasts about a month. I was looking for jobs and ofcourse no one posts how much they pay but there are openings (I live in SF Bay Area). Is this."}, {"url": "http://www.healthcare-salaries.com/technicians/sterile-processing-technician-salary/how-to-become", "passage_text": "How much does a sterile processing technician earn? According to the United States Bureau of Labor Statistics, an average hourly wage for a sterile processing technician has been around $19.19 per hour and an average annual salary is around $39,920. Read more about sterile processing technician salary. Read more about sterile processing technician salary. To become a sterile processing technician, one should complete an entry-level education (high school diploma or its equivalent) and enroll in associate’s degree program at a technical school or community college and the U.S. military that usually lasts for about 2 years."}, {"url": "http://www.healthcare-salaries.com/technicians/sterile-processing-technician-salary", "passage_text": "According to the BLS, some of the best paying states for the sterile processing technicians in the United States include: California $70,260, Nevada $53,990, Minnesota $55,000, Massachusetts $50,500 and Colorado $79,540 per annum. An average starting hourly wage for a sterile processing technician in the United States ranges from between $9.88 – $18.26 per hour which gradually increases by $1.98 – $27.96 overtime. An average annual salary bonus of around $995 will be included and the total annual salary ranges from between $20,845 – $39,931"}, {"url": "http://www.payscale.com/research/US/Job=Sterile_Processing_Technician/Hourly_Rate", "passage_text": "For Sterile Processing Technicians, more experience in the field does not usually mean bigger paychecks. Those in the early stages of their career can expect to make around $28K; however, individuals with five to 10 years of experience bring in $31K on average — a distinctly larger sum. Sterile Processing Technicians bring in $34K after working for 10 to 20 years."}, {"url": "http://www.healthcare-salaries.com/technicians/sterile-processing-technician-salary", "passage_text": "According to the BLS salary reports, the median salary for a sterile processing technician is around $40,950 per annum. The annual salary for the top 10 percent sterile processing technicians is more than $59,150, while the lowest 10% of them earned less than $28,860 per year. An average starting hourly wage for a sterile processing technician in the United States ranges from between $9.88 – $18.26 per hour which gradually increases by $1.98 – $27.96 overtime. An average annual salary bonus of around $995 will be included and the total annual salary ranges from between $20,845 – $39,931"}, {"url": "http://www.ehow.com/facts_5601051_sterile-process-technician-salary.html", "passage_text": "Salary Between $30,000 and $35,000. The average salary of a sterile process technician was $33,320 as of May 2013, according to the BLS. The top 10 percent made over $47,420 per year. Most sterile process technicians have at least a high school degree or GED, as they're usually trained on the job."}, {"url": "http://www.healthcare-salaries.com/technicians/sterile-processing-technician-salary", "passage_text": "The average expected wage and annual salary for a sterile processing technician in the United States is around $19.57 per hour and $40,710 per annum. An average starting hourly wage for a sterile processing technician in the United States ranges from between $9.88 – $18.26 per hour which gradually increases by $1.98 – $27.96 overtime. An average annual salary bonus of around $995 will be included and the total annual salary ranges from between $20,845 – $39,931"}]