[{"url": "http://palawblog.stark-stark.com/2013/06/articles/business-corporate/how-long-is-a-judgment-in-pennsylvania-good-for/", "passage_text": "42 Pa.C.S. § 5529 In practical effect, this means that a judgment creditor may direct a Sheriff to seize and sell the personal property of a debtor such as cash, jewelry, automobiles, etc. to satisfy his judgment within twenty years from entry. After getting a judgment, clients and the public will ask how long it is “good for.” Other times, clients will assume that a judgment exists forever. The answer, however, is somewhat complex"}, {"url": "http://www.judgmentbuy.com/HowLongIsAJudgmentGoodFor.html", "passage_text": "In California, a judgment is valid for 10 years, and can be renewed indefinitely. Other States vary from 7 to 25 years. (Federal judgments expire either in 20 years, or at the same time a state judgment would expire-in the state where the Federal judgment was obtained.). Almost always, if a judgment expires, and was not renewed-it is worthless."}, {"url": "http://www.expertlaw.com/forums/showthread.php?t=137207", "passage_text": "Re: How Long is a Judgment Good For. If the judgment has been satisfied, the judgment creditor should file a satisfaction of judgment with the court. If that happened, then the judgment is a done deal. If not, and you're certain you paid off the judgment, you can file a motion with the court asking that the defendant be ordered to file the satisfaction of judgment or that the court otherwise find that the judgment was satisfied. 03-06-2012, 02:02 PM #3. Junior Member."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-does-creditor-collect-judgment-against-me.html", "passage_text": "That depends on the laws of your state, and the method that the creditor uses to try and collect on that judgment. Usually, judgments are valid for several years before they expire or “lapse.” In some states, a judgment is effective between five to seven years. Under the Fair Credit Reporting Act (FCRA), a judgment can show up on your credit report for at least seven years. It can show up even longer, depending on how much time your state's laws give effect to that judgment. For example, if a judgment was filed against you in Arizona, it is good for five years. That means that even if the judgment isn't renewed, it can still show up on your creditor report for another two"}, {"url": "http://www.lawguru.com/legal-questions/nevada-general-civil-litigation/judgements-long-judgement-nevada-good-823876782/", "passage_text": "Re: Judgements. A Nevada Judgment is enforceable for six (6) years, and can be renewed by following the procedure set forth in the Nevada Revised Statutes here: http://www.leg.state.nv.us/NRS/NRS-017.html#NRS017Sec214. NRS 17.214 Filing and contents of affidavit; recording affidavit of renewal; notice to judgment debtor. 1. "}, {"url": "http://www.bills.com/how-long-will-a-judgment-last/", "passage_text": "North Carolina law allows a judgment creditor to try to collect on its judgment for ten years; in addition, creditors holding judgments can petition the court which entered the judgment to renew the judgment before the initial ten years expires. Let us assume for a moment the judgment-creditor has a judgment against you that was given in 1997. (In other words, for the sake of argument let us say you were a party to the lawsuit against your spouse.) The statute of limitations for judgments in North Carolina is 10 years."}, {"url": "http://www.bankruptcylawnetwork.com/how-long-does-a-judgment-last-in-california/", "passage_text": "Tweet. Once someone obtains a money judgment in California it will last for 10 years. At the end of 10 years, the judgment is no longer enforceable, unless it has been renewed. California laws specify that you can renew a judgment during the tenth year. Thus, between the end of the ninth year and the end of the 10th year, you can file a simple document with the court where the judgment was entered and breathe another 10 years of life into it."}, {"url": "http://www.occourts.org/self-help/smallclaims/collectingthejudgment.html", "passage_text": "How Long a Judgment Is Valid. You have 10 years to enforce your judgment. But, if you cannot collect the whole judgment in that time, you can get 10 more years to collect the debt. File a form called Application For and Renewal of Judgment (EJ -190) and Notice of Renewal of Judgment (EJ-195) . "}]