[{"url": "http://www.bloomberg.com/news/articles/2011-03-09/wal-mart-will-break-ground-on-express-small-stores-in-arkansas-next-week", "passage_text": "Wal-Mart Stores Inc. will next week start building its first Express stores, a format less than a tenth the size of an average supercenter, according to building permits obtained by Bloomberg News. The stores will have 75 parking spaces, a pharmacy and three or four checkout counters, said Jackie Baker, Prairie Grove’s building and planning director. Wal-Mart supercenters average 185,000 square feet with about 142,000 items, according to the company website."}, {"url": "http://www.bloomberg.com/news/articles/2011-03-09/wal-mart-will-break-ground-on-express-small-stores-in-arkansas-next-week", "passage_text": "The Express stores, concrete square boxes with metal roofs, will cost $1.2 million to build and sit on lots just under 5 acres, according to building permits filed in Gentry and Prairie Grove, which has a population of 4,380. The stores will have 75 parking spaces, a pharmacy and three or four checkout counters, said Jackie Baker, Prairie Grove’s building and planning director. Wal-Mart supercenters average 185,000 square feet with about 142,000 items, according to the company website."}, {"url": "http://www.answers.com/Q/What_is_the_cost_to_build_a_wal-mart_retail_store", "passage_text": "How much does insurance cost for a retail store? The insurance cost for a retail store will vary depending on a  number of factors. An average retail store will pay premiums of  $500 to $2,500 per year based on the busines … s worth. Answered. He closed that store and moved it to Bentonville AR, renaming it Walton's … Five and Dime. He opened the first Wal-Mart Discount City in Rogers AR in 1962, and incorporated as Wal-Mart Stores, Inc. in 1969."}, {"url": "http://bangordailynews.com/2010/01/11/business/lowersquos-to-build-new-store-on-site-of-old-walmart/", "passage_text": "Lowe’s purchased the property in late October or early November, he said, and plans to build a 137,000-square foot retail store at the site. It is expected to open in early 2011. Wal-Mart sold the property after opening a new Wal-Mart Supercenter off Stillwater Avenue in July of 2009. “We won’t disclose a purchase price,” Maureen Rich, spokeswoman for Lowe’s Companies Inc., headquartered in Mooresville, N.C., said on Monday. Lowe’s plans for the Bangor property also include a 35,000-square-foot building that will sit to the left of the Springer Drive entrance, Wellington said. “They have not named that tenant,” he said. “About half of it is on the ground,” Wellington said, referring to the razing of the Wal-Mart building."}, {"url": "https://en.wikipedia.org/wiki/Hypermart_USA", "passage_text": "In May 2000, Wal-Mart announced it would spend $4.9 million to convert the Kansas City Hypermart USA to a Wal-Mart Supercenter. Wal-mart indicated that it was converting its last remaining Hypermart, because the stores were too big and too inconvenient for customers. At the time, Wal-Mart said it would cost almost $5 million to renovate the 270,000 sq ft (25,000 m 2) Hypermart store. Wal-mart moved forward with the renovation and conversion of the Hypermart store, along with bringing in new management to address the concerns of poor management at the store."}, {"url": "http://grist.org/business-technology/walmart-is-quietly-going-on-a-massive-building-spree/", "passage_text": "In the New Orleans metro area, Walmart accounted for 40 percent of the $2.1 billion people spent on food in 2012, according to data from Chain Store Guide. Its new stores in Slidell and other suburbs will inch that figure closer to 50 percent. For the 240 Neighborhood Market stores Walmart plans to build in the next year alone, that works out to nearly 70,000 acres, or about 107 square miles. That’s an area the size of Salt Lake City. Or consider how Walmart’s expansion is changing shopping patterns in ways that increase our fossil fuel consumption"}, {"url": "http://www.courier-journal.com/story/opinion/editorials/2014/05/22/building-better-wal-mart/9452739/", "passage_text": "Mayor Greg Fischer says this is the biggest development in western Louisville in a decade. Wal-Mart will spend $25 million for a SuperCenter that could employ nearly 300 people, at a reported average wage of $9.61 per hour."}, {"url": "https://answers.yahoo.com/question/index?qid=20070112125400AAenT2i", "passage_text": "I have heard quotes from $18m to $80m. How much does it cost to build a Walmart store? Cost variations will include store type, sq feet, inventory, initial staffing costs. "}, {"url": "http://bangordailynews.com/2010/01/11/business/lowersquos-to-build-new-store-on-site-of-old-walmart/", "passage_text": "That retail store was the 10th built in Maine and cost approximately $18.5 million to build. It employs about 150 people. Currently, there are more than 1,700 Lowe’s stores in the United States and Canada, according to the company’s Web site. Lowe’s plans for the Bangor property also include a 35,000-square-foot building that will sit to the left of the Springer Drive entrance, Wellington said. “They have not named that tenant,” he said. “About half of it is on the ground,” Wellington said, referring to the razing of the Wal-Mart building."}]