[{"url": "http://healthyeating.sfgate.com/much-protein-serving-snap-peas-6886.html", "passage_text": "Since protein has 4 calories per gram, you'll need 200 to 700 calories, or 50 to 175 grams, of protein each day for a 2,000-calorie diet. Your 1-cup serving of steamed snap peas provides roughly 3 to 10 percent of your total daily protein requirement. No matter how you enjoy snap peas, you'll get some of the protein you need for only a minimal amount of calories. You'll get about 5.2 grams of protein from 1 cup, or 160 grams, of cooked snap peas, for less than 70 total calories. Your protein needs are based on a percentage of your total calories"}, {"url": "http://healthyeating.sfgate.com/sugar-snap-peas-good-1620.html", "passage_text": "Sugar snap peas contain 60 milligrams per 100-gram serving. The recommended intake of vitamin C is 90 milligrams for males over 19 years old and 75 milligrams for females of this same age group. A 100-gram serving of sugar snap peas contains 25 micrograms. The recommended daily amount of vitamin K is 120 micrograms for men over 19 years old and 90 micrograms for women in"}, {"url": "http://cals.arizona.edu/fps/sites/cals.arizona.edu.fps/files/cotw/Sugar_Snap_Peas.pdf", "passage_text": "SUGAR SNAP PEAS Peas belong to the plant family known as legumes, which produce pods with enclosed seeds. Peas are protein-rich, low fat, nutritional additions to almost any meal, and peas are certainly no exception. In fact only lima beans are a better vegetable source of protein than peas. Peas take so well to freezing that, only about 5 percent of the nation's pea crop is currently sold in the fresh market state. Most of the pea crop is now sold canned, frozen, and to a much lesser degree, dried. Peas are a good low calorie source of protein. A 100-calorie serving of peas (about ¾ cup) con-tains more protein than a whole egg or a tablespoon of peanut butter and has less than one gram of fat and no cholesterol."}, {"url": "http://www.howmuchprotein.com/foods/peas/", "passage_text": "5.9g. Peas belong to the pulse family and as well as being rich in protein, they are a good source of vitamin A, C, thiamin, phosphorus, iron, carbohydrate and fibre. Frozen peas are so convenient because you can keep them in your freezer for a nutritious addition to many meals. "}, {"url": "http://healthyeating.sfgate.com/much-protein-serving-snap-peas-6886.html", "passage_text": "Protein Content vs. Recommendation. You'll get about 5.2 grams of protein from 1 cup, or 160 grams, of cooked snap peas, for less than 70 total calories. Your protein needs are based on a percentage of your total calories. No matter how you enjoy snap peas, you'll get some of the protein you need for only a minimal amount of calories. You'll get about 5.2 grams of protein from 1 cup, or 160 grams, of cooked snap peas, for less than 70 total calories."}, {"url": "http://healthyeating.sfgate.com/sugar-snap-peas-good-1620.html", "passage_text": "Sugar snap peas contain 1,087 international units of vitamin A per 100 grams. This translates to about 326 micrograms. The recommended intake of this vitamin is 900 micrograms a day for males over 14 and 700 micrograms a day for females in this same age group. A 100-gram serving of sugar snap peas contains 25 micrograms. The recommended daily amount of vitamin K is 120 micrograms for men over 19 years old and 90 micrograms for women"}, {"url": "http://healthyeating.sfgate.com/sugar-snap-peas-good-1620.html", "passage_text": "A 100-gram serving of sugar snap peas contains just under 3 grams of fiber. The daily recommendation of fiber for men up to 50 years old is 38 grams. Men 51 and older should aim for 30 grams. A 100-gram serving of sugar snap peas contains 25 micrograms. The recommended daily amount of vitamin K is 120 micrograms for men over 19 years old and 90 micrograms for women in this same age group."}, {"url": "http://www.livestrong.com/article/86320-nutrition-snap-peas/", "passage_text": "Healthy Carbs. A 1-cup serving of cooked snap peas contains 10 grams of carbs and 4 grams of fiber. Carbs are your body's preferred source of energy, and should supply 45 percent to 65 percent of your calories. Your daily fiber needs depend on your age and gender. In general, women need 21 to 25 grams of fiber a day, and men need 30 to 38 grams. A 1/2-cup serving of cooked snap peas contains 2 grams of protein and 0.4 grams of total fat. Protein and fat are essential nutrients just like carbs. Protein in food like snap peas is used to promote immune health and make hormones and enzymes. Your body also uses fat in food as a source of energy. Fat is needed to help maintain cell membranes and assist with the absorption of fat-soluble vitamin"}]