[{"url": "http://livehealthy.chron.com/care-shoulder-bursitis-after-cortisone-shot-1198.html", "passage_text": "Follow-up care for shoulder bursitis often includes physical therapy. Treatments, such as heat, ultrasound, electrical stimulation, ice and compression, are used to decrease pain and muscle tightness. Heat treatments are not applied until a few days after a cortisone shot to avoid increased risk of a flare reaction. Immediate Care. Cortisone shots can cause a flare reaction in the first 24 to 48 hours. This can be caused by the body responding to the needle injury or from small crystals that form in the injected tissue."}, {"url": "http://www.advancedortho.net/info/postinjectioncare.php", "passage_text": "Unless your doctor tells you otherwise, applying ice to the area (10 to 15 minutes every one to two hours) for the first day or two will help decrease the pain. In addition, you may benefit from taking acetaminophen (Tylenol™) to help reduce the pain. Usually a numbing medication is given with the injection, which can last for five to 12 hours. The actual Cortisone may take up to two to five days to take effect. If you develop any abnormal symptoms, such as itching, swelling, redness, rash, or shortness of breath, please call our office. "}, {"url": "http://livehealthy.chron.com/care-shoulder-bursitis-after-cortisone-shot-1198.html", "passage_text": "Overview. The shoulder joint is formed by the upper arm bone and the shoulder blade. These bones form a ball-and-socket joint that can move in any direction. A bony roof sits over the top of the shoulder joint. Tendons from muscles that move the shoulder joint travel between the upper arm bone and this roof. Immediate Care. Cortisone shots can cause a flare reaction in the first 24 to 48 hours. This can be caused by the body responding to the needle injury or from small crystals that form in the injected tissue."}, {"url": "http://www.orthosports.com.au/content_common/pg-cortisone-injections.seo", "passage_text": "around the Shoulder. Cortisone injections make up a very important part of the treatment of shoulder injuries. In combination with an active rehabilitation program they may significantly reduced the need for surgery in shoulder impingement syndrome. Cortisone is a potent anti-inflammatory medication. back to top. Cortisone injections make up an important part of treatment of various shoulder conditions. They are, however, not the only method of treatment, but part of an overall management program. The cortisone injections do not cure the condition, but provide a window of symptom relief via inflammation reduction."}, {"url": "http://charlottesvillepainmanagementcenter.com/procedures/shoulder-joint-injection", "passage_text": "Shoulder Joint Injection. A shoulder joint injection is the injection of steroid in the subacromial bursa, acromioclavicular joint or glenohumeral joint. This injection is administered to relieve pain in the shoulder region. You may experience some “pressure” at the injection site and this may last up to an hour. Your pain may return and you may have some soreness at the injection site for a day or two. This is due to the mechanical process of needle insertion as well as initial irritation from the steroid itself."}, {"url": "http://www.cses.cumc.columbia.edu/care-cortison-expect.html", "passage_text": "Cortisone Injection: What to Expect. You have just received a cortisone injection. Most people feel relief right away, but it can take up to 48 to 72 hours to experience relief. The injection can last several weeks, although this varies from patient to patient. After you receive the injection, move the area around for a few minutes (i.e. massage, moving shoulder in circles, bending knee back and forth) to disperse the medication. "}, {"url": "https://www.bupa.co.uk/health-information/Directory/J/joint-injections", "passage_text": "Your doctor may suggest having a steroid injection if one or more of your joints are affected by arthritis or inflammation, including your shoulder, knee, elbow or wrist joints. Steroid joint injections can help reduce pain and swelling in your joint and allow it to move more easily. A steroid injection can be repeated every three months. However, long-term use of steroids can affect your mood, interfere with your menstrual cycle if you're a woman and weaken your bones and muscles. Repeat injections can also damage the joint."}, {"url": "http://livehealthy.chron.com/care-shoulder-bursitis-after-cortisone-shot-1198.html", "passage_text": "Cortisone Shot. Cortisone shots are given to decrease inflammation caused by shoulder bursitis. Pain-relieving medication is also sometimes added to the shot. Care must be taken to make sure nerves and blood vessels are not damaged during the injection. Immediate Care. Cortisone shots can cause a flare reaction in the first 24 to 48 hours. This can be caused by the body responding to the needle injury or from small crystals that form in the injected tissue."}]