[{"url": "http://www.askdoctork.com/what-foods-should-i-eat-to-help-lower-my-cholesterol-201303134496", "passage_text": "Foods with lots of cholesterol raise our blood cholesterol levels. But foods with lots of saturated fats and trans fats (the “bad fats”) are even worse. They cause your liver to make lots of cholesterol. Foods rich in saturated fats include whole milk, butter, cheese, ice cream, red meat and coconut products."}, {"url": "http://www.askdoctork.com/what-foods-should-i-eat-to-help-lower-my-cholesterol-201303134496", "passage_text": "Some cholesterol-lowering foods have a lot of soluble fiber, which sticks to cholesterol in the gut. When that happens, the cholesterol is not easily digested, so it passes out of your body in a bowel movement instead of entering your blood. The same thing happens with foods rich in plant sterols and stanols."}, {"url": "http://www.health.harvard.edu/heart-health/11-foods-that-lower-cholesterol", "passage_text": "Soy. Eating soybeans and foods made from them, like tofu and soy milk, was once touted as a powerful way to lower cholesterol. Analyses show that the effect is more modest — consuming 25 grams of soy protein a day (10 ounces of tofu or 2 1/2 cups of soy milk) can lower LDL by 5% to 6%."}, {"url": "http://www.webmd.com/cholesterol-management/ss/slideshow-cholesterol-lowering-foods", "passage_text": "Curb Cholesterol, Not Flavor. It’s no secret that certain foods can help you lower your LDL (“bad”) cholesterol, which causes a buildup of plaque in the arteries that leads to heart disease, heart attacks, and stroke."}, {"url": "http://www.askdoctork.com/what-foods-should-i-eat-to-help-lower-my-cholesterol-201303134496", "passage_text": "Other cholesterol-lowering foods are rich in the “good fats” (monounsaturated and polyunsaturated fats) that directly lower LDL (bad) cholesterol. Here are five foods you can start with to get your cholesterol-busting under way: Oats. Choose oatmeal or a cold oat-based cereal such as Cheerios for breakfast."}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/cholesterol/ART-20045192", "passage_text": "Oatmeal, oat bran and high-fiber foods. Oatmeal contains soluble fiber, which reduces your low-density lipoprotein (LDL), the bad cholesterol. Soluble fiber is also found in such foods as kidney beans, apples, pears, barley and prunes. Soluble fiber can reduce the absorption of cholesterol into your bloodstream. Five to 10 grams or more of soluble fiber a day decreases your total and LDL"}, {"url": "http://www.prevention.com/food/food-remedies/10-best-cholesterol-lowering-foods", "passage_text": "Except for your morning wheat bran, no food is more fiber-rich than beans. And beans are especially high in cholesterol-lowering soluble fiber. Eating a cup of any type of beans a day—particularly kidney, navy, pinto, black, chickpea, or butter beans—can lower cholesterol by as much as 10% in 6 weeks."}]