[{"url": "http://www.gotquestions.org/Spirit-walk.html", "passage_text": "Being filled (walking) with the Spirit is the same as allowing the word of Christ (the Bible) to richly dwell in us (Colossians 3:16). The result is thankfulness, singing, and joy (Ephesians 5:18-20; Colossians 3:16). Children of God will be led by the Spirit of God (Romans 8:14)."}, {"url": "http://www.sharefaith.com/guide/christian-principles/fruits-of-the-spirit/walking-in-the-spirit.html", "passage_text": "Biblical Keys to Walking in the Spirit with God. If we live in the Spirit, let us also walk in the Spirit.. (Galatians 5:25). The phrase Walk in the Spirit refers to lifestyle. In Biblical terms, to walk means to conduct oneself in a particular manner; pursue a particular course of life."}, {"url": "http://www.bibletruths.net/Archives/BTAR162.htm", "passage_text": "Walk in the Spirit. The full title of our study is, Walk in the Spirit, and ye shall not fulfill the lust of the flesh.. This is the precise language the inspired apostle Paul used in writing to the Christians in the region of Galatia (Gal. 5: 16)."}, {"url": "http://www.gotquestions.org/Spirit-walk.html", "passage_text": "Question: What does it mean to walk in the Spirit?. Answer: Believers have the Spirit of Christ, the hope of glory within them (Colossians 1:27). Those who walk in the Spirit will show forth daily, moment-by-moment holiness."}, {"url": "http://www.brunstad.org/en/the-holy-spirit/what-it-means-to-walk-in-the-spirit", "passage_text": "Paul writes in Galatians 5:16, “I say then: Walk in the Spirit, and you shall not fulfill the lust of the flesh.” The flesh is the expression the Bible uses for the dwelling place of everything in a person that opposes God and His will."}, {"url": "http://www.eliyah.com/walkspir.html", "passage_text": "Gala 5:16 (NKJV) I say then: Walk in the Spirit, and you shall not fulfill the lust of the flesh. A beautiful promise! We need only to walk in the Spirit and we will not obey or fulfill the temptations and desires that our flesh causes us to endure."}, {"url": "http://www.tscpulpitseries.org/english/1990s/ts940815.html", "passage_text": "__________. God's purpose for every one of His children is that we surrender to the reign and rulership of the Holy Spirit: If we live in the Spirit, let us also walk in the Spirit(Galatians 5:25). In other words, If He lives in you, let Him direct you!. In this message, I want to show you two things: 1  What it means to walk in the Spirit; and. 2  How you can obtain such a walk."}]