[{"url": "http://www.food.com/recipe/pan-seared-pork-chops-55042", "passage_text": "Directions. 1  Marinade chops in oil and vinegar (for at least 30 minutes or up to 3 hours). 2  Season chops and heat a black iron skillet or shallow fry pan. ( 3 Medium/High heat) When pan is hot sear chops (do not turn for 3 minutes) then flip and sear other side. ( 4 searing will seal in the juices so chops will not dry out). 1 (Medium/High heat) When pan is hot sear chops (do not turn for 3 minutes) then flip and sear other side. ( 2 searing will seal in the juices so chops will not dry out). 3  As soon as chops are done remove them and put butter and onions into pan."}, {"url": "http://www.food.com/recipe/pan-seared-pork-chops-55042", "passage_text": "1 Marinade chops in oil and vinegar (for at least 30 minutes or up to 3 hours). 2  Season chops and heat a black iron skillet or shallow fry pan. ( 3 Medium/High heat) When pan is hot sear chops (do not turn for 3 minutes) then flip and sear other side. ( 4 searing will seal in the juices so chops will not dry out). 1 (Medium/High heat) When pan is hot sear chops (do not turn for 3 minutes) then flip and sear other side. ( 2 searing will seal in the juices so chops will not dry out). 3  As soon as chops are done remove them and put butter and onions into pan."}, {"url": "http://www.seriouseats.com/recipes/2014/03/perfect-pan-seared-pork-chop-recipe.html", "passage_text": "The next day, preheat oven to 250°F. Place baking sheet with pork chops in oven and cook until an instant read thermometer inserted into the center of the chops registers 100 to 110°F on for medium-rare, about 30 minutes, or 110 to 120°F for medium, about 35 minutes. Remove from oven. 3. Heat oil in a large stainless steel or cast iron skillet over high heat heat until smoking. Place pork chops in skillet and cook, turning occasionally, until starting to brown, about 1 1/2 minutes. Add butter, shallots, and thyme to skillet."}, {"url": "http://www.finecooking.com/articles/juiciest-grilled-pork-chops.aspx", "passage_text": "For medium-thick pork chops (3/4 to 1 inch), I cook with direct heat. I sear both sides of the chops briefly over high heat to get a nice crust and then move them to an area of less intense heat, cover the grill, and let them cook through. For thick pork chops (1-1/4 to 1-1/2 inches), I start with direct heat and finish with indirect heat. I set up one side of the grill the same way as for medium-thick chops, with varying levels of heat. The other half of the grill has no coals. For gas grills, keep one burner off"}, {"url": "http://www.al.com/outdoors/index.ssf/2014/09/how_to_grill_succulent_center.html", "passage_text": "Seal the bag and shake the chops around in the mixture and allow to rest in the bag in the fridge for at least an hour. This allows the chop wash to seep into the meat and tenderize it. Get the grill nice and hot, over 450 degrees and place the pork chops on the grill. Sear each side for 2-4 minutes. When both sides are showing grate marks lower the heat to 250 degrees and baste your favorite BBQ sauce liberally on the chops. The searing process locks the juices into the meat. "}, {"url": "http://www.foodnetwork.com/recipes/sunny-anderson/easy-grilled-pork-chops-recipe.html", "passage_text": "That's easy. Heat a grill or grill pan over medium heat. Remove the pork chops from the bag and lightly sprinkle with salt and pepper. Place on the grill and cook until the pork chop releases from the grill, about 4 minutes. Flip and cook on the other side for another 3 minutes. If using a grill pan, be sure to do in batches so you don't steam the chops. And don't worry if you have neither; you can do this in a pan. See, easy! "}, {"url": "http://www.thekitchn.com/how-to-cook-perfect-pork-chops-in-the-oven-cooking-lessons-from-the-kitchn-194257", "passage_text": "Place the pork chops in a shallow dish and pour the brine over top. The brine should cover the chops — if not, add additional water and salt (1 cup water to 1 tablespoon salt) until the chops are submerged. Cover the dish and refrigerate for 30 minutes or up to 4 hours. 1 Brine the pork chops (optional): If you have time, brining the pork for even a brief period adds flavor and ensures juiciness in the finished chop. 2  Bring 1 cup of the water to a boil, add the salt and optional flavorings, and stir to dissolve the salt."}, {"url": "https://answers.yahoo.com/question/index?qid=20070525214534AAV5zUJ", "passage_text": "Best Answer: In the recipes that I have that call for you to sear pork chops go like this: you put in a little bit of oil in the bottom of the pan and cook the pork chops on both sides for a few minutes til brown on both side. "}]