[{"url": "http://www.answers.com/Q/How_do_they_know_that_inside_the_Earth_it_is_liquid", "passage_text": "Actually, only one segment of inner earth is theorized to be liquid. This segment is known as the outer core. Scientists suspect that the outer core is liquid because of its interaction with seismic waves. A type of seismic wave known as an S wave or Shear wave moves side-to-side in a shearing motion and does not propagate through liquid only through solid. The Earth's magnetic field also originates in the liquid outer core by the movement and currents of molten metal in this layer. Scientific experiments have revealed that with the calculated density of the Earth, despite the incredible temperatures, the inner core should remain solid due to the massive pressures there."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=2618", "passage_text": "Geologists hypothesize that the Earth's center is composed of predominantly iron. The outer portion of the center, known as the outer core, is thought to be liquid iron. While the interior portion of the center, known as the inner core is thought to be solid iron. Scientists figured out that the outer core must be liquid because S waves do not pass through it, but P waves do. The behavior of P and S waves also indicates that the inner core is solid."}, {"url": "http://www.answers.com/Q/How_do_they_know_that_inside_the_Earth_it_is_liquid", "passage_text": "This knowledge is based on the behavior of seismic waves, particularly the behavior of P-waves and S-waves. S-waves are unable to travel through liquids, and this particular w … ave trait indicates a boundary between the solid mantle and the liquid outer core. The Earth's magnetic field also originates in the liquid outer core by the movement and currents of molten metal in this layer. Scientific experiments have revealed that with the calculated density of the Earth, despite the incredible temperatures, the inner core should remain solid due to the massive pressures there."}, {"url": "http://www.universetoday.com/26700/core-of-the-earth/", "passage_text": "The core is believed to have two parts: a solid inner core, with a radius of 1,220 km, and then a liquid outer core that extends to a radius of 3,400 km. The core is through to be 80% iron, as well as nickel and other dense elements like gold, platinum and uranium. "}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=2618", "passage_text": "You pose an excellent question. The composition of Earth's interior is critical to all life on Earth. If Earth did not have a liquid outer core the Earth would not have its magnetic field. Earth's magnetic field protects us from cosmic and solar energy that would prevent life as we know it. Scientists figured out that the outer core must be liquid because S waves do not pass through it, but P waves do. The behavior of P and S waves also indicates that the inner core is solid."}, {"url": "http://www.answers.com/Q/What_evidence_indicates_that_earth's_outer_core_is_liquid", "passage_text": "The earth's outer core is a 2,250 km thick layer of the Earth which is composed of liquid iron and nickel which lies between the Earth's mantle and solid inner core. Flow / … movement within the liquid outer core is thought to be responsible for creating Earth's magnetosphere. And that's probably a very good thing, since the spinning of the liquid outer core is believed to be responsible for the Earth's protective magnetic field, without which it's unlikely that land-based life forms (including us) could've evolved."}, {"url": "http://scienceblogs.com/startswithabang/2011/09/28/why-does-the-earth-have-a-liqu/", "passage_text": "Image credit: Vanessa Ezekowitz and USGS. As a result of this, we can learn that the Earth has a liquid outer core, a solid mantle exterior to that, and a solid core interior to it! So that’s how come the Earth has the heaviest, densest elements at its core, and how we know its outer core is a liquid layer. "}, {"url": "http://www.answers.com/Q/How_do_they_know_that_inside_the_Earth_it_is_liquid", "passage_text": "The boundary between the inner core and outer core is also detected by a difference in velocities of P-waves. The Earth's magnetic field also originates in the liquid outer core by the movement and currents of molten metal in this layer. Scientific experiments have revealed that with the calculated density of the Earth, despite the incredible temperatures, the inner core should remain solid due to the massive pressures there."}, {"url": "https://en.wikipedia.org/wiki/Outer_core", "passage_text": "Outer core. The outer core of the Earth is a liquid layer about 2,300 km (1,400 mi) thick and composed of iron and nickel that lies above Earth's solid inner core and below its mantle. Its outer boundary lies 2,890 km (1,800 mi) beneath Earth's surface. Because of its high temperature, modeling work has shown that the outer core is a low viscosity fluid (about ten times the viscosity of liquid metals at the surface) that convects turbulently. Eddy currents in the nickel iron fluid of the outer core are believed to influence the Earth's magnetic field."}, {"url": "http://www.nasa.gov/connect/chat/moon_core_chat.html", "passage_text": "The team's findings suggest the moon possesses a solid, iron-rich inner core with a radius of nearly 150 miles and a fluid, primarily liquid-iron outer core with a radius of roughly 205 miles. Where it differs from Earth is a partially molten boundary layer around the core estimated to have a radius of nearly 300 miles. "}]