[{"url": "https://en.wikipedia.org/wiki/Trident_(gum)", "passage_text": "Trident is a brand of sugar free chewing gum. It was introduced by Cadbury in the United Kingdom. In many other European countries, Trident is branded as Stimorol gum; it is generally the same as Trident. Trident Layers is a soft gum with a flavored layer between two normal sized pieces of different flavors of Trident gum. It is sugar free and is sweetened with artificial sugars. It arrived in Canada by 2010, then in the United States in 2011 to compete against Excel Mist (Orbit Mist in the United States)."}, {"url": "https://answers.yahoo.com/question/index?qid=20090616194241AAhh5aG", "passage_text": "Best Answer: Some gum does, some does not. Most gums do contain shellac though, which comes from insects. You can get gum at most health food stores that does not contain any of those ingredients. I like my teeth, so I don't chew gum, and can't tell you what brands they are, but there are quite a few. Nope but a lot of fake gum like products marketed as gum have gelatin Real gum is made from chicle (which can be found in the rainforest) not fake gum bases and artificial gobbldy ****! freeyourself1anarchist · 6 years ago. Thumbs up. 1."}, {"url": "https://halalist.wordpress.com/2008/05/12/wrigleys-haraam-products-list/", "passage_text": "Our LifeSaver gummies do contain small quantities of gelatin, which is also derived from pork. It follows the same drying and purifying process as with the Altoids. If your diet does not allow you to consume animal byproducts such as dairy, our CremeSaver line does contain cream, which is a dairy byproduct. Some of the products are well known to contain gelatin but products like creme savers surprised me. The only reason I see cremesavers are on this list is because they are created on the same line as Lifesavers Gummies which contain gelatin."}, {"url": "http://www.ihopeitsvegan.com/entries/centrywrigley.html", "passage_text": "Wrigley-Vegan Friendly. Wrigley is a company that makes and sells gum, hard candies, and lollipops in 180 countries. The information in this entry also applies to the brands Extra ®, Orbit ®, Doublemint ®, 5 ®, Skittles ®, Starburst ®, Altoids ®, and Life Savers ® that Wrigley owns. Wrigley has verified that the cane sugar that they use is not processed through animal bone char. They claim that all of their products in the Middle East and Indonesia contain no animal ingredients because of dietary restrictions in these geographies."}, {"url": "http://www.wrigley.com/global/brands/orbit.aspx", "passage_text": "1 This marked the first time that a sugar-free gum was marketed under the Wrigley name. 2  The brand has since spread to other regions, including Canada, Australia, the UK, Norway, Poland and Israel. 3  2001 Orbit® chewing gum made its return to the U.S. with the launch of Spearmint and Wintermint flavors. 1 The brand has since spread to other regions, including Canada, Australia, the UK, Norway, Poland and Israel. 2"}, {"url": "http://www.answers.com/Q/Does_spearmint_gum_contains_geltain", "passage_text": "Normal Wrigley's Spearmint Gum does not contain Xylitol. Here are the ingredients: SUGAR, GUM BASE, DEXTROSE, CORN SYRUP; LESS THAN 2% OF: NATURAL AND ARTIFICIAL FLAVORS, GL … YEROL, SOY LECITHIN, ASPARTAME, ACESULFAME K, COLORS (YELLOW 5 LAKE, BLUE 1 LAKE), BHT (TO MAINTAIN FRESHNESS). I forgot, some may have soy lecithin. That has the word soy in it, so it may have some soy. Just look at the ingredients, hopefully that will help you. ;) I have not found a gum that does not have soy lecithin in it."}, {"url": "https://halalist.wordpress.com/2008/05/12/wrigleys-haraam-products-list/", "passage_text": "The different varieties of our ALTOIDS mints do contain very small quantities of gelatin which is derived from pork. Gelatin does not impart any flavor to ALTOIDS, but it’s a necessary ingredient for the texture of the mint. When we use gelatin it is thoroughly purified and dried during its manufacturing process. Some of the products are well known to contain gelatin but products like creme savers surprised me. The only reason I see cremesavers are on this list is because they are created on the same line as Lifesavers Gummies which contain gelatin."}, {"url": "https://halalist.wordpress.com/2008/05/12/wrigleys-haraam-products-list/", "passage_text": "Extra® Polar Ice gum and Orbit® Crystal Mint contain tiny flavor beads encased in a microscopic layer of gelatin, which is animal based. We have requested the development of a gelatin-free flavor bead that is currently being worked on by our supplier. Some of the products are well known to contain gelatin but products like creme savers surprised me. The only reason I see cremesavers are on this list is because they are created on the same line as Lifesavers Gummies which contain gelatin."}, {"url": "http://www.petpoisonhelpline.com/pet-safety-tips/is-xylitol-poisonous-to-dogs/", "passage_text": "Xylitol is a common sugar-substitute used in sugar-free chewing gum, breath mints, candies, and baked goods. It is also found in some smoking-cessation products like nicotine gum. Bulk xylitol can be purchased for cooking at home. Many sugarless gums (including some Trident, Orbit, and Ice Breaker brands) and candies contain xylitol, a sweetener which is toxic to dogs. Beware of those desserts or baked goods that could also be made with xylitol!"}]