[{"url": "http://emedicine.medscape.com/article/1267908-overview", "passage_text": "Codman established that the calcification was within the tendons of the rotator cuff. Calcifying tendinitis of the shoulder is characterized by the presence of macroscopic deposits of hydroxyapatite (a crystalline calcium phosphate) in any tendon of the rotator cuff. "}, {"url": "http://www.webmd.com/a-to-z-guides/calcium-deposits-and-tendinitis-calcific-tendinitis-topic-overview", "passage_text": "Calcific tendinitis starts with a buildup of calcium that causes a chemical reaction with other tissues in the tendon to cause pain. In the shoulder, the calcium is most often built up inside the rotator cuff. It is most common in the shoulders. But it may occur in the elbows, wrists, hands, hips, knees, or feet. People most affected by calcific tendinitis are between 30 and 50 years old."}, {"url": "http://www.physioworks.com.au/injuries-conditions-1/rotator-cuff-calcific-tendinitis", "passage_text": "Calcific tendonitis is a condition that causes the formation of a small, usually about 1-2 centimetre size, calcium deposit within the tendons of the rotator cuff. While a traumatic injury can occur eg fall, it is repeated movement of your arm into the impingement zone overhead that most frequently causes the rotator cuff to contact the outer end of the shoulder blade (acromion)."}, {"url": "http://www.allinahealth.org/mdex/ND7804G.HTM", "passage_text": "Calcific tendinitis is a condition that occurs when calcium collects in the tendons of the shoulder. Tendons are bands of tissue that connect muscle to bone. The calcium can make the tendons swell and cause severe pain. "}, {"url": "http://www.webmd.com/a-to-z-guides/calcium-deposits-and-tendinitis-calcific-tendinitis-topic-overview", "passage_text": "Calcific tendinitis (also called calcific tendinopathy) happens when calcium builds up in the tendons. It is most common in the shoulders. But it may occur in the elbows, wrists, hands, hips, knees, or feet. People most affected by calcific tendinitis are between 30 and 50 years old. Women are more likely to have it than men"}, {"url": "http://www.kentuckyonehealth.org/documents/Calcific%20tendonitis.pdf", "passage_text": "Calcific tendonitis is a condition that causes the formation of a small, usually about 1-2 centimeter size, calcium deposit within the tendons of the rotator cuff. The calcium deposits are not always painful, and even when painful they will often spontaneously resolve after a period of 1-4 weeks. What are the causes of calcific tendonitis? The cause of calcium deposits within the rotator cuff tendon is not entirely understood."}, {"url": "http://www.howardluksmd.com/education/common-injuries/calcific-tendonitis/", "passage_text": "Calcific tendonitis of the rotator cuff is characterized by the deposition of calcium within the rotator cuff tendon itself. Although it looks like a piece of bone… it is not. It is during the resorption phase of calcific tendonitis — where your body is trying to break up and reabsorb the calcium — where the pain comes into play. The other phases mentioned do not cause pain. Do not worry or think that you did anything wrong."}, {"url": "http://www.sportsmd.com/shoulder-injuries/calcific-tendinitis/", "passage_text": "Facebook Twitter Google Pinterest Linkedin Reddit Stumbleupon Mail. Calcific tendinitis is characterized by the presence of calcium deposits, actually hydroxyapatite (crystalline calcium phosphate), in a tendon of the rotator cuff. It’s often asymptomatic and occurs in 3-20% of shoulders in the general population. "}, {"url": "http://www.physioworks.com.au/injuries-conditions-1/rotator-cuff-calcific-tendinitis", "passage_text": "The cause of calcium deposits within the rotator cuff tendon (calcific tendonitis) is not entirely understood. Different ideas have been suggested, including blood supply and ageing of the tendon, but the evidence to support these conclusions is not clear. One of the most compelling arguments is delayed healing. While a traumatic injury can occur eg fall, it is repeated movement of your arm into the impingement zone overhead that most frequently causes the rotator cuff to contact the outer end of the shoulder blade (acromion)."}, {"url": "https://www.shoulderdoc.co.uk/section/10", "passage_text": "Calcific Tendonitis. Calcific tendonitis refers to a build-up of calcium in the rotator cuff (calcific deposit). When calcium builds up in the tendon, it can cause a build up of pressure in the tendon, as well causing a chemical irritation. This leads to pain. The pain can be extremely intense. "}]