[{"url": "http://emedicine.medscape.com/article/243160-overview", "passage_text": "Miscellaneous causes of metabolic alkalosis include villous adenomas, which are a rare cause of diarrhea. Villous adenomas usually lead to metabolic acidosis from loss of colonic secretions that are rich in bicarbonate, but occasionally these tumors cause metabolic alkalosis. The mechanism is not well understood. Hydrogen ions may be lost through the kidneys or the GI tract. Vomiting or nasogastric (NG) suction generates metabolic alkalosis by the loss of gastric secretions, which are rich in hydrochloric acid (HCl). Whenever a hydrogen ion is excreted, a bicarbonate ion is gained in the extracellular space."}, {"url": "https://en.wikipedia.org/wiki/Metabolic_acidosis", "passage_text": "Metabolic acidosis is a condition that occurs when the body produces excessive quantities of acid or when the kidneys are not removing enough acid from the body. Metabolic acidosis occurs when the body produces too much acid, or when the kidneys are not removing enough acid from the body. There are several types of metabolic acidosis. The main causes are best grouped by their influence on the anion gap."}, {"url": "https://en.wikipedia.org/wiki/Metabolic_alkalosis", "passage_text": "Metabolic alkalosis is a metabolic condition in which the pH of tissue is elevated beyond the normal range (7.35-7.45). "}, {"url": "http://www.merckmanuals.com/professional/endocrine-and-metabolic-disorders/acid-base-regulation-and-disorders/metabolic-alkalosis", "passage_text": "Metabolic alkalosis is primary increase in HCO 3 − with or without compensatory increase in P co 2; pH may be high or nearly normal. Common causes include prolonged vomiting, hypovolemia, diuretic use, and hypokalemia. Renal impairment of HCO 3 − excretion must be present to sustain alkalosis. "}, {"url": "http://emedicine.medscape.com/article/243160-overview", "passage_text": "Background. Metabolic alkalosis is a primary increase in serum bicarbonate (HCO 3 -) concentration. This occurs as a consequence of a loss of H + from the body or a gain in HCO 3 - 2), which diminishes the change in pH that would otherwise occur. Hydrogen ions may be lost through the kidneys or the GI tract. Vomiting or nasogastric (NG) suction generates metabolic alkalosis by the loss of gastric secretions, which are rich in hydrochloric acid (HCl). Whenever a hydrogen ion is excreted, a bicarbonate ion is gained in the extracellular space."}, {"url": "http://emedicine.medscape.com/article/243160-overview", "passage_text": "Metabolic alkalosis is diagnosed by measuring serum electrolytes and arterial blood gases. If the etiology of metabolic alkalosis is not clear from the clinical history and physical examination, including drug use and the presence of hypertension, then a urine chloride ion concentration can be obtained. Hydrogen ions may be lost through the kidneys or the GI tract. Vomiting or nasogastric (NG) suction generates metabolic alkalosis by the loss of gastric secretions, which are rich in hydrochloric acid (HCl). Whenever a hydrogen ion is excreted, a bicarbonate ion is gained in the extracellular space."}, {"url": "http://medical-dictionary.thefreedictionary.com/Metabolic+Alkalosis", "passage_text": "Metabolic alkalosis occurs when the body has more base than acid in the system. Chemists use the term pH to decribe how acidic or alkaline (also called basic) a substance is. Based on a scale of 14, a pH of 7.0 is neutral. A pH below 7.0 is an acid; the lower the number, the stronger the acid. Description. Metabolic alkalosis, as a disturbance of the body's acid/base balance, can be a mild condition, brought on by vomiting, the use of steroids or diuretic drugs, or the overuse of antacids or laxatives. Metabolic alkalosis can also indicate a more serious problem with a major organ such as the kidneys."}, {"url": "http://www.healthline.com/health/alkalosis", "passage_text": "Alkalosis is a condition in which the body fluids have excess base (alkali). This is the opposite of excess acid (acidosis). The fluids in your body contain two substances: acids and bases; alkali is the base. The balance between acids and bases is called pH balance, and having too much or too little base or acid can cause a pH imbalance. Decreased carbon dioxide (an acid) or increased bicarbonate (a base) levels in the blood may result in alkalosis. Hypokalemic alkalosis occurs when your body lacks the normal amount of potassium. Potassium is a mineral, often derived from food, which is essential to the proper functioning of the heart, kidneys, muscles, and nervous and digestive systems."}, {"url": "https://en.wikipedia.org/wiki/Metabolic_acidosis", "passage_text": "If unchecked, metabolic acidosis leads to acidemia, i.e., blood pH is low (less than 7.35) due to increased production of hydrogen ions by the body or the inability of the body to form bicarbonate (HCO 3 −) in the kidney. Its causes are diverse, and its consequences can be serious, including coma and death. Metabolic acidosis occurs when the body produces too much acid, or when the kidneys are not removing enough acid from the body. There are several types of metabolic acidosis. The main causes are best grouped by their influence on the anion gap."}]