[{"url": "http://www.sciencekids.co.nz/sciencefacts/countries/spain.html", "passage_text": "In Spain they drive on the right-hand side of the road. It is believed that modern humans first arrived in Spain around 32000 years ago. Mount Teide is the highest mountain in Spain (3718 m, 12198 ft) and an active volcano. The Pyrenees is a mountain range that divides Spain and France. Spain includes a number of islands including Mallorca, Tenerife, Ibiza and Gran Canaria. Many can be found in the Canary Islands, an archipelago off the northwest coast of Africa. "}, {"url": "http://getawaytips.azcentral.com/5-major-mountains-spain-3212.html", "passage_text": "SHARE SHARE TWEET EMAIL. Spain has a mountain near Barcelona with ties to Arthurian lore. Another mountain sits on the coast of a tourist island with views of the Mediterranean Sea. In the north, Spain even has a coastal mountain range that allows you to ski and surf in the same day. Sierra Nevada. The Sierra Nevada in southeast Spain will let you ski near the Mediterranean Sea. This coastal range, set in the UNESCO-honored Sierra Nevada National Park, towers over the country with the 11,500-foot Mulhacen, the highest peak in Spain and one of the highest in Europe."}, {"url": "http://www.answers.com/Q/What_are_the_mountains_name_in_Spain", "passage_text": "There are several mountain ranges in Spain. Two of the more famous are the original Sierra Nevada in southern Spain, and the Pyrenees Mountains that lie on the Spanish border with France. Each range has more than one peak and there are more than these two ranges so take your pick. The highest mountain anywhere in Spain is Mt Tiede (3718 meters) on Tenerife Island in the Canary Islands. The highest mountain in continental Spain is Mulhacen (3478 meters). … Mulhacen is located near Granada in southern Spain. Spain has 10 mountains over 3,300 meters (10,000 ft.)."}, {"url": "http://getawaytips.azcentral.com/5-major-mountains-spain-3212.html", "passage_text": "A section of the Pyrenees has been declared a UNESCO World Heritage Site, and the Aneto mountain, at more than 11,000 feet high, is one of the highest peaks in Spain. Adventure junkies visit the Pyrenees for rock climbing, skiing and white-water rafting. Sierra Nevada. The Sierra Nevada in southeast Spain will let you ski near the Mediterranean Sea. This coastal range, set in the UNESCO-honored Sierra Nevada National Park, towers over the country with the 11,500-foot Mulhacen, the highest peak in Spain and one of the highest in Europe."}, {"url": "http://www.answers.com/Q/Name_the_mountain_ranges_in_Spain", "passage_text": "Those who die in the M … editerranean Sea are (from north to south): Ebro (the biggest of Spain), Jucar, Júcar segura Y. Turia the most important mountains: Are at the (north from west to): East Cordillera cantabrica Cantábrica (And). Pirineos pyrenees in (the centre Forming): a T The sistema central And The. cordillera iberica ibérica There are the Pyrenees Mountain in the north, and the Sierra Nevada range in the south."}, {"url": "http://www.destination360.com/europe/spain/mountains", "passage_text": "Mountains in Spain are of particular interest for skiing, hiking, and easy walking. When looking at a topographical map, it is evident that a majority of Spain's land mass is dominated by mountain ranges in Spain. Across the country there are five major mountain ranges in Spain including Cordillera Cantabrica, Sistema Central, the Pyrenees, Sierra Morena, and Cordillera Subbetica. The highest mountain in Spain is located in the Canary Islands on Mount Tenerife while on the mainland it is Mulhacen near Granada at 11,420 feet high. Biking and walking trips are popular throughout the Andalucia Sierra Nevada mountains in Spain and lodging is easily found dotting many of the ranges. From easy walking and hiking excursions and advanced level paths, every ability can enjoy a mountain holiday."}, {"url": "http://www.spain.net/spain-guide/-mountain-ranges-spain.html", "passage_text": "The Mountain Ranges of Spain. In a continent so littered with mountain ranges as Europe, from the high Tatras of Southern Poland and Slovakia, to the snow touched ski slopes of the French and Swiss Alps, it is perhaps not surprising that Spain rarely figures on lists of the continent’s top topographical nations. Historically the Pyrenees have acted as a sort of geographical gateway to the Iberian Peninsula, separating Spain from France with a wall of granite peaks that range from the provinces of Girona in the East, through Barcelona, toLleida in the West."}, {"url": "http://www.spainthenandnow.com/spanish-travel/mountains/default_23.aspx", "passage_text": "The most distinctive geographical features of Spain are its mountains. They are so widespread that Richard Ford, the famous 19th-century English traveler called Spain’s topography “almost one mountain.”. After Switzerland, Spain is the most mountainous country in Europe. http//commons.wikimedia.org/wiki/Atlas_of_Spain. The mountains of the north, especially the Cordillera Cantabrica, cantábrica historically had a special function in Defining spanish. Society the traditional title of the heir to The spanish, throne The prince Of, asturias is a reminder of the role played by that. region"}, {"url": "http://www.quizmeup.com/question/what-range-of-mountains-separates-france-and-spain", "passage_text": "The Pyrenees. Feedback: France and Spain are separated by the Pyrenees range of mountains. The Pyrenees, is a range of mountains in southwest Europe that forms a natural border between France and Spain. "}, {"url": "http://commons.wikimedia.org/wiki/Category:Mountain_ranges_of_Spain", "passage_text": "English: This category contains the list of mountain ranges of Spain. If the range is located in just in one autonomous community, it is in the subcategory of the relevant autonomous community. If the range is in more than one autonomous community, it is in this category. "}]