[{"url": "http://www.celebritiesnetworth.org/dustin-johnson/", "passage_text": "Dustin Johnson began his 2013 season with a win at the season opening Hyundai Tournament of Champions, an event reserved for winners from the past season. Johnson won by four strokes over defending champion Steve Stricker. The event was Johnson’s seventh PGA Tour win and his third in a 54-hole event. As an amateur, Dustin won the Monroe Invitational and the Northeast Amateur in 2007 and played on the winning 2007 Walker Cup and Palmer Cup teams. Dustin Johnson is the first player since Tiger Woods to win at least once in each of his first seven seasons coming out of college."}, {"url": "http://www.celebritiesnetworth.org/dustin-johnson/", "passage_text": "Dustin Johnson is a professional golfer. Dustin played collegiate golf at Coastal Carolina University. As an amateur, Dustin won the Monroe Invitational and the Northeast Amateur in 2007 and played on the winning 2007 Walker Cup and Palmer Cup teams. Dustin Johnson is the first player since Tiger Woods to win at least once in each of his first seven seasons coming out of college. Johnson turned professional in late 2007 and earned his 2008 PGA Tour card by finishing in a tie for 14th place at the 2007 qualifying school in December"}, {"url": "http://www.celebritynetworth.com/articles/entertainment-articles/10-highest-earning-golfers-2012/", "passage_text": "This list of the 20 highest paid golfers of 2012 should be a wake up call to all parents out there who are looking for a sport that wont put their kid at risk for concussions and long term brain damage…. Tiger Woods Net Worth. Highest Paid Golfers: 1  20. 2  Dustin Johnson – $8.7 million. 3  19. "}, {"url": "http://www.celebritynetworth.com/richest-athletes/richest-golfers/dustin-johnson-net-worth/", "passage_text": "He turned professional in 2007, and qualified for the PGA Tour in 2008. He won his first two PGA Tour events that same year, and has gone on to win five more PGA Tour events since then. To date, he has tied for fifth place at the PGA Championship, and tied for eighth place at the U.S. Open. He has also tied for second place at The Open Championship. He tied for thirteenth at the Masters Tournament in April of 2013. In August 2013, Dustin Johnson announced his engagement to model Paulina Gretzky (Wayne Gretzky's super hot daughter)."}, {"url": "http://www.celebritynetworth.com/richest-athletes/richest-golfers/dustin-johnson-net-worth/", "passage_text": "Dustin Johnson net worth: Dustin Johnson is an American professional golfer who has a net worth of $20 million dollars. As of this writing, Dustin has won $24.5 million dollars in tournament prize money. Dustin Johnson was born in Columbia, South Carolina, and went on to play golf at Coastal Carolina University. He has also tied for second place at The Open Championship. He tied for thirteenth at the Masters Tournament in April of 2013. In August 2013, Dustin Johnson announced his engagement to model Paulina Gretzky (Wayne Gretzky's super hot daughter)."}, {"url": "http://sportrichlist.com/golf/dustin-johnson-net-worth/", "passage_text": "Golfers Age: 29 Year Old. —————————————————————————————————————————————————–. Dustin Johnson Biography: Career in Golf : Dustin Johnson the 29 year old talented Golfer, who has won 10 professional events of Golf in which 8 Major PGA Tours are included. He is the 3rd highest earning player in the 2014 in the list of golfers. He won the World Golf Championships. His best finish in the golf in 2013 event (World Golf Championships-HSBC Champions) where he collected amount of ($1,400,000) winning prize money. There is allot more to see from this young golfer in 2013. He is hopeful for more titles. With United States team he wins the titles like Walker Cup in 2007, Palmer Cup in 2007 these are Amateur tours. and Presidents Cup in 2011 a professional tour."}, {"url": "http://www.reviewjournal.com/business/money/net-worths-bubba-watson-rory-mcilroy-and-other-2015-masters-golfers", "passage_text": "Dustin Johnson Net Worth: $20 Million. Dustin Johnson turned professional in 2007 and qualified for his first PGA tour the following year. CelebrityNetWorth estimates he has won $24.5 million in tournament prize money and reports his net worth at $20 million. In 2014, Johnson took a six-month leave of absence from golf after what Golf.com reported was a third failed drug test. He’s back and is a favorite to win this week’s Masters tournament. In addition to last year’s tournament, Watson also won the 2012 Masters, which made him a household name. During his career, CelebrityNetWorth estimates he has earned roughly $24 million in total tournament winnings and $3 to $5 million per year in endorsements, bringing his total net worth to"}, {"url": "http://heavy.com/sports/2015/06/dustin-johnson-what-is-net-worth-career-earnings-money-house-endorsements-gretzky/", "passage_text": "1. (Getty). Some websites have estimated Johnson’s worth at $20 million. The exact accuracy of the number is likely impossible to figure unless you’re Johnson’s accountants, to be honest. (Getty). Johnson’s future father-in-law is likely most famous hockey player of all-time — Wayne Gretzky. Johnson and Paulina Gretzky are engaged and are the parents of son Tatum, who was born in January 2015. Wayne Gretzky isn’t exactly hurting for cash, either. He has an estimated worth of $200 million."}, {"url": "http://heavy.com/sports/2015/06/dustin-johnson-what-is-net-worth-career-earnings-money-house-endorsements-gretzky/", "passage_text": "Dustin Johnson has made nearly $28 million on the course. (Getty). Dustin Johnson has made some serious cash in his 8 years on the PGA Tour. Then add in the generous endorsements contracts from top companies like Adidas and EA Sports, and you find yourself a pretty wealthy person. (Getty). Johnson’s future father-in-law is likely most famous hockey player of all-time — Wayne Gretzky. Johnson and Paulina Gretzky are engaged and are the parents of son Tatum, who was born in January 2015. Wayne Gretzky isn’t exactly hurting for cash, either. He has an estimated worth of $200 million."}]