[{"url": "http://www.rxlist.com/desyrel-drug/indications-dosage.htm", "passage_text": "An initial dose of 150 mg/day in divided doses is suggested. The dose may be increased by 50 mg/day every three to four days. The maximum dose for outpatients usually should not exceed 400 mg/day in divided doses. Inpatients (ie, more severely depressed patients) may be given up to but not in excess of 600 mg/day in divided doses."}, {"url": "http://www.minddisorders.com/Py-Z/Trazodone.html", "passage_text": "Daily doses may be increased to a maximum of 400 mg per day in outpatients and up to 600 mg per day in hospitalized patients. In cases of extreme depression, daily doses of up to 800 mg have been used in hospitalized patients. To minimize daytime drowsiness, a major portion of the daily dose can be given at bedtime. "}, {"url": "http://www.drugsdb.com/rx/trazodone/trazodone-for-sleep/", "passage_text": "When used as a sleep-aid or for insomnia, the recommended starting dose of trazodone is 25 to 50 mg taken at bedtime. The dose may be adjusted if necessary to a maximum dose of 100 mg. Its sedative effect starts within 1 to 2 hours and can last up to 8 hours. Important notes: 1  Do not take this drug if you cannot go to bed within the narrow “window” of sedative effect. Trazodone is especially effective as a sleep-aid for people with insomnia and sleep disorders due to depression. Conversely, some antidepressant drugs can cause sleep deprivation, trazodone can be used to treat insomnia caused by other antidepressants."}, {"url": "http://depression.emedtv.com/trazodone/trazodone-dosage.html", "passage_text": "Your healthcare provider may choose to increase the dose if symptoms continue, or decrease the dose if trazodone side effects occur. The maximum recommended dose of trazodone is 400 mg per day, although people who have been hospitalized due to depression may take up to 600 mg per day. Even though trazodone is not approved to treat insomnia, it is frequently prescribed in an  off-label  fashion for this use. Usually, the dose of trazodone for insomnia is lower, starting with 25 mg or 50 mg at bedtime. Trazodone Dosage for Insomnia. Even though trazodone is not approved to treat insomnia, it is frequently prescribed in an  off-label  fashion for this use. Usually, the dose of trazodone for insomnia is lower, starting with 25 mg or 50 mg at bedtime."}, {"url": "http://www.drugsdb.com/rx/trazodone/trazodone-dosage/", "passage_text": "Treatment of Depression. The recommended initial dosage of trazodone is 150 mg/day taken in divided doses. The dose may be adjusted every three to four days with increment of 50 mg/day. The maximum daily dose for outpatients is 400 mg/day in divided doses. Meanwhile, for patients within hospital settings (particularly those with severe depression) may be given a maximum of 600 mg/day in divided doses. Although not approved by the Food and Drug Administration for this purpose, trazodone is frequently prescribed “off-label” as a sleep drug. When used as a sleep aid, the usual trazodone dosage is 25 to 50 mg taken at bedtime."}, {"url": "http://depression.emedtv.com/trazodone/trazodone-as-a-sleep-aid.html", "passage_text": "In clinical studies, up to 40.8 percent of people reported drowsiness as a side effect. While side effects are usually bothersome, they can sometimes be beneficial for certain people. For example, the drowsiness effect of trazodone can be helpful for people who have insomnia. Trazodone is especially useful as a sleep aid in people with depression, since it is effective for both insomnia and depression. Conversely, some antidepressants are likely to cause insomnia, even when taken in the morning. Trazodone can be used to treat insomnia caused by other antidepressant medications. "}, {"url": "http://mental-health.emedtv.com/desyrel/desyrel-dosage.html", "passage_text": "The maximum recommended dose of Desyrel is 400 mg total per day, although people who have been hospitalized due to their depression may take up to 600 mg per day. Even though Desyrel is not approved to treat insomnia, it is frequently prescribed in an off-label fashion for this use. Desyrel Dosage for Insomnia. Even though Desyrel is not approved to treat insomnia, it is frequently prescribed in an off-label fashion for this use. Usually, the dose of Desyrel for insomnia is lower, starting with Desyrel 25 mg or 50 mg at bedtime."}]