[{"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 An implant topped by a crown can cost $1,500-$13,000 or more; two to six implants with a bridge can cost $3,500-$30,000 or more; and four to 12 implants with a set of denture plates can cost $7,000-$90,000. 2  Insurance does not typically cover the cost of dental implants."}, {"url": "http://www.justanswer.com/dental/4laby-does-cost-fake-teeth-surgically-inserted.html", "passage_text": "There are few options to replace the missing tooth.Obviously, the better and long term solution is an implant.It has got a great success rate and a very good long term prognosis. The average cost of implant is $4000 - $5000 per tooth. The next option is bridge.If you have the tooth on both sides of the missing tooth, a bridge could be glued to those teeth with a false tooth in the middle. The average cost of bridge is $3000."}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 A permanently fixed replacement for one or more teeth is known as a dental bridge. 2  A Maryland or resin-bonded bridge (with a false tooth and metal side wings that are bonded to the back of the adjacent/anchor teeth) can cost $1,000-$1,200 for one false tooth with two metal wings or $1,700-$3,500 with two false teeth."}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 Traditional or cantilever bridges (held in place by dental crowns on the anchor teeth) can cost $1,500-$6,000 for a three-unit bridge (two crowns with one false tooth); a four-unit bridge (two crowns, two false teeth) can cost $2,000-$12,000 or more."}, {"url": "http://www.justanswer.com/dental/4laby-does-cost-fake-teeth-surgically-inserted.html", "passage_text": "On an average, as per the current data, the cost to extract one tooth is $150 - $250 at a general dentist office (without sedation).Sedation (IV sedation, nitrous oxide) could add $100 - $300 to the cost."}, {"url": "http://www.falseteeth.net/teeth-implants-cost/", "passage_text": "How Much Do Teeth Implants Costs. A dental implant is an artificial tooth that is embedded into the jawbone. This is considered as the most suitable tooth replacement as it restores the individual’s chewing and speech ability."}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 If only a few teeth are missing, removable partial dentures start at $300 -$500, average about $700 -$1,800, and can cost $2,000 -$4,000 for high-end materials like gold."}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 It can cost $500-$1,500 or more per tooth for porcelain-fused-to-metal crowns; $600-$2,500 or more per tooth for gold or other metal alloys; and $800-$3,000 or more per tooth for all-porcelain."}]