[{"url": "http://www.newenglandfoam.com/filter.html", "passage_text": "Characteristics of Filter Foam. Filter foam, also known as reticulated foam, is a porous, low-density type of polyurethane foam with an open cell structure. Filter foam has a near-infinite amount of applications due to the following characteristics: Filter foam, also known as reticulated foam, is a porous, low-density type of polyurethane foam with an open cell structure. Filter foam has a near-infinite amount of applications due to the following characteristics: 1  Compressibility. 2  Cushioning. "}, {"url": "http://www.merriam-webster.com/dictionary/reticulation", "passage_text": "Definition of RETICULATION. : a reticulated formation: network; also: something reticulated. ADVERTISEMENT. "}, {"url": "https://en.wikipedia.org/wiki/Python_reticulatus", "passage_text": "The reticulated python (Python reticulatus) is a species of python found in Southeast Asia. They are the world's longest snakes and longest reptiles, but are not the most heavily built. Like all pythons, they are nonvenomous constrictors and normally not considered dangerous to humans. "}, {"url": "https://en.wikipedia.org/wiki/Reticulated_foam", "passage_text": "Reticulated foam is a very porous, low density solid foam. 'Reticulated' means like a net. Reticulated foams are extremely open foams i.e. there are few, if any, intact bubbles or cell windows. In contrast, the foam formed by soap bubbles is composed solely of intact (fully enclosed) bubbles. In a reticulated foam only the lineal boundaries where the bubbles meet (Plateau borders) remain. A description of the structure of reticulated foams is still being developed. While Plateau's laws, the rules governing the shape of soap films in foams were developed in the 19th century, a mathematical description of the structure is still debated. The computer-generated Weaire–Phelan structure is the most recent."}, {"url": "http://www.nzqa.govt.nz/nqfdocs/units/pdf/18458.pdf", "passage_text": "Performance criteria 1.1 Reticulated services are described in terms of their general characteristics, ownership, access and occurrence. Range includes but is not limited to – water supply, foul sewage, stormwater, electricity supply, telecommunication systems, gas systems, traffic systems, easement. "}, {"url": "http://www.oxforddictionaries.com/definition/english/reticulation", "passage_text": "2 chiefly Australian / NZ A network of pipes used in irrigation and water supply: [as modifier]: six kilometres of reticulation mains. More example sentences. 1  The bond by the Nkana water company is intended for a water reticulation project in which the company would be building a pipeline from Kitwe to Kalulushi. 1 The initial contract is a five-year period and includes the maintenance of water reticulation network conveyance and purification, low voltage electrical distribution network, road network and buildings."}, {"url": "http://www.answers.com/Q/What_is_water_reticulation", "passage_text": "Making the world better, one answer at a time. I am not aware of water reticulation as a term, however, since, reticulation means network, hence (I deduce), water reticulation should mean: The network of pipes that distribute water from sources of charge to points of discharg"}, {"url": "http://mitiwater.com/", "passage_text": "Home. This is the website for the Mitiamo Reticulated Water Supply project. On here, you can find the latest information and news about the project. The above menu allows you access to all the pages of the website."}, {"url": "http://www.thefreedictionary.com/reticulation", "passage_text": "re·tic·u·late. adj. 1. Resembling or forming a net or network: reticulate veins of a leaf. 2. Relating to or being an evolutionary process that involves the exchange of genes between organisms of different species, as in the formation of a new species through hybridization. v. (-lāt′) re·tic·u·lat·ed, re·tic·u·lat·ing, re·tic·u·lates. reticulation - (photography) the formation of a network of cracks or wrinkles in a photographic emulsion. photography, picture taking-the act of taking and printing photographs."}]