[{"url": "http://www.medicalnewstoday.com/articles/254475.php", "passage_text": "The evidence suggests that there are two things happening: domestic violence can often lead to victims developing mental health problems, and people with mental health problems are more likely to experience domestic violence.."}, {"url": "http://www.bellaonline.com/articles/art9387.asp", "passage_text": "Bipolar Disorder and Domestic Violence. Guest Author-Jeanette Stingley. Bipolar mood disorder, if untreated can cause periods of agitation, irritable euphoria, excessive talkativeness, poor judgment with impulsivity and transient loss of contact with reality alternating with periods of depression."}, {"url": "http://www.medicalnewstoday.com/articles/254475.php", "passage_text": "Mental health professionals need to be aware of the link between domestic violence and mental health problems, and ensure that their patients are safe from domestic violence and are treated for the mental health impact of such abuse, she urges."}, {"url": "http://www.bipolardisorderscenters.com/domestic-violence-and-bipolar-disorder/", "passage_text": "Available 24/7. Call us 1-855-315-4764. While the idea that people with mental disorders are automatically more violent than the general population has been proven to be a myth, there are several aspects of untreated bipolar disorder that can lead to an increased risk of domestic violence."}, {"url": "http://health.usnews.com/health-news/news/articles/2013/01/02/mental-disorders-linked-with-domestic-violence-study-says", "passage_text": "The evidence suggests that there are two things happening: Domestic violence can often lead to victims developing mental health problems, and people with mental health problems are more likely to experience domestic violence, Howard said."}, {"url": "http://www.bellaonline.com/articles/art9387.asp", "passage_text": "With the mood swings that someone who has bipolar suffers from, they can lead to violence against loved ones for various reasons. Often times the person with bipolar disorder has triggers that will set off a mood swing."}, {"url": "http://news.health.com/2013/01/02/mental-disorders-linked-with-domestic-violence-study-says/", "passage_text": "“Mental health professionals need to be aware of the link between domestic violence and mental health problems, and ensure that their patients are safe from domestic violence and are treated for the mental health impact of such abuse,” said Howard."}, {"url": "http://abcnews.go.com/Health/BipolarOverview/story?id=4359990", "passage_text": "Answer: There is a relationship between bipolar disorder and violence. As there is a relationship between severe mental illness and violence in general. The majority of people with bipolar disorder are not violent."}]