[{"url": "http://www.timeclockmts.com/tips-and-tricks/how-does-payroll-time-rounding-work/", "passage_text": "A common question I get is how exactly does payroll time rounding work? So I thought it would be worthwhile to cover it in some more detail to help Time Clock MTS users. So, in our example above any employee clocking in after 7:30:00 AM will have their time rounded up to 7:45:00 AM. Let’s say the normal clock out time for the above example is 4:30:00 PM."}, {"url": "http://www.staples.com/Time-Clocks-Cards/cat_DP3901", "passage_text": "Time Clocks & Cards. Choose a time clock that prints the time, year, and date on time cards, or sends data to a computer. Install a time card rack, so your employees can easily find their cards. Keep replacement time clock batteries and ribbons to ensure you're prepared when your time clock needs new supplies. Accurate. An electronic time clock records when an employee clocks in or clocks out on a time card, or sends the information to a computer. Many time clocks come with a battery backup that allows employees to track their time worked during a power outage"}, {"url": "http://www.twc.state.tx.us/news/efte/c_time_clock_rounding_.html", "passage_text": "It has been found that in some industries, particularly where time clocks are used, there has been the practice of recording the employee's starting and stopping time to the nearest five minutes, or to the nearest one-tenth or quarter of an hour. Time missed or worked within that interval will not be deducted from or added to the time worked, whereas time missed or worked outside that interval will result in that interval being deducted from or added to the time worked. The regulations on this are found in subpart D of part 785 of the wage and hour regulations."}, {"url": "http://www.dol.gov/whd/regs/compliance/whdfs53.htm", "passage_text": "An employer only records and pays for time if employees work in full 15 minute increments. An employee paid $10 per hour is scheduled to work 8 hours a day Monday through Friday, for a total of 40 hours a week. The employee always clocks out 12 minutes after the end of her shift. The employee is paid $400 per week. Employee time from 1 to 7 minutes may be rounded down, and thus not counted as hours worked, but employee time from 8 to 14 minutes must be rounded up and counted as a quarter hour of work time. See Regulations 29 CFR 785.48(b) ."}, {"url": "http://www.timeclockmts.com/tips-and-tricks/how-does-payroll-time-rounding-work/", "passage_text": "Here’s an example, let’s say we have the time rounding set to 15 minutes and the normal clock in time for your employees is 7:30 AM. In this example, anything on or before 7:37:29 AM is rounded down to 7:30 AM, and anything on or after 7:37:30 is rounded up to 7:45 AM. So, in our example above any employee clocking in after 7:30:00 AM will have their time rounded up to 7:45:00 AM. Let’s say the normal clock out time for the above example is 4:30:00 PM."}, {"url": "http://www.twc.state.tx.us/news/efte/c_time_clock_rounding_.html", "passage_text": "Many employers do not pay employees according to the exact number of hours and minutes they work, but rather utilize some sort of rounding or roundoff system whereby a certain interval is set that serves as the minimum block of time that will be recognized as a unit of time worked or not worked. Time missed or worked within that interval will not be deducted from or added to the time worked, whereas time missed or worked outside that interval will result in that interval being deducted from or added to the time worked. The regulations on this are found in subpart D of part 785 of the wage and hour regulations."}, {"url": "https://en.wikipedia.org/wiki/Time_clock", "passage_text": "One or more time cards could serve as a timesheet or provide the data to fill one. This allowed a timekeeper to have an official record of the hours an employee worked to calculate the pay owed an employee. The terms Bundy clock, bundy clock, or just bundy have been used in Australian English for time clocks. The term comes from brothers Willard and Harlow Bundy. In regard to mechanical time clocks this was accomplished by inserting a heavy paper card, called a time card, into a slot on the time clock. When the time card hit a contact at the rear of the slot, the machine would print day and time information (a timestamp) on the card."}, {"url": "http://www.twc.state.tx.us/news/efte/c_time_clock_rounding_.html", "passage_text": "If an employee came in early for personal convenience and did not work prior to the scheduled beginning time, a recording of the fact that the employee worked, for example, 8 hours that day is all that is required. Time missed or worked within that interval will not be deducted from or added to the time worked, whereas time missed or worked outside that interval will result in that interval being deducted from or added to the time worked. The regulations on this are found in subpart D of part 785 of the wage and hour regulations."}, {"url": "http://www.timeclockmts.com/tips-and-tricks/how-does-payroll-time-rounding-work/", "passage_text": "The most basic way of explaining it is that all clock ins are ROUNDED UP and all clock outs are ROUNDED DOWN. So, in our example above any employee clocking in after 7:30:00 AM will have their time rounded up to 7:45:00 AM. Let’s say the normal clock out time for the above example is 4:30:00 PM. When the Least Quantity check box is marked, any employee clocking out between 4:30:01 PM and 4:44:59 PM will have their clock out time rounded down to 4:30:00 PM"}]