[{"url": "http://www.gardeningknowhow.com/edible/herbs/lemongrass/learn-about-growing-lemon-grass-plant.htm", "passage_text": "You may have wondered how to grow lemongrass on your own. You can grow your own lemongrass plants, and in fact, growing lemongrass and propagating lemongrass is not all the difficult and you don’t have to have a great green thumb. Let’s take a look at how to grow lemongrass. If you live in a warm climate, you can plant your lemongrass plants out in the backyard in a bog or pond. Of course, growing the plant indoors is nice for having easy access to the fresh plant whenever you need it."}, {"url": "http://parkseed.com/lemongrass-seeds/p/00632-PK-P1/", "passage_text": "Lemongrass thrives in moist soil and full sun, growing 3 to 5 feet tall within a single season. The seed germinates in 7 to 14 days, and the plant reaches a good size for picking about 3 months later. If you begin the seeds indoors, transplant the young plants at about 6 inches high. "}, {"url": "http://www.gardeningblog.net/how-to-grow/lemongrass/", "passage_text": "Actually, you may even be able to start a new lemongrass plant from fresh stalks you purchase at the regular grocery store. As long as they are still firm and green, you should be able to get them to root. Snip off an inch or two from the end of the leaves, and put the base end in a glass of water. While inside, a lemongrass plant needs as much sun as you can offer with a minimum of 6 hours a day. It may thrive as an indoor-only plant but you won’t get as many stalks from it. Fertilize your container plants once every 2 weeks with a standard mix, though you can skip this during the winter months."}, {"url": "http://www.gardenguides.com/111923-grow-lemon-grass-plant.html", "passage_text": "Overview. Lemon grass (Cymbopogon citratus) is grown as a perennial in USDA horticultural zones 8 to 11 and as an annual or container plant everywhere else. It is a clumping grass that grows to 4 feet tall and wide. The bulbous stems are used in Asian and Caribbean dishes, where they are smashed to release the oils. The location needs to be well-drained, as lemon grass cannot sit in waterlogged soil for long periods of time. If you are planting more than one plant, the plants need to be spaced 3 or 4 feet apart. They will grow to full size in one season."}, {"url": "http://www.gardeningknowhow.com/edible/herbs/lemongrass/learn-about-growing-lemon-grass-plant.htm", "passage_text": "Advertisement. Growing lemongrass is as simple as taking your started plant out of the water and putting the rooted stalks into a pot containing all-purpose soil, with the crown just below the surface. You want to put this pot of lemongrass plants in a warm, sunny spot on a window ledge or out on your patio. Water it regularly. If you live in a warm climate, you can plant your lemongrass plants out in the backyard in a bog or pond. Of course, growing the plant indoors is nice for having easy access to the fresh plant whenever you need it."}, {"url": "http://homeguides.sfgate.com/tall-can-johnson-grass-grow-75326.html", "passage_text": "Height. Johnson grass grows upright and is capable of reaching a height of 6 to 8 feet. Leaves are .8 inches thick, rolled at the bud, and 6 to 20 inches long. Extensive rhizomes, which can grow 275 feet in a single year per plant, generally inhabit the uppermost 10 inches of soil in which the grass grows."}, {"url": "http://blog.gardenharvestsupply.com/2011/10/25/how-to-grow-lemongrass-indoors-or-out/", "passage_text": "Growing Lemongrass Outside. Lemongrass is actually a tropical plant, so those of you who have warm weather year round can easily grow lemon-grass plants as part of your landscape. In ideal conditions lemon grass will reach 3 to 6-foot high and do double-duty as a decorative ornamental grass. Lemongrass prefers full sun and some room. A mature plant can reach 6 feet in height and be up to 40 inches wide. It wants a well-drained, loamy soil, so make sure you don’t have heavy clay, or that water does not stand in the area you’re planting."}, {"url": "http://www.gardeningblog.net/how-to-grow/lemongrass/", "passage_text": "Each plant can grow to between 3 and 6 feet high if you do grow it outside. It will be somewhat smaller if you have to keep it inside. There are 2 kinds of lemongrass: East Indian and West Indian but there is little difference between them in terms of culinary use and growing. While inside, a lemongrass plant needs as much sun as you can offer with a minimum of 6 hours a day. It may thrive as an indoor-only plant but you won’t get as many stalks from it. Fertilize your container plants once every 2 weeks with a standard mix, though you can skip this during the winter months."}, {"url": "http://nassau.ifas.ufl.edu/horticulture/herbs/lemongrass.html", "passage_text": "Planting and Spacing: Lemongrass divisions should be spaced 3 feet apart in the garden since it can grow 3 to 6 feet tall and 3 feet wide, if water, fertilizer and growing conditions are optimal. In cooler areas, lemongrass should be planted in a pot. "}]