[{"url": "https://en.wikipedia.org/wiki/Type_O-", "passage_text": "1 Blood group A individuals have the A antigen on the surface of their RBCs, and blood serum containing IgM antibodies against the B antigen. 2  Therefore, a group A individual can receive blood only from individuals of groups A or O (with A being preferable), and can donate blood to individuals with type A or AB. Some of these antigens are also present on the surface of other types of cells of various tissues. Several of these red blood cell surface antigens can stem from one allele (or an alternative version of a gene) and collectively form a blood group system."}, {"url": "https://en.wikipedia.org/wiki/Type_O-", "passage_text": "1 Blood group B individuals have the B antigen on the surface of their RBCs, and blood serum containing IgM antibodies against the A antigen. 2  Therefore, a group B individual can receive blood only from individuals of groups B or O (with B being preferable), and can donate blood to individuals with type B or AB. Some of these antigens are also present on the surface of other types of cells of various tissues. Several of these red blood cell surface antigens can stem from one allele (or an alternative version of a gene) and collectively form a blood group system."}, {"url": "http://www.answers.com/Q/What_kind_of_antibodies_does_a_person_with_type_A_blood_have", "passage_text": "People with blood type O do not have any antigen on the RBC membrane.So they can not receive blood from group A&B&AB.Because they have anti_A and anti_B antibodies in their pl … asma.They can only receive blood from type O. type A BLOOD has antigens A and it has antibodies B type B blood has antigens B and antibodies A type AB blood has both antigens A and B but no antibodies type O blood has no … antigens but antibodies A and B. 11 people found this useful."}, {"url": "http://health.howstuffworks.com/human-body/systems/circulatory/blood5.htm", "passage_text": "For instance, type A blood has anti-type-B antibodies. Type B blood has anti-type-A antibodies. Type AB blood has no antibodies in the plasma, and type O blood has both anti-type-A and anti-type-B antibodies in the plasma. These antibodies are not present at birth but are formed spontaneously during infancy and last throughout life. There are two antigens, A and B. If you have the A antigen on the RBC, then you have type A blood. When B antigen is present, you have type B blood. When both A and B antigens are present, you have type AB blood. When neither are present, you have type O blood. When an antigen is present on the RBC, then the opposite antibody (also called agglutinin) is present in the plasma"}, {"url": "http://www.answers.com/Q/What_antibodies_are_in_the_plasma_of_type_A-_blood", "passage_text": "People with blood type O do not have any antigen on the RBC membrane.So they can not receive blood from group A&B&AB.Because they have anti_A and anti_B antibodies in their pl … asma.They can only receive blood from type O. + 3 others found this useful. Jill Bond Porterfield. "}, {"url": "http://www.nobelprize.org/educational/medicine/bloodtypinggame/1.html", "passage_text": "The A and B antigens are sugars and the Rh antigens are proteins. The antigens expressed in the red blood cells determine an individual's blood type. Also the combination of some other molecules floating around in the blood plasma differs between the eight blood types, the so called antibodies. Antibodies (in the blood plasma) : A antibodies. If there are B and Rh antigens but no A antigens, the antibodies in the blood plasma are A antibodies. The blood type notation B Rh+ indicates which antigens and antibodies are present in the blood."}]