[{"url": "https://en.wikipedia.org/wiki/I%27ll_Fly_Away", "passage_text": "I'll Fly Away , is a hymn written in 1929 by Albert E. Brumley and published in 1932 by the Hartford Music company in a collection titled Wonderful Message. Brumley's writing was influenced in part by an older secular ballad. In a history given by the current Chuck Wagon Gang, their recording of I'll Fly Away is described as the first commercially licensed release.. Their recording appears to have had two releases on Columbia, first as a B-side in 1949, then as an A-side in 1950."}, {"url": "http://www.lyricsmode.com/lyrics/r/randy_crawford/one_day_ill_fly_away.html", "passage_text": "My life again. One Day I'll fly away. Leave your love to yesterday. What more can your love do for me. When will love be through with me. Why live life from dream to dream. And dread the day that dreaming ends. One day i'll fly away, fly away, fly away (repeat to fade). Lyrics taken from http://www.lyricsmode.com/lyrics/r/randy_crawford/one_day_ill_fly_away.html."}, {"url": "http://www.lyricsmode.com/lyrics/m/moulin_rouge/one_day_ill_fly_away.html#!", "passage_text": "I follow the night Can't stand the light When will I begin To live again? One day I'll fly away Leave all this to yesterday What more could your love do for me? When will love be through with me? Why live life from dream to dream.... "}, {"url": "http://www.metrolyrics.com/one-day-ill-fly-away-lyrics-soundtrack.html", "passage_text": "Submit Corrections Cancel. I follow the night. Can't stand the light. When will I begin. To live again. One day I'll fly away. Leave all this to yesterday. What more could your love do for me. When will love be through with me. Why live life from dream to dream. One day I'll fly away. Fly fly away. print correct. Get One Day I'll Fly Away Ringtone. 5 Love Songs That Are Actually Creepy You'll never hear them the same way again. FEATURED more videos. 5 Love Songs That Are Actually Creepy."}, {"url": "http://www.lyricsfreak.com/a/alison+krauss/ill+fly+away_20521748.html", "passage_text": "I'll fly away; (in the morning). When I die, Hallelujah, by and by, I'll fly away (I'll fly away). top 100 · top new · updates · submit lyrics. Some glad morning when this life is o'er, I'll fly away; To a home on God's celestial shore, I'll fly away (I'll fly away). When I die, Hallelujah, by and by, I'll fly away (I'll fly away)"}, {"url": "http://www.npr.org/sections/bryantpark/2008/06/whats_the_best_ill_fly_away_ev.html", "passage_text": "I'll Fly Away was originally written by Albert Brumley in 1929, and since then it's become one of the most covered songs of all time. It's been performed by everyone from Andy Griffith to Kanye West. Today I made a contribution to the continuing BPP series, Best Song in the World Today, with the classic spiritual  I'll Fly Away .. The choice was inspired by the jarring experience of going from the Grand Canyon to Las Vegas last weekend."}, {"url": "http://www.songfacts.com/detail.php?id=6509", "passage_text": "Now We May Begin was produced by The Crusaders, and this song (as well as Street Life) was written by their keyboard player Joe Sample with lyrics by Will Jennings, who told us: 'One Day I'll Fly Away' was written specifically for Randy Crawford. On that album Randy also covered a song Joe and I wrote for the B.B. King Take It Home album, Same Old Story.. In 1980 Lalo Shifrin and I wrote People Alone for the film The Competition, which Randy performed."}]