[{"url": "http://www.emg-pr.com/en/prfitem.aspx?id=15081", "passage_text": "Clariant’s Emulsogen® MTP 070 for metalworking fluids. (Photo: Clariant) Editorial EnquiriesKai RolkerClariant International LtdEmail: kai.rolker@clariant.comTel: +41 61 469 6363Josina van der VeldenEMGEmail: jvandervelden@emg-pr.comTel: +31 164 317 014Fax: +31 164 317 039. 1 Extreme pressure/anti-wear additives: Clariant Hordaphos® and Hostaphat® phosphoric acid esters enhance cutting and forming fluid by providing protection under extreme friction, especially when combined with Hostagliss products-the perfect solution to replace chlorinated paraffins."}, {"url": "http://www.essentialingredients.com/spec/Emulsogen%20HCO%20040.pdf", "passage_text": "Emulsogen HCO 040 - 154631 Revision: 5Page 2 This product specification would cease to be binding if the customer has not purchased the product during the preceding 12 months. This information is based on our present state of knowledge and is intended to provide general notes on our products and their uses. 6, D-10787 Berlin, Germany. They are also available from the National Standard authority of each country. DGF-Standards are published by: Wissenschaftliche Verlagsgesellschaft mbH, Birkenwald Str. 44, D-70191 Stuttgart, Germany."}, {"url": "http://www.google.com/patents/WO2010084301A1?cl=en", "passage_text": "In order to maintain emulsion stability and, where required, to enable the incorporation of an optional oil phase soluble insecticide, at least one solvent is incorporated in the compositions of the invention in an amount of from 1 to 20% w/w. The insecticide is incorporated in the compositions of the invention as an aqueous suspension so as to give an effective concentration of insecticide in the composition, preferably of from 0.001 to 5%w/w. A more preferred concentration range is from 0.001 to 2.5%w/w. Most preferred concentration is from 0.001 to 1% w/w."}, {"url": "http://www.essentialingredients.com/spec/Emulsogen%20HCO%20040.pdf", "passage_text": "This Product Specification is not signed. If you have any questions, please contact the local Clariant Office or Clariant Produkte (Deutschland) GmbH, European-Quality-Service-Center (EQSC), D-65926 Frankfurt, Germany. 6, D-10787 Berlin, Germany. They are also available from the National Standard authority of each country. DGF-Standards are published by: Wissenschaftliche Verlagsgesellschaft mbH, Birkenwald Str. 44, D-70191 Stuttga"}, {"url": "https://www.ulprospector.com/en/na/Coatings/Detail/2961/43869/Emulsogen-TS-200", "passage_text": "Emulsogen® TS 200 is a nonionic dispersing agent and emulsifier. It is is suitable for organic pigments and carbon black to produce stable, free flowing pigment preparations with high solid contents. Emulsogen® TS 200 improves the compatibility of pigments and minerals with polymers and binders."}, {"url": "http://www.essentialingredients.com/spec/emulsogenls24gel.pdf", "passage_text": "Emulsogen LS-24 Gel - 113330 Revision: 2Page 2 This product specification would cease to be binding if the customer has not purchased the product during the preceding 12 months. This information is based on our present state of knowledge and is intended to provide general notes on our products and their uses. 6, D-10787 Berlin, Germany. They are also available from the National Standard authority of each country. DGF-Standards are published by: Wissenschaftliche Verlagsgesellschaft mbH, Birkenwald Str. 44, D-70191 Stuttgart, Germany. This Product Specification is not signed."}, {"url": "http://www.essentialingredients.com/spec/Emulsogen%20HCO%20040.pdf", "passage_text": "It should therefore not be construed as guaranteeing specific properties of the products described or their suitability for a particular application. Any existing industrial rights must be observed. ISO-, EN-and DIN-Standards are published by: Beuth-Verlag, Burggrafenstr. 6, D-10787 Berlin, Germany. They are also available from the National Standard authority of each country. DGF-Standards are published by: Wissenschaftliche Verlagsgesellschaft mbH, Birkenwald Str. 44, D-70191 Stuttgart, Germany."}, {"url": "http://www.google.com/patents/WO2010084301A1?cl=en", "passage_text": "Claims(1). 1. An insecticidal composition in the form of an aerosol water-in-oil emulsion comprising: (a) an effective amount of an aqueous suspension of at least one insecticide, said insecticide being in particulate form or adsorbed onto inert particles; The insecticide is incorporated in the compositions of the invention as an aqueous suspension so as to give an effective concentration of insecticide in the composition, preferably of from 0.001 to 5%w/w. A more preferred concentration range is from 0.001 to 2.5%w/w. Most preferred concentration is from 0.001 to 1% w/w."}, {"url": "http://www.essentialingredients.com/spec/emulsogenls24gel.pdf", "passage_text": "It should therefore not be construed as guaranteeing specific properties of the products described or their suitability for a particular application. Any existing industrial rights must be observed. ISO-, EN-and DIN-Standards are published by: Beuth-Verlag, Burggrafenstr. 6, D-10787 Berlin, Germany. They are also available from the National Standard authority of each country. DGF-Standards are published by: Wissenschaftliche Verlagsgesellschaft mbH, Birkenwald Str. 44, D-70191 Stuttgart, Germany. This Product Specification is not signed. If you have any questions, please contact the local Clariant Office or Clariant Produkte (Deutschland) GmbH, European-Quality-Service-Center (EQSC), D-65926 Frankfurt, Germany"}, {"url": "http://www.google.com/patents/WO2010084301A1?cl=en", "passage_text": "Patents. An insecticidal composition in the form of an aerosol water-in-oil emulsion comprising: (a) an effective amount of an aqueous suspension of at least one insecticide, said insecticide being in particulate form or adsorbed onto inert particles; (b) at least one water soluble or water dispersible thickener... The insecticide is incorporated in the compositions of the invention as an aqueous suspension so as to give an effective concentration of insecticide in the composition, preferably of from 0.001 to 5%w/w. A more preferred concentration range is from 0.001 to 2.5%w/w. Most preferred concentration is from 0.001 to 1% w/w."}]