[{"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm205999.htm", "passage_text": "Triclosan is an ingredient added to many consumer products to reduce or prevent bacterial contamination. It may be found in products such as clothing, kitchenware, furniture, and toys. FDA is working to incorporate the most up-to-date data and information into the regulations that govern the use of triclosan in consumer products. FDA anticipates communicating the findings of our review to the public in winter 2012 through our rulemaking process."}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm205999.htm", "passage_text": "1 In light of questions raised by recent animal studies of triclosan, FDA is reviewing all of the available evidence on this ingredient’s safety in consumer products. 2  FDA will communicate the findings of its review to the public in winter 2012. FDA is working to incorporate the most up-to-date data and information into the regulations that govern the use of triclosan in consumer products. FDA anticipates communicating the findings of our review to the public in winter 2012 through our rulemaking process."}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm378393.htm", "passage_text": "EPA regulates the use of triclosan as a pesticide, and is in the process of updating its assessment of the effects of triclosan when it is used in pesticides. FDA's focus is on the effects of triclosan when it is used by consumers on a regular basis in hand soaps and body washes. "}, {"url": "http://drbenkim.com/articles/triclosan-products.htm", "passage_text": "Although triclosan is best known for its presence in many brands of antibacterial soap, it is also found in a wide variety of personal care and household products. If you are not yet aware of the potential dangers of triclosan, you should know that this antibacterial agent has been strongly linked to the following effects on human health: * Abnormalities with the endocrine system, particularly with thyroid hormone signaling. * Weakening of the immune system."}, {"url": "http://greencleaning.about.com/od/GreenCleaningResources/g/Triclosan-What-It-Is-How-Its-Used-Why-You-Should-Avoid-It.htm", "passage_text": "Triclosan, which is a chlorinated aromatic compound, is an antibacterial and bacteriocidal agent used in a wide array of consumer goods, such as cleaning products, cosmetic products, furniture, and textiles, to prevent the growth of bacteria, mold, and mildew. Other Names for Triclosan. Triclosan is regulated by the Environmental Protection Agency (EPA) when its use is considered a pesticide and by the FDA for other purposes. In light of new research and data, the EPA is scheduling another review of Triclosan in 2013."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/adult-health/expert-answers/triclosan/faq-20057861", "passage_text": "There currently isn't enough evidence to recommend avoiding use of products that contain triclosan — an ingredient added to certain soaps, cosmetics, clothing, cookware, furniture and toys to reduce or prevent bacterial contamination. When you use a product containing triclosan, you can absorb a small amount through your skin or mouth. A 2008 study, which was designed to assess exposure to triclosan in a representative sample of U.S. children and adults, found triclosan in the urine of nearly 75 percent of those tested."}, {"url": "http://articles.mercola.com/sites/articles/archive/2012/08/29/triclosan-in-personal-care-products.aspx", "passage_text": "Print. Print. By Dr. Mercola Triclosan, a high production volume ingredient used as a bactericide in personal care products such as toothpaste, deodorant, and antibacterial soap, has been linked to heart disease and heart failure in a new study. "}, {"url": "http://articles.mercola.com/sites/articles/archive/2014/08/27/triclosan-toothpaste.aspx", "passage_text": "1 Triclosan is an antibacterial chemical used in a wide variety of consumer products. 2  Despite the pervasive use of this chemical, troubling questions linger about its potentially harmful effects, especially for children. "}, {"url": "http://www.care2.com/greenliving/the-trouble-with-triclosan-in-your-soap.html", "passage_text": "Thanks to the chemical industry, a hazardous antibacterial compound called triclosan is now an ingredient in many household and personal care products such as soaps, cleaners, cosmetics, clothing, and even children’s toys. If a product contains triclosan, but does not make such a claim, then EPA does not review it. Triclocarban. Triclocarban is an antibacterial substance with a structure and function similar to triclosan that also has toxic properties."}, {"url": "http://www.businessinsider.com/is-colgate-total-triclosan-toothpaste-safe-2014-8", "passage_text": "It first started to appear in antibacterial hand soap products in the 1970s. Since then, triclosan has been added to a ton of things — it has been used in consumer products such as detergents, soaps, skin cleansers, deodorants, lotions, creams, toothpastes, and dishwashing liquids, according to a CDC fact sheet. "}]