[{"url": "http://www.scotsconnection.com/clan_crests/Bruce.htm", "passage_text": "Bruce Clan. Bruce Crest: A lion statant with tail extended. Bruce Clan Motto: Fuimus (We have been). Bruce Clan History: The Bruce surname, one of the most celebrated in Scottish history, is of territorial origin, from the Chateau d'Adam at Brix, in Normandy. The first Bruce recorded in Britain was Robert de Brus, who arrived with William the Conqueror's Norman invasion of England in 1066"}, {"url": "http://www.sheknows.com/baby-names/name/bruce", "passage_text": "The name Bruce is an American baby name. In American the meaning of the name Bruce is: Thick brush. Surname since medieval times; now a common given name. Folklore tale of 14th century Robert King of Scotland: (the Bruce) who learned the value of perseverance from watching a spider spin a web. English Meaning: The name Bruce is an English baby name. In English"}, {"url": "https://en.wikipedia.org/wiki/Bruce", "passage_text": "The Scots-English language name Bruce arrived in Scotland with the Normans, from the place name Brix of the Manche departement département In, Normandy, france meaning the. willowlands Initially promulgated via the descendants of King Robert I of Scotland (Robert the Bruce) (1274-1329), it has been a Scottish surname since medieval times; it is now a common given name."}, {"url": "http://www.sheknows.com/baby-names/name/bruce", "passage_text": "The name Bruce is a French baby name. In French the meaning of the name Bruce is: From Brys. Scottish Meaning: The name Bruce is a Scottish baby name. In Scottish the meaning of the name Bruce is: Surname since medieval times; now a common given name. Folklore tale of 14th century Robert King of Scotland: ('the Bruce') who learned the value of perseverance from watching a spider spin a web. English Meaning: The name Bruce is an English baby name. In English the meaning of the name Bruce is: Thick brush. Surname since medieval times; now a common given name. Folklore tale of 14th century Robert King of Scotland: (the Bruce"}, {"url": "http://www.ancestry.com/name-origin?surname=bruce", "passage_text": "Bruce Name Meaning. Scottish and English (of Norman origin): habitational name from a place in Normandy which has not been certainly identified. Traditionally, it is believed to be derived from Brix near Cherbourg, but Le Brus in Calvados and Briouze in Orne have also been proposed as candidates. "}, {"url": "http://www.archives.com/genealogy/family-history-bruce.html", "passage_text": "Bruce is a locational name, deriving from the place of origin of the family in Normandy in France, either in Brix or in Brieuze. The first Bruces, with the Norman name de Brus, came to England with William the Conqueror during the eleventh century Norman invasion. Bruce family history is very strong especially in Scotland, claiming several royal titles."}, {"url": "http://www.behindthename.com/name/bruce", "passage_text": "From a Scottish surname, of Norman origin, which probably originally referred to the town of Brix in France. The surname was borne by Robert the Bruce, a Scottish hero of the 14th century who achieved independence from England and became the king of Scotland. It has been in use as a given name in the English-speaking world since the 19th century. A notable bearer is the American musician Bruce Springsteen (1949-)"}, {"url": "http://www.babynamewizard.com/baby-name/boy/bruce", "passage_text": "Meanings and history of the name Bruce: | Edit. Bruce was the surname of a Scottish Clan, and is of Norman origins. Robert the Bruce became the first king of Scotland. Became a given name in the 19th century. I've read this name means thick brush or from the brushwood thicket. "}, {"url": "https://en.wikipedia.org/wiki/Clan_Bruce", "passage_text": "History [edit]. The surname Bruce comes from the French de Brus or de Bruis, derived from the lands now called Brix, situated between Cherbourg and Valognes in Normandy, France. There is no evidence to support a claim that a member of the family, Robert de Brix, served under William the Conqueror during the Norman Conquest of England. Origins of the Clan [edit]. The surname Bruce comes from the French de Brus or de Bruis, derived from the lands now called Brix, situated between Cherbourg and Valognes in Normandy, France."}]