[{"url": "http://www.google.com/patents/US20110239337", "passage_text": "Patents. ‘Ivory’ is a new Prunus laurocerasus variety particularly distinguished by having dark green foliage that has cream and greenish white blotches and dots, variegation that consists of small yellow-green and green-white dot, and a relatively narrow, upright growth habit, is disclosed.... US 20110239337 P1. Abstract"}, {"url": "http://www.laurelhedging.com/types-of-laurel-hedging.html", "passage_text": "Types of Laurel Hedging. There are several different types of Laurel plants that are suitable for hedging. Most of the hedging plants sold in the UK come from the Common or Cherry Laurel group (Prunus laurocerasus) but Portugal Laurel also makes a dense, evergreen hedge. Bay Laurel is also a useful hedging plant but is not hardy enough in some parts of the UK. Click on each type below for more details."}, {"url": "http://www.laurelhedging.com/types-of-laurel-hedging/cherry-or-common-laurel.html", "passage_text": "PRUNUS LAUROCERASUS. Prunus laurocerasus is the original species of Common Laurel. It is a quick-growing, evergreen, wide-spreading shrub that can grow up to 18ft (6 metres) in height. This is the species of Common Laurel (aka Cherry Laurel, English Laurel) from which most of the other varieties have been developed. Marbled White is a variety of Common Laurel with fine white markings on the leaves. It is slower growing that most other varieties of Prunus laurocerasus as it has less chlorophyll in the leaves because of the variegation. Ultimate height 5m (15ft) tall."}, {"url": "http://www.laurelhedging.com/types-of-laurel-hedging/cherry-or-common-laurel.html", "passage_text": "PRUNUS LAUROCERASUS 'NOVITA ™'. This variety of common laurel is a selection from Rotundifolia and as a result, is very similar to it. There is some evidence that it may be even hardier, tolerating temperatures of -27 C, and so it is becoming more popular on continental Europe where winters are harder than in the UK. Marbled White is a variety of Common Laurel with fine white markings on the leaves. It is slower growing that most other varieties of Prunus laurocerasus as it has less chlorophyll in the leaves because of the variegation. Ultimate height 5m (15ft) tall."}, {"url": "http://www.google.com/patents/US20110239337", "passage_text": "1 Comparison with parental variety: ‘Ivory’ is a new and distinct variety of Prunus laurocerasus having dark green foliage that is blotched and dotted cream color and greenish white color, variegation that consists of small dots, and a relatively narrow, upright growth habit. US 20110239337 P1. Abstract. ‘Ivory’ is a new Prunus laurocerasus variety particularly distinguished by having dark green foliage that has cream and greenish white blotches and dots, variegation that consists of small yellow-green and green-white dot, and a relatively narrow, upright growth habit, is disclosed."}, {"url": "http://yardandgardenrescue.com/prunus-laurocerasus-best-prunus-laurocersus-varieties/", "passage_text": "Prunus laurocerasus varieties are often used a good formal hedges or as an informal hedge or screen with a naturalistic form, and also planted in masses or groups. Prunus make good choices for woodland and shaded gardens. Origin: Eastern Europe and southwest Asia. Hardiness Zones: range from Zone 6-8. Get facts and information on the best Prunus varieties for your yard and garden. Prunus Facts and Information. Cherry laurel bears excellent, glossy, 6”, dark green leaves year round. It has clusters of perfumed blooms that appear in spring, followed by black fruits that attract wildlife."}, {"url": "http://www.laurelhedging.com/types-of-laurel-hedging/cherry-or-common-laurel.html", "passage_text": "PRUNUS LAUROCERASUS 'ROTUNDIFOLIA'. Prunus laurocerasus 'Rotundifolia' is a bushier and more upright growing form of Common (aka Cherry) Laurel than the species. It also has a more attractive rounded leaf which is generally half as broad as it is long, hence its name Rotundifolia meaning rotund foliage or rounded leaf. Marbled White is a variety of Common Laurel with fine white markings on the leaves. It is slower growing that most other varieties of Prunus laurocerasus as it has less chlorophyll in the leaves because of the variegation. Ultimate height 5m (15ft) tall."}, {"url": "https://en.wikipedia.org/wiki/Prunus_laurocerasus", "passage_text": "The common names of P. laurocerasus refer to the similarity of foliage and appearance to bay laurel (Laurus nobilis, the true laurel, in the Lauraceae family), and like the bay laurel, Prunus laurocerasus was used for making laurel wreaths, but the two plants are unrelated. Prunus laurocerasus is an evergreen shrub or small to medium-sized tree, growing to 5 to 15 metres (16 to 49 ft) tall, rarely to 18 metres (59 ft), with a trunk up to 60 cm broad. The leaves are dark green, leathery, shiny, (5–)10–25(–30)cm long and 4–10 cm broad, with a finely serrated margin."}]