[{"url": "http://www.eng-tips.com/viewthread.cfm?qid=288463", "passage_text": "A minimum temperature is not often specified for the concrete. It is usually in the form of air temperature. As a practical matter, you would like to see the concrete temperature not go below 40F. At about 39F, the density of water decreases and continues to decrease until it freezes. Further, long term performance of concrete with regard to temperature differential is affected. If you have the proper mix design, heated water, protected or heated aggregates and reasonable protection from the elements, the heat of hydration will over-rule the air temperature if the base the concrete is on is not too cold."}, {"url": "http://www.murray.utah.gov/DocumentCenter/Home/View/3744", "passage_text": "If concrete temperature is greater than 60º F and the air temperature is 50º F the concrete needs to be protected from drying by using a curing compound or steam heating ACI 306R-88 Chpt 8.2 The contractor is still responsible for following all requirements in ACI 306R and APWA. 3 mix. APWA 03 30 04 2.5 E1 4. Non chloride admixtures may be used but placement, curing and protection requirements must be observed. APWA 03 30 10 3.4 A2 5. Temperature of concrete as placed should be as close to the minimum recommended value as possible (55º F) ACI 306R-88 Chpt 3.1 6."}, {"url": "http://www.ecslimited.com/blog/cold-weather-concrete-0", "passage_text": "ECS recommends that you review the guidelines presented in ACI 360R before beginning a cold weather concrete pour. ACI 306R provides additional guidance on the types and duration of protective measures that may be necessary for cold weather concrete placement. When concrete is placed at cold temperatures, hydration can be slowed-and even stopped-which impacts finishing and curing times. Another concern is the permanent damage that concrete may experience if it freezes at an early age."}, {"url": "http://www.cement.org/for-concrete-books-learning/concrete-technology/concrete-construction/hot-weather-concreting", "passage_text": "As a general rule of thumb an increase of 20 degrees Fahrenheit will reduce the setting time of a concrete mixture by as much as 50 percent. As an example, a concrete mixture that reaches final set in three hours at 60 degrees Fahrenheit may reach final set in as little 1½ hours at 80 degrees Fahrenheit. As the concrete temperature increases the setting time is further reduced."}, {"url": "http://www2.iccsafe.org/states/newyorkcity/Building/PDFs/Chapter%2019_Concrete.pdf", "passage_text": "In addition to the requirements of this section,structuralplainconcretewallsshallcomplywiththeapplicablerequirements of ACI 318, Chapter 22. 1909.6.1 Basement walls. The thickness of exterior base-ment walls and foundation walls shall be not less than 7 1 / 2 inches (191 mm). Structural plain concrete exterior base-ment walls shall be exempt from the requirements for spe-cial exposure conditions of Section 1904.2.2. 1909.6.2 Other walls."}, {"url": "http://www2.iccsafe.org/states/newyorkcity/Building/PDFs/Chapter%2019_Concrete.pdf", "passage_text": "1901.2 Plain and reinforced concrete. Structural concreteshall be designed and constructed in accordance with therequirements of this chapter and ACI 318 as amended in Sec-tion 1908 of this code. Except for the provisions of Sections1904 and 1911, the design and construction of slabs on ... The thickness of exterior base-ment walls and foundation walls shall be not less than 7 1 / 2 inches (191 mm). Structural plain concrete exterior base-ment walls shall be exempt from the requirements for spe-cial exposure conditions of Section 1904.2.2. 1909.6.2 Other walls."}, {"url": "http://www.ecslimited.com/blog/cold-weather-concrete-0", "passage_text": "Cold weather affects concrete in many ways. Hydration in concrete, the process of gaining strength, is a chemical reaction. When concrete is placed at cold temperatures, hydration can be slowed-and even stopped-which impacts finishing and curing times. Another concern is the permanent damage that concrete may experience if it freezes at an early age."}, {"url": "http://www.murray.utah.gov/DocumentCenter/Home/View/3744", "passage_text": "Concrete should not be exposed to temperatures 20ºF above the minimum placement temperatures. ACI 306R-88 Chpt 7.4 11. The temperature of the concrete and the ambient air and recorded at least twice in 24 hr period. Temperatures should be taken at more than one location, on edges and corners. 12. 3 mix. APWA 03 30 04 2.5 E1 4. Non chloride admixtures may be used but placement, curing and protection requirements must be observed. APWA 03 30 10 3.4 A2 5. Temperature of concrete as placed should be as close to the minimum recommended value as possible (55º F) ACI 306R-88 Chpt 3.1 6."}, {"url": "http://www.ecslimited.com/blog/cold-weather-concrete-0", "passage_text": "Once normal-set concrete has been placed, it must be maintained at the above temperature and kept moist for a specified period of time, usually at least 72 hours, to allow for adequate initial curing. Insulating blankets, heated mats, and/or heated enclosures may be necessary. When concrete is placed at cold temperatures, hydration can be slowed-and even stopped-which impacts finishing and curing times. Another concern is the permanent damage that concrete may experience if it freezes at an early age."}, {"url": "http://www.cemstone.com/userfiles/file/PCA-Cold%20Weather%20Concreting.pdf", "passage_text": "Effect of temperature conditions on the strengthdevelopment of concrete. Concrete for the lower curve wascast at 4°C (40°F) and placed immediately in a curing roomat -4°C (25°F). Both concretes received 100% relative-humidity curing for first 28 days followed by 50% relative-humidity curing (Klieger 1958). Concrete should not be placed onany surface that would lower the temperature of the as-placed concrete below the minimum values shown on Line4 in Table 14-1. ENCLOSURES Heated enclosures are very effective for protectingconcrete in cold weather, but are probably the most expen-sive too (Fig. 14-17)."}]