[{"url": "http://www.bbc.co.uk/history/historic_figures/bismarck_otto_von.shtml", "passage_text": "Otto von Bismarck in uniform © Bismarck was responsible for transforming a collection of small German states into the German empire, and was its first chancellor. Otto Eduard Leopold von Bismarck was born into an aristocratic family at Schoenhausen, schönhausen northwest Of, berlin on 1 april. 1815 he attended a prestigious school In berlin followed by The university Of. Goettingen göttingen he then Entered the prussian civil service but was bored by his job and in. 1838 resigned"}, {"url": "http://www.ssa.gov/history/ottob.html", "passage_text": "Otto von Bismarck German Chancellor 1862-1890. SSA History Archives. Germany became the first nation in the world to adopt an old-age social insurance program in 1889, designed by Germany's Chancellor, Otto von Bismarck. The idea was first put forward, at Bismarck's behest, in 1881 by Germany's Emperor, William the First, in a ground-breaking letter to the German Parliament."}, {"url": "http://www.history.com/topics/otto-von-bismarck", "passage_text": "Germany became a modern, unified nation under the leadership of the “Iron Chancellor” Otto von Bismarck (1815-1898), who between 1862 and 1890 effectively ruled first Prussia and then all of Germany."}, {"url": "http://www.history.com/topics/otto-von-bismarck", "passage_text": "Otto von Bismarck: Early Years. Otto Eduard Leopold von Bismarck was born April 1, 1815, at his family’s estate in the Prussian heartland west of Berlin. His father was a fifth-generation Junker (a Prussian landowning noble), and his mother came from a family of successful academics and government ministers."}, {"url": "http://www.kbismarck.com/otto-von-bismarck.html", "passage_text": "Bismarck, also known as the Iron Chancellor, was the founder and first chancellor of the German Empire, and through his diplomatic skills, he managed to maintain the peace in Europe for a generation. Early Life and Career. Otto von Bismarck was born on 1 April 1815 at Sch nhausen in Brandenburg, Prussia. His father, Ferdinand von Bismarck-Sch nhausen, was of the old Prussian nobility. His mother, Wilhelmine Mencken, from the upper bourgeoisie."}, {"url": "http://www.kbismarck.com/otto-von-bismarck.html", "passage_text": "OTTO VON BISMARCK Otto von Bismarck (1815-1898) The battleship Bismarck was named in honour of Otto F rst von Bismarck, the architect of German unification and the arbiter of European politics during the second half of the 19th century."}]