[{"url": "http://www.audioenglish.org/dictionary/cargo_container.htm", "passage_text": "A large container for freight. Classified under: Nouns denoting man-made objects. Hypernyms (cargo container is a kind of...): container (any object that can be used to hold things (especially a large metal boxlike object of standardized dimensions that can be loaded from one form of transport to another))."}, {"url": "http://www.answers.com/Q/What_does_cargo_mean_in_english", "passage_text": "Spanish 'cargo' is both a noun and part of a verb: cargar = to (over)load, (over)burden; 'cargo' i … s the 1st person ('I') of this verb. As a noun, 'cargo' has many meanings: the act of loading; burden; weight; responsibility; duty; charge; accusation; also specific meanings related to measurements of stones or grapes."}, {"url": "http://www.answers.com/Q/What_does_cargo_mean", "passage_text": "Spanish 'cargo' is both a noun and part of a verb: cargar = to (over)load, (over)burden; 'cargo' i … s the 1st person ('I') of this verb. As a noun, 'cargo' has many meanings: the act of loading; burden; weight; responsibility; duty; charge; accusation; also specific meanings related to measurements of stones or grapes. Depending on what Country you work in it could mean 1 of two things.A shifting cargo means that the cargo is or has moved while the vehicle is in motion. This can cause damage … or even an accident or crash.In some places Shifting means to move or relocate as in: Shift that Cargo to the warehouse."}, {"url": "http://www.definitions.net/definition/cargo", "passage_text": "Cargo is goods or produce transported, generally for commercial gain, by ship or aircraft, although the term is now extended to intermodal train, van or truck. In modern times, containers are used in most long-haul cargo transport. Wiktionary (0.00 / 0 votes) Rate this definition: cargo (Noun). Freight carried by a ship, aircraft etc. cargo (Noun). (Papua New Guinea) Western material goods. Origin: From cargo, from cargar, from carricare."}, {"url": "https://en.wikipedia.org/wiki/Cargo_cult", "passage_text": "A cargo cult is a Melanesian millenarian movement encompassing a diverse range of practices and occurring in the wake of contact with the commercial networks of colonizing societies. The name derives from the belief that various ritualistic acts will lead to a bestowing of material wealth ( cargo ). "}, {"url": "http://www.thefreedictionary.com/cargo", "passage_text": "Commodities and supplies in transit. See also air cargo; dangerous cargo; essential cargo; immediately vital cargo; unwanted cargo; valuable cargo; wanted cargo. a. goods carried by a ship, aircraft, or other vehicle; freight. b. (as modifier): a cargo vessel. 2. any load: the train pulled in with its cargo of new arrivals. [C17: from Spanish: from cargar to load, from Late Latin carricāre to load a vehicle, from carrus car]. (ˈkɑr goʊ). n., pl."}, {"url": "http://www.thefreedictionary.com/cargo", "passage_text": "car•go. 1. the load of goods carried by a ship, airplane, etc.; freight. 2. cargos, pants or shorts having several pleated and flapped pockets to hold bulky gear and small items. 3. of or being a style of pants or shorts with pleated pockets. a. goods carried by a ship, aircraft, or other vehicle; freight. b. (as modifier): a cargo vessel. 2. any load: the train pulled in with its cargo of new arrivals. [C17: from Spanish: from cargar to load, from Late Latin carricāre to load a vehicle, from carrus car]. (ˈkɑr goʊ). n., pl."}, {"url": "http://www.merriam-webster.com/dictionary/cargo", "passage_text": "Full Definition of CARGO. : the goods or merchandise conveyed in a ship, airplane, or vehicle: freight. See cargo defined for English-language learners. See cargo defined for kids. ADVERTISEMENT. "}]