[{"url": "http://www.livestrong.com/article/175858-the-average-lean-body-mass/", "passage_text": "This is because women naturally hold more body fat and men tend to have a larger amount of lean muscle mass. According to Medline Plus, the average woman in America holds about 22 to 25 percent body fat and the average American man holds approximately 17 to 19 percent body fat. People are considered obese if their body fat exceeds 30 percent for women and is 25 percent or higher for men. Medline Plus recommendations for body fat are 20 to 21 percent for women and 13 to 17 percent for men."}, {"url": "http://forum.bodybuilding.com/showthread.php?t=144135581&pagenumber=1", "passage_text": "K. I. S. S. There is usually little discussion about average muscle or FFM (fat-free mass) for women, but it's a good thing to pursue. At 21, most average BF% targets will be 20-30%. That's a broad average and I think it's too high. Rep Power: 5665"}, {"url": "http://livewell.jillianmichaels.com/ideal-weight-muscle-mass-height-4682.html", "passage_text": "Instead of focusing on muscle itself, most medical professionals defer to body fat to determine if your muscle mass is at an ideal percentage for your height. Women should have a body fat percentage somewhere between 20 and 21 percent. Men should have far less, coming in at 13 to 17 percent. The National Institutes of Health provides a rough estimate of desirable body weight for height. Women should weigh approximately 100 lbs. at 5 feet and then another 5 lbs. for each inch over this height. Men should weigh a bit more, coming in at 106 lbs. at 5 feet and then an extra 6"}, {"url": "http://www.answers.com/Q/What_is_the_average_female_human_muscle_mass", "passage_text": "What is the average muscle mass? Muscle mass is important in maintaining a healthy body. Depending  on age and physical activity level, the average muscle mass  percentage lies between 38% and 54% for men a … nd between 28% and 39%  for women. Answered. In Exercise. Muscle mass is important in maintaining a healthy body. Depending  on age and physical activity level, the average muscle mass  percentage lies between 38% and 54% for men a … nd between 28% and 39%  for women."}, {"url": "http://healthyliving.azcentral.com/much-muscle-mass-male-female-1709.html", "passage_text": "For women under 30, recommended body fat is between 14 percent and 21 percent, compared to 9 percent to 15 percent for men. Lower levels of lean muscle mass translate into comparatively lower strength capacity. John LeCuyer, author of Designing the Fitness Program, contends that body composition, and specifically percentage of fat mass, is the most significant indicator of overall fitness. The increased fat mass in women displaced lean muscle mass, leading to an overall lower percentage of lean muscle mass."}, {"url": "http://forum.bodybuilding.com/showthread.php?t=144135581&pagenumber=1", "passage_text": "Originally Posted by jdmalm123 There is usually little discussion about average muscle or FFM (fat-free mass) for women, but it's a good thing to pursue. At 21, most average BF% targets will be 20-30%. That's a broad average and I think it's too high. Rep Power: 5665."}, {"url": "http://healthyliving.azcentral.com/much-muscle-mass-male-female-1709.html", "passage_text": "In comparison, the average adult female contains 36 percent muscle and 26 percent fat. Though women have a higher percentage overall of body fat, 15 percent of their body fat is regarded as essential, meaning it is necessary to the healthy functioning of the body. John LeCuyer, author of Designing the Fitness Program, contends that body composition, and specifically percentage of fat mass, is the most significant indicator of overall fitness. The increased fat mass in women displaced lean muscle mass, leading to an overall lower percentage of lean muscle mass."}, {"url": "http://www.answers.com/Q/What_is_the_average_female_human_muscle_mass", "passage_text": "the average is 30 to 40 percent in muscle mass for an adult female. In Exercise. Muscle mass is important in maintaining a healthy body. Depending  on age and physical activity level, the average muscle mass  percentage lies between 38% and 54% for men a … nd between 28% and 39%  for women. Answered"}, {"url": "http://healthyliving.azcentral.com/much-muscle-mass-male-female-1709.html", "passage_text": "According to a 2003 review by the Journal of Adolescent Health, at the end of puberty males have 150 [percent] of the lean body mass of the average female and twice the number of muscle cells.. A surge in female estrogen causes the increase in essential body fat in women. John LeCuyer, author of Designing the Fitness Program, contends that body composition, and specifically percentage of fat mass, is the most significant indicator of overall fitness. The increased fat mass in women displaced lean muscle mass, leading to an overall lower percentage of lean muscle mass."}]