[{"url": "https://answers.yahoo.com/question/index?qid=20080512143442AAwzKAC", "passage_text": "Be at least 1-2 inches away from the umbilicus. Inject at a 45 – 90 degree angle. The maximum amount that can be injected subcutaneously is 1cc. Sites for subcutaneous injections: 1. Outer aspect of the upper arm. 2. The abdomen – below the costal margin (rib cage) to the iliac crest. 3."}, {"url": "http://www.drugs.com/dosage/arcalyst.html", "passage_text": "Pediatric patients aged 12 to 17 years: Treatment should be initiated with a loading dose of 4.4 mg/kg, up to a maximum of 320 mg, delivered as one or two subcutaneous injections with a maximum single-injection volume of 2 mL."}, {"url": "http://www.drugs.com/cg/how-to-give-a-subcutaneous-injection.html", "passage_text": "Subcutaneous injections can be given straight in at a 90 degree angle or at a 45 degree angle. Give the injection at a 90 degree angle if you can grasp 2 inches of skin between your thumb and first finger. If you can grasp only 1 inch of skin, give the injection"}, {"url": "http://www.drugs.com/dosage/arcalyst.html", "passage_text": "Dosing should be continued with a once-weekly injection of 2.2 mg/kg, up to a maximum of 160 mg, administered as a single subcutaneous injection, up to 2 mL. If the initial dose is given as two injections, they should be given on the same day at two different sites."}, {"url": "http://pharmlabs.unc.edu/labs/parenterals/subcutaneous.htm", "passage_text": "The upper back also can be used as a site of subcutaneous administration. The site of injection is usually rotated when injections are frequently given. The maximum amount of medication that can be subcutaneously injected is about 2 ml. Needles are generally 3/8 to 1 inch in length and 24 to 27 gauge."}, {"url": "http://atitesting.com/ati_next_gen/skillsmodules/content/medication-administration-3/equipment/intramuscular-injections.html", "passage_text": "If the total volume to be administered exceeds the maximum volume recommended for a particular site, split the injection into two or more smaller injections and give them at different sites. For the deltoid muscle of an average adult or adolescent, give up to 1 mL of medication with a ⅝-inch to 1-inch needle."}]