[{"url": "http://waddl.vetmed.wsu.edu/animal-disease-faq/bvd-pi-ear-notch", "passage_text": "Bovine Virus Diarrhea Virus (BVDV) infection in cattle herds can result in major economic loss from poor reproductive performance (reduced percent pregnant, increased abortion and stillbirth) or poor calf performance (increased calf sickness and death loss). When present, the most common disease caused by BVD virus infection in cattle herds is poor reproductive performance including, abortions, poor conception rates, stillbirths, and weak calves."}, {"url": "https://www.idexx.com/livestock-poultry/ruminant/bvdv.html", "passage_text": "Bovine viral diarrhea virus (BVDV) suppresses a cow's immune system, making the animal susceptible to a host of other infections. That's why BVDV is one of the world's most costly bovine diseases, with losses of $15–$88 per head from reduced herd productivity, health and reproductive efficiency. "}, {"url": "http://waddl.vetmed.wsu.edu/animal-disease-faq/bvd-pi-ear-notch", "passage_text": "Cattle persistently infected with BVDV (BVD-PI) are the primary reservoir for BVDV infection in cattle herds, and thus are the major focus of control programs. When present, the most common disease caused by BVD virus infection in cattle herds is poor reproductive performance including, abortions, poor conception rates, stillbirths, and weak calves."}, {"url": "http://calfology.com/library/wiki/bovine-viral-diarrhea-virus-bvd", "passage_text": "Description: Bovine viral diarrhea virus (BVD) is a viral infection of domestic ruminants worldwide. BVD is responsible for significant economic losses due to decreased milk production, reproductive problems, treatment costs, and mortality. Cost estimates in herds with BVD range from $24 to $200 per cow per year. BVD often interacts with other disease of the respiratory and digestive tract and can affect multiple organ systems. The clinical scenario that occurs when a herd is infected with BVD depends on the level of immune protection in the herd and the strain of the infecting virus. One of the problematic aspects associated with BVD is the presence of persistently infected (PI) cattle."}, {"url": "http://www.nadis.org.uk/bulletins/control-of-bovine-virus-diarrhoea-(bvd).aspx", "passage_text": "The cytopathic BVD virus usually arises from changes in the BVD virus within the PI animal. Mucosal disease is most commonly seen in 6 to 12 month-old calves, and is usually seen as sudden onset depression, fever and anorexia, with excess salivation. Ulcers appear in the mouth and on the muzzle. It is estimated that more than 90% of UK herds have had exposure to bovine virus diarrhoea virus (BVDv)."}, {"url": "https://en.wikipedia.org/wiki/Bovine_virus_diarrhea", "passage_text": "The causative agent, bovine viral diarrhea virus (BVDV) is a member of the Pestivirus genus of the family Flaviviridae. BVD infection results in a wide variety of clinical signs, due to its immunosuppressive effects, as well as having a direct effect on respiratory disease and fertility. "}, {"url": "http://www.bovilis.ie/bvd/", "passage_text": "Bovine Viral Diarrhoea (BVD) in Cattle. Bovine viral diarrhoea is a highly infectious disease caused by a virus transmitted from infected animals. Animal Health Ireland estimate the annual cost of BVD to Irish herds totals €102 million. BVD is widespread amongst Irish herds and many farmers are unaware of the virus circulating in their herds. Signs of infection vary and include fertility problems such as abortions and birth defects, scour and reduced milk yield. Bovilis BVD is licensed for use in cows and heifers from 8 months old to protect the foetus from infection with BVD virus via the placenta. A primary vaccination course, commencing after 8 months of age, requires 2 doses of Bovilis BVD given by intramuscular injection four weeks apart."}, {"url": "http://www.farmanimalhealth.co.uk/cattle-bvd", "passage_text": "Bovine Viral Diarrhoea (BVD) is believed by many to be the most important viral disease of cattle, responsible for a variety of production losses. It can be hard, however, to associate health problems seen in the herd with the BVD virus or appreciate the prevalence and dangers of the disease. "}, {"url": "http://www.msd-animal-health.co.nz/binaries/BVD_SC_MSD_Farmer_Brochure___BEEF_tcm51-112710.pdf", "passage_text": "These figures do not include abortions that may have been caused by BVD virus. The cost of BVD Virus. 16 Cost to an average beef herd per 100 cows Assume weaner heifers and steers average $400 each, and the replacement cost of an empty cow is $200. These animals remain immune to further infections for several years. All cattle that become infected with BVD virus will develop a transient infection as long as they are a fetus older than 4 months. For example, BVD infection of a 180 day fetus or 6 month calf or adult cow can only result in a transient infection."}]