[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_edexcel/organism_energy/respirationrev1.shtml", "passage_text": "This is the equation for aerobic respiration: glucose + oxygen → carbon dioxide + water (+ energy). The energy released by respiration is used to make large molecules from smaller ones. In plants, for example, sugars, nitrates and other nutrients are converted into amino acids. Amino acids can then join together to make proteins. The energy is also used: 1  To allow muscles to contract in animals."}, {"url": "https://en.wikibooks.org/wiki/GCSE_Science/Breathing_and_Respiration", "passage_text": "Respiration is the process in which the chemical bonds of energy-rich molecules such as glucose are converted into energy usable for life processes. Aerobic respiration uses oxygen to oxidise glucose and produce energy. The equation for the oxidation of glucose is: "}, {"url": "http://sciencewithme.com/learn-about-respiration/", "passage_text": "Respiration is the term used to refer to the movement of oxygen into your body and tissues and the movement of carbon dioxide from your body to the environment. Different organisms have different modes of respiration and respiratory systems. The basis of respiration or gas exchange is called a pressure gradient. Remember that substances tend to move from an area of higher concentration to an area of lower concentration. This is also called diffusion. This is true for the two gases essential for respiration—oxygen and carbon dioxide."}, {"url": "http://www.yourdictionary.com/respiration", "passage_text": "respiration. 1  act or process of respiring; breathing; inhaling and exhaling air. 2  the processes by which a living organism or cell takes in oxygen from the air or water, distributes and utilizes it in oxidation, and gives off products of oxidation, esp. carbon dioxide. 1 The process of inhaling and exhaling; breathing, breath. 2  An act of breathing; a breath. 3  Any similar process, in organisms that lack lungs, that exchanges gases with its environment. 4  The process by which cells obtain chemical energy by the consumption of oxygen and the release of"}, {"url": "http://study.com/academy/lesson/what-is-respiration-definition-process-equation.html", "passage_text": "Respiration is the biochemical process in which the cells of an organism obtain energy by combining oxygen and glucose, resulting in the release of carbon dioxide, water, and ATP, the currency of energy in cells. Balance With Photosynthesis. Respiration is the antithesis to the process of photosynthesis, in which carbon dioxide and water are taken in by autotrophs, along with sunlight, to make glucose and oxygen. Autotrophs include any photosynthesizing organisms, such as plants and algae, all of whom also undergo respiration."}, {"url": "http://study.com/academy/lesson/what-is-respiration-definition-process-equation.html", "passage_text": "When we examine the equation for cellular respiration, we see that the reactants are glucose and oxygen (for aerobic respiration), and the products are carbon dioxide, water, and ATP. Note the number of oxygen, carbon dioxide, and water molecules involved in each 'turn' of the process. Balance With Photosynthesis. Respiration is the antithesis to the process of photosynthesis, in which carbon dioxide and water are taken in by autotrophs, along with sunlight, to make glucose and oxygen. Autotrophs include any photosynthesizing organisms, such as plants and algae, all of whom also undergo respiration."}, {"url": "http://www.yourdictionary.com/respiration", "passage_text": "1 act or process of respiring; breathing; inhaling and exhaling air. 2  the processes by which a living organism or cell takes in oxygen from the air or water, distributes and utilizes it in oxidation, and gives off products of oxidation, esp. carbon dioxide. 1 The process of inhaling and exhaling; breathing, breath. 2  An act of breathing; a breath. 3  Any similar process, in organisms that lack lungs, that exchanges gases with its environment. 4  The process by which cells obtain chemical energy by the consumption of oxygen and the release of"}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/organisms_behaviour_health/life_processes/revision/3/", "passage_text": "Respiration. Respiration is a chemical reaction that happens in all living cells. It is the way that energy is released from glucose, for our cells to use to keep us functioning. Remember that respiration is not the same as breathing (which is properly called ventilation). The reaction is called aerobic respiration because oxygen from the air is needed for it to work. Here is the word equation for aerobic respiration: glucose + oxygen → carbon dioxide + water (+ energy). (Energy is released in the reaction."}, {"url": "http://study.com/academy/lesson/what-is-respiration-definition-process-equation.html", "passage_text": "Respiration is the antithesis to the process of photosynthesis, in which carbon dioxide and water are taken in by autotrophs, along with sunlight, to make glucose and oxygen. Balance With Photosynthesis. Respiration is the antithesis to the process of photosynthesis, in which carbon dioxide and water are taken in by autotrophs, along with sunlight, to make glucose and oxygen. Autotrophs include any photosynthesizing organisms, such as plants and algae, all of whom also undergo respiration."}]