[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/biology/mitochondria.html", "passage_text": "Mitochondria are the energy factories of the cells. The energy currency for the work that animals must do is the energy-rich molecule adenosine triphosphate (ATP). The ATP is produced in the mitochondria using energy stored in food. Just as the chloroplasts in plants act as sugar factories for the supply of ordered molecules to the plant, the mitochondria in animals and plants act to produce the ordered ATP molecules as the energy supply for the processes of life."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/biology/mitochondria.html", "passage_text": "Your fat cells have many mitochondria because they store a lot of energy. Muscle cells have many mitochondria, which allows them to respond quickly to the need for doing work. Mitochondria occupy 15 to 20 percent of mammalian liver cells according to Karp. The ATP is produced in the mitochondria using energy stored in food. Just as the chloroplasts in plants act as sugar factories for the supply of ordered molecules to the plant, the mitochondria in animals and plants act to produce the ordered ATP molecules as the energy supply for the processes of life."}, {"url": "http://www.dermascope.com/chemistry/cell-science-the-mighty-mitochondria", "passage_text": "Fat cells have many mitochondria because they store a lot of energy. Muscle cells also have abundant mitochondria that allow them to respond quickly to the need of performing activities. ATP production via mitochondria is done by the process of respiration using oxygen in a process that generates energy. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090923124103AALnYEb", "passage_text": "Answers. Best Answer: mitochondria supplies energy to the cell. muscle cells require a lot of mitochondria,as they move a lot and require a great deal of energy,this way it can keep going. without the mitochondria it would become tired,and not be able to functon properly. hope this helps xx. Source(s):"}, {"url": "http://www.answers.com/Q/Why_is_the_mitochondria_important_in_cells", "passage_text": "1 ATP synthesis   Mitochondria are important as the only site of aerobic respiration in the cell. Some respiration (glycolysis) takes place in the cytosol, yielding 2 … molecules of ATP per glucose molecule respired, but this is anaerobic. The mitochondria breaks down glucose into ATP (stored energy). The ATP is then broken down into ADP and releases energy for your cells. Therefore you function as a human being!"}, {"url": "http://sciencelearn.org.nz/Contexts/Digestion-Chemistry/Looking-Closer/Mitochondria-cell-powerhouses", "passage_text": "Image: Cell featuring mitochondria. Mitochondria are tiny organelles inside cells that are involved in releasing energy from food. This process is known as cellular respiration. It is for this reason that mitochondria are often referred to as the powerhouses of the cell. Cells that need a lot of energy, like muscle cells, can contain thousands of mitochondria. Apart from cellular respiration, mitochondria also play a key role in the ageing process as well as in the onset of degenerative disease"}, {"url": "https://answers.yahoo.com/question/index?qid=20080911140139AAB6lzv", "passage_text": "Report Abuse. Every cell has a mitochondria, because it is here that cell releases energy from food. The energy is needed to help it grow and move. Mitochondria are sometimes called the 'powerhouses' of the cell. The energy is released by combining food with oxygen, in a process called respiration.The more active a cell, the more mitochondria it has. So the mitochondria is not a cell, but part of a cell. Source(s): My fourth form Biology teacher. "}, {"url": "http://home.trainingpeaks.com/blog/article/the-power-and-importance-of-mitochondria", "passage_text": "Tweet. Many of you may wonder what mitochondria are and why you should care about them. As an endurance athlete, the microscopic entities (organelles) located inside your muscle cells known as mitochondria are critical to your training and racing success. It doesn’t matter if you are a beginner or a pro athlete; the proper care and feeding of your mitochondria is crucial. Mitochondria are affectionately referred to in almost every academic physiology textbook as the powerhouses of the cell. For our purposes we are going to focus on the muscle cells of the skeletal and cardiac (heart) systems but mitochondria populate many other cells of the human body. A mitochondrion is 0.5 to 1.0 microns in size; that represents 0.0000195 to 0.000039 of an inch"}, {"url": "http://bscb.org/learning-resources/softcell-e-learning/mitochondrion-much-more-than-an-energy-converter/", "passage_text": "In cells where there is a high energy demand large numbers of mitochondria are found. The tail of a sperm contains many mitochondria and they run in a spiral like form along the length of the tail. In heart muscle cells about 40% of the cytoplasmic space is taken up by mitochondria. In liver cells the figure is about 20-25% with 1000 to 2000 mitochondria per cell. Mitochondria: determinators."}]