[{"url": "http://www.ebay.com/sch/i.html?_nkw=guinness+is+good+for+you", "passage_text": "Follow guinness is good for you to get e-mail alerts and updates on your eBay Feed. guinness is good for you. Follow guinness is good for you to get e-mail alerts and updates on your eBay Feed. Unfollow guinness is good for you to stop getting updates on your eBay Feed. Yay! You're now following guinness is good for you in your eBay Feed."}, {"url": "http://news.bbc.co.uk/2/hi/3266819.stm", "passage_text": "The old advertising slogan Guinness is Good for You may be true after all, according to researchers. A pint of the black stuff a day may work as well as a low dose aspirin to prevent heart clots that raise the risk of heart attacks. Drinking lager does not yield the same benefits, experts from University of Wisconsin told a conference in the US."}, {"url": "http://www.popsugar.com/fitness/Guinness-Health-Benefits-7709620", "passage_text": "Some other reasons you may want to enjoy a pint of beer on St. Paddy's Day: better bones, weight management, and a better memory. It also doesn't hurt that Guinness contains fewer calories and carbs than a good majority of popular full-strength beer sold in markets. This is not a license to go out and get blitzed, though. As always, everything is better in moderation, but if you end up kicking back a few too many, check out these hangover cures. "}, {"url": "http://news.bbc.co.uk/2/hi/3266819.stm", "passage_text": "The long-running ad campaign is well-known. The old advertising slogan Guinness is Good for You may be true after all, according to researchers. A pint of the black stuff a day may work as well as a low dose aspirin to prevent heart clots that raise the risk of heart attacks. Drinking lager does not yield the same benefits, experts from University of Wisconsin told a conference in the US."}, {"url": "http://news.health.com/2014/03/14/3-surprising-facts-about-guinness/", "passage_text": "This one’s more of a half-myth. “Guinness is Good for You” was born as a catchy marketing slogan in the late 1920s, and wasn’t based on any scientific proof that drinking beer actually had any health benefits. Today, some experts actually do believe that moderate alcohol consumption (including beer, wine, and spirits) could be good for you. Oh, and beer. Lots and lots of beer. And since Guinness is perhaps the most popular Irish beer brand in the world, chances are your local watering hole will be offering specials on it come March 17."}, {"url": "https://en.wikipedia.org/wiki/Guinness", "passage_text": "Guinness (/ˈɡɪnɨs/) is an Irish dry stout that originated in the brewery of Arthur Guinness (1725–1803) at St. James's Gate, Dublin. Guinness is one of the most successful beer brands worldwide. It is brewed in almost 60 countries and is available in over 120. "}, {"url": "http://www.smithsonianmag.com/arts-culture/is-guinness-really-good-for-you-54943899/", "passage_text": "Back in the 1920s, when the “Guinness is Good for You” slogan was introduced, the claim was based on market research that found that people felt good after they drank a pint of the dark and foamy stout. Um, duh. This flimsy claim was eventually bolstered by the fact that Guinness contains iron. But another health benefit was discovered in 2003: stout beer like Guinness (as opposed to lager and other light beer) is high in the antioxidant compounds called flavonoids—similar to those found in red wine, tea and chocolate—that can reduce the risk of heart attack from blood clotting."}, {"url": "http://www.irishcentral.com/news/guinness-is-good-for-you-say-medical-experts-113839559-237365401.html", "passage_text": "Grab a pint of the black stuff. Photo by: Getty Images. The old advertising slogan ‘Guinness is good for you’ is actually true it seems. While Diageo, the manufacturer, makes no health claims for the product, scientific research shows a pint of Guinness a day is actually good for your health. Indeed it may work as well as a low dose of aspirin to prevent heart attacks. Researchers at the University of Wisconsin made the discovery recently. "}]