[{"url": "https://answers.yahoo.com/question/index?qid=20080827004817AA9eF0O", "passage_text": "Report Abuse. There is a certain age at which most people usually stop growing: men - 25, women - 21. It occurs shortly after puberty. However, these numbers can be changed! It is possible to continue growing until 25 for women and 27-30 for men"}, {"url": "https://answers.yahoo.com/question/index?qid=20091228081020AApmg7d", "passage_text": "Report Abuse. at the age of 17 years we stop growing (i.e. our height stops growing) but as for other things there are different ages of different organs but our brain never stops growing (i.e as long as we live) not in size but as in knowledge. king · 6 years ago. Thumbs up. 1. In particular, the sutures between the bones of the skull do not completely grow together until about the age of 29. Frequently females slow or stop growing soon after they have their first menstrual period. So, as I said in the very first sentence, there is no exact science as to when humans stop growing."}, {"url": "http://www.nbcnews.com/id/3076703/t/why-do-we-stop-growing/", "passage_text": "Ultimately, we stop growing because we are genetically programmed to do so. It is our genes, made of DNA, that determine how we grow and develop. We inherit our genes from our parents when we are conceived, and we maintain this genetic blueprint throughout life. Once we are born, we continue to grow and develop until the completion of puberty. At this point our genetic program tells us to stop growing. From an evolutionary viewpoint, once our genes have orchestrated the growth and development of the body to the point that it can reproduce, the purpose for growth is complete."}, {"url": "http://www.answers.com/Q/At_what_age_do_humans_stop_growing", "passage_text": "The penis will stop growing by the time Puberty is over. So most boys penises will have stopped growing by the age of 16 to 21.It will grow to the size it is genetically desti … ned to be, regardless of what you do to it. There are no foods, supplements, or exercises that will change the size of your penis. An other Answer There's been modern reserch on human growth that the average human stops their growth (in length) at age 25 but that doesn't mean your going to gorw 4 inches in 5 years, you might grow 1 inch or 1 inch and a half. Only time, exersise and the proper nutricion will tell."}, {"url": "http://www.youtube.com/watch?v=yLER9OWeo_g", "passage_text": "Please try again later. The male body stops growing when the epiphyseal bone plates are completely seals between the ages of 18 and 20 years old. Find out how the epiphyseal bone plates are controlled by hormones with information from an ophthalmologist in this free video on the human body. "}, {"url": "https://answers.yahoo.com/question/index?qid=20091228081020AApmg7d", "passage_text": "We stop growing in height at around age 16-18 for women and 17-19 for men. However, we are constantly regenerating cells so in a sense we are still growing, its just that our growth has slowed to the point where we are only replacing the cells we have lost. In particular, the sutures between the bones of the skull do not completely grow together until about the age of 29. Frequently females slow or stop growing soon after they have their first menstrual period. So, as I said in the very first sentence, there is no exact science as to when humans stop growing."}, {"url": "http://www.answers.com/Q/When_do_people_stop_growing", "passage_text": "Making the world better, one answer at a time. Women stop growing at 14 to 18 years of age, and men stop growing at about 18 to 21 years of age. People stop growing when their bones stop growing and that is usually when they are between 15 and 25 years old. Although bones look lifeless, they are living and changing all … the time. The bones of a baby are made up of a rubbery but soft tissue called cartilage. As the baby grows, the cartilage turns to hard bon"}, {"url": "https://answers.yahoo.com/question/index?qid=20091228081020AApmg7d", "passage_text": "Females very frequently stop growing by the time they are around 18 and males around 21. However, there continues to be bone growth that does not add to height. In particular, the sutures between the bones of the skull do not completely grow together until about the age of 29. Frequently females slow or stop growing soon after they have their first menstrual period. So, as I said in the very first sentence, there is no exact science as to when humans stop growing."}]