[{"url": "http://www.yourdictionary.com/labelling", "passage_text": "noun. Labelling, or labeling, is defined as the process of attaching a descriptive word or phrase to someone or something. 1  An example of labelling is the process of putting signs on jars that say what is inside. 2  An example of labelling is calling everyone from Oklahoma an Oakie."}, {"url": "https://answers.yahoo.com/question/index?qid=20121029114508AAQaIiH", "passage_text": "Labelling is to assume a person belongs to a certain group and then stereotype them into that group. For example, if you label someone who is wearing black as a goth, you will assume them to be a depressing and dark-minded person, when in fact they might not be at all. This can lead to prejudice and discrimination. "}, {"url": "http://sociology.about.com/od/Sociological-Theory/a/Labeling-Theory.htm", "passage_text": "Labeling theory is one of the most important approaches to understanding deviant and criminal behavior. It stems from the work of W.I. Thomas who, in 1928, wrote, If men define situations as real, they are real in their consequences.. Once a person is labeled as deviant, it is extremely difficult to remove that label. The deviant person becomes stigmatized as a criminal or deviant and is likely to be considered, and treated, as untrustworthy by others."}, {"url": "https://en.wikipedia.org/wiki/Labeling_theory", "passage_text": "Labeling theory is the theory of how the self-identity and behavior of individuals may be determined or influenced by the terms used to describe or classify them. It is associated with the concepts of self-fulfilling prophecy and stereotyping. The labeling theory suggests that people obtain labels from how others view their tendencies or behaviors. Each individual is aware of how they are judged by others because he or she has attempted many different roles and functions in social interactions and has been able to gauge the reactions of those present."}, {"url": "https://en.wikipedia.org/wiki/Labelling", "passage_text": "Labelling or labeling is describing someone or something in a word or short phrase. For example, describing someone who has broken a law as a criminal. Labelling theory is a theory in sociology which ascribes labelling of people to control and identification of deviant behavior. It has been argued that labelling is necessary for communication. However, the use of the term labelling is often intended to highlight the fact that the label is a description applied from the outside, rather than something intrinsic to the labelled thing. For example, a piece of music may be described as progressive rock or indie or ragga jungle drum and bass. However, there are other labels that can be applied to a work, such as derivative, low or high. The use of the word labelling is less common in the context of works of art than people. However, it also often represents the rejection of a label. For example, an artist may feel that the labeller is attempting to restrict the scope of the artist's work to that which is covered by the label"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20091124121859AAnwhKq", "passage_text": "Answers. Best Answer: Labeling is calling someone a certain name due to a stereotype or whatever. Stereotyping is automatically assuming that someone will be like a certain type of person due to how they dress, talk, what they look like, who they talk to, or what they do. Source(s): kaloskayla · 6 years ago."}, {"url": "https://en.wikipedia.org/wiki/Labeling_theory", "passage_text": "A stigma is defined as a powerfully negative label that changes a person's self-concept and social identity. Labeling theory is closely related to social-construction and symbolic-interaction analysis. The labeling theory suggests that people obtain labels from how others view their tendencies or behaviors. Each individual is aware of how they are judged by others because he or she has attempted many different roles and functions in social interactions and has been able to gauge the reactions of those present."}]