[{"url": "http://apt.rcpsych.org/content/aptrcpsych/7/4/243.full.pdf", "passage_text": "Cognitive–analytic therapy (CAT) is a brief focaltherapy informed by cognitive therapy, psycho-dynamic psychotherapy and certain developmentsin cognitive psychology. It was developed byAnthony Ryle specifically in response to the needsof the National Health Service (NHS) for treatmentapproaches of short duration. "}, {"url": "http://eprints.hud.ac.uk/12330/1/224.pdf", "passage_text": "The limitations and clinical implicationsof the study are discussed. Key Words: Psychotherapy, Learning disability, Reciprocal Roles, CAT Introduction Introduction to Cognitive Analytic Therapy (CAT) Cognitive Analytic Therapy is a time-limited, integrative psychotherapy developed byRyle (1990) for use within the NHS. 100 Cognitive Analytic Therapy (CAT) with people with learningdisabilities CAT has been adapted for use with people with learning disabilities. Vygotsky (1978)recognises that what a child is allowed to do with the support of another influenceswhat it can learn to do independently."}, {"url": "http://apt.rcpsych.org/content/7/4/243", "passage_text": "Cognitive–analytic therapy (CAT) is a brief focal therapy informed by cognitive therapy, psychodynamic psychotherapy and certain developments in cognitive psychology. It was developed by Anthony Ryle specifically in response to the needs of the National Health Service (NHS) for treatment approaches of short duration. Margison, F. (2000) Cognitive analytic therapy: a case study in treatment development (editorial). British Journal of Medical Psychology, 73, 145–149. Marzillier, J. & Butler, G. (1995) CAT in relation to cognitive therapy. In Cognitive Analytic Therapy: Developments in Theory and Practice (ed."}, {"url": "http://eprints.hud.ac.uk/12330/1/224.pdf", "passage_text": "Cognitive analytic therapy in people with learning disabilities. Method Design This was an exploratory investigation to identify common Reciprocal Roles (RRs) forpeople with learning disabilities. An empirical methodology was employed whichinvolved gathering of data and induction of patterns (Coolican, 1990). 100 Cognitive Analytic Therapy (CAT) with people with learningdisabilities CAT has been adapted for use with people with learning disabilities. Vygotsky (1978)recognises that what a child is allowed to do with the support of another influenceswhat it can learn to do independently."}, {"url": "http://www.acat.me.uk/reformulation.php?issue_id=1&article_id=3", "passage_text": "Using a template to draw diagrams in Cognitive Analytic Therapy. Jenaway, Dr. A. and Rattigan, N., 2011. Using a template to draw diagrams in Cognitive Analytic Therapy. Reformulation, Summer, pp.46-48. This field is required. On the right hand side are the things which go wrong or interrupt the state of bliss and send the baby back down to the unwanted state at the bottom of the diagram. A.J. has used this developmental model with parents to try and explain personality development in their struggling child or adolescent (2009). (Fig 1)."}, {"url": "http://www.users.miamioh.edu/stileswb/course_materials/development_of_CAT.htm", "passage_text": "Cognitive Analytic Therapy (CAT) is an integrative mode of short-term psychotherapy. As indicated by its name, the conceptual basis for the therapy derives mainly from cognitive psychology and psychoanalysis. In the first actual phase of Cognitive Analytic Therapy common patterns of neurotic problems were described as traps, dilemmas, and snags, (Ryle, 1979; 1990). I summarise these early definitions briefly."}, {"url": "http://eprints.hud.ac.uk/12330/1/224.pdf", "passage_text": "Cognitive Analytic Therapy (CAT) has beenadapted for use with a learning disability population (Ryle 2002). CAT collaborativelyexamines the Reciprocal Roles (RRs) a client plays in relationships. These are impactedby clients’ experiences of the world. 100 Cognitive Analytic Therapy (CAT) with people with learningdisabilities CAT has been adapted for use with people with learning disabilities. Vygotsky (1978)recognises that what a child is allowed to do with the support of another influenceswhat it can learn to do independently."}, {"url": "https://en.wikipedia.org/wiki/Cognitive_Analytic_Therapy", "passage_text": "(Redirected from Cognitive Analytic Therapy). Cognitive analytic therapy (CAT) is a form of psychological therapy initially developed in the United Kingdom by Anthony Ryle. CAT was also influenced in part by George Kelly 's constructivism. Kelly had developed personal construct theory and the repertory grid method, and Kelly's approach to therapy offered a a model of nonauthoritarian practice that psychotherapist Anthony Ryle found appealing."}, {"url": "https://en.wikipedia.org/wiki/Cognitive_Analytic_Therapy", "passage_text": "It is distinctive due to its intensive use of reformulation, its integration of cognitive and analytic practice and its collaborative nature, involving the patient very actively in their treatment. CAT was also influenced in part by George Kelly 's constructivism. Kelly had developed personal construct theory and the repertory grid method, and Kelly's approach to therapy offered a a model of nonauthoritarian practice that psychotherapist Anthony Ryle found appealing."}]