[{"url": "http://www.collegecalc.org/colleges/kentucky/spencerian-college/", "passage_text": "Annual Total Cost. The annual total list price cost to go to Spencerian College was $29,715 for the 2014/2015 academic year. The cost is the same for all students regardless of Kentucky residence status as there is no in-state discount. This is 29% more expensive than the national average private for-profit two year college tuition of $13,944. The cost is $10,516 and 142% more expensive than the average Kentucky tuition of $7,424 for 2 year colleges."}, {"url": "http://www.utsa.edu/financialaid/apply/cost.html", "passage_text": "1 Tuition and Fees: The average cost of tuition and fees for a typical undergraduate student based on full-time or part-time enrollment. 2  Full-time undergraduate = 30 hours per year; Part-time undergraduate = 18 hours per year; Full-time graduate = 18 hours per year; Part-time graduate = 12 hours per year. Definitions. 1 "}, {"url": "http://www.collegecalc.org/colleges/kentucky/spencerian-college/", "passage_text": "Undergraduate Tuition. Tuition for Spencerian College is $17,940 for the 2014/2015 academic year. This is 29% more expensive than the national average private for-profit two year college tuition of $13,944. The cost is $10,516 and 142% more expensive than the average Kentucky tuition of $7,424 for 2 year colleges. Tuition ranks 23rd in Kentucky amongst 2 year colleges for affordability and is the 2nd most expensive 2 year college in the state. Price does not vary by residence"}, {"url": "http://www.collegedata.com/cs/content/content_payarticle_tmpl.jhtml?articleId=10064", "passage_text": "Colleges often report a combined tuition and fees figure. According to the College Board, the average cost of tuition and fees for the 2014–2015 school year was $31,231 at private colleges, $9,139 for state residents at public colleges, and $22,958 for out-of-state residents attending public universities. Housing and Meals. The cost of room and board depends on the campus housing and food plans you choose. The College Board reports that the average cost of room and board in 2014–2015 ranged from $9,804 at four-year public schools to $11,188 at private schools. Colleges also provide room and board estimates for living off campus based on typical student cost"}, {"url": "http://admissions.tamu.edu/freshman/cost", "passage_text": "$18,636. $43,144. The total average cost of attendance to attend Texas A&M for one year is approximately $22,470 (for in-state residents), which includes tuition and fees, room and board, books, transportation and miscellaneous expenses. An education from Texas A&M remains very desirable and very affordable, year after year. The total average cost of attendance to attend Texas A&M for one year is approximately $22,470 (for in-state residents), which includes tuition and fees, room and board, books, transportation and miscellaneous expenses."}, {"url": "http://financialaid.tamu.edu/Undergraduate/Cost-of-Attendance", "passage_text": "The figures below outline the estimated cost of attendance for Undergraduate students at Texas A&M University. Detailed information regarding tuition & fees at Texas A&M University is available from Student Business Services. "}, {"url": "http://www.uah.edu/admissions/undergraduate/financial-aid/costs", "passage_text": "2015 - 2016 Cost of Attendance. For the 2015-2016 academic year, the total full time cost of attendance for undergraduates is estimated to be $24,525 for full-time resident undergraduate students and $36,536 for full-time non-resident undergraduate students. "}, {"url": "http://financialaid.tamu.edu/Cost.aspx", "passage_text": "The cost of attendance (COA) is an estimate of what it costs the typical student to attend Texas A&M University. Don’t be startled by the sticker price of a college education. Your cost of attendance (COA) doesn’t just cover your college tuition; it takes into account your basic living expenses too. So think about this: it is going to cost you the same amount to live for the next few years whether you’re in college or not, and college graduates earn an average of $20,000 MORE a year than students who only complete high school."}]