[{"url": "http://roadtransportinfo.blogspot.com/2011/09/what-is-general-freight.html", "passage_text": "Literally thousands of different items. If you are not sure where your freight fits in, it's likely to be General Freight. So you will need to find a General Freight Carrier. And finding the right carrier can be a bit of a challenge depending on the pick up point and the destination. Tips and information for businesses and individuals wanting to use Road Transport service in Australia. Learn how to use road transport, why rates vary, your responsibilities and how to locate the carrier you need."}, {"url": "http://naics-codes.findthedata.com/l/1418/General-Freight-Trucking-Local", "passage_text": "This industry comprises establishments primarily engaged in providing local general freight trucking. General freight establishments handle a wide variety of commodities, generally palletized and transported in a container or van trailer. Local general freight trucking establishments usually provide trucking within a metropolitan area which may cross state lines. Generally the trips are same-day return. NAICS code 484110 is the government industry code for general freight trucking, local. For more information about NAICS codes, visit our NAICS Code Guide."}, {"url": "http://www.freightmatch.com.au/general-freight/", "passage_text": "The general freight transport market in Australia is the largest category of freight moved in Australia as it literally could mean thousands of different items. General freight is generally moved interstate in Tautliners or Flattop trailers. This trailers can be in many different combinations. In some states such as Western Australia, South Australia, Northern Terrirtory, Queensland and New South Wales it is legal in certain areas to operate B-Triples and Roadtrains."}, {"url": "http://www.transportation-dictionary.org/General_Freight_Carrier", "passage_text": "General Freight Carrier. Trucking company engaged in shipping packaged, boxed, and palletized goods that can be transported in standard, enclosed tractor-trailers, generally 40 to 48 feet in length. (BOC2). A carrier which handles a wide variety of commodities. (ATA2)"}, {"url": "http://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&TVD=118464&CVD=118467&CPV=4841&CST=01012012&CLV=3&MLV=5&D=1", "passage_text": "48-49Transportation and warehousing-Transportation and warehousing. This sector comprises establishments primarily engaged in transporting passengers and goods, warehousing and storing goods, and providing services to these establishments. The modes of transportation are road (trucking, transit and ground passenger), rail, water, air and pipeline. "}, {"url": "https://en.wikipedia.org/wiki/Freight_rate", "passage_text": "From Wikipedia, the free encyclopedia. A freight rate (historically and in ship chartering simply freight) is a price at which a certain cargo is delivered from one point to another. The price depends on the form of the cargo, the mode of transport (truck, ship, train, aircraft), the weight of the cargo, and the distance to the delivery destination. So a 100 car train, each carrying 100 tons, over a distance of 1000 miles, would cost $100,000. In ship chartering, freight is the price which a charterer pays a shipowner for the use of a ship in a voyage charter."}, {"url": "http://www.freightmatch.com.au/general-freight/", "passage_text": "A general freight transport carrier in Australia is a trucking company that can move a wide variety of commodities in standard trailers. It can be full truck loads or LTL (Less than full truckloads). General freight is generally moved interstate in Tautliners or Flattop trailers. This trailers can be in many different combinations. In some states such as Western Australia, South Australia, Northern Terrirtory, Queensland and New South Wales it is legal in certain areas to operate B-Triples and Roadtrains."}, {"url": "http://www.freightmatch.com.au/general-freight/", "passage_text": "COMMON TRUCKING ROUTES. The majority of general freight is moved from South to North and East to West. Therefore, due to the supply and demand of trucking companies it is generally less expensive to move it from Perth to Sydney and Perth to Melbourne than it would be to move your freight in the opposite direction. General freight is generally moved interstate in Tautliners or Flattop trailers. This trailers can be in many different combinations. In some states such as Western Australia, South Australia, Northern Terrirtory, Queensland and New South Wales it is legal in certain areas to operate B-Triples and Roadtrains."}, {"url": "http://www.generalfreight.com.pk/", "passage_text": "General Freight Corporation (Pvt) Limited was established in May 1993 is an FIATA certified company. Initially it was confined to customs brokerage and inland transportation. "}]