[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/radiation/anintroductiontowavesrev2.shtml", "passage_text": "The wavelength of a wave is the distance between a point on one wave and the same point on the next wave. It is often easiest to measure this from the crest of one wave to the crest of the next wave, but it doesn't matter where as long as it is the same point in each wave. The frequency of a wave is the number of waves produced by a source each second. It is also the number of waves that pass a certain point each second. The unit of frequency is the hertz (Hz). It is common for kilohertz (kHz), megahertz (MHz) and gigahertz (GHz) to be used when waves have very high frequencies"}, {"url": "https://answers.yahoo.com/question/index?qid=20070512163820AA1Uuaw", "passage_text": "Best Answer: Amplitude: measures how high and how low the waves travel compared to a straight line. Frequency: measures how many times per second the wave peaks. Four basic EEG brain waves: Delta waves, Theta waves, Alpha waves, and Beta waves constitute the standard lineup of EEG brainwave activity."}, {"url": "http://regentsprep.org/Regents/math/algtrig/ATT7/graphvocab.htm", "passage_text": "Let's see what vocabulary is needed to discuss sinusoids and other trigonometric graphs. amplitude: The amplitude of a sinusoidal function is one-half of the positive difference between the maximum and minimum values of a function. Amplitude is the magnitude (height) of the oscillation (wave) of a sinusoidal function. Sometimes it is referred to as the peak from center of the graph. The maximum of y = sin x is 1. A sine wave, or sinusoid, is the graph of the sine function in trigonometry. In addition to mathematics, this function also occurs in other fields of study such as science and engineering. This wave pattern also occurs in nature as seen in ocean waves, sound waves and light waves."}, {"url": "http://www.diffen.com/difference/AM_vs_FM", "passage_text": "Modulating differences. In AM, a radio wave known as the carrier or carrier wave is modulated in amplitude by the signal that is to be transmitted. The frequency and phase remain the same. In FM, a radio wave known as the carrier or carrier wave is modulated in frequency by the signal that is to be transmitted."}, {"url": "https://answers.yahoo.com/question/index?qid=20070512163820AA1Uuaw", "passage_text": "For waves in general: amplitude measures the strength of the signal-how high the peaks and troughs are. *NOT* wavelength. frequency is how many times the wave cycles in a second. eg. for sound, a high pitch sound has a higher frequency. I dont know the terminology for brain waves, but the concepts are probably the same. Frequency: measures how many times per second the wave peaks. Four basic EEG brain waves: Delta waves, Theta waves, Alpha waves, and Beta waves constitute the standard lineup of EEG brainwave activity."}, {"url": "https://en.wikipedia.org/wiki/Phase_(waves)", "passage_text": "Formula Edit. The phase of an oscillation or wave refers to a sinusoidal function such as the following: where, , and are constant parameters called the amplitude, frequency, and phase of the sinusoid. These functions are periodic with period, and they are identical except for a displacement of along the axis. The term phase can refer to several different things : Phase in sinusoidal functions or in waves has two different, but closely related, meanings. One is the initial angle of a sinusoidal function at its origin and is sometimes called phase offset or phase difference."}, {"url": "https://en.wikipedia.org/wiki/Frequency_Modulation", "passage_text": "(Compare with amplitude modulation, in which the amplitude of the carrier wave varies, while the frequency remains constant.). In analog signal applications, the difference between the instantaneous and the base frequency of the carrier is directly proportional to the instantaneous value of the input-signal amplitude. "}, {"url": "http://www.differencebetween.com/difference-between-amplitude-and-vs-frequency/", "passage_text": "Posted on. by admin. Amplitude vs Frequency. Amplitude and frequency are two of the basic properties of periodic motions. A proper understanding in these concepts is required in the study of motions such as simple harmonic motions and damped harmonic motions. The frequency of a simple pendulum only depends on the length of the pendulum and the gravitational acceleration for small oscillations. Amplitude. Amplitude is also a very important property of a periodic motion. To understand the concept of amplitude, the properties of harmonic motions must be understood."}]