[{"url": "http://medical-dictionary.thefreedictionary.com/reticular+formation", "passage_text": "The reticular formation constantly monitors the state of the body through connections with the sensory and motor tracts. Certain nerve cells in the formation regulate the flow of hydrochloric acid in the stomach. Other cells regulate swallowing, tongue movements, and movements of the face, eyes, and tongue."}, {"url": "http://psychlopedia.wikispaces.com/reticular+formation", "passage_text": "Definition: A pencil-shaped structure forming the core of the brain stem. 1  The part of the brain that keeps you alert. 2  Helps you pay attention to new stimulation. 3  Connected to the thalamus. 4  The reticular formation is a group of nerve fibers located inside the brain stem.5  Part of the sympathetic nervous system. Helps you pay attention to new stimulation. 2  Connected to the thalamus. 3  The reticular formation is a group of nerve fibers located inside the brain stem. 4"}, {"url": "https://en.wikipedia.org/wiki/Reticular_formation", "passage_text": "The reticular formation (lat. formatio reticularis) is a set of interconnected nuclei that are located throughout the brainstem. The reticular formation is not anatomically well defined because it includes neurons located in diverse parts of the brain. The neurons of the reticular formation all play a crucial role in maintaining behavioral arousal and consciousness. The functions of the reticular formation are modulatory and premotor. The modulatory functions are primarily found in the rostral sector of the reticular formation and the premotor functions are localized in the neurons in more caudal regions."}, {"url": "http://psychlopedia.wikispaces.com/reticular+formation", "passage_text": "1 The part of the brain that keeps you alert. 2  Helps you pay attention to new stimulation. 3  Connected to the thalamus. 4  The reticular formation is a group of nerve fibers located inside the brain stem. Helps you pay attention to new stimulation. 2  Connected to the thalamus. 3  The reticular formation is a group of nerve fibers located inside the brain stem. 4  Part of the sympathetic nervous system."}, {"url": "http://psychlopedia.wikispaces.com/reticular+formation", "passage_text": "1 The reticular formation is a group of nerve fibers located inside the brain stem. 2  Part of the sympathetic nervous system. 3  Acts as an alarm system. 4  Detects potential threats and sets off automatic responses. Helps you pay attention to new stimulation. 2  Connected to the thalamus. 3  The reticular formation is a group of nerve fibers located inside the brain stem. 4"}, {"url": "http://www.thefreedictionary.com/reticular+formation", "passage_text": "RF. brain stem, brainstem, brain-stem-the part of the brain continuous with the spinal cord and comprising the medulla oblongata and pons and midbrain and parts of the hypothalamus. neural net, neural network-any network of neurons or nuclei that function together to perform some function in the body."}, {"url": "http://psychologydictionary.org/reticular-formation/", "passage_text": "Comprehensive network of connections containing nerve cell bodies and fibers in the brain stem. Originating in the medulla oblogata and extending into the midbrain, it is integrated into the spinal cord, cerebellum, thalamus, and cerebral cortex. Provides regulation of arousal, alertness, and sleep-wake cycles, as well as operating a portion of posture and movement. Also known as: brain stem reticular formation."}, {"url": "https://en.wikipedia.org/wiki/Reticular_formation", "passage_text": "1 Sleep and consciousness – The reticular formation has projections to the thalamus and cerebral cortex that allow it to exert some control over which sensory signals reach the cerebrum and come to our conscious attention. 2  It plays a central role in states of consciousness like alertness and sleep.he functions of the reticular formation are modulatory and premotor. The modulatory functions are primarily found in the rostral sector of the reticular formation and the premotor functions are localized in the neurons in more caudal regions."}, {"url": "http://medical-dictionary.thefreedictionary.com/reticular+activating+system", "passage_text": "reticular activating system. n. Abbr. RAS. The part of the reticular formation in the brainstem that plays a central role in bodily and behavioral alertness; its ascending connections affect the function of the cerebral cortex and its descending connections affect bodily posture and reflex mechanisms."}, {"url": "http://www.thefreedictionary.com/reticular+formation", "passage_text": "Noun. 1. reticular formation-a complex neural network in the central core of the brainstem; monitors the state of the body and functions in such processes as arousal and sleep and attention and muscle tone. RF.F. brain stem, brainstem, brain-stem-the part of the brain continuous with the spinal cord and comprising the medulla oblongata and pons and midbrain and parts of the hypothalamus. neural net, neural network-any network of neurons or nuclei that function together to perform some function in the body."}]