[{"url": "http://money.usnews.com/careers/best-jobs/veterinarian/salary", "passage_text": "Average Veterinarian Pay vs. Other Best Jobs. With an average salary of $96,140 in 2013, veterinarians earned a healthy take-home pay for health care jobs. While they earned less than physicians ($188,440), they made about three times the pay of veterinary technologists ($31,760) in 2013. They made about the same average salary as physician assistants ($94,530)."}, {"url": "http://www1.salary.com/Veterinary-Assistant-salary.html", "passage_text": "The annual salary for someone with the job title Veterinary Assistant may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://money.usnews.com/careers/best-jobs/veterinarian/salary", "passage_text": "The BLS reports that veterinarians earned a median salary of $86,640 in 2013. The best-paid veterinarians earned $149,530, while the lowest-paid earned $53,270."}, {"url": "http://www.healthcaresalaryonline.com/veterinarian-salary.html", "passage_text": "Annually. On an annual basis the average Veterinarian salary is $86,640. The lowest 10% earn less than $53,270 per year while the upper 10% earn more than $149,530 per year. These salaries are calculated as a mean or average."}, {"url": "http://www1.salary.com/Veterinary-Assistant-salary.html", "passage_text": "For example the median expected annual pay for a typical Veterinary Assistant in the United States is $28,458 so 50% of the people who perform the job of Veterinary Assistant in the United States are expected to make less than $28,458. Source: HR Reported data as of October 2015. Medi"}, {"url": "http://money.usnews.com/careers/best-jobs/veterinarian/salary", "passage_text": "Salary Outlook. The BLS reports that veterinarians earned a median salary of $86,640 in 2013. The best-paid veterinarians earned $149,530, while the lowest-paid earned $53,270. Veterinarians working in scientific research tend to be among the highest paid."}]