[{"url": "http://www.behr.com/consumer/how-to/interior/how-to-paint-a-door", "passage_text": "Door. Step 1. Use a brush for painting in a small panel. You can use a brush over the entire surface to avoid the appearance of roller stipple. TIP: As with walls, work on the door from top to bottom. Step 2. Allow enough time for the paint to dry fully before putting doors and windows back into use. Otherwise, they will stick together."}, {"url": "http://www.doityourself.com/stry/choosing-the-best-type-of-paint-for-your-wood-trim", "passage_text": "If the wood trim you want to be painted is inside the house, a water-based paint will be the safest paint to use. Exterior paint, such as acrylic and enamel, is overkill for an interior painting job. The only time you want to use an exterior paint on interior wood trim is when you need a glossy and durable finish. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071017205958AAotZmP", "passage_text": "You can also try using the paint pads for your doors. They work pretty well too. If you don't use Lowe's American Tradition Eggshell, Satin or Semi-Gloss (all washable), then other decent paints are Kelly Moore and Dun Edwards (only available in a few western states). Best Answer: Before repainting over the patch, make sure it is smoothed out more to match the rest of the door. Lightly sand the door and trim before repainting. I would prime it as well which should help resolve the patch showing through. I've used most all of the better quality and well known paints"}, {"url": "http://www.thehouseofsmiths.com/2011/11/how-to-paint-molding-and-trim-work.html", "passage_text": "Especially for trim you want to make sure that your surface is free of all dust or sanding and putty residue. I love a glossy finish on my trim, so doing a once-over with a damp rag on my trim work BEFORE I start painting, is key! Tip #3: Use a Semi-gloss or High-gloss finish for your trim. I'm a Semi-gloss kinda girl, but I've used high gloss in the past. We love ultra white trim, so for us, we just pull a can of interior semi-gloss paint right off the shelf, have our paint department give it a good shake and go to town! How to paint molding and trim work in your home. More then anything, we probably get the MOST emails about our paint. Everything from what colors we use, to how we actually approach painting a space. So today I thought I'd share with you how to get the BEST results when painting detailed trim work."}, {"url": "http://www.diychatroom.com/f4/paint-use-painting-wood-trim-white-11045/", "passage_text": "You can use an oil primer and still use waterborne finish. Usually 1 coat of primer and 2 coats of the finish is the way to go. As far as brush size and style goes it will depend how much trim, what kind of trim, and how many doors, crown, ect.. For a diyer i would suggest a Purdy 3 XL glide, or a 2-1/2 XL Glide. My house is about 20 years old, with stained wood trim and interior doors. We want to paint it all white. I will be sanding, cleaning, and taping off the trim this week, with the hopes of painting a few rooms worth this weekend."}, {"url": "http://www.imageworkspainting.com/blog/bid/257129/Interior-House-Painting-How-To-Paint-Doors-Windows-Trim", "passage_text": "Windows. Prep-Just as you did with the doors, make sure the window sashes and trim have been properly prepared before applying any paint. Use a paintable wood filler to fill any dings, dents, or holes in the surface, then sand smooth. If the doors are bare wood then you should first apply an oil-based or latex-based primer made specifically for bare wood prior to painting. Be sure that the gap where any trim touches the walls is caulked with a high quality paintable caulking."}, {"url": "https://answers.yahoo.com/question/index?qid=20071017205958AAotZmP", "passage_text": "On the mantel put a good prime coat on and paint with semi gloss as well....apply with a good brush or trim it out then use one of the small foam rollers, checking frequently for runs and drips. Best Answer: Before repainting over the patch, make sure it is smoothed out more to match the rest of the door. Lightly sand the door and trim before repainting. I would prime it as well which should help resolve the patch showing through. I've used most all of the better quality and well known paint"}, {"url": "http://interiordec.about.com/od/interiorpainting/a/diy_paintfinish.htm", "passage_text": "Matte Finish. Whether called flat finish or wall paint, this type of interior paint has a matte surface. This paint finish is usually used on interior walls. It's expecially good if you have to camouflage small wall bumps, cracks, or other imperfections, as this finish does not reflect light. Satin Finish. Satin finish paint has a smooth, velvety look with a bit more gloss. It is most often used for windows, doors, trim, or ceilings, but can also be used as wall paint. This is particularly suitable for kids' room walls, kitchens, or bathrooms, or in areas which get a lot of traffic."}]