[{"url": "http://www.webtender.com/db/ingred/146", "passage_text": "Midori melon liqueur. Midori is a bright green, sweet Japanese honeydew melon flavored liqueur produced by Suntory. Midori was launched in the United States in 1978, at New York's famous Studio 54 Nightclub. Today, Midori can be found in more than 30 countries around the world, with Australia as the currently most successful market"}, {"url": "http://www.food.com/recipe/midori-sour-243093", "passage_text": "Cook. If you like sweet and sour combinations then you will love Midori Sours! The traditional way to prepare a Midori Sours is to shake it on ice and strain it into a rocks glass, but I like them on the rocks and with a good quality vodka. Whichever way you prefer... they are still good! "}, {"url": "http://articles.latimes.com/2013/jan/11/entertainment/la-et-cm-midori-20121230", "passage_text": "January 11, 2013 | By David Ng, Los Angeles Times. Midori is no stranger to the L.A. stage. On Friday, she’ll debut a… (Katie Falkenberg, Los Angeles…). Since she made her solo debut at age 11 in 1982, violinist Midori has grown up — and grown middle-aged — under the full glare of the media. "}, {"url": "https://en.wikipedia.org/wiki/Midori_(liqueur)", "passage_text": "A bottle of Midori. Midori is a sweet, bright-green-coloured, muskmelon-flavored liqueur made by Suntory. It is manufactured in Japan, USA, Mexico, and France, although it was made exclusively in Japan until 1987. Midori is usually 20–21% alcohol by volume. Its name is the Japanese word for green"}, {"url": "http://cocktails.about.com/od/liqueurscordials/p/midori_liqueur.htm", "passage_text": "Midori is the brand name for a specific liqueur that is distinct in two aspects: color and flavor. The color is a beautiful light green that is often used in cocktails for that exact characteristic. The Flavor of Midori: The flavor of Midori is also unique. It is that of a very sweet melon-although I would not peg it to a specific type of melon, but more of a mix. This distinct flavor profile is often used in cocktails to highlight other fruits"}, {"url": "http://mixthatdrink.com/what-does-midori-taste-like/", "passage_text": "Taste of Midori. Midori is a melon flavored liqueur; it originated in Japan (my bottle was made by Suntory, though). It is a very visually appealing liqueur, with a vivid green color. I think that’s honestly the major reason it is used in a lot of cocktails, because it makes for some beautiful drinks."}, {"url": "https://en.wikipedia.org/wiki/Midori_(liqueur)", "passage_text": "As it is extremely sweet, Midori is not usually taken straight; it is generally used in a mixed drink (i.e., a cocktail), such as a Japanese slipper. It is usually used in a range of long drinks – with lemonade, fresh lemon juice, lime juice, pineapple juice, or orange juice. Midori is a sweet, bright-green-coloured, muskmelon-flavored liqueur made by Suntory. It is manufactured in Japan, USA, Mexico, and France, although it was made exclusively in Japan until 1987."}, {"url": "http://cooking.stackexchange.com/questions/33579/balance-overly-sweet-liqueurs", "passage_text": "When dealing with particularly sweet liqueurs, in particular Midori (a very sweet melon flavored liqueur), I tend to find their sugary nature overpowering the rest of the drink. "}, {"url": "http://www.popsugar.com/food/Happy-Hour-Midori-Sour-255355", "passage_text": "Follow us on Pinterest. Midori is a green melon flavored liquor that is used as an ingredient to enhance cocktails. Alternatively, midori can shine on its own as it does in the classic Midori Sour. A sorority girl's easy to drink cocktail, the Midori Sour is a refreshing summer drink"}]