[{"url": "http://www.utsouthwestern.edu/newsroom/news-releases/year-2014/march/thibodeau-bendopnea.html", "passage_text": "DALLAS – March 18, 2014 – UT Southwestern Medical Center cardiologists have defined a novel heart failure symptom in advanced heart failure patients: shortness of breath while bending over, such as when putting on shoes. “Some patients thought they were short of breath because they were out of shape or overweight, but we wondered if there was something more to it. So we developed this study to further investigate this symptom,” said Dr. Jennifer Thibodeau, Assistant Professor of Internal Medicine in the Division of Cardiology."}, {"url": "http://www.hngn.com/articles/26859/20140319/shortness-breath-bending-over-maybe-heart-failure-symptom.htm", "passage_text": "Researchers looked at risk factors linked to silent stroke. (Photo: Flickr). Researchers have identified shortness of breath while bending over as a new potential heart failure symptom. UT Southwestern Medical Center cardiologists define this symptom as bendopnea. "}, {"url": "http://www.mountsinai.org/patient-care/service-areas/heart/areas-of-care/heart-failure-and-transplantation/types-of-heart-failure", "passage_text": "Signs & Symptoms of Acute Heart Failure (Sudden): 1  Severe shortness of breath, especially while walking or bending over to put on one's shoes. 2  Rapid heartbeat and palpitations, which may cause the heart to stop. 3  Sudden fluid retention. 4  Sudden weight gain and swelling. 5  Sudden and severe chest pain. Since the blood is coming to the left side from the lungs, this is where the blood can get pooled. Signs & Symptoms of Left Side Heart Failure: 1  Shortness of breath, especially while walking or bending over to put on one's shoes. 2  Fatigue. 3  Dizziness, lightheadedness."}, {"url": "http://www.huffingtonpost.com/2014/03/18/bendopnea-shortness-breath-bending-over-heart-failure_n_4988621.html", "passage_text": "For people with heart failure, experiencing shortness of breath when bending forward could be a sign that something is wrong, a new study suggests. One-third of these people had bendopnea, the researchers found. They cautioned that bendopnea is not a risk factor for heart failure, so the findings don't apply to people who do not have heart failure but experience shortness of breath when bending forward."}, {"url": "http://www.mountsinai.org/patient-care/service-areas/heart/areas-of-care/heart-failure-and-transplantation/types-of-heart-failure", "passage_text": "Since the blood is coming to the right side of the heart from the body this is where blood can pool. Signs & Symptoms of Right Side Heart Failure: 1  Swelling in the feet, ankles and legs. 2  Distended abdomen or bloating. 3  Fatigue. 4  Shortness of breath, especially while walking or bending over to put on one's shoes. Since the blood is coming to the left side from the lungs, this is where the blood can get pooled. Signs & Symptoms of Left Side Heart Failure: 1  Shortness of breath, especially while walking or bending over to put on one's shoes. 2  Fatigue. 3  Dizziness, lightheadedness."}, {"url": "http://www.mayoclinic.org/symptoms/shortness-of-breath/basics/causes/SYM-20050890", "passage_text": "Most cases of shortness of breath are due to heart or lung conditions. Your heart and lungs are involved in transporting oxygen to your tissues and removing carbon dioxide, and problems with either of these processes affect your breathing. 1  Asthma. 2  Carbon monoxide poisoning. 3  Cardiac tamponade. "}, {"url": "http://www.healthcentral.com/heart-disease/c/question/972707/157437", "passage_text": "When you're short of breath, it's hard or uncomfortable for you to take in the oxygen your body needs. You may feel as if you're not getting enough air. Sometimes mild breathing problems are from a stuffy nose or strenuous exercise. Many conditions can make you feel short of breath. Lung conditions such as asthma, emphysema, or pneumonia cause breathing difficulties. Heart disease can make you feel breathless if your heart cannot pump enough blood to supply oxygen to your body and stress caused by anxiety can make it hard for you to breathe."}, {"url": "https://www.healthtap.com/topics/shortness-of-breath-bending-over", "passage_text": "My husband is getting over something. 10. Get help from a doctor now ›. Shortness of breath: This usually implies something is not working properly in your lungs. It may be infection but also could represent wheezing. Have your doctor listen to your lungs and help you with a diagnosis. starting Saturday I've had this phlemy cough and shortness of breath"}]