[{"url": "http://www.news-medical.net/Clinical-and-Diagnostics/Hemoglobinometers", "passage_text": "Clinical & Diagnostics Hemoglobinometers Equipment. A hemoglobinometer is an instrument used to determine the hemoglobin content of the blood by spectrophotometric measurement. Portable hemoglobinometers provide easy and convenient measurement, which is particularly useful in areas where no clinical laboratories are available. "}, {"url": "https://en.wikipedia.org/wiki/Hematocrit", "passage_text": "Anemia refers to an abnormally low hematocrit, as opposed to polycythemia, which refers to an abnormally high hematocrit. For a condition such as anemia that goes unnoticed, one way it can be diagnosed is by measuring the hematocrit levels in the blood. Both are potentially life-threatening disorders. The hematocrit (Ht or HCT, British English spelling haematocrit), also known as packed cell volume (PCV) or erythrocyte volume fraction (EVF), is the volume percentage (%) of red blood cells in blood."}, {"url": "https://answers.yahoo.com/question/index?qid=20081211054115AADB8aD", "passage_text": "both are based on lysing red blood cells to release hemoglobin and then measuring the absorbance of the resulting solution photometrically. the resulting absorbance is proportional to the amount of hemoglobin present in the sample. Best Answer: Apparently some people don't know the difference between methemoglobin and hemoglobin. As far as I know, the primary instrument is a needle and then a red blood cell count. The amount of hemoglobin can be tested by measuring oxygen saturation using electromagnetic waves."}, {"url": "http://itcaonline.com/wp-content/uploads/2011/10/Unit-3-Hemoglobin-Testing.pdf", "passage_text": "HemoCue  Analyzer The equipment used by the ITCA WIC program to test the hemoglobin is called the HemoCue  201+ Photometer. The HemoCue  201+ measures the hemoglobin levels in the blood. Microcuvettes Microcuvettes (also called cuvettes) are the instruments used to collect the blood. "}, {"url": "http://www.medicinenet.com/hemoglobin/page2.htm", "passage_text": "Hemoglobin is usually measured as a part of the complete blood count (CBC) test from a blood sample. Several methods exist for measuring hemoglobin, most of which are done currently by automated machines designed to perform different tests on blood. Within the machine, the red blood cells are broken down to get the hemoglobin into a solution. The free hemoglobin is exposed to a chemical containing cyanide which binds tightly with the hemoglobin molecule to form cyanomethemoglobin."}, {"url": "http://www.mayoclinic.org/tests-procedures/hemoglobin-test/basics/definition/PRC-20015022", "passage_text": "Definition. A hemoglobin test measures the amount of hemoglobin in your blood. Hemoglobin is a protein in your red blood cells that carries oxygen to your body's organs and tissues and transports carbon dioxide from your organs and tissues back to your lungs. If a hemoglobin test reveals that your hemoglobin level is lower than normal, it means you have a low red blood cell count (anemia). Anemia can have many different causes, including vitamin deficiencies, bleeding and chronic diseases."}, {"url": "http://www.aetna.com/cpb/medical/data/800_899/0824.html", "passage_text": "Anemia is a condition in which the hemoglobin (Hb) concentration in the blood is below a defined level (men: 13.5 to 16.5 g/dL; women: 12 to 15 g/dL; children: 11 to 16 g/dL; and pregnant women: 11 to 12 g/dL), resulting in a reduced oxygen-carrying capacity of red blood cells. The above policy is based on the following references: Number: 0824. Aetna considers home hemoglobin testing devices experimental and investigational for the management of chronic anemia and all other indications because their effectiveness has not been established."}]