[{"url": "https://en.wikipedia.org/wiki/Beta-lactamase", "passage_text": "Through hydrolysis, the lactamase enzyme breaks the β-lactam ring open, deactivating the molecule's antibacterial properties. Beta-lactam antibiotics are typically used to treat a broad spectrum of Gram-positive and Gram-negative bacteria. TEM-1 is the most commonly encountered beta-lactamase in Gram-negative bacteria. Up to 90% of ampicillin resistance in E. coli is due to the production of TEM-1."}, {"url": "http://medical-dictionary.thefreedictionary.com/Beta+lactamase", "passage_text": "beta-lactamase. [-lak′təmāz]. Etymology: lactam, a cyclic amide, ase, enzyme. a bacterial enzyme that catalyzes the hydrolysis of the beta-lactam ring of some penicillins and cephalosporins, producing penicilloic acid and rendering the antibiotic ineffective. /β-lac·ta·mase/ (lak´tah-mās) any of a group of enzymes, produced by almost all gram-negative bacteria, that hydrolyze the β-lactam ring of penicillins and cephalosporins, destroying their antibiotic activity. Individual enzymes may be called penicillinases or cephalosporinases based on their specificities."}, {"url": "http://www.answers.com/Q/What_is_a_role_of_beta_lactamase_inhibitor", "passage_text": "If you add a beta lactamase inhibitor to a beta lactam antibiotic (i.e clavulanaic acid added to amoxicillin) it decreases the potential of the bacteria to inactivate the antibiotic. Confidence votes 87. Some bacteria produce beta lactamase enzyme, this enzyme will break the beta lactam ring structure of certain antibiotics (penicillin, cephalexin for example) rendering them ineffective against the infection."}, {"url": "http://www.niaid.nih.gov/labsandresources/resources/dmid/sg/pages/decstructure.aspx", "passage_text": "Structure of the Month: Beta-lactamase Enzyme Structures. Beta-lactamases are enzymes produced by some Gram-negative and Gram-positive bacteria and are responsible for resistance to a broad class of-beta-lactam antibiotics, including penicillin. There are several groups and classes of beta-lactamases that result in antibiotic resistance. For example, several class C beta-lactamases result in cephalosporin resistance and some class A beta-lactamases confer resistance to oxyimino-cephalosporins, cephamycins and carbapenems. Two different beta – lactamase structures have recently been determined by the Center for Structural Genomics of Infectious Diseases."}, {"url": "http://avidlaboratories.com/frames/whatsnew02.pdf", "passage_text": "ESBL is a type of B-lactamase that hydrolyzes (inactivates) most extended-spectrum B-lactams (but NOT cephamycins, carbapenems, or B-lactamase inhibitor combinations). Detection and reporting of bacteria that produce extended-spectrum beta-lactamases (ESBLs) present a continuing challenge for the clinical laboratory. B-Lactamase is an enzyme that destroys the B-Lactam ring portion of B-Lactam molecules. The following figure shows a simple B-Lactamase reaction depicting hydrolysis of penicillin to penicilloic acid. Penicilloic acid does not have any antibacterial activity. What is an extended-spectrum B-lactamase (ESBL)? An extended-spectrum B-lactamase is a type of B-lactamase that hydrolyzes (inactivates) most extended-spectrum B-lactams (but NOT cephamycins, carbapenems, or B-lactamase inhibitor combinations)"}, {"url": "https://en.wikipedia.org/wiki/Beta-lactamase", "passage_text": "Beta-lactamase provides antibiotic resistance by breaking the antibiotics ' structure. These antibiotics all have a common element in their molecular structure: a four-atom ring known as a β-lactam. TEM-1 is the most commonly encountered beta-lactamase in Gram-negative bacteria. Up to 90% of ampicillin resistance in E. coli is due to the production of TEM-1."}, {"url": "https://en.wikipedia.org/wiki/Beta-lactamase", "passage_text": "Beta-lactamases are enzymes (EC 3.5.2.6) produced by some bacteria that provide resistance to β-lactam antibiotics like penicillins, cephamycins, and carbapenems (ertapenem), although carbapenems are relatively resistant to beta-lactamase. TEM-1 is the most commonly encountered beta-lactamase in Gram-negative bacteria. Up to 90% of ampicillin resistance in E. coli is due to the production of TEM-1."}, {"url": "https://en.wikipedia.org/wiki/Beta-lactamase_inhibitor", "passage_text": "Avibactam. A β-lactamase inhibitor (or beta-lactamase inhibitor) is a molecule used in conjunction with a β-Lactam antibiotic to extend its spectrum of activity. "}]