[{"url": "http://weddings.costhelper.com/wedding-reception-venue.html", "passage_text": "Shopping for a wedding reception venue: 1  Tip: Couples can save $200 to $2,000 or more by finding a location for both the ceremony and the reception. 2  But, if chairs must be moved from the wedding area to reception area, you might be charged up to $3 per chair for the service."}, {"url": "http://weddings.costhelper.com/wedding-reception-venue.html", "passage_text": "1 A reception in a private room in a casual or ethnic restaurant, such as barbecue or Chinese, or a bar might cost as little as $50 to $250 for a room rental fee, plus a per-person cost for food and beverage that can be as little as $15 to $20. 2  Other similarly priced venues include rooms at city, county or state parks."}, {"url": "http://weddings.costhelper.com/wedding-caterer.html", "passage_text": "1 The average wedding caterer cost, including food and food service, drinks and drink service and cake and cake cutting fees is $12,790, according to The Bridal Association of America, which treats these as three separate categories. 2  The average number of guests is 150, so it works out to about $85 per person."}, {"url": "http://weddings.costhelper.com/wedding-reception-venue.html", "passage_text": "1 Tip: Couples can save $200 to $2,000 or more by finding a location for both the ceremony and the reception. 2  But, if chairs must be moved from the wedding area to reception area, you might be charged up to $3 per chair for the service. 3  Some facilities require that a licensed bartender serve any alcoholic drinks."}, {"url": "http://www.answers.com/Q/How_much_does_an_average_wedding_cost_per_person", "passage_text": "I'm not sure what you mean by how much a wedding costs per person, but in total a wedding usually cost from about 20,000 to 30,000. Though it really depends on your budget, and how much you want to spend for certain things. Here is a list for how most aspects of the wedding usually cost."}, {"url": "http://www.answers.com/Q/How_much_does_an_average_wedding_cost_per_person", "passage_text": "Confidence votes 6. I'm not sure what you mean by how much a wedding costs per person, but in total a wedding usually cost from about 20,000 to 30,000. Though it really depends on your budget, and how much you want to spend for certain things. Here is a list for how most aspects of the wedding usually cost."}, {"url": "http://www.valuepenguin.com/average-cost-of-wedding", "passage_text": "1 Expect to spend an average of $4,200 for a wedding of 140 ($30 per plate). 2  Of course, if you're having a fancier wedding be prepared to spend much more than that...anywhere up to $100 per plate depending on how decadent your reception is."}]