[{"url": "http://www.livescience.com/22486-circulatory-system.html", "passage_text": "The systemic circulation is the portion of the circulatory system is the network of veins, arteries and blood vessels that transports blood from heart, services the body's cells and then re-enters the heart, the Mayo Clinic noted. The pulmonary circulatory system sends oxygen-depleted blood away from the heart through the pulmonary artery to the lungs and returns oxygenated blood to the heart through the pulmonary veins, according to the Mayo Clinic."}, {"url": "http://www.webmd.com/heart/cardiovascular-system", "passage_text": "Cardiovascular System. The cardiovascular system consists of the heart and blood vessels (arteries, veins, and capillaries). It delivers oxygen and nutrients to the tissues and carries waste products to the organs responsible for elimination. "}, {"url": "https://www.sharecare.com/health/circulatory-system-health/what-does-cardiovascular-system-do", "passage_text": "Follow Following Unfollow Pending Disabled. A SecondsCount.org answered. The cardiovascular system is made up of the heart that pumps blood, the lungs that oxygenate blood, the arteries that carry oxygenated blood to all organs and tissues, and the veins that return blood to the heart. "}, {"url": "http://www.innerbody.com/image/cardov.html", "passage_text": "The cardiovascular system of the head and neck includes the vital arteries that provide oxygenated blood to the brain and organs of the head, including the mouth and eyes. It also includes the veins that return deoxygenated blood from these organs to the heart. The heart is a pumping system which takes in deoxygenated blood through the veins and delivers it to the lungs for oxygenation before pumping it into the various arteries (which provide oxygen and nutrients to body tissues by transporting the blood throughout the body)."}, {"url": "http://www.answers.com/Q/What_does_the_cardiovascular_system_do", "passage_text": "The cardiovascular system contains the heart and many blood vessels throughout the body. It works with the bodies circulatory system and is responsible for distributing blood and nutrients throughout the body to maintain homeostasis. Pumps blood around the body, to supply the tissues with oxygen and nutrients and to transport waste products away from these tissues. The cardiovascular system is one of the major body systems that makes sure that the muscles and bones are supplied with the proper amount of oxygen and blood.Cardiovascular sy … stem is one of the anatomic apparati (singular apparatus) in which the body is functionally divided."}, {"url": "http://www.livescience.com/22486-circulatory-system.html", "passage_text": "The circulatory system is a vast network of organs and vessels that is responsible for the flow of blood, nutrients, hormones, oxygen and other gases to and from cells. The pulmonary circulatory system sends oxygen-depleted blood away from the heart through the pulmonary artery to the lungs and returns oxygenated blood to the heart through the pulmonary veins, according to the Mayo Clinic."}, {"url": "http://www.livescience.com/22486-circulatory-system.html", "passage_text": "In addition to blood, the circulatory system moves lymph, which is a clear fluid that helps rid the body of unwanted material. The heart, blood, and blood vessels make up the cardiovascular component of the circulatory system. It includes the pulmonary circulation, a loop through the lungs where blood is oxygenated. The pulmonary circulatory system sends oxygen-depleted blood away from the heart through the pulmonary artery to the lungs and returns oxygenated blood to the heart through the pulmonary veins, according to the Mayo Clinic."}, {"url": "https://en.wikipedia.org/wiki/Circulatory_system", "passage_text": "The essential components of the human cardiovascular system are the heart, blood and blood vessels. It includes the pulmonary circulation, a loop through the lungs where blood is oxygenated; and the systemic circulation, a loop through the rest of the body to provide oxygenated blood. The circulatory system is often seen to comprise both the cardiovascular system, which distributes blood, and the lymphatic system, which circulates lymph. These are two separate systems. The passage of lymph for example takes a lot longer than that of"}, {"url": "https://en.wikipedia.org/wiki/Circulatory_system", "passage_text": "The circulatory system of the lungs is the portion of the cardiovascular system in which oxygen-depleted blood is pumped away from the heart, via the pulmonary artery, to the lungs and returned, oxygenated, to the heart via the pulmonary vein. The circulatory system is often seen to comprise both the cardiovascular system, which distributes blood, and the lymphatic system, which circulates lymph. These are two separate systems. The passage of lymph for example takes a lot longer than that of blood"}]