[{"url": "http://www.answers.com/Q/What_is_the_normal_pulse_rate_healthy_adult_male", "passage_text": "The normal pulse rate for adult males is between 60 and 100 beats per minute. The normal pulse rate for an adult is 60 to"}, {"url": "https://answers.yahoo.com/question/index?qid=20070615111120AAQNYZN", "passage_text": "Infants have the fastest heart rate (120-160 bpm) and it slows as they age. A young adult male in average health will have a resting pulse of 60-100 bpm and a female will have a slightly higher rate (on average.) 93 perfectly normal if you are an adult. Source(s): I'm a university Anatomy and Physiology instructor. Bio Instructor · 8 years ago."}, {"url": "http://www.livestrong.com/article/152337-what-is-a-normal-heart-rate-for-men/", "passage_text": "An athletic male between the ages of 18 and 25 will often have a resting heart rate of 49 to 55 beats per minute. A person in this age group of below-average health might have a resting heart rate between 74 and 81 beats per minute, according to Top End Sports. An athletic male between the ages of 36 and 45 often has a resting heart rate of 50 to 56 beats per minute, while someone of the same age with below-average health can experience a rate of 76 to 82."}, {"url": "https://answers.yahoo.com/question/index?qid=20090418005034AAaVB9b", "passage_text": "· just now. Asker's rating. Report Abuse. The normal resting heart rate for an adult is between 60 and 100 beats per minute (bpm). that can vary with the person's level of cardiovascular fitness-for example, an olympic athlete may have a resting heart rate of 45-50 bpm and be perfectly healthy. The expected resting heart rate (when not exercising) for a healthy child is between 80 and 90 beats per minute, for a healthy adult female approximately 75 beats per minute, and for a healthy adult male an approximate figure of 70 beats per minute. THE GENIUS · 6 years ago."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/vital_signs_body_temperature_pulse_rate_respiration_rate_blood_pressure_85,P00866/", "passage_text": "Strength of the pulse. The normal pulse for healthy adults ranges from 60 to 100 beats per minute. The pulse rate may fluctuate and increase with exercise, illness, injury, and emotions. Females ages 12 and older, in general, tend to have faster heart rates than do males. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/fitness/expert-answers/heart-rate/faq-20057979", "passage_text": "A normal resting heart rate for adults ranges from 60 to 100 beats a minute. Generally, a lower heart rate at rest implies more efficient heart function and better cardiovascular fitness. For example, a well-trained athlete might have a normal resting heart rate closer to 40 beats a minute. "}, {"url": "http://www.medindia.net/patients/calculators/pulse_chart.asp", "passage_text": "1 Normal values for pulse rate depend on age and fitness level. 2  A normal adult has a pulse rate of 72 per minute and an athlete s pulse rate maybe below 50 per minute. 3  Patients with an average resting pulse rate above 70 beats per minute can have a slightly higher incidence of heart attacks. "}, {"url": "http://www.livescience.com/42081-normal-heart-rate.html", "passage_text": "For adults 18 and older, a normal resting heart rate is between 60 and 100 beats per minute (bpm), depending on the person’s physical condition and age. For children ages 6 to 15, the normal resting heart rate is between 70 and 100 bpm, according to the AHA. "}, {"url": "http://www.nhs.uk/chq/Pages/2024.aspx?CategoryID=52", "passage_text": "Most adults have a resting heart rate of 60-100 beats per minute (bpm). The fitter you are, the lower your resting heart rate is likely to be. For example, athletes may have a resting heart rate of 40-60 bpm or lower. You should contact your GP if you think your heart rate is continuously above 120 bpm or below 40 bpm, although this could just be normal for you."}]