[{"url": "http://www.everydayhealth.com/drugs/adderall", "passage_text": "A child older than 5 who is taking Adderall for ADHD would typically start with a dose of 5 milligrams (mg) and increase it gradually to 30 mg. A typical dose for an adult with narcolepsy may start at 5 mg and increase to 60 mg. You can take Adderall and Adderall XR with or without food. People usually take Adderall tablets every four to six hours during the day. People take Adderall XR capsules once a day, in the morning. Adderall is usually taken in the morning. Doses of Adderall late in the day can result in insomnia or trouble sleeping. Adderall can be taken with our without food. Common side effects with Adderall include a headache, dizziness, sleep problems, dry mouth, diarrhea, constipation and weight loss."}, {"url": "http://www.wikihow.com/Get-an-Adderall-Prescription", "passage_text": "Three Parts: Be Honest With Yourself Talk to a Doctor Proper Use. Adderall is a prescription medication that is used to treat ADHD (attention deficit hyperactivity disorder) in children and adults. The drug is a central nervous system stimulant that is believed to improve attentiveness, organization, and performance in people who have chronic trouble staying focused. Keep it to yourself. Adderall and Ritalin are among the most commonly abused prescription drugs, especially among students. Remember that you were prescribed this medicine for a reason, and that giving it or selling it to others is unethical and may put their health at serious risk."}, {"url": "http://www.nrxhealth.com/adderall/", "passage_text": "Adderall (also referred to as obetrol, adderal, adderol, adderral) is a prescription drug that is prescribed by your doctor to cure Attention Deficit Disorder (ADD) and Attention deficit hyperactivity disorder (ADHD) symptoms. Adderall alternatives without a prescription and without the negative side effects! Before suspecting, whether a child is suffering from ADD / ADHD or not, a careful examination must be done by a qualified doctor. Only a doctor can determine other possible conditions and reasons for such behavior."}, {"url": "http://www.additudemag.com/adhd-web/article/11070.html", "passage_text": "Adderall is a brand-name prescription stimulant medication used to treat inattention, hyperactivity, impulsivity, and other symptoms of attention deficit/hyperactivity disorder (ADHD), including lack of focus, disorganization, forgetfulness, fidgeting, excessive talking, or frequent interrupting. Since the FDA has not studied the use of Adderall IR in children younger than three years of age, or of Adderall XR in children younger than six years of age, the FDA does not approve the use of Adderall XR in these younger age groups."}, {"url": "http://www.additudemag.com/adhd-web/article/5000.html", "passage_text": "Adderall has been approved for use in patients age 3 years and older. People with even mild cases of hypertension should avoid Adderall use. Amphetamines can cause mania in people with bipolar disorder. People with a history of drug abuse need to use extreme caution when taking this medication. Adderall is a mixture of four different amphetamine salts-Dextroamphetamine Saccharate, Amphetamine Aspartate, Dextroamphetamine Sulfate, and Amphetamine Sulfate-that is used to treat Attention Deficit Hyperactivity Disorder (ADHD). Treating ADHD with Adderall was approved by the FDA in 1996."}, {"url": "http://www.rxlist.com/adderall-drug/indications-dosage.htm", "passage_text": "Attention Deficit Hyperactivity Disorder. Not recommended for children under 3 years of age. In children from 3 to 5 years of age, start with 2.5 mg daily; daily dosage may be raised in increments of 2.5 mg at weekly intervals until optimal response is obtained. Narcolepsy. Usual dose 5 mg to 60 mg per day in divided doses, depending on the individual patient response. Narcolepsy seldom occurs in children under 12 years of age; however, when it does, dextroamphetamine sulfate may be used. The suggested initial dose for patients aged 6 to 12 is 5 mg daily; daily dose may be raised in increments of "}, {"url": "http://www.additudemag.com/adhd-web/article/11070.html", "passage_text": "Most people are very sensitive to the dose of Adderall IR and Adderall XR. A patient can discern a 2 or 3 mg. difference in the dose. The immediate-release version comes in increments of 2.5 mg. in a range from 5 mg. to 30 mg. tablets. The extended-release formulation comes in 5 mg. Since the FDA has not studied the use of Adderall IR in children younger than three years of age, or of Adderall XR in children younger than six years of age, the FDA does not approve the use of Adderall XR in these younger age groups."}, {"url": "http://www.everydayhealth.com/drugs/adderall", "passage_text": "A: Adderall (amphetamine/dextroamphetamine) is a medication that is used to treat ADD/ADHD or narcolepsy. It is in the class of medications that are considered stimulants and although it goes against the way you would think a stimulant would work, it calms down the patient with ADD/ADHD. Adderall is usually taken in the morning. Doses of Adderall late in the day can result in insomnia or trouble sleeping. Adderall can be taken with our without food. Common side effects with Adderall include a headache, dizziness, sleep problems, dry mouth, diarrhea, constipation and weight loss."}]