[{"url": "http://www.salarylist.com/jobs/Dancer-Salary.htm", "passage_text": "Dancer Salary. Dancer average salary is $30,683, median salary is $28,952 with a salary range from $20,030 to $54,340. Dancer salaries are collected from government agencies and companies. Each salary is associated with a real job position. Dancer salary statistics is not exclusive and is for reference only. "}, {"url": "http://www1.salary.com/Choreographer-salary.html", "passage_text": "For example the median expected annual pay for a typical Choreographer in the United States is $35,798, so 50% of the people who perform the job of Choreographer in the United States are expected to make less than $35,798. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. The annual salary for someone with the job title Choreographer may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.payscale.com/research/US/Job=Dancer/Salary", "passage_text": "X Total Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job. It does not include equity (stock) compensation, cash value of retirement benefits, or the value of other non-cash benefits (e.g. healthcare). Total Pay (?X"}, {"url": "http://work.chron.com/salaries-ballet-dancers-5128.html", "passage_text": "The Houston Ballet has 53 dancers whose average weekly salary is $1,036 for 44 weeks. Pay for dancers in the Pennsylvania Ballet averages $883 for 34 weeks. SalaryList.com indicates the pay range for the Joffrey Ballet is $33,280 to $42,500, as of 2012, with an average salary of $35,585. SalaryExpert.com reports ballet dancers in Colorado earn more than $40,000, followed by Arizona at slightly less. According to the 2008 contract for the New York-based Joffrey Ballet, the company's 42 dancers made an average of $829 a week for the 38-week season, The New York Times reported in 2011. The Times also reported that the Boston Ballet has 42 dancers who are paid an average salary of $1,204 a week for 38 weeks."}, {"url": "http://www.payscale.com/research/US/Job=Dancer/Salary", "passage_text": "Dancer Salary. (United States). The average pay for a Dancer is $30,395 per year. Most people move on to other jobs if they have more than 20 years' experience in this field. Total Pay (?XTotal Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job."}, {"url": "http://smallbusiness.chron.com/salary-dancers-choreographers-34407.html", "passage_text": "Their highest wages, however, are with junior colleges, which pay $36.20 per hour, or $75,300 per year, on average, and elementary and secondary schools at $26.61 per hour, or $55,350 per year. Independent choreographers make the third-highest average salaries of $24.28 per hour, or $50,500 per year. Almost half of all dancers work for performing arts companies, which have the third-highest wages for dancers of $19.89 per hour. The next biggest employers were the amusement and recreation industries, with mean wages of $10.93 per hour, and drinking establishments, with pay at $10.56 per hour."}, {"url": "http://www.ehow.com/about_7425045_average-salary-professional-dancer.html", "passage_text": "Experience. The PayScale website lists the annual salary of dancers according to the years of experience. In October 2010, dancers with one to four years experience earned $17,687 to $32,556. Dancers with five to nine years of experience earned $35,375 to $71,216. "}, {"url": "http://smallbusiness.chron.com/salary-dancers-choreographers-34407.html", "passage_text": "The highest salaries for dancers are in colleges, universities and professional schools, with hourly pay of $23.36 per hour. Ranking second for wages is travel arrangement and reservation services, with average pay of $21.79 per hour. Related Reading: How to Calculate Bi-Weekly Salary to Hourly. Almost half of all dancers work for performing arts companies, which have the third-highest wages for dancers of $19.89 per hour. The next biggest employers were the amusement and recreation industries, with mean wages of $10.93 per hour, and drinking establishments, with pay at $10.5"}]