[{"url": "http://naturallysavvy.com/eat/the-real-cost-of-fast-food", "passage_text": "(0) Comment |. A fast-food meal may sound like a good deal, especially when you don’t have time to prepare breakfast or lunch. A comparison of cost vs. nutritional value, however, paints a very different picture. The average cost of a combo meal at a fast food restaurant is $4 to $7. Preparing a comparable meal at home costs about the same, but the real savings are in the calories, fat, and sodium. "}, {"url": "http://fastfoodmarketing.org/fast_food_facts_in_brief.aspx", "passage_text": "On average, US preschoolers saw 2.8 fast food ads per day, children saw 3.2 ads per day, and teens saw 4.8 ads per day. The total number of TV fast food ads seen by children ages 6 to 11 decreased by 10% between 2009 and 2012, but there was no change in the number of ads seen by children ages 2 to 5. On average, U.S. preschoolers viewed 2.8 fast food ads on TV every day in 2012, children (6-11 years) viewed 3.2 ads per day, and teens viewed"}, {"url": "http://healthyeating.sfgate.com/price-difference-between-healthy-food-fast-food-11002.html", "passage_text": "Twice the Price. The study published by STFM found that the average total cost for the healthy-food-diet model was $5,019 per year. The average cost of the convenient-food-diet model was more than twice that of the healthy-food-model, at $10,298 per year. The average daily cost of the healthy diet was $7.48, while the fast food diet averaged $15.30 per day. In contrast, by purchasing all whole ingredients from grocery stores, the estimated cost for three meals per day, per person came out to $43 per week. The experiment concluded that by preparing all three meals from home, the average person could save approximately $45 per week, when compared to eating out."}, {"url": "http://www.usatoday.com/story/news/nation/2013/05/01/grocery-costs-for-family/2104165/", "passage_text": "The USDA uses national food intake data and grocery price information to calculate different costs for a healthy diet at home. The latest numbers for a four-member family: a thrifty food plan, $146 a week; a low-cost food plan, $191 a week; a moderate-cost plan, $239; a liberal plan, $289 a week. The cost of feeding a family of four a healthy diet can run $146 to $289 a week, according to the latest numbers from the U.S. Department of Agriculture. That's based on preparing all the meals and snacks at home for a couple with two school-aged children."}, {"url": "http://www.thesimpledollar.com/dont-eat-out-as-often-188365/", "passage_text": "At an average cost of $12.75 per meal, you’d save yourself $8.75 for each of those meals. In other words, the average American would save $36.75 per person per week by moving all of their meals from restaurants to home-prepared meals. Let’s look at a more realistic picture. A couple summers ago, I did a food series where I prepared a wide variety of meals for my family at under $10 per meal. Those meals fed four (at the time) of us quite well and often left food for the following day’s lunch for some of us. Thus, the cost for these meals was well under $2 per person per meal."}, {"url": "http://www.trueactivist.com/this-sheet-shows-exactly-how-much-mcdonalds-menu-costs/", "passage_text": "True Activist. McDonalds is one of the largest fast food franchises in the world, the average distance from any one point (in the US) being about 115 miles away. While the price tag on any menu option or meal is relatively cheap, its food has lately become recognized as less-than-optimal for many reasons. "}, {"url": "http://www.answers.com/Q/How_much_money_does_the_average_fast_food_meal_cost", "passage_text": "1 person found this useful. The average fast food manager makes about 30-35,000$ annually. According to PayScale.com, the salary for fast food restaurant  managers in the United States ranged from $32,9 … 04 to $44,370 in  September, 2010. 3 people found this useful. how much money we spent in fast food like eating stuff fast and such   According to Fast Food Nation, Americans spend $110 billion a year on fast food. One-quarter of the v … egetables consumed in this country fall under one category: french fries. Our supersized diet is resulting in supersized waistlines"}, {"url": "http://www.answers.com/Q/What_is_the_average_price_of_a_restaurant_meal_in_the_United_States", "passage_text": "The general range of individual meals runs from $5.00 per person (e.g. a sandwich and a side for lunch) to $25.00 per person (e.g. a steak dinner.) The cost of a meal varies depending on many circumstances, such as: - Breakfast and lunch meals are usually cheaper than dinner meals. The average price of eating at a restaurant is usually about $55.   From,   Kendall Sellinger, age 11   It depends on 2 things, what state you live in, and the qualit … y of the restaurant."}, {"url": "https://www.expatistan.com/price/big-mac/tokyo", "passage_text": "The price of Combo meal in fast food restaurant (Big Mac Meal or similar) in Tokyo is ¥681. Change the currency to. € (EUR) , $ (USD) , £ (GBP) , AU$ (AUD) , or. This average is based on 13 price points. "}]