[{"url": "http://www.oxforddictionaries.com/definition/english/mnemonic", "passage_text": "Example sentences. 1  Her poems often have a hip-hop feel, emphasizing repetition and the mnemonic power of the spoken word. 2  The mnemonic power of poetry-the rhythmic organization of words as an aid to memory-however, is central, if not indispensable, to the transmission of a tradition in an oral society. 1 Her poems often have a hip-hop feel, emphasizing repetition and the mnemonic power of the spoken word."}, {"url": "http://www.oxforddictionaries.com/definition/english/mnemonic", "passage_text": "1 The mnemonic power of poetry-the rhythmic organization of words as an aid to memory-however, is central, if not indispensable, to the transmission of a tradition in an oral society. 1 Her poems often have a hip-hop feel, emphasizing repetition and the mnemonic power of the spoken word. 2 "}, {"url": "http://etymonline.com/", "passage_text": "This is a map of the wheel-ruts of modern English. Etymologies are not definitions; they're explanations of what our words meant and how they sounded 600 or 2,000 years ago. The dates beside a word indicate the earliest year for which there is a surviving written record of that word (in English, unless otherwise indicated). "}, {"url": "http://www.merriam-webster.com/dictionary/mnemonic", "passage_text": "Definition of MNEMONIC. 1. : assisting or intended to assist memory; also: of or relating to mnemonics. 2. : of or relating to memory. — mne·mon·i·cal·ly \\-ni-k(ə-)lē\\ adverb. See mnemonic defined for kids"}, {"url": "https://www.wyzant.com/resources/lessons/english/etymology", "passage_text": "Etymology. Most vocabulary words are derived from Latin or Greek etymologies. Here you will find access to phobias (fears, terrors, dreads), manias, and many other words listed in thematic units of English vocabulary words. 1 If you are preparing for an examination in which questions about English vocabulary words are a significant part of your score, you will find that learning the etymologies of words is a much better way to learn most of the English words you will encounter."}, {"url": "https://en.wikipedia.org/wiki/Mnemonic", "passage_text": "The word mnemonic is derived from the Ancient Greek word μνημονικός (mnēmonikos), meaning of memory, or relating to memory and is related to Mnemosyne (remembrance), the name of the goddess of memory in Greek mythology. Both of these words are derived from μνήμη (mnēmē), remembrance, memory. Mnemonics in antiquity were most often considered in the context of what is today known as the art of memory. Ancient Greeks and Romans distinguished between two types of memory: the natural memory and the artificial memory. A mnemonic (. : /nəˈmɒnɨk/ , : /nɛˈmɑːnɪk/ the first m is silent), mnemonic device, or memory device is any learning technique that aids information retention in the human memory. Mnemonics aim to translate information into a form that the brain can retain better than its original form"}, {"url": "https://en.wikipedia.org/wiki/Etymology_of_chemistry", "passage_text": "Arabic al-kīmiyaʼ or al-khīmiyaʼ (الكيمياء or الخيمياء), according to some, is thought to derive from the late Greek word khymeia (χυμεία) meaning the art of alloying metals, alchemy; in the manuscripts, this word is also written khēmeia (χημεία) or kheimeia (χειμεία), which is the probable basis of the Arabic form. From Wikipedia, the free encyclopedia. In the history of science, the etymology of the word chemistry is debatable. It is agreed that the word derives from the word alchemy, which is a European one, derived from the Arabic al-kīmīā (الكيمياء). The Arabic term is derived from the Greek χημία or χημεία. However, the ultimate origin of the root word, chem, is uncertain"}]