[{"url": "http://www.japan-guide.com/e/e2038.html", "passage_text": "Sushi. Sushi is the most famous Japanese dish outside of Japan, and one of the most popular dishes among the Japanese themselves. In Japan, sushi is usually enjoyed on special occasions, such as a celebration. During the Edo period, sushi refered to pickled fish preserved in vinegar. There are many different types of sushi. Some popular ones are: Nigiri Small rice balls with fish, shellfish, etc. on top. There are countless varieties of nigirizushi, some of the most common ones being tuna, shrimp, eel, squid, octopus and fried egg."}, {"url": "http://www.foodbycountry.com/Germany-to-Japan/Japan.html", "passage_text": "Many Japanese have turned to Western-style food for breakfast and lunch, especially in the cities. However, traditional dinners are still eaten by most people in Japan, such as rice, soup, pickles, and fish. Seasonal fresh fruit makes a great dessert. Soy sauce and other soybean products are also staples in Japan. These include miso (fermented soybean paste) and tofu (a soybean curd that resembles custard). Other common ingredients in Japanese food include bamboo shoots, daikon (a giant white radish), ginger, seaweed, and sesame seed products."}, {"url": "http://www.answers.com/Q/Why_is_fish_such_a_popular_source_of_food_in_Japan", "passage_text": "The most popular food in japan is teriaki and sushi. Contrary to the popular belief, Rice is not the main food in Japan. Japanese meals are based on fish, which is eaten at al … most half a pound a day per person. Usually there are two fish courses at every meal, one of cold fish and one of hot. 1 Cichlids are some of the most popular fish in the aquarium world. 2  They are soug…. 3  Websites With Recipes for Japanese Cuisine Japanese cuisine is fresh and light with an emphasis on rice, soy products and seasonal produce. 4  Fish and seafood are featured in many dishes"}, {"url": "http://www.foodbycountry.com/Germany-to-Japan/Japan.html", "passage_text": "Two uniquely Japanese foods are sushi (fresh raw seafood with rice) and sashimi (fresh raw seafood with soy sauce); both rely on freshly caught fish or seafood. Dishes prepared in a single pot (nabemeno) are popular throughout Japan. Soy sauce and other soybean products are also staples in Japan. These include miso (fermented soybean paste) and tofu (a soybean curd that resembles custard). Other common ingredients in Japanese food include bamboo shoots, daikon (a giant white radish), ginger, seaweed, and sesame seed products."}, {"url": "https://en.wikipedia.org/wiki/Fish_as_food", "passage_text": "Fish is consumed as a food by many species, including humans. It has been an important source of protein and other nutrients for humans throughout recorded history. In culinary and fishery contexts, the term fish can also include shellfish, such as molluscs, crustaceans and echinoderms."}, {"url": "http://www.answers.com/Q/Why_is_fish_such_a_popular_food_in_japan", "passage_text": "The most popular food in japan is teriaki and sushi. Contrary to the popular belief, Rice is not the main food in Japan. Japanese meals are based on fish, which is eaten at al … most half a pound a day per person. Usually there are two fish courses at every meal, one of cold fish and one of hot. When beef and chicken are included in the meal they are served in small portions."}, {"url": "http://www.japan-guide.com/e/e2035.html", "passage_text": "Sushi (more details) Sushi may refer to any dish that contains sushi rice, cooked white rice flavored with seasoned rice vinegar. There are various kinds of sushi dishes, such as nigirizushi (hand formed sushi), makizushi (rolled sushi), and chirashi (sushi rice topped with raw fish). Sushi is the most famous Japanese dish outside of Japan, and one of the most popular dishes among the Japanese themselves. "}, {"url": "http://www.japan-guide.com/e/e2038.html", "passage_text": "Sushi is the most famous Japanese dish outside of Japan, and one of the most popular dishes among the Japanese themselves. In Japan, sushi is usually enjoyed on special occasions, such as a celebration. There are many different types of sushi. Some popular ones are: Nigiri Small rice balls with fish, shellfish, etc. on top. There are countless varieties of nigirizushi, some of the most common ones being tuna, shrimp, eel, squid, octopus and fried egg."}]