[{"url": "http://thehousingforum.com/how-to-bake-chicken-pieces/", "passage_text": "• Place the meat into the pan and if the skin has been removed from the breast, coat it with a thin layer of oil. • Sprinkle on seasonings such as rosemary, garlic or salt and pepper. • Place the chicken into the preheated oven and cook for thirty minutes. • Check the temperature with the thermometer, and when it reaches 170 degrees F, remove the chicken from the oven and allow it to rest for at least five minutes before cutting. This will allow the juices to redistribute throughout the portion. "}, {"url": "http://www.bhg.com/recipes/how-to/handling-meat/how-long-to-cook-chicken/", "passage_text": "How Long to Cook Chicken Pieces. Use these cooking guides for chicken breast halves, drumsticks, and thighs with bone. 1  2-1/2 to 3 pounds total: 375 degrees F for 45 to 55 minutes. "}, {"url": "http://www.bhg.com/recipes/how-to/handling-meat/bake-chicken/", "passage_text": "Step 2: Bake the chicken pieces. Preheat the oven to 400 degrees F. Bake the chicken pieces, uncovered, for 25 to 30 minutes or until no longer pink (internal temperature should be 170 degrees F for chicken breasts, 180 degrees F for thighs and drumsticks). To store: Let the baked chicken stand for 30 minutes to cool. "}, {"url": "http://www.thekitchn.com/how-to-cook-chicken-the-easiest-simplest-method-cooking-lessons-from-the-kitchn-216562", "passage_text": "Cooking time is generally 20 to 30 minutes, or until the chicken registers 165°F in the thickest part. Amazingly, all the chicken pieces wind up cooking at about the same rate — dark meat pieces cook a bit slower than white meat, but the thickness of the breast meat means everything finishes around the same time. Bake for 20 to 30 minutes: The chicken is done when opaque all the way through and the meat registers at least 165°F in the thickest part. Broil for extra-crispy skin: If you'd like the skin to be a bit more crispy and golden, turn on the broiler for 2 to 3 minutes."}, {"url": "http://healthyrecipesblogs.com/2011/08/09/how-to-bake-chicken-breast/", "passage_text": "The secret to juicy baked chicken breast? Bake for a short time at a high temperature. Baking for 30 minutes at 350 degrees will yield dry meat. But baking for just 20 minutes at 450 degrees will result in delightfully juicy baked chicken breast, every time. Baked Chicken Breast. "}, {"url": "http://www.simplyrecipes.com/recipes/classic_baked_chicken/", "passage_text": "Arrange the chicken pieces in the pan so that all the pieces are skin-side up, and the largest pieces (the breasts) are in the center of the pan. Don't crowd the pan; allow room between the pieces. 3 Bake in the oven for 30 minutes at 400°F (205°C). This initial high heat will help brown the chicken. Pat the chicken pieces dry with a paper towel. Sprinkle all sides with salt. Let the chicken pieces sit for 15 to 20 minutes to take the chill off. 2 Preheat your oven to 400°F (205°C). Pat the chicken pieces dry with a paper towel. Rub olive oil over the chicken pieces and on the bottom of the roasting pa"}, {"url": "http://www.simplyrecipes.com/recipes/classic_baked_chicken/", "passage_text": "Then lower the heat to 350°F (175°C) and bake for and additional 10-30 minutes more until the juices run clear (not pink) when poked with a sharp knife or the internal temperature of the chicken breasts is 165°F (74°C) and of the thighs is 170°F (77°C). Pat the chicken pieces dry with a paper towel. Sprinkle all sides with salt. Let the chicken pieces sit for 15 to 20 minutes to take the chill off. 2 Preheat your oven to 400°F (205°C). Pat the chicken pieces dry with a paper towel. Rub olive oil over the chicken pieces and on the bottom of the roasting pan"}, {"url": "http://whatscookingamerica.net/Q-A/ChickenCook.htm", "passage_text": "I just ignore their inaccurate times and use the following logic: One and a half hours is much too long to cook the chicken at 350 degrees F. The time your chicken will bake in the oven does depend on the internal temperature and the size of your chicken or chicken pieces. Generally I bake chicken at 350 degrees F. for 30 to 40 minutes. "}]