[{"url": "http://www.wikihow.com/Calculate-Annual-Salary", "passage_text": "Multiply this figure by 52, the number of weeks per year, to work out your annual salary. 1  For instance, if you work 40 hours per week and you earn $19 per hour, calculate your weekly salary with the equation 40 x $19 = $760. Average your weekly number of hours if you work a different amount each week. If you work a different number of hours each week, keep track of your weekly hours for one month. Then find the average number of hours per week you worked, and multiply to find"}, {"url": "http://www.wikihow.com/Calculate-Annual-Salary", "passage_text": "1 If you earn $19 per hour, then calculate your annual salary with the equation (32.5 x $19) x 52 = $32,110. 2  Keep track of your weekly hours with spreadsheet software or a time-tracking app. 3  Some time-tracking apps are marketed to managers who have to keep track of hours for multiple employees. Average your weekly number of hours if you work a different amount each week. If you work a different number of hours each week, keep track of your weekly hours for one month. Then find the average number of hours per week you worked, and multiply to find your annual salary."}, {"url": "http://www.convertunits.com/hourly/", "passage_text": "Salary calculator-hourly to annual. ConvertUnits.com provides a tool you can use to calculate the equivalent annual salary based on your hourly wage. You can factor in paid vacation time and holidays to figure out the total number of working days in a year. The salary calculator will also give you information on your daily, weekly, and monthly earnings. "}, {"url": "http://www.hourlysalaries.com/", "passage_text": "8 hours. Note: For monthly salary, this calculator takes the yearly salary and divides it by 12 months. Some people define a month as 4 weeks. This calculator does not calculate monthly salary based on a 4 week month. Note: This calculator assumes a work week consists of 40 hours and a work day consists of 8 hours. "}, {"url": "http://www.wikihow.com/Calculate-Annual-Salary", "passage_text": "1 Find the average weekly hours with the equation (30 + 25 + 35 + 40) / 4 = 32.5. 2  If you earn $19 per hour, then calculate your annual salary with the equation (32.5 x $19) x 52 = $32,110. 3  Keep track of your weekly hours with spreadsheet software or a time-tracking app. Average your weekly number of hours if you work a different amount each week. If you work a different number of hours each week, keep track of your weekly hours for one month. Then find the average number of hours per week you worked, and multiply to find your annual salary."}, {"url": "http://smallbusiness.chron.com/calculate-annual-salary-weekly-wage-20123.html", "passage_text": "Step 1. Convert to a basic hourly rate. Based on 40 hours per work week and 52 weeks a year, a full-time employee will work 2,080 hours per year. Divide the annual salary by 2,080 for the hourly rate for that position. For example: An annual salary of $35,000.00 divided by 2,080 = $16.83 per hour. While $35,000 may seem like a lot money, breaking it down to an hourly equivalent makes it easier to compare to similar jobs with an hourly rate. How to Calculate Annual Salary to a Weekly Wage. A few calculations will reveal the hourly rate for a salaried position. Jupiterimages/Pixland/Getty Images. Most people want an interesting job with great pay and benefits."}, {"url": "http://www.free-online-calculator-use.com/hourly-pay-calculator.html", "passage_text": "Calculate Your Hourly Equivalents. Instructions: Enter your annual salary, the number of hours you work per day, and the number of days you work per week, then click the Calculate Hourly Pay button. Mouse over the blue question marks for a further explanation of each entry field. "}, {"url": "http://www.wikihow.com/Calculate-Annual-Salary", "passage_text": "Their annual salary is divided by the number of pay periods per year to calculate the amount of gross pay for each pay check. This is also know as an exempt employee. If you are a salaried employee, you were likely told your total annual salary when you were hired. Average your weekly number of hours if you work a different amount each week. If you work a different number of hours each week, keep track of your weekly hours for one month. Then find the average number of hours per week you worked, and multiply to find your annual salary."}]