[{"url": "http://www.ehow.com/about_5372429_age-requirements-filing-federal-taxes.html", "passage_text": "Age Requirements. Your age does not exempt you from having to file a federal tax return at the end of the year. If you meet the income requirements for filing a tax return, you must file and pay taxes. However, if you are younger than 19 or if you are a full-time student younger than 24 you may be eligible to have your income included on your parent's federal tax return. Dependents. If you are listed as a dependent on another person's taxes, you may still be required to file your own taxes depending on your income and age. If you are single and younger than 65, you must file a return if your income exceeds the annual limit or your earned income is over the standard deduction."}, {"url": "http://budgeting.thenest.com/there-age-limit-electronic-income-tax-filing-33492.html", "passage_text": "The IRS can direct you to Free File software participants that may even file your state taxes for free. The IRS Free File program does not have an age limit for filers. According to the IRS website, Free File limits users to those who made $58,000 or less in adjusted gross income during the previous filing year. If your previous year's income exceeded $58,000, you can still file for free by using Free File Fillable Forms."}, {"url": "http://www.nolo.com/legal-encyclopedia/taxes-social-security-benefits.html", "passage_text": "If you file a federal tax return as an individual and your combined income is between $25,000 and $34,000, you have to pay income tax on up to 50% of your Social Security benefits. If your income is above $34,000, up to 85% of your Social Security benefits is subject to income tax. Joint filers. Individual filers. "}, {"url": "http://www.ehow.com/about_5372429_age-requirements-filing-federal-taxes.html", "passage_text": "If you are older than 65, you must file if your taxable income is over $11,200. To file as a head of household, you must have at least one dependent and not be married. If you use this filing status, you must file a tax return if you are less then 65 years old and have at least $12,500 in taxable income. Dependents. If you are listed as a dependent on another person's taxes, you may still be required to file your own taxes depending on your income and age. If you are single and younger than 65, you must file a return if your income exceeds the annual limit or your earned income is over the standard deduction."}, {"url": "http://finance.zacks.com/can-stop-paying-federal-income-taxes-age-70-3516.html", "passage_text": "Basically, you have to file a tax return as of publication if you and your spouse, both over 65, had combined income of more than $21,300 or half your Social Security benefits and other income was more than $32,000 combined. If you're single, you have to file if your gross income was more than $10,950. Exemptions and Deductions. Your tax will be figured after deductions and exemptions from your gross income. In 2012, you're allowed a $3,700 exemption for you and a spouse, a total of $7,400, and a standard deduction for a joint return of $13,900 at age 70. Either of these amounts can be changed in the future"}, {"url": "http://www.efile.com/tax/do-i-need-to-file-a-tax-return/", "passage_text": "Whether or not you are required to file a federal income tax return depends on several things: your filing status, your age, your income, your dependency status, and whether you meet a few other special requirements. Even if you're not required to file a tax return, there are reasons you may want to file a tax return. The minimum income required to file or efile a tax return for Tax Year 2014 depends on your income, age, and filing status. The minimum income levels for the various filing statuses are listed in the table below."}, {"url": "http://finance.zacks.com/maximum-can-earn-not-file-federal-income-taxes-3743.html", "passage_text": "If you are single and under age 65, you can earn up to $9,499 in a year and not file a tax return. Should you be 65 or older, you could earn up to $10,949 and be exempt from filing a federal tax return. However, you may qualify for an Earned Income Tax Credit, which is refundable in cash to you. Also, if you've had income taxes withheld, you should file to receive a refund of your money. Whether you need to file tax returns depends on your earnings, your age and your filing status. In many cases, even if you meet regulations eliminating the need to file a tax return, you may want to if you qualify for tax credits that could generate a rebate."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Family/At-What-Income-Does-a-Minor-Have-to-File-an-Income-Tax-Return-/INF14178.html", "passage_text": "If your child is required to file a tax return for unearned income, the IRS gives you the option of claiming the money on your return instead. There are certain restrictions, including a limit to the amount of money involved, and the tax you’ll owe may be greater than if your child filed an individual return. "}]