[{"url": "http://www.archives.gov/legislative/resources/education/veto/", "passage_text": "Lesson Extension. Several attempts have been made to give the President line-item veto power, but all have failed (Congress passed a law in 1996 granting line-item veto power to the President, but the Supreme Court declared it unconstitutional in Clinton v. City of New York, 524 U.S. 417 (1998). Students will use a facsimile of a vetoed bill and veto message to understand the veto and veto override process in Congress. Referring to the Constitution, students will match the Constitution's directions to the markings and language of the bill and veto message."}, {"url": "http://history.house.gov/Institution/Presidential-Vetoes/Presidential-Vetoes/", "passage_text": "The Legislative Branch, backed by modern court rulings, asserts that the Executive Branch may only pocket veto legislation when Congress has adjourned sine die from a session. President James Madison was the first President to use the pocket veto in 1812. The Constitution provides the President 10 days (excluding Sundays) to act on legislation or the legislation automatically becomes law. There are two types of vetoes: the “regular veto” and the “pocket veto.”. The regular veto is a qualified negative veto. The President returns the unsigned legislation to the originating house of Congress within a 10 day period usually with a memorandum of disapproval or a “veto message.” Congress can override the President’s decision if it musters the necessary two–thirds vote of each house"}, {"url": "http://auburn.edu/~johnspm/gloss/line-item_veto", "passage_text": "Line-item veto. A special form of veto in which the chief executive has the right to prevent particular provisions of a bill enacted by a legislative assembly from becoming law without having to kill all the other parts of the bill at the same time."}, {"url": "http://www.archives.gov/legislative/resources/education/veto/background.pdf", "passage_text": "The veto power does not give the President the power to amend or alter the content of. legislation—the President only has the ability to accept or reject an entire act passed by. Congress. The President, however, can influence and shape legislation by a threat of a veto. If Congress adjourns before the President has signed the bill and the President does not want the bill to pass the President may simply fail to sign the bill. When this happens the bill does not become law (it is essentially vetoed)."}, {"url": "http://www.historycentral.com/Civics/Pres/veto.html", "passage_text": "Article I, Section 7 of the Constitution gives the president the power to veto a bill passed by Congress. When the President vetoes a bill, it is returned to the Congress. If two thirds of both the House of Representatives and the Senate vote to override the veto, the bill becomes law without presidential approval. "}, {"url": "http://nationalparalegal.edu/conLawCrimProc_Public/Federalism/PresidentialPowers.asp", "passage_text": "If, on the other hand, Congress is in session at the end of the ten days the President’s opportunity to veto has lapsed and the bill will become law. Article II of the Constitution vests the powers of the executive branch in the President of the United States and details the powers of that office. Pocket veto: The President’s power to veto a bill is time-limited. If Congress is not in session and the President does not actively veto the bill, but rather “pockets” it, after 10 days the bill is automatically vetoed."}, {"url": "http://history.house.gov/Institution/Presidential-Vetoes/Presidential-Vetoes/", "passage_text": "Article I, section 7 of the Constitution grants the President the authority to veto legislation passed by Congress. This authority is one of the most significant tools the President can employ to prevent the passage of legislation. The Constitution provides the President 10 days (excluding Sundays) to act on legislation or the legislation automatically becomes law. There are two types of vetoes: the “regular veto” and the “pocket veto.”. The regular veto is a qualified negative veto. The President returns the unsigned legislation to the originating house of Congress within a 10 day period usually with a memorandum of disapproval or a “veto message.” Congress can override the President’s decision if it musters the necessary two–thirds vote of each house"}, {"url": "https://en.wikipedia.org/wiki/Powers_of_the_President_of_the_United_States", "passage_text": "The Constitution explicitly assigns to the president the power to sign or veto legislation, command the armed forces, ask for the written opinion of his Cabinet, convene or adjourn Congress, grant reprieves and pardons, and receive ambassadors. If the president kills a bill in this manner there is nothing that Congress can do to override this, which is called a  pocket veto . When signing a bill the president can also issue a signing statements that expresses his opinion on the constitutionality of a bill's provisions that intrude on executive power."}]