[{"url": "http://www.recipetips.com/kitchen-tips/t--1527/italian-sauces.asp", "passage_text": "Italian pasta dishes that are served with a sauce (Carbonara sauce) made with cream, eggs, Parmesan cheese, small pieces of bacon and vegetables, such as peas. Although any type of pasta can be used, spaghetti and linguine are most suitable with this sauce. Spinach Sauce may be made as a white creamy sauce or a red, tomato-based sauce. For a white Spinach Sauce, ingredients such as garlic, cheese, fresh or frozen spinach, and seasonings are often combined in a food processor to be blended, but not to the texture of a puree."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1527/italian-sauces.asp", "passage_text": "Pesto Sauce. An herb-based sauce originating in Italy that is typically made with basil, parsley, pine nuts, garlic, olive oil, and parmesan or Romano cheese. Many variations of this sauce exist, which may be different simply by the type of cheese, nuts or herbs, or other ingredients that are used to make the sauce. Spinach Sauce may be made as a white creamy sauce or a red, tomato-based sauce. For a white Spinach Sauce, ingredients such as garlic, cheese, fresh or frozen spinach, and seasonings are often combined in a food processor to be blended, but not to the texture of a puree."}, {"url": "http://culinaryarts.about.com/od/sauces/tp/Mother-Sauces.htm", "passage_text": "Each of the five mother sauces is made with a different liquid, and a different thickening agent — although three of the mother sauces are thickened with roux, in each case the roux is cooked for a different amount of time to produce a lighter or darker color. 3. Espagnole Sauce. The Espagnole Sauce, also sometimes called Brown Sauce, is a slightly more complex mother sauce. Espagnole is made by thickening brown stock with roux. So in that sense it's similar to a veloute. Velouté the difference is that espagnole is made with tomato puree purée and mirepoix for deeper color. and flavor"}, {"url": "https://en.wikipedia.org/wiki/Sauce", "passage_text": "In cooking, a sauce is liquid, cream, or semi-solid food served on or used in preparing other foods. Sauces are not normally consumed by themselves; they add flavor, moisture, and visual appeal to another dish. Sauce is a French word taken from the Latin salsa, meaning salted. Possibly the oldest sauce recorded is garum, the fish sauce used by the Ancient Greeks."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1526/french-sauces.asp", "passage_text": "Mayonnaise. Mayonnaise is a sauce made with egg yolks, olive or vegetable oil, mustard, and lemon juice or vinegar, and various seasonings. It is one the mother sauces of French cooking and forms the base for a number of other sauces. In French cooking, brown sauces serve as a base for other similar sauces that are used as an accompaniment for meats and vegetables. Brown sauces are made from a brown meat stock and thickened with cornstarch or roux (flour cooked with butter)."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1527/italian-sauces.asp", "passage_text": "Spinach Sauce. Very common in Italian and Indian dishes, this type of sauce is used as a base for cooking and flavoring dishes with poultry, vegetables, legumes, and pasta. Spinach Sauce may be made as a white creamy sauce or a red, tomato-based sauce. For a white Spinach Sauce, ingredients such as garlic, cheese, fresh or frozen spinach, and seasonings are often combined in a food processor to be blended, but not to the texture of a puree."}, {"url": "http://www.recipetips.com/kitchen-tips/t--1526/french-sauces.asp", "passage_text": "Hollandaise Sauce. A sauce made with egg yolks that are beaten as they are warmed slightly. Butter is gradually added along with lemon juice to create a thick, creamy sauce. Hollandaise sauce is used to accompany egg dishes, boiled or poached fish, and a variety of vegetables. In French cooking, brown sauces serve as a base for other similar sauces that are used as an accompaniment for meats and vegetables. Brown sauces are made from a brown meat stock and thickened with cornstarch or roux (flour cooked with butter)."}, {"url": "http://chinesefood.about.com/od/foodingredients/tp/Types-Of-Chinese-Soy-Sauce.htm", "passage_text": "1. Light Soy Sauce (thin soy sauce). Used in stir-fry sauces, marinades, soups and even dipping sauces, light soy sauce is the most commonly used type of soy sauce in Chinese cooking. It’s what most North Americans would think of as regular soy sauce – use it whenever a Chinese recipe calls for soy sauce, without further clarification. "}, {"url": "http://culinaryarts.about.com/od/sauces/tp/Mother-Sauces.htm", "passage_text": "While the chicken veloute, velouté made with chicken, stock is the most common, type there is also a veal veloute velouté and. Fish veloute velouté each of the veloutes veloutés forms the basis of its own. respective secondary mother sauce 3. Espagnole Sauce. The Espagnole Sauce, also sometimes called Brown Sauce, is a slightly more complex mother sauce. Espagnole is made by thickening brown stock with roux. So in that sense it's similar to a veloute. Velouté the difference is that espagnole is made with tomato puree purée and mirepoix for deeper color. and flavor"}, {"url": "http://www.recipetips.com/kitchen-tips/t--1526/french-sauces.asp", "passage_text": "In French cooking, traditional white sauces are one of two types: those made with hot milk added to a white roux (such as Bechamel béchamel sauce Or mornay) sauce or sauces made with hot broth or stock added to a white (roux such As veloute). velouté sauce In French cooking, brown sauces serve as a base for other similar sauces that are used as an accompaniment for meats and vegetables. Brown sauces are made from a brown meat stock and thickened with cornstarch or roux (flour cooked with butter)."}]