[{"url": "http://www.slideshare.net/squirky/fraction-of-a-quantity-5826598", "passage_text": "1 1. 2  How to Find a Fraction of a Quantity e.g. 2/3 of 12 For more maths help & free games related to this, visit: www.makemymathsbetter.com. 3  2. 4  To work out 2/3 of 12: First, divide the quantity (in this example 12) by the number on the bottom of the fraction (the denominator) – in this example 3. 5  3. 1 4. 2  To work out 2/3 of 12: First, divide the quantity (in this example 12) by the number on the bottom of the fraction (the denominator) – in this example 3. 12 ÷ 3 = 4 So, 1/3 of 12 = 4. 3  5. 4  This can be shown in a diagram as: 4 12 4 4."}, {"url": "http://www.answers.com/Q/How_do_you_find_a_fraction_of_a_fraction", "passage_text": "If you can multiply both the numerator and denominator of one fraction by the same number to get the other fraction then the fractions are equivalent. you take the numerator of the second fraction and divide it by the denominator of the first fraction. you take the answer from that equation and then multiply by the numer"}, {"url": "http://www.slideshare.net/squirky/fraction-of-a-quantity-5826598", "passage_text": "1 How to Find a Fraction of a Quantity e.g. 2/3 of 12 For more maths help & free games related to this, visit: www.makemymathsbetter.com. 2  2. 3  To work out 2/3 of 12: First, divide the quantity (in this example 12) by the number on the bottom of the fraction (the denominator) – in this example 3. 4  3. 1 4. 2  To work out 2/3 of 12: First, divide the quantity (in this example 12) by the number on the bottom of the fraction (the denominator) – in this example 3. 12 ÷ 3 = 4 So, 1/3 of 12 = 4. 3  5. 4  This can be shown in a diagram as: 4 12 4 4."}, {"url": "http://www.math-salamanders.com/how-to-calculate-fractions.html", "passage_text": "We need to multiply our answer by the numerator which is 3. So 3 7 of 35 = (1 7 of 35) x 3 = 5 x 3 = 15. How to calculate fractions-the algebra... For those of you who like to see things in Algebra...this is what it looks like. If we want to work out a b of a number n. First we divide n by the denominator b (n ÷ b). How to find a fraction of a number. Here are the two easy steps for finding the fraction of a number: Step 1 - Find the unit fraction of the number by dividing the number by the denominator. Step 2 - Multiply by the numerator. You should have now found your fraction of a number! Examples. Example 1) Find 5 6 of 24. Step 1). A unit fraction is a fraction where the numerator is equal to 1. To find the unit fraction of a number, you need to divide the number by the denominator"}, {"url": "http://classroom.synonym.com/fraction-number-2676.html", "passage_text": "A fraction is defined as the expression a/b, where a and b are integers. In the fraction a/b, a is the numerator and b is the denominator. Find the fraction of an integer. You can calculate the fraction of a whole number by multiplying the number by the numerator and dividing that product by the denominator. Thus, the fraction a/b of a whole number x is given by ax/b. Calculate the fractions of an integer for specific cases. For example, ¾ of 21 is (3x21)/4 or 63/4"}, {"url": "http://www.wikihow.com/Find-Equivalent-Fractions", "passage_text": "Divide the numerator and denominator by the same number. Like multiplication, division can also be used to find a new fraction that's equivalent to your starting fraction. Simply divide the numerator and the denominator of a fraction by the same number to obtain an equivalent fraction. There is one caveat to this process--the resulting fraction must have whole numbers in both the numerator and denominator to be valid. 1  For instance, let's look at 4/8 again. 1 Converting fractions to equivalent forms is actually a form of multiplying them by 1. 2  In converting 1/2 to 2/4, multiplying the numerator and denominator by 2 is the same as multiplying 1/2 by 2/2, which equals 1. 3  If desired, convert mixed numbers to improper fractions to make converting easier."}, {"url": "http://www.mathgoodies.com/lessons/fractions/equivalent.html", "passage_text": "You can multiply the numerator and the denominator of a fraction by any nonzero whole number, as long as you multiply both by the same whole number! For example, you can multiply the numerator and the denominator by 3, as shown in part A above. But you cannot multiply the numerator by 3 and the denominator by 5. Multiplying the numerator and the denominator of a fraction by the same nonzero whole number will change that fraction into an equivalent fraction, but it will not change its value. Equivalent fractions may look different, but they have the same value. Let's look at some more examples of equivalent fractions. Example 5."}, {"url": "http://www.mathgoodies.com/lessons/fractions/equivalent.html", "passage_text": "Example 4. Multiplying the numerator and the denominator of a fraction by the same nonzero whole number will change that fraction into an equivalent fraction, but it will not change its value. Equivalent fractions may look different, but they have the same value. Let's look at some more examples of equivalent fractions. Example 5."}, {"url": "http://www.mathgoodies.com/lessons/fractions/equivalent.html", "passage_text": "But you cannot multiply the numerator by 4 and the denominator by 2. The numerator and the denominator of a fraction must be multiplied by the same nonzero whole number in order to have equivalent fractions. You may be wondering why this is so. In the last lesson, we learned that a fraction that has the same numerator and denominator is equal to one. This is shown below. Multiplying the numerator and the denominator of a fraction by the same nonzero whole number will change that fraction into an equivalent fraction, but it will not change its value. Equivalent fractions may look different, but they have the same value. Let's look at some more examples of equivalent fractions. Example 5."}]