[{"url": "https://en.wikipedia.org/wiki/Methane", "passage_text": "Methane (/ˈmɛθeɪn/ or /ˈmiːθeɪn/) is a chemical compound with the chemical formula CH4 (one atom of carbon and four atoms of hydrogen). Methane can be produced by hydrogenating carbon dioxide through the Sabatier process. Methane is also a side product of the hydrogenation of carbon monoxide in the Fischer-Tropsch process. This technology is practiced on a large scale to produce longer chain molecules than methane."}, {"url": "http://www.answers.com/Q/What_is_methane_used_for", "passage_text": "Methane is a chemical compound with the chemical formula CH4. It is the simplest alkane, and the principal component of natural gas. Methane's bond angles are 109.5 degrees. Methane is a type of alcohol.The gas evolved from it is known as methane gas.It is used in industrial chemical process and can be used in refrigerated liquid."}, {"url": "http://www.answers.com/Q/What_is_methane_used_for", "passage_text": "Methane is used in various ways   Methane is important for electrical generation by burning it as a fuel in a gas turbine or steam boiler.   Methane is used in industr … ial chemical processes and may be transported as a refrigerated liquid (liquefied natural gas, or LNG). Methane is a type of alcohol.The gas evolved from it is known as methane gas.It is used in industrial chemical process and can be used in refrigerated liquid."}, {"url": "https://en.wikipedia.org/wiki/Methane", "passage_text": "Methane in the form of compressed natural gas is used as a vehicle fuel and is claimed to be more environmentally friendly than other fossil fuels such as gasoline / petrol and diesel. Research into adsorption methods of methane storage for use as an automotive fuel has been conducted. Methane can be produced by hydrogenating carbon dioxide through the Sabatier process. Methane is also a side product of the hydrogenation of carbon monoxide in the Fischer-Tropsch process. This technology is practiced on a large scale to produce longer chain molecules than methane."}, {"url": "http://www.answers.com/Q/What_is_methane_used_for", "passage_text": "Methane is the IUPAC name for the main constituent in natural gas (CH4). Methane stores energy in the C-H chemical bonds and this stored energy is readily released as heat thr … ough a chemical process known as combustion (burning) which is a largely exergonic reaction. Methane is a type of alcohol.The gas evolved from it is known as methane gas.It is used in industrial chemical process and can be used in refrigerated liquid."}, {"url": "https://www.dhs.wisconsin.gov/chemical/methane.htm", "passage_text": "Methane. Methane is an odorless, colorless flammable gas. It is used primarily as fuel to make heat and light. It is also used to manufacture organic chemicals. Methane can be formed by the decay of natural materials and is common in landfills, marshes, septic systems and sewers. Methane can form an EXPLOSIVE mixture in air at levels as low as 5 percent"}, {"url": "https://answers.yahoo.com/question/index?qid=20070529202716AA3UlNg", "passage_text": "Report Abuse. methane is a hydrocarbon .its formula is CH4. 1)Methane is important for electrical generation by burning it as a fuel in a gas turbine or steam boiler. 2)CNG contains a large amt of methane which is used as a fuel and is eco-friendly."}, {"url": "http://www.answers.com/Q/What_is_methane_used_for", "passage_text": "First, Methane [CH4] is a chemical compound composed of four Hydrogen molecules attached to a single Carbon molecule. It is a colorless, odorless, and tasteless gas at normal temperatures and pressures, and has many beneficial uses. Methane is a type of alcohol.The gas evolved from it is known as methane gas.It is used in industrial chemical process and can be used in refrigerated liquid."}, {"url": "http://www.wisegeek.org/what-is-methane.htm", "passage_text": "Methane, CH4, is a chemical compound composed of one carbon atom and four hydrogen atoms. It is one of the most common gases in the universe, as well as on Earth. While it is valued for its energy-production capabilities, methane also has the ability to potentially wreak havoc on the Earth's fragile ecosystems. In addition to natural gas-fired electrical generation stations, there are other uses for methane as an energy source as well. It is currently being used to power some automobiles and NASA is considering its use as a fuel for space vehicles."}]