[{"url": "http://www.nmfs.noaa.gov/pr/species/mammals/cetaceans/harborporpoise.htm", "passage_text": "Harbor porpoises inhabit northern temperate and subarctic coastal and offshore waters. They are commonly found in bays, estuaries, harbors, and fjords less than 650 ft (200 m) deep. In 1996, NMFS convened two take reduction teams (TRT) to mitigate bycatch of harbor porpoises in gillnet fisheries: the Gulf of Maine Harbor Porpoise TRT and the Mid-Atlantic TRT."}, {"url": "http://www.whalefacts.org/harbor-porpoise-facts/", "passage_text": "Harbor Porpoise. The harbor or harbour porpoise can be found swimming in locations such as the north Atlantic, north Pacific, the Black sea and west Africa. As the name suggest these porpoises tend to swim in or around harbors in coastal waters. These marine mammals can be found swimming throughout various parts of the Northern hemisphere in the North Atlantic and North Pacific ocean as well as the Black Sea. Harbor porpoises generally prefer shallow waters of less than 1,000 – 500 ft."}, {"url": "http://www.adfg.alaska.gov/index.cfm?adfg=viewing.marinemammals&species=porpoisedolphin", "passage_text": "Habitat. The Dall’s porpoise is found in Alaska coastal waters as far north as the Bering Sea. Pacific white-sided porpoises travel as far north as Kodiak Island and are present in the Aleutians and Gulf of Alaska. Harbor porpoises may be found as far north as the Beaufort Sea in ice-free months"}, {"url": "https://en.wikipedia.org/wiki/Harbour_porpoise", "passage_text": "The harbour porpoise may be polytypic, with geographically distinct populations representing distinct races: P. p. phocoena in the North Atlantic and West Africa, P. p. relicta in the Black Sea and Sea of Azov, an unnamed population in the northwest Pacific and P. p. vomerina in the northeast Pacific. The harbour porpoise (Phocoena phocoena) is one of six species of porpoise."}, {"url": "https://www.nwf.org/Wildlife/Wildlife-Library/Mammals/Harbor-Porpoise.aspx", "passage_text": "Habitat: Found in salt water and freshwater along North America's Atlantic and Pacific coasts, bays, harbors, estuaries and large rivers in waters generlly less than 650 feet deep. Range: Harbor porpoises are found in temperate and subarctic waters of the North Atlantic, North Pacific, and Black Sea. Life History and Reproduction: Harbor porpoises travel most often in pairs, small groups (6-10) and occasionally larger groups (50-100). "}, {"url": "http://animals.nationalgeographic.com/animals/mammals/harbor-porpoise/", "passage_text": "Harbor porpoises are found throughout the temperate coastal waters of the Northern Hemisphere. As their name suggests, they prefer the shallows, less than 500 feet (152 meters) deep, and are commonly seen in harbors and bays. They are also known to frequent inland waters, including rivers, estuaries, and tidal channels. Size relative to a 6-ft (2-m) man: Harbor porpoises are shy, elusive sea mammals whose numbers are declining primarily because they are frequently caught by accident in commercial fishing nets."}, {"url": "http://marinebio.org/species.asp?id=364", "passage_text": "World Range & Habitat. Harbor porpoises, Phocoena phocoena, are found in shallow, coastal waters of the North Atlantic, North Pacific, and Black Sea in temperate and subarctic waters of less than 15 °C. They sometimes also swim into bays and large rivers. Harbor porpoises are found singly, in pairs, or in small groups of 6-10 animals, however larger groups between 50-100 animals have been observed feeding. Harbor porpoises are often found stranded, which is likely due to their preferred shoreline habitat."}, {"url": "http://www.fisheries.noaa.gov/pr/species/mammals/porpoises/harbor-porpoise.html", "passage_text": "They feed on demersal and benthic species, mainly schooling fish and cephalopods. Harbor porpoises inhabit northern temperate and subarctic coastal and offshore waters. They are commonly found in bays, estuaries, harbors, and fjords less than 650 ft (200 m) deep. Harbor porpoises have a discontinuous distribution. In the North Atlantic, they range from West Greenland to Cape Hatteras, NC (but do not enter Hudson Bay), and from the Barents Sea to West Africa."}]