[{"url": "http://gotirupati.com/mamandur-eco-forest/", "passage_text": "Mamandur Eco Forest. Mamandur Eco Forest is at a Distance of 27 Km from Tirupati. Mamandur Eco Forest is one of the best Tourism places nearby Tirupati, This Bio park is near to Tirupati Forest Village and is a interesting Trekking Hub. "}, {"url": "http://puratattva.in/2010/11/11/mamandur-cave-temple-worshop-27", "passage_text": "However the work has been stopped in between due to cracks in the rock and load above the roof. How to Reach – Mamandur is located on Kanchipuram-Vandavasi road, and is about 15 km from Kanchipuram. The cave temples are about 2 km inside from the main road, in the village Narasapalaiyam. You need to keep asking the local people to reach the shrines as there are few cross roads inside the village. "}, {"url": "http://www.maplandia.com/india/tamil-nadu/tiruvannamalai-sambuvaray/mamandur/", "passage_text": "Mamandur hotels map. The location of each Mamandur hotel listed is shown on the detailed zoomable map. Moreover, Mamandur hotel map is available where all hotels in Mamandur are marked. You can easily choose your hotel by location. 3D map of Mamandur in India. You can also dive right into Mamandur on unique 3D satellite map provided by Google Earth. With new GoogLe Earth plugin you can enjoy the interactive Mamandur 3D map within your web browser."}, {"url": "https://en.wikipedia.org/wiki/Talakona", "passage_text": "It is located 49 kilometres (30 mi) from Pileru, 58 kilometres (36 mi) from Tirupathi, 220 kilometres (140 mi) from Chennai, and 105 kilometres (65 mi) from Chittoor and 250 kilometres (160 mi) from Bangalore. Talakona is a resort with waterfalls, dense forests and wildlife. The Talakona waterfall is in Sri Venkateswara National Park, Chittoor District of Andhra pradesh in India. With a 270 feet (82 m)-fall, Talakona is the highest waterfall in the Andhra pradesh state. Talakona is also known for the Lord Siddheswara Swamy Temple, which is located close to the waterfall"}, {"url": "http://www.gamesacorp.com/en/", "passage_text": "1 Gamesa continues to grow in India with a contract for the supply of 100 MW The company will install 50 of its G97-2.0 MW class S turbines, purpose-designed for the Indian market. End of utilities block. Start of main content. 1 "}, {"url": "http://www.maplandia.com/india/tamil-nadu/tiruvannamalai-sambuvaray/mamandur/", "passage_text": "detailed map of Mamandur and near places. Welcome to the Mamandur google satellite map! This place is situated in Tiruvannamalai Sambuvaray, Tamil Nadu, India, its geographical coordinates are 12° 45' 0 North, 79° 40' 0 East and its original name (with diacritics) is Māmandūr. See Mamandur photos and images from satellite below, explore the aerial photographs of Mamandur in India. 3D map of Mamandur in India. You can also dive right into Mamandur on unique 3D satellite map provided by Google Earth. With new GoogLe Earth plugin you can enjoy the interactive Mamandur 3D map within your web browser."}, {"url": "http://www.tourismtimes.org/mamandur-weekend-tour", "passage_text": "Mamandur Weekend Tour. Mamandur is bountifully endowed with nature in the form of hills and valleys of Eastern Ghats. Mamandur forest village is located on Chennai – Kadapa High way – 25 Km away from Tirupati, 160 Km from Chennai and 100 Km from Kadapa. "}, {"url": "http://www.onefivenine.com/india/villages/Tiruvannamalai/Vembakkam/Mamandur", "passage_text": "About Mamandur. Mamandur is a Village in Vembakkam Taluk in Tiruvannamalai District of Tamil Nadu State, India. It is located 102 KM towards East from District head quarters Thiruvannamalai. 11 KM from Vembakkam. 82 KM from State capital Chennai. Mamandur Pin code is 631702 and postal head office is Mamandur Kanchipuram."}]