[{"url": "http://sheabutterguide.com/shea-butter/", "passage_text": "Shea butter is a slightly yellowish or ivory colored and nutty, smoky scented natural fat extracted from the seed of the African shea tree. It is often referred to by its French name as karite tree, which originally (ghariti) means the tree of life. The tree got this name due to its exceptional healing properties. Unrefined shea butter simply means it is extracted and prepared without the use of chemicals or preservative. In other terms, that means it is produced the same way African people do it for centuries. And this is what really counts, because only unrefined shea butter keeps all of its natur"}, {"url": "http://wellnessmama.com/27324/shea-butter-benefits/", "passage_text": "Shea butter is one of the most versatile natural beauty ingredients and I use it daily in some form. I’ve used it for years in everything from my homemade lotion bars and original magnesium body butter to homemade lip balms and healing salves. 1 Moisturizing: The concentration of natural vitamins and fatty acids in Shea butter makes it incredibly nourishing and moisturizing for skin. 2  It is often used to remedy dry skin and to help protect the skin’s natural oils."}, {"url": "http://www.ebay.com/gds/Whats-the-Difference-Between-Raw-Unrefined-and-Ultra-refined-Shea-Butter-/10000000178258860/g.html", "passage_text": "Shea butter, which comes from the African shea tree, has been used for many centuries as a skin moisturizer and hair conditioner. It is also commonly used in Africa for cooking food, making candles, and even coating wood products. Refined shea butter has undergone some form of processing in order to remove its odor and/or change its properties. It is also common for refined shea butter to have additives, such as perfumes or preservatives. Refined shea butter is generally very smooth and has a white color instead of yellow color."}, {"url": "http://sheabutterguide.com/shea-butter/", "passage_text": "In its pure unrefined state, shea butter is also edible and has been used for centuries in Africa as cooking oil, as a waterproofing wax, for hairdressing, for candle-making, as an anti-inflammatory for sprains and arthritis, and to sooth dry skin. Unrefined shea butter simply means it is extracted and prepared without the use of chemicals or preservative. In other terms, that means it is produced the same way African people do it for centuries. And this is what really counts, because only unrefined shea butter keeps all of its natural healing properties."}, {"url": "http://www.sheainstitute.com/asbi-library/21reasons/", "passage_text": "Shea Butter, the multi-purpose all natural vitamin A skin cream, is derived from the seed of the Shea tree. The cream is extracted and prepared without the use of chemicals. The best Shea Butter for skin use is prepared by cold press methods without use of added chemicals or preservative. "}, {"url": "http://wellnessmama.com/27324/shea-butter-benefits/", "passage_text": "Shea butter is a skin superfood that comes from the seeds of the fruit of the Shea (Karite) tree and that is naturally rich in vitamins A, E and F. It offers UV protection (it is SPF ~6) and provides the skin with essential fatty acids and the nutrients necessary for collagen production. 1 Moisturizing: The concentration of natural vitamins and fatty acids in Shea butter makes it incredibly nourishing and moisturizing for skin. 2  It is often used to remedy dry skin and to help protect the skin’s natural oils."}, {"url": "http://www.treasuredlocks.com/shebutben.html", "passage_text": "Shea Butter is extracted from the nuts of the Shea-Karite tree. This tree only begins to produce nuts after about fifteen years and it can take up to 30 years to get the first quality crop from a particular tree. The producers are waiting for the nut to contain a high concentration of irremovable fatty acid. "}, {"url": "http://health.howstuffworks.com/skin-care/moisturizing/products/is-shea-butter-good-for-face-skin-.htm", "passage_text": "Shea butter, which is extracted from the nut of the African shea tree, is a rich, cream-colored substance that has natural soothing and moisturizing properties. Shea butter is full of nutrients, including vitamin A, which has many healing properties and has been known to aid in treating blemishes, wrinkles, eczema and dermatitis, as well as burns and even stretch marks. Shea butter is also packed with antioxidants like vitamin E, as well as polyphenols and phytonutrients."}, {"url": "https://en.wikipedia.org/wiki/Shea_butter", "passage_text": "Shea butter (/ˈʃiː/ or /ˈʃiː.ə/) is an off-white or ivory-colored fat extracted from the nut of the African shea tree (Vitellaria paradoxa). Shea butter is a triglyceride (fat) derived mainly from stearic acid and oleic acid. It is widely used in cosmetics as a moisturizer, salve or lotion. Shea butter is edible and is used in food preparation in Africa. Occasionally, the chocolate industry uses shea butter mixed with other oils as a substitute for cocoa butter, although the taste is noticeably different. The English word shea comes from s’i, í the'tree s name in The bambara language Of. mali"}, {"url": "http://www.stylecraze.com/articles/best-benefits-of-shea-butter-for-skin-hair-and-health/", "passage_text": "Shea butter may be refined or unrefined. Raw or unrefined shea butter is the purest form of shea butter, which is the most natural and the least processed. Since it is extracted manually, it is able to retain its vitamins, minerals and other natural properties. Refined shea butter, on the other hand, is the processed form of butter"}]