[{"url": "http://smellslikescience.com/ether-and-the-discovery-of-anesthesia/", "passage_text": "Today, Crawford Long is recognized as the first physician to use ether as an anesthetic during surgery. But it was William Morton’s ether demonstration at Massachusetts General Hospital, and his desire for fame and fortune, that first alerted the world to the miracle of anesthesia. "}, {"url": "https://en.wikipedia.org/wiki/History_of_general_anesthesia", "passage_text": "In 1847, Scottish obstetrician James Young Simpson (1811–1870) of Edinburgh was the first to use chloroform as a general anesthetic. The use of chloroform anesthesia expanded rapidly thereafter in Europe. Chloroform began to replace ether as an anesthetic in the United States at the beginning of the 20th century. The word anesthesia, coined by Oliver Wendell Holmes, Sr. (1809–1894) in 1846 from the Greek αν- , an- , without; and αἴσθησις, aisthēsis, sensation), refers to the inhibition of sensation."}, {"url": "http://www.scienceclarified.com/Al-As/Anesthesia.html", "passage_text": "Under these conditions, many patients died of shock from the pain of the operation itself. Nitrous oxide, ether, and chloroform. The gases nitrous oxide, ether, and chloroform were first used as anesthetics in the nineteenth century, ushering in the modern era of anesthesia. Nitrous oxide, or laughing gas, was discovered as an anesthetic by English chemist Humphry Davy (1791–1867) in 1799. The patient cried out in pain and, as a result, another 20 years passed before nitrous oxide was accepted for use as an anesthetic. The first use of ether as an anesthetic during an operation was claimed by surgeon Crawford W. Long (1815–1878) of Georgia in 1842."}, {"url": "http://www.pbs.org/newshour/rundown/the-painful-story-behind-modern-anesthesia/", "passage_text": "An illustration of the first use of ether as an anesthetic in 1846 by the dental surgeon W.T.G. Morton. Photo: Wikimedia Commons. Recalling these lessons during the summer of 1846, Morton purchased bottles of the stuff from his local chemist and began exposing himself and a menagerie of pets to ether fumes. "}, {"url": "https://en.wikipedia.org/wiki/History_of_general_anesthesia", "passage_text": "Re-enactment of the first public demonstration of general anesthesia by William T. G. Morton on October 16, 1846 in the Ether Dome at Massachusetts General Hospital, Boston. Surgeons John Collins Warren and Henry Jacob Bigelow are included in this daguerrotype by Southworth & Hawes. The word anesthesia, coined by Oliver Wendell Holmes, Sr. (1809–1894) in 1846 from the Greek αν- , an- , without; and αἴσθησις, aisthēsis, sensation), refers to the inhibition of sensation."}, {"url": "https://en.wikipedia.org/wiki/Anesthesia", "passage_text": "Cocaine was later isolated and became the first effective local anesthetic. It was first used in 1859 by Karl Koller, at the suggestion of Sigmund Freud, in eye surgery in 1884. German surgeon August Bier (1861–1949) was the first to use cocaine for intrathecal anesthesia in 1898. Romanian surgeon Nicolae Racoviceanu-Piteşti (1860–1942) was the first to use opioids for intrathecal analgesia; he presented his experience in Paris in 1901."}, {"url": "http://www.discoveriesinmedicine.com/A-An/Anesthetics.html", "passage_text": "The modern era of anesthesia began in the late eighteenth century when chemists began to investigate the use of various gases. Joseph Priestley (1733-1804) discovered nitrous oxide in 1772, and in 1800 Humphry Davy (1778-1829) discovered that the gas had anesthetic properties when it was inhaled. Intratracheal anesthesia, which involves introducing anesthetic through a tube in the trachea (windpipe in the throat), was pioneered by New York City surgeon George Fell (1850-1918) and perfected in 1909 by Samuel Meltzer and John Auer of the Rockefeller Institute."}, {"url": "http://science.howstuffworks.com/anesthesia6.htm", "passage_text": "The American Medical Association as well as the American Dental Association endorsed Dr. Horace Wells, a dentist, as the first person to use nitrous oxide to pull teeth in 1845. Chloroform was first used as an anesthetic by Dr. James Simpson in the mid-1840s as well. "}, {"url": "http://www.history.com/topics/ether-and-chloroform", "passage_text": "In 1842, Georgia physician Crawford Williamson Long became the first doctor to use ether as a general anesthetic during surgery, when he used it to remove a tumor from the neck of his patient James M. Venable. Long did not publish the results of his experiments until 1848, and by that time Boston dentist William T.G. Morton had already gained fame with the first publicly demonstrated use of ether as an effective surgical anesthetic."}]