[{"url": "http://answers.webmd.com/answers/1198615/what-is-an-iron-infusion", "passage_text": "A. An iron infusion is simply a liquid dose of iron given in the veins. Iron is an essential mineral that we get from eating foods such as meat, eggs, and leafy greens. Iron is needed to make hemoglobin, the oxygen-carrying substance in red blood cells. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080430051447AAfcRCh", "passage_text": "Answers. Iron intravenous (IV) - you will be ordered an intravenous iron infusion, if you have iron deficiency anemia, and you are unable to absorb iron in your body, due to stomach problems, or another condition. Source(s): http://www.pharmacosmos.com/intravenousi... http://www.chemocare.com/managing/iron_d.."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_anemia/hic_intravenous_iron_supplementation", "passage_text": "Iron is one of the minerals in the human body. It is one of the components of hemoglobin, the substance in red blood cells that helps blood carry oxygen throughout the body. If you do not have enough iron, your body cannot make hemoglobin, and you may develop anemia. 1 blood loss (caused by ulcers, some cancers, and other conditions; and, in women, during monthly periods); 2  a diet that doesn't have enough iron in it; 3  taking medications that interfere with the ability of the body to absorb iron; 4  an increase in the body's need for iron (for instance, in women during pregnancy)."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_anemia/hic_intravenous_iron_supplementation", "passage_text": "This is known as iron-deficiency anemia, the most common type of anemia. Factors that can lower your body's supply of iron include: 1  blood loss (caused by ulcers, some cancers, and other conditions; and, in women, during monthly periods); 2  a diet that doesn't have enough iron in it; 3  taking medications that interfere with the ability of the body to absorb iron; 1 blood loss (caused by ulcers, some cancers, and other conditions; and, in women, during monthly periods); 2  a diet that doesn't have enough iron in it; 3  taking medications that interfere with the ability of the body to absorb iron; 4  an increase in the body's need for iron (for instance, in women during pregnancy)."}, {"url": "http://chemocare.com/chemotherapy/side-effects/iron-deficiency-anemia.aspx", "passage_text": "1 Iron intravenous (IV) - you will be ordered an intravenous iron infusion, if you have iron deficiency anemia, and you are unable to absorb iron in your body, due to stomach problems, or another condition. The most common cause of iron deficiency is bleeding or blood loss, usually from the gastrointestinal tract. Other causes include a lack of iron in your diet, or changes in your body due to pregnancy."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/ida/treatment", "passage_text": "A transfusion of red blood cells will treat your anemia right away. The red blood cells also give a source of iron that your body can reuse. However, a blood transfusion is only a short-term treatment. Your doctor will need to find and treat the cause of your anemia. Treatment To Stop Bleeding. If blood loss is causing iron-deficiency anemia, treatment will depend on the cause of the bleeding. For example, if you have a bleeding ulcer, your doctor may prescribe antibiotics and other medicines to treat the ulcer."}, {"url": "http://www.hematology.org/Patients/Anemia/Iron-Deficiency.aspx", "passage_text": "Blood Transfusions. Red blood cell transfusions may be given to patients with severe iron-deficiency anemia who are actively bleeding or have significant symptoms such as chest pain, shortness of breath, or weakness. Iron-deficiency anemia is diagnosed by blood tests that should include a complete blood count (CBC) . Additional tests may be ordered to evaluate the levels of serum ferritin, iron, total iron-binding capacity, and/or transferrin."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/ida/treatment", "passage_text": "Blood Transfusion. If your iron-deficiency anemia is severe, you may get a transfusion of red blood cells. A blood transfusion is a safe, common procedure in which blood is given to you through an IV line in one of your blood vessels. A transfusion requires careful matching of donated blood with the recipient's blood. Treatment To Stop Bleeding. If blood loss is causing iron-deficiency anemia, treatment will depend on the cause of the bleeding. For example, if you have a bleeding ulcer, your doctor may prescribe antibiotics and other medicines to treat the ulcer."}]