[{"url": "http://readingpagoda.com/", "passage_text": "Welcome to The Pagoda. The Pagoda, located atop Mt. Penn is an historical landmark that has served as a shining beacon for Greater Reading for more than 100 years. It is owned, loved and cared for by the city and citizens of Reading, Pennsylvania. Visitors from around the world come to see the Pagoda. This out-of-place and yet extraordinary building has an unforgettable view and is a comforting sight for many, especially the red glow of lights at night. To generations of residents, the Pagoda is a sure sign of home"}, {"url": "https://en.wikipedia.org/wiki/Pagoda", "passage_text": "The whole structure is coated with 60 tons of pure gold. A pagoda is a tiered tower with multiple eaves, built in traditions originating in historic East Asia or with respect to those traditions, common to Nepal, India, China, Japan, Korea, Vietnam, Burma and other parts of Asia. Tiered towers with multiple eaves: 1  Songyue Pagoda on Mount Song, Henan, China, built in 523. 2  Miruksa Temple Pagoda at Iksan, Korea, built in the early 7th century. 3  Bunhwangsa at Gyeongju, Korea, built in 634. 4  Xumi Pagoda at Zhengding, Hebei, China, built in 636. 5  Daqin Pagoda in China, built in 640. 6  Hwangnyongsa Wooden nine-story pagoda on 7  ... Pagod"}, {"url": "https://en.wikipedia.org/wiki/Pagoda", "passage_text": "The modern pagoda is an evolution of the Ancient Nepal stupa, a tomb-like structure where sacred relics could be kept safe and venerated. The architectural structure of the stupa has spread across Asia, taking on many diverse forms as details specific to different regions are incorporated into the overall design. Tiered towers with multiple eaves: 1  Songyue Pagoda on Mount Song, Henan, China, built in 523. 2  Miruksa Temple Pagoda at Iksan, Korea, built in the early 7th century. 3  Bunhwangsa at Gyeongju, Korea, built in 634. 4  Xumi Pagoda at Zhengding, Hebei, China, built in 636. 5  Daqin Pagoda in China, built in 640. 6  Hwangnyongsa Wooden nine-story pagoda on 7  ... Pagod"}, {"url": "https://en.wikipedia.org/wiki/Chinese_pagoda", "passage_text": "The Lingxiao Pagoda of Zhengding, Hebei, built in 1045 AD during the Song Dynasty, with little change in later renovations. The earliest base-structure type for Chinese pagodas were square-base and circular-base. By the 5th-10th centuries the Chinese began to build octagonal-base pagoda towers. The highest Chinese pagoda from the pre-modern age is the Liaodi Pagoda of Kaiyuan Monastery, Dingxian, Hebei province, completed in the year 1055 AD under Emperor Renzong of Song and standing at a total height of 84 m (275 ft)."}, {"url": "https://www.renown-travel.com/burma/mandalay/mingunpagoda.html", "passage_text": "The massive Mingun pagoda. The Mingun Pagoda is a massive unfinished pagoda built at the end of the 18 th century, that was meant to be the largest pagoda in the country. The massive paya, also known as the Mantara Gyi Pagoda, the Mingun Pahtodawgyi and the Great Royal Stupa makes for an impressive site on the banks of the Irrawaddy river. The Pondaw Pagoda; model of the Great Paya. To get an idea what the pagoda would have looked like if it had been finished, have a look at the Pondaw Pagoda. This whitewashed pagoda with a golden spiral on top nearby at the bank of the river is a model of what the Great Paya was meant to be."}, {"url": "http://myanmartravelinformation.com/yangon-where-to-visit/shwedagon-pagoda.html", "passage_text": "Shwedagon Pagoda is the most popular and well-known pagoda in Yangon. The pagoda is one of the main tourist destinations in Myanmar. Located at No.1. Shwedagon Pagoda Road. Dagon Township. in Yangon. this pagoda is the most notable building in Yangon. The Shwedagon Pagoda is a great cone-shaped Buddhist monument that crowns a hill about one mile north of the Cantonment. The pagoda itself is a solid brick stupa (Buddhist reliquary) that is completely covered with gold. "}, {"url": "https://en.wikipedia.org/wiki/Chinese_pagoda", "passage_text": "The earliest extant brick pagoda is the 40-metre-tall Songyue Pagoda in Dengfeng Country, Henan. This curved, circle-based pagoda was built in 523 during the Northern Wei Dynasty, and has survived for 15 centuries. By the 5th-10th centuries the Chinese began to build octagonal-base pagoda towers. The highest Chinese pagoda from the pre-modern age is the Liaodi Pagoda of Kaiyuan Monastery, Dingxian, Hebei province, completed in the year 1055 AD under Emperor Renzong of Song and standing at a total height of 84 m (275 ft)."}, {"url": "https://en.wikipedia.org/wiki/Pagoda", "passage_text": "1 Phra Pathom Chedi the highest pagoda or stupa in the world Nakhon Pathom, Thailand. 2  Shwedagon Pagoda, a 98 metres (322 ft) gilded pagoda and stupa located in Yangon, Burma. 3  It is the most sacred Buddhist pagoda for the Burmese with relics of the past four Buddhas enshrined within. 4  Shwezigon Pagoda in Nyaung Oo, Burma. Tiered towers with multiple eaves: 1  Songyue Pagoda on Mount Song, Henan, China, built in 523. 2  Miruksa Temple Pagoda at Iksan, Korea, built in the early 7th century. 3  Bunhwangsa at Gyeongju, Korea, built in 634. 4  Xumi Pagoda at Zhengding, Hebei, China, built in 636. 5  Daqin Pagoda in China, built in 640. 6  Hwangnyongsa Wooden nine-story pagoda on 7  ... Pagod"}, {"url": "https://en.wikipedia.org/wiki/Chinese_pagoda", "passage_text": "The Liaodi Pagoda is the tallest pre-modern pagoda still standing, yet in April 2007 a new wooden pagoda at the Tianning Temple of Changzhou was opened to the public; this pagoda is now the tallest in China, standing at 154 m (505 ft). By the 5th-10th centuries the Chinese began to build octagonal-base pagoda towers. The highest Chinese pagoda from the pre-modern age is the Liaodi Pagoda of Kaiyuan Monastery, Dingxian, Hebei province, completed in the year 1055 AD under Emperor Renzong of Song and standing at a total height of 84 m (275 ft)."}]