[{"url": "http://www.answers.com/Q/How_long_does_a_bankruptcy_stay_on_your_credit_report", "passage_text": "A Chapter 7 bankruptcy may display on your credit for 10 years from the date of filing. Chapter 13 may stay for 10 years also, but it is customary for those to be removed after 7 years. A Chapter 7 Bankruptcy may stay on your credit report for up to 10 years. A Chapter 13 Bankruptcy may stay on your credit report for up to 7 years. But both may be removed … earlier if the information they are reporting is incorrect, incomplete, misleading, or unverifiable"}, {"url": "http://bankruptcy-law.freeadvice.com/bankruptcy-law/consumer_bankruptcy/credit_report.htm", "passage_text": "by FreeAdvice staff. A bankruptcy will stay on your credit report for up to 10 years, but many credit reporting agencies will remove it after 7. This is similar to the reporting period for late pays or delinquent accounts posted on your credit report, which is also 7 years. "}, {"url": "http://blog.credit.com/2012/07/how-long-will-a-bankruptcy-stay-on-your-credit-report/", "passage_text": "Chapter 13 bankruptcy is deleted seven years from the filing date because a portion of the debt is repaid under the discharge plan. Here is a general summary of how long “negative” information will stay on the credit report: 1  Late payment information — 7 years. 2  Foreclosures — 7 years. 3  Collections — 7 years (depending on age of the debt being collected). 4  Derogatory Public Records — 7 years (unpaid tax liens may remain longer)"}, {"url": "https://www.creditkarma.com/question/how-long-does-bankruptcy-remain-on-my-credit", "passage_text": "It may only stay on your credit report for 10 years, but if you are in a profession where they do a thorough background check on you, they can find out 25 years after the fact that you filed for bankruptcy relief. Chapter 7 = Up to 10 years it can remain on your credit report. Chapter 13 = Up to 7 years it can remain on your credit report. Until you are qualified to file a chapter 7 again = 8 years from the date your case was discharged."}, {"url": "http://www.alllaw.com/articles/nolo/bankruptcy/life-after-chapter-13.html", "passage_text": "According to the Fair Credit Reporting Act, a bankruptcy can only remain on your credit for up to ten years after your filing date. However, a Chapter 13 bankruptcy will typically be removed from your credit report after seven years. Keep in mind that the clock starts running when you file your case, not when you receive your discharge."}, {"url": "http://www.answers.com/Q/How_long_will_a_dismissed_bankruptcy_stay_on_your_credit_report", "passage_text": "A bankruptcy usually stays on your credit report for 7 years. If you forgetadebt on the bankruptcy petition, it may may be 7 years from the time the bankruptcy petition was am … ended, but otherwise it is from the time the bankruptcy became file. 4 people found this useful. A chapter 7 is on your credit report for 10 years.    …  i called equifax and a discharged chapter 13 stays on for 7 years and a dismissed chapter 13 stays on"}, {"url": "http://www.answers.com/Q/How_long_will_a_dismissed_bankruptcy_stay_on_your_credit_report", "passage_text": "Chapter 7 will stay on your credit report for 10 years from the date bankruptcy was filed. Chapter 13 typically stays on your credit report for 7 years from the date the bankr … uptcy was filed, however, can remain on your credit report for 10 years. 3 people found this useful. A chapter 7 is on your credit report for 10 years.    …  i called equifax and a discharged chapter 13 stays on for 7 years and a dismissed chapter 13 stays on"}, {"url": "https://www.creditkarma.com/question/how-long-does-bankruptcy-remain-on-my-credit", "passage_text": "The record will remain on your credit report for seven years or longer depending on the type of bankruptcy filed. For Chapter 7, it stays for 10 years. For Chapter 13, it stays for 7 years. Chapter 7 = Up to 10 years it can remain on your credit report. Chapter 13 = Up to 7 years it can remain on your credit report. Until you are qualified to file a chapter 7 again = 8 years from the date your case was discharged."}, {"url": "http://www.answers.com/Q/How_long_does_a_bankruptcy_stay_on_your_credit_report", "passage_text": "Chapter 7 will stay on your credit report for 10 years from the date bankruptcy was filed. Chapter 13 typically stays on your credit report for 7 years from the date the bankr … uptcy was filed, however, can remain on your credit report for 10 years. 3 people found this useful. A Chapter 7 Bankruptcy may stay on your credit report for up to 10 years. A Chapter 13 Bankruptcy may stay on your credit report for up to 7 years. But both may be removed … earlier if the information they are reporting is incorrect, incomplete, misleading, or unverifiable"}]