[{"url": "http://lexicon.ft.com/Term?term=Financial-Policy-Committee--FPC", "passage_text": "The Financial Policy Committee (FPC) is the UK’s risk regulator formed in early 2011, charged with overseeing the stability of the financial system. The committee is given tough powers to tame systemic risk by clamping down on loose credit, overheated sectors and previously unregulated parts of the financial system. The committee, housed in the Bank of England (BoE) and chaired by the Bank's governor Mervyn King, is viewed as a counterpart to the monetary policy committee, which sets interest rates. The FPC will be part of the BoE and staffed with six BoE executives, the head of the new regulator and four external members."}, {"url": "http://lexicon.ft.com/Term?term=Financial-Policy-Committee--FPC", "passage_text": "Whereas the Monetary Policy Committee (MPC) is responsible for making interest rate decisions based on changes in the macroeconomic environment, the FPC is more of a regulatory body for the City. The committee, housed in the Bank of England (BoE) and chaired by the Bank's governor Mervyn King, is viewed as a counterpart to the monetary policy committee, which sets interest rates. The FPC will be part of the BoE and staffed with six BoE executives, the head of the new regulator and four external members."}, {"url": "http://www.investorwords.com/7674/Monetary_Policy_Committee.html", "passage_text": "MPC. A committee designated by the Bank of England. The role of the Monetary Policy Committee is to regulate interest rates for the United Kingdom. The committee meets monthly, and at the meeting a variety of economics issues are discussed. The Governor of the committee puts together a proposed plan, and each members is allowed to vote on it and give his or her opinion"}, {"url": "http://www.brookings.edu/research/speeches/2011/12/02-macroprudential-policy-kohn", "passage_text": "Kohn described how the Bank of England's Financial Policy Committee, of which he is an interim member, is using macroprudential policy tools to identify risks and make recommendations to preserve financial stability. "}, {"url": "http://www.bankofengland.co.uk/financialstability/Pages/fpc/default.aspx", "passage_text": "Previously, in February 2011, the Bank’s Court of Directors created an interim FPC to undertake, as far as possible, the future statutory role of FPC. The interim FPC held its first policy meeting in June 2011, and met on a quarterly basis thereafter. The Committee publishes a record of its formal policy meetings, and is responsible for the Bank’s bi-annual Financial Stability Report. The FPC is a statutory sub-committee of Court. The Committee is charged with a primary objective of identifying, monitoring and taking action to remove or reduce systemic risks with a view to protecting and enhancing the resilience of the UK financial system."}, {"url": "http://www.nonprofitaccountingbasics.org/reporting-operations/finance-committee-committee-chair-responsibilities", "passage_text": "Role of the Committee. The role of the finance committee is primarily to provide financial oversight for the organization. Typical task areas for small and midsized groups include budgeting and financial planning, financial reporting, and the creation and monitoring of internal controls and accountability policies. "}, {"url": "http://www.bankofengland.co.uk/financialstability/Pages/fpc/whatis.aspx", "passage_text": "Page Content. In the article below, Paul Tucker (former Deputy Governor, Financial Stability) explains the role and powers of the FPC in relation to risks that threaten the resilience of the UK financial system as a whole. He also describes some of the processes supporting the new committee. "}, {"url": "https://en.wikipedia.org/wiki/Financial_Policy_Committee", "passage_text": "From Wikipedia, the free encyclopedia. The Financial Policy Committee (FPC) is an official committee of the Bank of England, modelled on the already well established Monetary Policy Committee. It was announced in 2010 as a new body responsible for monitoring the economy of the United Kingdom. Plans for the committee were set out in George Osborne 's first Mansion House speech in June 2010, along with the creation of the PRA and a Consumer Protection and Markets Authority (CPMA, later renamed the Financial Conduct Authority, or FCA)."}, {"url": "https://en.wikipedia.org/wiki/Monetary_Policy_Committee", "passage_text": "Monetary Policy Committee. From Wikipedia, the free encyclopedia. The Monetary Policy Committee (MPC) is a committee of the Bank of England, which meets for three and a half days twelve times a year to decide the official interest rate in the United Kingdom (the Bank of England Base Rate). The Committee is responsible for formulating the United Kingdom's monetary policy, most commonly via the setting of the rate at it which it lends to banks (officially the Bank of England Base Rate or BOEBR for short)."}]