[{"url": "http://www.goodrx.com/guaifenesin-er/what-is", "passage_text": "Therapeutic Classification: Expectorant. Uses For guaifenesin ER. Guaifenesin is used to help clear mucus or phlegm (pronounced flem) from the chest when you have congestion from a cold or flu. It works by thinning the mucus or phlegm in the lungs. Children with these conditions may need a different kind of medicine. Also, guaifenesin should not be given to children and infants younger than 2 years of age unless you are directed to do so by your doctor. Do not give any over-the-counter (OTC) cough and cold medicine to a baby or child under 4 years of age."}, {"url": "http://www.webmd.com/drugs/2/drug-63818/mucinex-oral/details", "passage_text": "This product is usually not used for ongoing cough from smoking or long-term breathing problems (such as chronic bronchitis, emphysema) unless directed by your doctor. Guaifenesin is an expectorant. It works by thinning and loosening mucus in the airways, clearing congestion, and making breathing easier. If you are self-treating with this medication, it is important to read the package instructions carefully before you start using this product to be sure it is right for you. How to use Mucinex. Take this medication by mouth with or without food, as directed by your doctor, usually every 12 hours with a full glass of water. If you are self-treating, follow all directions on the product package. If you are uncertain about any of the information, ask your doctor or pharmacist"}, {"url": "http://www.everydayhealth.com/drugs/mucinex-dm", "passage_text": "5 Reviews. Mucinex DM is a cough medicine that contains dextromethorphan, a cough suppressant, and guaifenesin, an expectorant that helps loosen mucus in your throat and lungs. This combination of two drugs helps to loosen mucus or phlegm and thin out bronchial secretions, making coughs more productive. It is distributed by Reckitt Benckiser in two strengths: Mucinex DM has 30 milligrams of dextromethorphan and 600 mg of guaifenesin; Mucinex DM Maximum Strength has 60 mg of dextromethorphan and 1200 mg of guaifenesin. Tablets are formulated as extended release, which are meant to work for 12 hours."}, {"url": "http://www.goodrx.com/guaifenesin-er/what-is", "passage_text": "Guaifenesin is used to help clear mucus or phlegm (pronounced flem) from the chest when you have congestion from a cold or flu. Children with these conditions may need a different kind of medicine. Also, guaifenesin should not be given to children and infants younger than 2 years of age unless you are directed to do so by your doctor. Do not give any over-the-counter (OTC) cough and cold medicine to a baby or child under 4 years of age."}, {"url": "http://www.everydayhealth.com/drugs/mucinex", "passage_text": "Mucinex is the brand name of an expectorant drug called guaifenesin. It helps reduce chest congestions caused by colds, infections, or allergies. Mucinex works by thinning the mucus in the air passages. While Mucinex can help control symptoms, it doesn't treat the cause of congestion. Mucinex is sold both over-the-counter and with a doctor's prescriptio"}, {"url": "http://www.mayoclinic.org/drugs-supplements/guaifenesin-oral-route/description/DRG-20068720", "passage_text": "Descriptions. Guaifenesin is used to help clear mucus or phlegm (pronounced flem) from the chest when you have congestion from a cold or flu. It works by thinning the mucus or phlegm in the lungs. This medicine is available both over-the-counter (OTC) and with your doctor's prescription. "}, {"url": "https://en.wikipedia.org/wiki/Mucinex", "passage_text": "Guaifenesin INN /ɡwaɪˈfɛnɨsɪn/ or guaiphenesin (former BAN), also glyceryl guaiacolate, is an expectorant drug sold over the counter and usually taken orally to assist the bringing up (expectoration) of phlegm from the airways in acute respiratory tract infections. Guaifenesin is a centrally acting muscle relaxant used routinely in large-animal veterinary surgery. Guaifenesin is used in combination with, for example, propofol, since guaifenesin does not produce analgesia nor does it produce unconsciousness."}, {"url": "http://www.webmd.com/drugs/2/drug-63818/mucinex-oral/details", "passage_text": "Fluids will help to break up mucus and clear congestion. Tell your doctor if your condition returns, or if it is accompanied by fever, severe sore throat, rash, persistent headache, or if it persists or worsens after 7 days. These may be signs of a serious medical problem. How to use Mucinex. Take this medication by mouth with or without food, as directed by your doctor, usually every 12 hours with a full glass of water. If you are self-treating, follow all directions on the product package. If you are uncertain about any of the information, ask your doctor or pharmacist"}]