[{"url": "http://www.citehr.com/314142-lta-limit.html", "passage_text": "You can even give Rs 5.0 lakhs as LTA. But as per IT rule, Rs 15,000/- is allowed for exemption under IT Act. Over and above the same, it will be taxable. There is a block period of 04 years and any employee can claim maximum two times LTA in the block period of 04 years. If any employees claim more than two times it will be taxable; provided that employee comes under the limit of tax limit. For claim the LTA employee has need to produce the journey proof as per travel. rakeshkashyap. Minimum Limit is for LTA is 8.33% of Basic Salary of an employee per month and same will be calculated for the enitre period. There is no maximum limit defined regarding this. There is a block period of 04 years and any employee can claim maximum two times LTA in the block period of 04 years."}, {"url": "http://www.am22tech.com/lta-tax-rules/", "passage_text": "Carry forward your unspent LTA. If you have not claimed your LTA in first year, the amount is accumulated in your kitty. Hence, you can claim for a higher amount if you travel in next year. (year 1 amount year 2 amount) is available for LTA tax exemption claim in year 2. Double Dip LTA."}, {"url": "http://www.livemint.com/Money/0tRts2zZ66nq0wzjzzxGjN/DYK-how-to-make-the-most-out-of-LTA-claims.html", "passage_text": "A smarter way to get the best out of the LTA tax exemption is to claim your reimbursements in the same years as you get the exemptions. For this, keep a record in which years you claim your LTA tax exemption. Say, your yearly LTA travel reimbursement limit is Rs. 20,000. The current block of four years is 2014 to 2017. Suppose your LTA limit is Rs. 20,000 a year, and you have spent only Rs. 15,000. This means you can claim reimbursements and tax exemptions for only Rs. 15,000 in that year. The balance Rs. 5,000 gets added to next year’s limit of Rs. 20,000."}, {"url": "http://www.caclubindia.com/forum/leave-travel-allowance-lta--190273.asp", "passage_text": "Points: 231. I think you can change the LTA amount to avail the maximum benefit of tax exemption. Because u/s 10 (5) of income tax, the limit for LTA is not defined, only the limit for exemption is there (i t is limited to amount actually spent on travelling of employee and his family members. ). Also it is allowed twice in a block of four years"}, {"url": "http://www.charteredclub.com/leave-travel-allowance/", "passage_text": "The following amount is allowed to be claimed as LTA exemption:-. The taxpayer can claim exemption in respect of any 2 journeys in a block of 4 years. The Income Tax Department has created block of 4 years each and in each block, the exemption can be claimed twice. The Leave Travel Allowance (LTA)/Leave Travel Concession (LTC) amount computed above is allowed as an exemption for income tax purposes. Your employer may pay you a different amount depending on your position in the organisation."}, {"url": "http://www.livemint.com/Money/0tRts2zZ66nq0wzjzzxGjN/DYK-how-to-make-the-most-out-of-LTA-claims.html", "passage_text": "Note that in this block of four years (2014-17), you can claim your LTA tax exemption only once more. For the December 2015 travel, you will submit your travel bills in 2016, for the purpose of tax calculation for FY2015-16. It would be better, then, to claim both your reimbursements in 2015-16. Suppose your LTA limit is Rs. 20,000 a year, and you have spent only Rs. 15,000. This means you can claim reimbursements and tax exemptions for only Rs. 15,000 in that year. The balance Rs. 5,000 gets added to next year’s limit of Rs. 20,000."}, {"url": "http://www.citehr.com/402521-lta-limit.html", "passage_text": "LTA (Leave against Travel) has no limit as per Income tax law under section 10 (5) rule (2b). Any person can avail this facility two times in the block of 4 years. Current block is 2010 - 13. There are specific rules need to be followed to get the benefit. "}, {"url": "http://www.investmentyogi.com/taxes/all-about-leave-travel-allowance-lta-and-tax-treatment.aspx", "passage_text": "For rail or road, the maximum amount that can be claimed as exempt is the air conditioned first class rail fare to your destination by the shortest route. Know more about Tax Saving Investments. LTA and the Block of Four Years. You could claim LTA exemption in respect of any two journeys in a block of four years. The current block is 2010 to 2013. Say for example, you claim LTA exemption in 2010, then you could claim just one more till 2013."}]