[{"url": "http://dictionary.cambridge.org/dictionary/english/excruciating", "passage_text": "by Colin McIntosh, The Cambridge English Dictionary is constantly being updated and expanded to reflect the interests of our users. One area of particular interest to our users is that of English Language Teaching (ELT), and a number of ELT terms have recently been added to the dictionary. We’ve added some of the words that learners of English might. Read More ►."}, {"url": "http://www.merriam-webster.com/dictionary/excruciating", "passage_text": "Learn More About EXCRUCIATING. Thesaurus: All synonyms and antonyms for excruciating. Spanish Central: Spanish translation of excruciating. Nglish: Translation of excruciating for Spanish speakers. Britannica English: Translation of excruciating for Arabic speakers. "}, {"url": "http://www.thefreedictionary.com/excruciatingly", "passage_text": "(lit : = unbearably) painful → unertraeglich; unerträglich walking was excruciatingly → painful Das gehen bereitete Unertraegliche. (unerträgliche : = schmerzen) → fig, extremely; fuerchterlich fürchterlich → entsetzlich, excruciatingly Funny (urkomisch). [zum] schreien (inf ɪksˈkruːʃɪˌeɪtɪŋlɪ) → adv, see. adj atrocemente insopportabilmente (lit : = unbearably) painful → unertraeglich; unerträglich walking was excruciatingly → painful Das gehen bereitete Unertraegliche. (unerträgliche : = schmerzen) → fig, extremely; fuerchterlich fürchterlich → entsetzlich, excruciatingly Funny (urkomisch). zum schreien inf"}, {"url": "http://www.oxforddictionaries.com/definition/english/excruciating", "passage_text": "1 I call it seven of the most excruciating and awkward minutes of my life. 2  Farah is willing to bring out all the emotional guns to convince his readers of the horror of the situation, describing the scene in excruciating detail. 1 After enduring excruciating pain, a raging infection and almost a week in the hospital, I feel fortunate to be alive. 2  Needless to say, that if looks could kill, Darien would most certainly have died a painful and excruciating death."}, {"url": "http://www.macmillandictionary.com/dictionary/british/excruciating", "passage_text": "90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent. Close. A must for anyone with an interest in the changing face of language. The Macmillan Dictionary blog explores English as it is spoken around the world today. Definition and synonyms of excruciating from the online English dictionary from Macmillan Publishers Limited."}]