[{"url": "http://www.babycentre.co.uk/x553493/when-will-my-periods-start-after-ive-had-my-baby", "passage_text": "If you're formula-feeding your baby, you may start your periods again any time between five weeks and three months after giving birth. So you could be fertile just three weeks after having your baby. Learn more about contraception after having a baby."}, {"url": "http://www.thebump.com/a/how-long-after-birth-will-i-get-my-period", "passage_text": "If you’re not breastfeeding, your period could come back about six weeks after delivery, maybe even sooner, says Dr. Laura Riley."}, {"url": "http://snippets.com/how-soon-after-giving-birth-will-i-get-my-period.htm", "passage_text": "The length of time it takes a women to get her period after giving birth varies from women to women. For many women it can take about 2 to 3 months before your period returns to normal. If you are nursing than this time frame will last even longer. It could take about 6 months on average."}, {"url": "http://www.answers.com/Q/When_should_you_get_a_period_after_giving_birth", "passage_text": "Some women get a period about a month after giving birth. Some women do not get a period for months if they are fully breastfeeding. Just because you don't have a period does not mean you cannot get pregnant."}, {"url": "http://www.answers.com/Q/When_should_you_get_a_period_after_giving_birth", "passage_text": "Getting pregnant after birth   It is not necessary to have a period after giving birth to get pregnant again. That's part of the reason doctors tell you to wait si … x weeks before having intercourse again. The other reason is you have to give your uterus and cervix time to heal."}, {"url": "http://www.babycenter.com/404_when-will-i-get-my-period-after-my-baby-is-born_11728.bc", "passage_text": "Non-nursing moms: If you're formula-feeding your baby, you'll probably start menstruating one to three months after delivering your child. If you don't get your period by three months postpartum, talk to your doctor. She may want to check for secondary amenorrhea (that's when women with previously normal cycles don't have a period for three months), pregnancy, or other issues."}, {"url": "http://www.babycentre.co.uk/x553493/when-will-my-periods-start-after-ive-had-my-baby", "passage_text": "If you're still breastfeeding day and night, it can be up to a year before you have a period. If you're lucky enough to have a baby who sleeps through the night from an early age, your periods will probably return sooner. Your periods could start within three months to eight months."}]