[{"url": "http://www.nytimes.com/2014/10/19/realestate/financing-manufactured-homes.html", "passage_text": "The Consumer Financial Protection Bureau estimated the typical interest rate for a manufactured home loan in 2012 at 6.79 percent. By contrast, the average 30-year fixed rate on a conventional mortgage that year was 3.6 to 4.2 percent, according to HSH.com, a publisher of loan information."}, {"url": "http://www.chattelmortgage.net/mobile_home_loan_rates.html", "passage_text": "Fixed Rate Program. Fixed Rate Program. 6.500%. 7.100%. *The mobile home mortgage rates indicated above are reflective for both purchase and refinance, using an amount to finance of $250,000. The refinance rates reflect 90% to 80% loan to value, while purchase rates reflect a 10% to 20% down payment."}, {"url": "http://www.trulia.com/voices/Home_Buying/I_was_thinking_of_purchasing_a_mobile_home_what_i-158622", "passage_text": "The answers below are correct. Mobile homes that are not on owned land are almost impossible to be financed. The interest rate on mobile homes that are on their own lot can be financed with about 25% down and the interest rate is typically 1 percent higher than the frame built home. You can purchase the land and the mobile home together in one loan which is very common."}, {"url": "http://www.bills.com/mobile-home-loan/", "passage_text": "Currently, the average interest rate for a new 30 year fixed-rate loan is 6.3%, and the average FICO credit score is 723. So, if your credit score is better than 720, you should expect to qualify for an interest rate of around 6.3%, or possibly lower."}, {"url": "http://eslintl.com/MobileHomeLoans/MobileHomeRates.htm", "passage_text": "No more worrying about variable rates and how high your payment might go. Mobile Home lending is generally considered to be high risk even if your credit is good. In practical terms this means that the average mobile home loan carries an interest rate anywhere from 11% to 13%. Some are even as high as 18%! Many of our customers have lowered their rate as much as 6 - 7% saving them hundreds of dollars* every month! REDUCE your monthly payment."}]