[{"url": "http://www.petroleumhpv.org/petroleum-substances-and-categories", "passage_text": "Petroleum (crude oil) and raw natural gas and condensates are naturally occurring substances potentially containing thousands of individual chemicals called hydrocarbons. After crude oil is removed from the ground, it is sent to a refinery by pipeline, ship, or barge. In order to make finished petroleum products, these substances are separated at the refinery into different boiling fractions (i.e., gases, naphtha, residuum, etc.)."}, {"url": "https://en.wikipedia.org/wiki/Crude_oil", "passage_text": "Though crude oil is predominantly composed of various hydrocarbons, certain nitrogen heterocylic compounds, such as pyridine, picoline, and quinoline are reported as contaminants associated with crude oil, as well as facilities processing oil shale or coal, and have also been found at legacy wood treatment sites. Petroleum is recovered mostly through oil drilling (natural petroleum springs are rare). This comes after the studies of structural geology (at the reservoir scale), sedimentary basin analysis, reservoir characterization (mainly in terms of the porosity and permeability of geologic reservoir structures)."}, {"url": "http://toxtown.nlm.nih.gov/text_version/chemicals.php?id=73", "passage_text": "This process is why crude oil is called a fossil fuel. Crude oil is extracted and used to make fuel and other petroleum products. Hydraulic fracturing is one method used to extract oil and natural gas from deep shale formations. Crude oil is a mixture of a wide variety of constituents. It consists primarily of hydrocarbons, which are chemicals composed of hydrogen and carbon. Crude oil also contains hundreds of substances that include benzene, chromium, iron, mercury, nickel, nitrogen, oxygen, sulfur, toluene, and xylene. There are four types of crude oil: Class A: Light, Volatile Oils: These oils are highly fluid and highly toxic to humans and include jet fuel and gasoline. Class B: Non-Sticky Oils: These oils are waxy and less toxic to humans and include diesel fuel and light crude oil."}, {"url": "http://www.educationquizzes.com/gcse/chemistry/crude-oil-substances-from-crude-oil/", "passage_text": "Crude Oil-Substances from Crude Oil. Crude oil provides us with so many useful materials, some of them quite obvious like petrol and diesel. There are some, however, that are a little more obscure including bubble gum and lipsticks. "}, {"url": "http://science.howstuffworks.com/environmental/energy/oil-refining4.htm", "passage_text": "Fractional Distillation. The various components of crude oil have different sizes, weights and boiling temperatures; so, the first step is to separate these components. Because they have different boiling temperatures, they can be separated easily by a process called fractional distillation. The steps of fractional distillation are as follows:"}, {"url": "http://science.howstuffworks.com/environmental/energy/oil-refining1.htm", "passage_text": "1 Hydrocarbons contain a lot of energy. 2  Many of the things derived from crude oil like gasoline, diesel fuel, paraffin wax and so on take advantage of this energy. 3  Hydrocarbons can take on many different forms. 4  The smallest hydrocarbon is methane (CH 4), which is a gas that is a lighter than air. It is also known as petroleum. Crude oil is a fossil fuel, meaning that it was made natural­ly from decaying plants and animals living in ancient seas millions of years ago -- most places you can find crude oil were once sea beds."}, {"url": "https://answers.yahoo.com/question/index?qid=20090130072509AAuqnEk", "passage_text": "The soluble portion is known as bitumen. When heated to the right temperatures in the Earth's crust, (oil window ca. 60°-120°C, gas window ca.120°-150°C) some types of kerogen release crude oil or natural gas, collectively known as hydrocarbons (fossil fuels). Kerogen is a mixture of organic chemical compounds that make up a portion of the organic matter in sedimentary rocks.[1] It is insoluble in normal organic solvents because of the huge molecular weight (upwards of 1,000 Daltons) of its component compounds."}, {"url": "http://science.howstuffworks.com/environmental/energy/oil-refining1.htm", "passage_text": "­ Crude oil is the term for unprocessed oil, the stuff that comes out of the ground. It is also known as petroleum. Crude oil is a fossil fuel, meaning that it was made natural­ly from decaying plants and animals living in ancient seas millions of years ago -- most places you can find crude oil were once sea beds. Crude oils vary in color, from clear to tar-black, and in viscosity, from water to almost soli"}, {"url": "http://www.answers.com/Q/What_are_substances_that_are_extracted_from_crude_oil_without_being_changed", "passage_text": "Answer by Crazyman1569. Confidence votes 65. Crude Oil is the mixture of difference substances, substances are seprated from crude oil through the process of Fractional Distillation. the substances extracted from crude oil are as follow : Fuel Gas (LPG). Petrol. Naptha (used for plastics)"}]