[{"url": "http://www.thomsonsafaris.com/blog/fast-cheetah-run-bigcat-facts/", "passage_text": "On the exterior, the cheetah is the most slender of the big cats; its lightweight body (weighing about 80-140 lbs.), small head and long legs are designed for aerodynamics. Structurally, the cheetah has a unique, flexible spine, which allows for extreme flexion and extension while running at top speeds. Like Bolt, the cheetah is a sprinter – not a long distance runner – and can only attain high speeds in short bursts due to the tremendous drain on its energy resources."}, {"url": "http://animalstime.com/how-fast-can-cheetah-run-how-fast-can-cheetahs-run/", "passage_text": "Cheetah is actually the large-sized feline that inhabits across Africa, Asia and Middle East. These cats are by far the fastest runner on land in the animal kingdom. This article demonstrates you exactly how fast can cheetahs run. While studying facts about cheetah perhaps the first question arises is that how fast can a cheetah run! Very few people are aware of the exact speed of this fastest animal."}, {"url": "http://www.thomsonsafaris.com/blog/fast-cheetah-run-bigcat-facts/", "passage_text": "The cheetah can accelerate from 0 – 60 mph in 3 seconds, making it the fastest land animal on the planet. Yes, even faster than Usain Bolt. Like Bolt, the cheetah is a sprinter – not a long distance runner – and can only attain high speeds in short bursts due to the tremendous drain on its energy resources."}, {"url": "http://animals.howstuffworks.com/mammals/cheetah-speed.htm", "passage_text": "If a lion comes along, the cheetah will abandon its catch -- it can't fight off a lion, and chances are, the cheetah will lose its life along with its prey if it doesn't get out of there fast enough. Speed is never an issue, of course. Speed is how the cheetah survives as a predator that can't defend itself in a fight. The cheetah is the fastest land animal, achieving a top speed of about 70 mph (113 kph) [sources: Blue Lion, Defenders of Wildlife ]. This incredible speed comes with a price, though -- a cheetah is a rather puny large cat."}, {"url": "http://cheetah.org/about-the-cheetah/for-kids/", "passage_text": "The cheetah is the world’s fastest land animal. They can run 70 mph (or 110 kph), which is as fast as cars drive on the highway. The cheetah can reach its top speed in just 3 seconds! The cheetah has “semi non-retractable” claws (almost like dog claws) that work like the cleats on a football shoe to give the cheetah a lot of traction when running. The pads of most cats’ paws are soft, but the cheetah’s pads are hard kind of like the rubber on a tire."}, {"url": "http://www.thomsonsafaris.com/blog/fast-cheetah-run-bigcat-facts/", "passage_text": "Tweet. Tags: big cat, Big Cat Initiative, cause an uproar, cheetah, creature feature, infographic, run, speed, usain bolt, wildlife facts. The spectacle of a cheetah running at full speed is art; the anatomy and physique facilitating its speed and agility is genetic engineering at its best. Like Bolt, the cheetah is a sprinter – not a long distance runner – and can only attain high speeds in short bursts due to the tremendous drain on its energy resources."}, {"url": "https://www.highlightskids.com/science-questions/why-cant-human-run-fast-cheetah", "passage_text": "Art by Rocky Fuller. The cheetah is born with traits that let it run fast. In fact, over a short distance, it can run faster than any other animal. Here are a few of the main reasons. First, like horses and ostriches, the cheetah has short, strong upper legs and long, thin lower legs. The legs are light in weight, yet they have plenty of strength and leverage to push against the ground"}, {"url": "http://animals.howstuffworks.com/mammals/cheetah-speed1.htm", "passage_text": "Cheetahs: Born to Run. Any animal that can go from zero to 40 mph in three strides must have a very specialized body. The cheetah is so built for speed, it really can't do much else. A cheetah's speed starts with aerodynamics. Its slender body, small head, flattened rib cage and long, thin legs minimize air resistance. It typically only weighs about 125 pounds (57 kg), so its muscles don't have that much weight to carry."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/animals/cheetah.html", "passage_text": "Fun Cheetah Facts for Kids. Learn more about the cheetah by reading these fun cheetah facts. Cheetahs are part of the big cat family and while they can’t climb trees, they can run faster than any other land animal. Read on for more interesting cheetah information. The cheetah is the fastest land animal in the world. They can reach a top speed of around 113 km per hour. 1  A cheetah can accelerate from 0 to 113 km in just a few seconds. 2  Cheetahs are extremely fast however they tire quickly and can only keep up their top speed for a few minutes before they are too tired to continue. "}, {"url": "https://en.wikipedia.org/wiki/Cheetah", "passage_text": "The cheetah (Acinonyx jubatus) is a big cat in the subfamily Felinae that inhabits most of Africa and parts of Iran. It is the only extant member of the genus Acinonyx. The cheetah can run as fast as 109.4 to 120.7 km/h (68.0 to 75.0 mph), faster than any other land animal. Agility, rather than raw speed, accounts for much of the cheetah's ability to catch prey. Cheetahs can accelerate four times as fast as a human (thanks to greater muscle power) and can slow down by 14 kilometers per hour in one stride."}]