[{"url": "http://www.ehow.com/how-does_5006456_an-anemometer-work.html", "passage_text": "Sonic Anemometers. Ultrasound, or sonic, anemometers use sound waves to measure the velocity and direction of wind. They employ sound transmitters that send information to receivers, usually within a few inches of each other. Wind blowing between the two affects the sound, speeding it up or slowing it down.ind power professionals, meteorologists, physicists, farmers and even NASA scientists use anemometers to measure wind speed and direction. Anemometers come in many different forms, from simple to high-tech, with varying uses and degrees of accuracy."}, {"url": "http://www.explainthatstuff.com/anemometers.html", "passage_text": "Some anemometers have what looks like a small fan in place of the cups or propeller. As the wind blows, it spins the fan blades and a tiny generator to which they're attached, which works a bit like a bicycle dynamo.echanical anemometers. Some of the simplest anemometers work in exactly this way. They're little more than an electricity generator mounted in a sealed-up metal cylinder with an axle protruding upward from it. On top of the axle, there are several large cups that catch the wind and make the generator spin around."}, {"url": "http://www.explainthatstuff.com/anemometers.html", "passage_text": "Mechanical anemometers. Some of the simplest anemometers work in exactly this way. They're little more than an electricity generator mounted in a sealed-up metal cylinder with an axle protruding upward from it. On top of the axle, there are several large cups that catch the wind and make the generator spin around."}, {"url": "http://www.answers.com/Q/How_does_an_anemometer_work", "passage_text": "An anemometer has cups on it and when the wind blows the cups spin around and one of the cups is a different colour so you count how many times the coloured cup goes around. If it is a high number than that means that the wind speed is high. An anemometer is a weather instrument used to measure wind direction and speed. A simple anemometer does just that but its wind speed is manually measured. Edit."}, {"url": "http://www.ehow.com/how-does_5006456_an-anemometer-work.html", "passage_text": "Cup anemometers have three or four cups mounted on arms that can spin a vertical rod. Other types use propellers instead of cups. Wind will catch the cups or propellers and rotate them -- the rotations will be counted and wind speed calculated. These anemometers generally only measure wind speed.ind power professionals, meteorologists, physicists, farmers and even NASA scientists use anemometers to measure wind speed and direction. Anemometers come in many different forms, from simple to high-tech, with varying uses and degrees of accuracy."}, {"url": "http://www.answers.com/Q/How_does_an_anemometer_work", "passage_text": "An anemometer is a device used to measure wind speed. It is used by  atmospheric scientists or those gathering weather data.   Anemometer-An anemometer is a device for me … asuring wind  speed, and is one instrument used in a weather station. The term is  derived from the Greek word, anemos, meaning wind. An anemometer is a weather instrument used to measure wind direction and speed. A simple anemometer does just that but its wind speed is manually measured. Edit."}, {"url": "https://answers.yahoo.com/question/index?qid=20060622140354AAbu1IZ", "passage_text": "· just now. Report Abuse. An anemometer is a device for measuring the velocity or the pressure of the wind, and is one instrument used in a weather station. The term is derived from the Greek word anemos meaning wind. This Site Might Help You. RE: How does an anemometer work? wind speed can be measured with an instrument called an anemometer, which looks like a horizontal winmill with cups at the end of each spoke."}, {"url": "http://www.herebeanswers.com/2011/08/what-is-anemometer-how-does-it-work.html", "passage_text": "Anemometer is an apparatus for measuring the speed of wind. The commonest kind of anemometer is a kind of horizontal three-armed windmill, with a hollow hemispherical cup on the end of each arm. (See photo.). (See photo.). The pressure on the inside of a cup when it is back to wind overcomes the pressure on the rounded front of the cup on the opposite arm, and the cups revolve at rather more than two-fifths the speed of the wind. The mill moves a pointer round a graduated dial."}, {"url": "https://en.wikipedia.org/wiki/Anemometer", "passage_text": "An anemometer is a device used for measuring wind speed, and is a common weather station instrument. The term is derived from the Greek word anemos ,which means wind, and is used to describe any wind speed measurement instrument used in meteorology. The first known description of an anemometer given by Leon Battista Alberti in 1450. In 1450, the Italian art architect Leon Battista Alberti invented the first mechanical anemometer; in 1664 it was re-invented by Robert Hooke (who is often mistakenly considered the inventor of the first anemometer)."}]