[{"url": "http://www.kingdom.meridies.org/index.php", "passage_text": "The Kingdom of Meridies is the fifth kingdom of the SCA, founded in 1978 and covers the states of Alabama, Georgia, the panhandle of Florida, most of Tennessee and select areas of Kentucky."}, {"url": "http://www.thenazareneway.com/order_of_the_kingdom.htm", "passage_text": "3. And Jesus answered and said, Verily I say unto thee, O Mary, and to each of any disciples, The kingdom of Heaven is within you. But the time cometh when that which is within shall be made manifest in the without, for the sake of the world. 4. Order indeed is good, and needful, but before all things is love."}, {"url": "http://www.lifestreamteaching.com/Teaching%20pdf/Royal%20Priesthood.pdf", "passage_text": "Priests of God Series Lesson 1: A Royal Priesthood. kingdom of priests and a holy nation.' These are the words that you shall speak to the sons of Israel. (Exodus 19:5-6 NASB)God had chosen them to be 1) His own possession, 2) a kingdom of priests, 4)"}, {"url": "http://www.royal-houseofgeorgia.org/royal-orders", "passage_text": "This is available to both Georgian citizens and foreigners. The Royal Order of the Crown of the Georgian Kingdom was established on 4th July 2013 by Royal decree on the feast of the two Martyr Georgian Kings, St. Archil (744) and St. Luarsab (1622);"}, {"url": "http://www.kamehamehafestival.org/about/37/royal-order-of-kamehameha-i", "passage_text": "The royal decree not only established the Order’s mandate to defend the sovereignty of the Kingdom of Hawai‘i and uplift the Kanaka ‘Ōiwi (aboriginal peoples of Hawai‘i), but also empowered and authorized the Order to carry out this kuleana (responsibility)."}, {"url": "http://www.mamalahoa.org/about/royal-order-of-kamehameha-i", "passage_text": "Authorized by the 35th Article of the 1864 Constitution of the Kingdom of Hawai‘i, King Kamehameha V established the Order of Kamehameha I by Royal Decree on April 11, 1865 at the ‘Iolani Palace."}, {"url": "http://www.kamehamehafestival.org/about/37/royal-order-of-kamehameha-i", "passage_text": "Following the illegal overthrow of Queen Lili‘uokalani and the Kingdom in 1893, the Order was considered a threat to national security and suppressed by the Provisional Government and subsequent Republic of Hawai‘i."}, {"url": "http://www.kingdom.meridies.org/index.php", "passage_text": "The Kingdom of Meridies is a regional branch of the Society for Creative Anachronism (SCA), an international organization dedicated to researching and re-creating the arts and skills of pre-17th-century Europe."}, {"url": "http://www.mamalahoa.org/about/royal-order-of-kamehameha-i", "passage_text": "The Royal Decree was made with the endorsement of the King’s Privy Council of State and establishes the Order’s mission and authorizes the Order to carry out its kuleana, in perpetuity, as an institution of the Kingdom of Hawai‘i."}, {"url": "http://www.royal-houseofgeorgia.org/royal-orders", "passage_text": "Your possible eligibility for nomination as Knight or Lady will be submitted to the Board of the Order who will advise you in writing of his decision. The process leading to a candidate’s admission into the Royal Order of the Crown of the Georgian Kingdom is explained in detail in the Statutes of the Order."}]