[{"url": "http://www.publishtogetclients.com/how-long-should-your-book-be/", "passage_text": "Each page contains about 34 lines, with an average word count of 11 words per line, thus 375 words per page. Excluding endnotes and index, the book has about 200 pages of text, which means its total word count is about 74,000 words."}, {"url": "https://answers.yahoo.com/question/index?qid=20080226135441AAk3vCd", "passage_text": "Rating Newest Oldest. Best Answer: Industry standard is 250 words per page. So if you are working on a novel, take the number of words you have written and divide it by 250. That will tell you how many pages you have written."}, {"url": "http://www.publishtogetclients.com/how-long-should-your-book-be/", "passage_text": "1 You don’t want to overwrite and be forced to use a teeny font. 2  This trim size is good for only 200 to 250 words per printed book page. 3  This translates into just 20,000 to 25,000 words for a 100 page book, 30,000 to 42,500 words for a 150-page book, perhaps just 40,000 words for a 200-page book."}, {"url": "http://www.publishtogetclients.com/how-long-should-your-book-be/", "passage_text": "1 This trim size is good for only 200 to 250 words per printed book page. 2  This translates into just 20,000 to 25,000 words for a 100 page book, 30,000 to 42,500 words for a 150-page book, perhaps just 40,000 words for a 200-page book."}, {"url": "https://answers.yahoo.com/question/index?qid=20080226135441AAk3vCd", "passage_text": "Each page (one sided) in novel format averages 250 words. Of course this depends on the amount of dialogue. But the average is 250. So if you're writing something on any sort of word processor and want to know how many pages as a novel it would be than go to 'tools', then 'word count'."}, {"url": "http://www.megcabot.com/about-meg-cabot/frequently-asked-questions-getting-published/", "passage_text": "It depends on the font you are using, of course, but in general, 250-300 words per page. Therefore, a 55,000 word book should be about 200 manuscript pages. A 100,000 word book would be about 400. Editors like 12 point font."}, {"url": "http://www.publishedauthors.org/t5464-how-many-words-per-page-average", "passage_text": "Subject: How many words per page (average) Tue Jul 20, 2010 1:22 pm. Hi. How many words per page is a good average for a novel. My book King of Princes has 320 pages and an average of 280 words per page on font size 16, Times New Roman. Therefore most of the pages are over 300 words to a page. Page breaks etc bring down the average."}]