[{"url": "http://www.answers.com/Q/What_part_of_the_brain_interprets_smell", "passage_text": "For smell, the olfactory bulb (a brain structure directly above the nasal cavity and below the frontal lobe) interprets smell. The olfactory nerve endings are in the upper nas … al cavity and detect smells. For taste, lower primary somatic sensory cortex interpreters the sense of taste. Making the world better, one answer at a time. The part of the brain that interprets smell is the olfactory bulb. This brain structure is usually above the nasal cavity and below frontal lobe."}, {"url": "http://mhhe.com/biosci/ap/holeessentials/student/olc/graphics/hole06ehap_s/other/chap10outline.pdf", "passage_text": "Sensations (p. 262)1. Sensations are feelings that occur when the brain interprets sensory impulses.2. At the same time the sensation is being formed, the brain uses projection to sendthe sensation back to its point of origin so the person can pinpoint the area ofstimulation.D. Sensory Adaptation (p. 262)1. "}, {"url": "http://www.ck12.org/user:ZXpvdWJpbmFAaG90bWFpbC5jb20./section/Sense-Organs-and-Sensory-Perception-%253A%253Aof%253A%253A-Nervous-System/", "passage_text": "For example, regions of the occipital lobe interpret nerve impulses that come from the sensory receptors of the eyes, and regions of the temporal lobe interpret sensory information from the ears through the nerves that enter the brain in these areas, as shown in Figure below. Taste is one of the two main chemical senses, the other being smell. There are at least four types of taste receptors on the tongue. Taste stimuli from each receptor type send information to a different region of the brain. The four well-known receptors detect sweet, salt, sour, and bitter."}, {"url": "https://quizlet.com/1874892/sensory-organs-flash-cards/", "passage_text": "Steps of Olfaction. Molecules are dispersed through the air entering the nose. They dissolve in the moisture of the nasal tissue and bind with olfactory receptors (stimulated). Nerve impulses are sent through cranial nerve to the olfactory area in the temporal lobe and the smell is perceived. "}, {"url": "http://nortonhealthcare.adam.com/pages/guide/reftext/html/nerv_sys_fin.html", "passage_text": "These roots become nerves that innervate (transmit nerve impulses to) muscles and organs throughout the body. Twelve pairs of cranial nerves transmit from special sensory receptors information on the senses of balance, smell, sight, taste, and hearing. The thalamus is a relay and preprocessing station for the many nerve impulses that pass through it. Impulses carrying similar messages are grouped in the thalamus, then relayed to the appropriate brain areas. The epithalamus is the most dorsal (posterior) portion of the diencephalon."}, {"url": "https://www.aans.org/Patient%20Information/Conditions%20and%20Treatments/Anatomy%20of%20the%20Brain.aspx", "passage_text": "Anatomy of the Brain. The brain serves many important functions. It gives meaning to things that happen in the world surrounding us. Through the five senses of sight, smell, hearing, touch and taste, the brain receives messages, often many at the same time. The brain controls thoughts, memory and speech, arm and leg movements, and the function of many organs within the body."}, {"url": "http://www.tastescience.com/abouttaste2.html", "passage_text": "Smell, the nose, and the brain. Molecules of the food you are eating move through the back of the throat and reach olfactory nerve endings in the roof of the nose. The molecules bind to these nerve endings, which then signal the olfactory bulb to send smell messages to two critical parts of the brain: Of course, we have to know what we are eating, so taste, smell, and trigeminal messages meet in a part of the brain called the insula (not shown in the image above), which identifies what the flavor is."}, {"url": "http://www.answers.com/Q/Where_does_the_brain_interpret_smell", "passage_text": "The part of the brain that interprets smell is the olfactory bulb.  This brain structure is usually above the nasal cavity and below  frontal lobe. The lobe that contorls hearing is the temporal lobe, the lobe that deals with pain, pressure, temperature, touch … , and part of taste is the parietal lobe.   The lobe that controls consciousness and primary body movements is the frontal lobe.   The temporal lobe is said to control smell."}]