[{"url": "http://dos.myflorida.com/elections/for-voters/voter-registration/voter-information-as-a-public-record/", "passage_text": "Voter registration information is public record in Florida with a few exceptions. Information such as your social security number, driver’s license number, and the source of your voter registration application cannot be released or disclosed to the public under any circumstances. Your signature can be viewed, but not copied. 1 You submit a written request to each agency that may have your information such as your address, photo, and date of birth. 2  However, you must fall within one of the statutorily designated classes of high-risk professionals."}, {"url": "http://dailycaller.com/2014/12/11/florida-gets-another-chance-to-appeal-for-the-right-to-clean-voter-rolls-they-should-take-it/", "passage_text": "Those challenging Florida’s law argued that this 90-day freeze should apply as well to any systematic effort to remove non-citizens – meaning foreign nationals, whether lawfully or unlawfully present in the U.S. – from the voter rolls. Pause for a moment to consider just how extraordinary that argument is. Even more astonishing is the fact that the Florida Secretary of State has not committed to appealing this ruling. It is imperative that he do so at once. This convoluted legal story began in 2012, when Florida sought to implement a program to identify and remove non-citizens from its rolls."}, {"url": "http://articles.sun-sentinel.com/2013-10-09/news/fl-voter-roll-purge-20131009_1_voter-rolls-purge-state-ken-detzner", "passage_text": "October 9, 2013 | By Anthony Man, Sun Sentinel. LAUDERHILL — The state's top elections official was in South Florida on Wednesday to push one of Gov. Rick Scott's most controversial moves: An effort to purge non-citizens from the voter rolls. For the first time in South Florida, Detzner and elections division chief Maria Matthews described their plan to compare the state's registered voters with information in the state driver's license database and a federal database of non-citizens before sending the information to elections supervisors for action."}, {"url": "http://www.usatoday.com/story/news/nation/2014/01/14/florida-purge-voter-rolls/4470685/", "passage_text": "Florida's latest voter purge bid draws criticism. TALLAHASSEE, Fla. — The NAACP and other groups are calling on Gov. Rick Scott to stop a renewed attempt to purge people who aren't U.S. citizens from the state's voter rolls. Post to Facebook. Cancel Send. "}, {"url": "http://dailycaller.com/2014/12/11/florida-gets-another-chance-to-appeal-for-the-right-to-clean-voter-rolls-they-should-take-it/", "passage_text": "A federal appeals panel recently issued an astonishing decision holding that federal law forbids the State of Florida to remove non-citizens from its voter rolls in the 90 days before a federal election. Even more astonishing is the fact that the Florida Secretary of State has not committed to appealing this ruling. It is imperative that he do so at once. This convoluted legal story began in 2012, when Florida sought to implement a program to identify and remove non-citizens from its rolls."}, {"url": "http://www.flgov.com/2012/06/06/frequently-asked-questions-about-protecting-citizen-voter-rights-in-florida/", "passage_text": "The process to remove non-U.S. citizens from Florida’s voter database actually began in Spring 2011. A few months later, in September 2011, Florida elections officials asked the U.S. Department of Homeland Security (DHS) for access to the Systematic Alien Verification for Entitlements (SAVE) database. Without access to this data, or some new evidence from other sources (such as court records or other official documents) that can identify non-citizens, the federal government is preventing Florida from identifying and removing non-U.S. citizens from the voter rolls."}, {"url": "http://www.flgov.com/2012/06/06/frequently-asked-questions-about-protecting-citizen-voter-rights-in-florida/", "passage_text": "Florida’s Department of State isn’t removing anyone from the voter registration rolls. Only independent elections supervisors in each county may remove voters from the voter rolls. But Florida elections officials have an obligation to protect the right of eligible voters to cast a ballot, and that includes preventing non-citizens from participating in an election. Without access to this data, or some new evidence from other sources (such as court records or other official documents) that can identify non-citizens, the federal government is preventing Florida from identifying and removing non-U.S. citizen"}, {"url": "http://www.flgov.com/2012/06/06/frequently-asked-questions-about-protecting-citizen-voter-rights-in-florida/", "passage_text": "Florida will continue to protect the rights of citizens to vote. That includes, but is not limited to, ensuring the voter rolls are accurate, and forwarding credible and reliable information whenever such information is discovered. Without access to this data, or some new evidence from other sources (such as court records or other official documents) that can identify non-citizens, the federal government is preventing Florida from identifying and removing non-U.S. citizens from the voter rolls."}, {"url": "http://www.tampabay.com/news/publicsafety/crime/of-7000-felons-purged-from-voting-rolls-many-are-democrats-blacks/1231444", "passage_text": "The system for removing felons from the Florida voter rolls is similar to that for noncitizens, who must respond to a certified letter within 30 days or face removal. Soon after taking office, Gov. Rick Scott asked the state's chief elections official, Kurt Browning, whether noncitizens were voting illegally in Florida. Pockets of Tampa and Jacksonville are home to the most purged voters in 2012, according to voters' ZIP codes. Jacksonville, the state's largest city, accounts for 928 removals, about one of seven felons swept from the rolls, even though the rate of violent crime declined there by 3.3 percent from 2010 to 2011."}, {"url": "http://dos.myflorida.com/elections/for-voters/voter-registration/voter-information-as-a-public-record/", "passage_text": "Your voter registration information may not be publicly disclosed or made available, provided: 1  You are or become a participant in the Attorney General’s Address Confidentiality Program for victims of domestic violence and stalking. 2  See section 97.0585(3) and sections 741.401-741.465, Florida Statutes. 1 You submit a written request to each agency that may have your information such as your address, photo, and date of birth. 2  However, you must fall within one of the statutorily designated classes of high-risk professionals."}]