[{"url": "http://culinaryarts.about.com/od/glossary/g/Daube.htm", "passage_text": "What distinguishes a traditional daube from an stew is that a daube would be cooked in an earthenware vessel called a daubiere, daubière which is shaped in such a way as to inhibit evaporation of the cooking. liquid To make a daube of beef a la bearnaise, béarnaise the bottom of the daubiere daubière would be lined with strips. Of ham and instead of a single piece, of meat the meat would be cut-into 2 inch cubes which were individually larded with small strips of. pork fat"}, {"url": "http://www.oxforddictionaries.com/definition/english/daube", "passage_text": "(Of meat) braised slowly in wine. Example sentences. 1  Meat cooked ‘en daube’ is usually braised in red wine stock with root vegetables and herbs. 2  The cooked foodstuff was then removed to be eaten ‘dry’ (without the sauce) and often cold. 3  If the food was eaten in its sauce, it ceased to be en daube and became en compote. 1 My main course was a daube of beef on a bed of creamed potatoes, with glazed vegetables and a sweet jus. 2  Beef with carrots was braised to a deep, glossy brown, like a daube, but was a bit on the ragged side and less melting than would be perfect."}, {"url": "http://culinaryarts.about.com/od/glossary/g/Daube.htm", "passage_text": "What distinguishes a traditional daube from an stew is that a daube would be cooked in an earthenware vessel called a daubiere, daubière which is shaped in such a way as to inhibit evaporation of the cooking. Liquid cooks would even go so far as to seal the lid of the pot with paste made of flour and. water To make a daube of beef a la bearnaise, béarnaise the bottom of the daubiere daubière would be lined with strips. Of ham and instead of a single piece, of meat the meat would be cut-into 2 inch cubes which were individually larded with small strips of. pork fat"}, {"url": "http://culinaryarts.about.com/od/glossary/g/Daube.htm", "passage_text": "The word daube (pronounced dobe) traditionally refers to a cooking technique for stewing meat such as beef or lamb or even turkey or pheasant. To make a daube of beef a la bearnaise, béarnaise the bottom of the daubiere daubière would be lined with strips. Of ham and instead of a single piece, of meat the meat would be cut-into 2 inch cubes which were individually larded with small strips of. pork fat"}, {"url": "https://en.wikipedia.org/wiki/Daube", "passage_text": "Daube is a classic Provencal (provençal or more, Broadly) french stew made with inexpensive beef braised in, wine, vegetables, garlic and herbes De, provence and traditionally cooked in a, daubiere daubière a. Braising pan a traditional daubiere daubière is a terracotta pot that, resembles a pitcher with. a concave lid Variations also call for olives, prunes, and flavoring with duck fat, vinegar, brandy, lavender, nutmeg, cinnamon, cloves, juniper berries, or orange peel. For best flavor, it is cooked in several stages, and cooled for a day after each stage to allow the flavors to meld together."}, {"url": "http://www.merriam-webster.com/dictionary/daube", "passage_text": "Definition of DAUBE. : a stew of braised meat, vegetables, herbs, and spices. ADVERTISEMENT."}, {"url": "http://www.oxforddictionaries.com/definition/english/daube", "passage_text": "A stew of meat, typically beef, braised slowly in wine: a good daube of boeuf with fresh noodles. More example sentences. 1  When I left university, vaguely aware that things were moving on, I found Elizabeth David and tried to make boeuf bourguignon and daubes without success. 1 My main course was a daube of beef on a bed of creamed potatoes, with glazed vegetables and a sweet jus. 2  Beef with carrots was braised to a deep, glossy brown, like a daube, but was a bit on the ragged side and less melting than would be perfect."}, {"url": "http://www.definitions.net/definition/daube", "passage_text": "Daube is a classic Provencal provençal stew made with inexpensive beef braised in, wine, vegetables, garlic and herbes De, provence and traditionally cooked in a, daubiere daubière a. braising pan "}]