[{"url": "http://dogs.about.com/od/becomingadogowner/a/costofdogs.htm", "passage_text": "Plan on going to the vet for wellness checkups once or twice a year at a cost of at least $150-300 yearly. Annual blood work can add about $100-200. Dental cleanings are often recommended once a year and usually cost at least $300. Of course, vet costs will be higher if your dog develops a health problem."}, {"url": "https://ca.answers.yahoo.com/question/index?qid=20090325111801AAWQwbc", "passage_text": "You should have up to $200 sitting around just for a regular vet visit and about $1000 AT LEAST in a savings account for in case your dog has a medical issue sometime down the road. Wouldn't pay anything more than about $100 for a spay/neuter. Blood work would be an addional $100 or so. Best just to shop around."}, {"url": "http://dogs.about.com/od/becomingadogowner/a/costofdogs.htm", "passage_text": "Vet bills for a young puppy will likely range from $100-300 depending on the puppy's health and the region in which you live. Puppies need to visit the vet every few week until about 16 weeks of age, and each visit can run you $100-300 depending on your pup's needs. Your next major expense will be dog supplies."}, {"url": "https://www.policygenius.com/blog/pet-health-care-costs/", "passage_text": "If you take your dog to the vet and the vet tells you it has cancer and you don’t want to deal with it or you can’t afford it, you can say let’s euthanize it and you are 100% in your rights to do that.” In the future, pet health care could fall under anti-cruelty laws."}, {"url": "http://www.howmuchisit.org/emergency-vet-cost/", "passage_text": "1 According to the site, the price of emergency vet visit can range anywhere from $100 to $300. 2  Your pet will be placed in a specialized table where it can rest and will be checked by the veterinarian."}, {"url": "http://www.howmuchisit.org/emergency-vet-cost/", "passage_text": "1 VetInfo.com is a website that shows several pieces of information regarding trips to the vet as well as how much it will cost you to take your pet to an emergency vet. 2  According to the site, the price of emergency vet visit can range anywhere from $100 to $300."}, {"url": "http://www.wikihow.com/Have-a-Successful-Visit-to-the-Vet", "passage_text": "1 If your pet has had problems with vomiting, diarrhea or urine, bring a sample to the vet with you and take your dog outside to relieve itself before bringing it into the vet."}, {"url": "http://www.healthline.com/health-slideshow/9-warning-signs-dog-needs-veterinarian", "passage_text": "Even in an overweight dog, sudden loss of weight should prompt you to take him to the vet. Losing weight quickly and unexpectedly could indicate a serious health condition. A 10 percent change in weight is something to bring to your vet’s attention. In small dogs, this may be as little as a one pound weight loss."}]