[{"url": "http://www.medicinenet.com/eosinophilic_esophagitis/page2.htm", "passage_text": "The esophagus is a muscular tube that propels swallowed food from the mouth into the stomach. Esophagitis refers to inflammation of the esophagus that has several causes. 1  The most common cause of esophagitis is acid reflux, which most frequently results in heartburn. 2  Acid reflux can also cause ulcers in the inner lining of the esophagus. Doctors believe that eosinophilic esophagitis is a type of esophagitis that is caused by an allergen for two reasons. First, eosinophils are prominent in other diseases associated with allergies such as asthma, hay fever, allergic rhinitis, and atopic dermatitis."}, {"url": "http://patients.gi.org/topics/eosinophilic-esophagitis/", "passage_text": "Eosinophilic esophagitis (also known as EoE) is a disease characterized by the presence of a large number of a special type of white blood cell, the eosinophil, that can cause inflammation in the esophagus. "}, {"url": "http://rarediseases.org/rare-diseases/eosinophilic-esophagitis/", "passage_text": "Causes. Eosinophilic esophagitis is caused by the presence of a large number of eosinophils in the esophagus. The production and accumulation of eosinophils may be caused by many factors such as particular foods or environmental irritants in some affected individuals. Eosinophilic esophagitis (EoE) is a chronic disorder of the digestive system in which large numbers of a particular type of white blood cell called eosinophils are present in the esophagus. The esophagus is the tube that carries food from the mouth to the stomach."}, {"url": "http://answers.webmd.com/answers/1177315/what-is-eosinophilic-esophagitis", "passage_text": "A. Eosinophilic esophagitis is an inflammatory condition in which the wall of the esophagus becomes filled with large numbers of eosinophils, a type of white blood cell. The esophagus is a muscular tube that propels swallowed food from the mouth into the stomach. Doctors believe that eosinophilic esophagitis is a type of esophagitis that is caused by allergy for two reasons. First eosinophils are prominent in other diseases associated with allergy such as asthma, hay fever, allergic rhinitis, and atopic dermatitis."}, {"url": "http://answers.webmd.com/answers/1177315/what-is-eosinophilic-esophagitis", "passage_text": "Esophagitis refers to inflammation of the esophagus that have several causes. The most common cause of esophagitis is acid reflux which most frequently results in heartburn, although acid reflux also can cause ulcers in the inner lining of the esophagus. Doctors believe that eosinophilic esophagitis is a type of esophagitis that is caused by allergy for two reasons. First eosinophils are prominent in other diseases associated with allergy such as asthma, hay fever, allergic rhinitis, and atopic dermatitis."}, {"url": "https://en.wikipedia.org/wiki/Eosinophilic_esophagitis", "passage_text": "Eosinophilic esophagitis (eosinophilic oesophagitis) , also known as allergic oesophagitis, is an allergic inflammatory condition of the esophagus that involves eosinophils, a type of white blood cell. Symptoms are swallowing difficulty, food impaction, and heartburn. "}, {"url": "http://idahogastro.com/eosinophilic-esophagitis/", "passage_text": "Esophagitis refers to inflammation of the esophagus that have several causes. The most common cause of esophagitis is acid reflux which most frequently results in heartburn, although acid reflux also can cause ulcers in the inner lining of the esophagus. Doctors believe that eosinophilic esophagitis is a type of esophagitis that is caused by allergy for two reasons. First eosinophils are prominent in other diseases associated with allergy such as asthma, hay fever, allergic rhinitis, and atopic dermatitis."}, {"url": "http://www.mayoclinic.org/diseases-conditions/eosinophilic-esophagitis/basics/causes/con-20035681", "passage_text": "Eosinophilic esophagitis is an allergic reaction in which the lining of your esophagus reacts to allergens, such as food or pollen. Eosinophils are a normal type of white blood cells present in your digestive tract, but in eosinophilic esophagitis they multiply in your esophagus. Previously, doctors thought eosinophilic esophagitis symptoms were caused by gastroesophageal reflux disease (GERD), but they now recognize it as a distinct condition with very different causes."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_eosinophilic_esophagitis", "passage_text": "Dietary management. There is also some thought that food allergies may be a cause of eosinophilic esophagitis. However, which foods might be the cause has yet to be determined. The more common foods associated with foods allergies in general are milk, eggs, nuts, beef, wheat, fish, shellfish, corn and soy. "}]