[{"url": "http://www.icoachmath.com/math_dictionary/Geometric_Sequence.html", "passage_text": "Definition of Geometric Sequence. Geometric sequence is a sequence in which each term after the first term a is obtained by multiplying the previous term by a constant r, called the common ratio. It is obvious that a ≠ 0 and r ≠ 0 or 1. Example: 1, 2, 4, 8, 16, 32, . . . is a geometric sequence. 1 Step1: Geometric sequence is a sequence in which each term after the first term is obtained by multiplying the previous term by a constant. 2  Step 2: 2, 4, 6, 8, 16, 32, 64,...... is the only sequence in the options in which each term is obtained by multiplying the previous term by 2."}, {"url": "http://www.definitions.net/definition/geometric%20progression", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: geometric progression (Noun). A sequence in which each term except the first is obtained from the previous by multiplying it by a constant value, known as the common ratio of the geometric progression. The sum of the terms of a geometric progression, or of an initial segment of a geometric progression, is known as a geometric series. Thus, the general form of a geometric sequence is and that of a geometric series is where r ≠ 0 is the common ratio and a is a scale factor, equal to the sequence's start value."}, {"url": "http://www.definitions.net/definition/geometric%20progression", "passage_text": "For example, the sequence 2, 6, 18, 54, ... is a geometric progression with common ratio 3. Similarly 10, 5, 2.5, 1.25, ... is a geometric sequence with common ratio 1/2. The sum of the terms of a geometric progression, or of an initial segment of a geometric progression, is known as a geometric series. Thus, the general form of a geometric sequence is and that of a geometric series is where r ≠ 0 is the common ratio and a is a scale factor, equal to the sequence's start value."}, {"url": "https://en.wikipedia.org/wiki/Geometric_progression", "passage_text": "For example, the sequence 2, 6, 18, 54, ... is a geometric progression with common ratio 3. Similarly 10, 5, 2.5, 1.25, ... is a geometric sequence with common ratio 1/2. Examples of a geometric sequence are powers r of a fixed number r, such as 2 and 3. The general form of a geometric sequence is. 1, −3, 9, −27, 81, −243, ... is a geometric sequence with common ratio −3. The behaviour of a geometric sequence depends on the value of the common ratio. If the common ratio is: 1  Positive, the terms will all be the same sign as the initial term."}, {"url": "http://www.audioenglish.org/dictionary/geometric_progression.htm", "passage_text": "Hypernyms (geometric progression is a kind of...): patterned advance; progression (a series with a definite pattern of advance). Domain category: math; mathematics; maths (a science (or group of related sciences) dealing with the logic of quantity and shape and arrangement). Meaning: (mathematics) a progression in which each term is multiplied by a constant in order to obtain the next term. Classified under: Nouns denoting groupings of people or objects. Context example: 1-4-16-64-256- is the start of a geometric progression."}, {"url": "http://www.definitions.net/definition/geometric%20progression", "passage_text": "In mathematics, a geometric progression, also known as a geometric sequence, is a sequence of numbers where each term after the first is found by multiplying the previous one by a fixed, non-zero number called the common ratio. The sum of the terms of a geometric progression, or of an initial segment of a geometric progression, is known as a geometric series. Thus, the general form of a geometric sequence is and that of a geometric series is where r ≠ 0 is the common ratio and a is a scale factor, equal to the sequence's start value."}, {"url": "http://www.audioenglish.org/dictionary/geometric_progression.htm", "passage_text": "• GEOMETRIC PROGRESSION (noun). The noun GEOMETRIC PROGRESSION has 1 sense: 1. (mathematics) a progression in which each term is multiplied by a constant in order to obtain the next term. Familiarity information: GEOMETRIC PROGRESSION used as a noun is very rare. Dictionary entry details. Meaning: (mathematics) a progression in which each term is multiplied by a constant in order to obtain the next term. Classified under: Nouns denoting groupings of people or objects. Context example: 1-4-16-64-256- is the start of a geometric progression."}, {"url": "http://www.investopedia.com/terms/g/geometricmean.asp", "passage_text": "DEFINITION of 'Geometric Mean'. The average of a set of products, the calculation of which is commonly used to determine the performance results of an investment or portfolio. Technically defined as the 'n'th root product of 'n' numbers, the formula for calculating geometric mean is most easily written as: "}, {"url": "http://www.merriam-webster.com/dictionary/geometric%20progression", "passage_text": "Definition of GEOMETRIC PROGRESSION. : a sequence (as 1, 1⁄2, 1⁄4) in which the ratio of a term to its predecessor is always the same —called also geometrical progression, geometric sequence. ADVERTISEMENT. Next Word in the Dictionary: geometrics Previous Word in the Dictionary: geometric plane All Words Near: geometric progression. 2 ENTRIES ... "}]