[{"url": "http://bloodbrainbarrier.jhu.edu/", "passage_text": "About. The blood brain barrier (BBB) is a dynamic interface that separates the brain from the circulatory system and protects the central nervous system (CNS) from potentially harmful chemicals while regulating transport of essential molecules and maintaining a stable environment. "}, {"url": "http://www.answers.com/Q/What_structure_in_the_brain_forms_the_blood_brain_barrier", "passage_text": "Making the world better, one answer at a time. Blood brain barrier is formed by specific nueroglial cells called astrocytes.These astrocytes are of two types :1) Fibrous astrocytes and 2) protoplasmic astrocytes. The fibres of these astrocytes forms a network with capillaries of blood vessels that supply blood to brain. "}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "The blood–brain barrier is formed by brain endothelial cells, which are connected by tight junctions with an extremely high electrical resistivity of at least 0.1 ω⋅m. The BBB is distinct from the quite similar blood–cerebrospinal-fluid barrier, which is a function of the choroidal cells of the choroid plexus, and from the blood–retinal barrier, which can be considered a part of the whole realm of such barriers. Several areas of the human brain are not on the brain side of the BBB."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0000023.html", "passage_text": "The blood–brain barrier regulates brain extracellular fluid. Brain capillaries form a tight barrier except in specialised areas. Tight junctions restrict paracellular movement of substances across the blood–brain barrier. Astrocytes contribute to differentiation of the blood–brain barrier. Transport across the blood–brain barrier may be passive or active."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0000023.html", "passage_text": "The barrier function of the blood–brain barrier is due to: (1) tight junctions that restrict movement of substances between the endothelial cells, (2) specific transport proteins that determine which substances can cross the barrier transcellularly and (3) enzymes that may degrade or alter substances prior to passage. Brain capillaries form a tight barrier except in specialised areas. Tight junctions restrict paracellular movement of substances across the blood–brain barrier. Astrocytes contribute to differentiation of the blood–brain barrier. Transport across the blood–brain barrier may be passive or active."}, {"url": "http://medical-dictionary.thefreedictionary.com/Blood+brain+barrier", "passage_text": "blood-brain barrier, n barrier formed by epithelial cells in the capillaries that supply the brain and central nervous system. This barrier selectively allows entry of substances such as glucose, some ions, and oxygen, while blocking entry of other substances. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15207256", "passage_text": "The blood-brain barrier (BBB) is a diffusion barrier, which impedes influx of most compounds from blood to brain. Three cellular elements of the brain microvasculature compose the BBB-endothelial cells, astrocyte end-feet, and pericytes (PCs). Tight junctions (TJs), present between the cerebral endothelial cells, form a diffusion barrier, which selectively excludes most blood-borne substances from entering the brain. "}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "The blood–brain barrier occurs along all capillaries and consists of tight junctions around the capillaries that do not exist in normal circulation. The BBB is distinct from the quite similar blood–cerebrospinal-fluid barrier, which is a function of the choroidal cells of the choroid plexus, and from the blood–retinal barrier, which can be considered a part of the whole realm of such barriers. Several areas of the human brain are not on the brain side of the BBB."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0000023.html", "passage_text": "The blood–brain barrier consists of endothelial cells lining brain capillaries. It serves to restrict and control the movement of substances between the general circulation and brain extracellular fluid. Brain capillaries form a tight barrier except in specialised areas. Tight junctions restrict paracellular movement of substances across the blood–brain barrier. Astrocytes contribute to differentiation of the blood–brain barrier. Transport across the blood–brain barrier may be passive or active."}, {"url": "https://en.wikipedia.org/wiki/Blood%E2%80%93brain_barrier", "passage_text": "The blood–brain barrier allows the passage of water, some gases, and lipid-soluble molecules by passive diffusion, as well as the selective transport of molecules such as glucose and amino acids that are crucial to neural function. The BBB is distinct from the quite similar blood–cerebrospinal-fluid barrier, which is a function of the choroidal cells of the choroid plexus, and from the blood–retinal barrier, which can be considered a part of the whole realm of such barriers. Several areas of the human brain are not on the brain side of the BBB."}]