[{"url": "http://medical-dictionary.thefreedictionary.com/Eponyms", "passage_text": "a name or phrase formed from or including a person's name, such as Hodgkin's disease, Cowper's glands, or Schick test. adj., adj eponym´ic, epon´ymous. Medtalk A syndrome, lesion, surgical procedure or clinical sign that bears the name of the author who first described the entity, or less commonly, the name of the index Pt(s) in whom the lesion was first described."}, {"url": "http://www.ajronline.org/doi/full/10.2214/AJR.07.7137", "passage_text": "1A, 1B, and 1C), Askin tumor appears as a heterogeneous and large mass in the chest wall. Chest wall muscle involvement and pleural invasion are frequent, with rib destruction seen in up to 63% of patients [ 3 ]. Areas of hemorrhage and necrosis are common. Lungs and bones are common metastatic sites [ 3 ]. Eponyms were used as a simple way to describe different tumors and tumorlike lesions at the beginning of our understanding of those entities and to acknowledge contributions of pioneers who helped to improve our understanding."}, {"url": "http://www.ajronline.org/doi/full/10.2214/AJR.07.7137", "passage_text": "The term “eponym” originates from the Greek word “eponymous,” which means “named after.” An eponym was a simple way to describe tumors and tumorlike lesions that initially were not well understood. Eponyms were used as a simple way to describe different tumors and tumorlike lesions at the beginning of our understanding of those entities and to acknowledge contributions of pioneers who helped to improve our understanding."}, {"url": "http://www.thefreedictionary.com/eponym", "passage_text": "eponym. n. 1. a name, esp a place name, derived from the name of a real or mythical person, as for example Constantinople from Constantine I. 2. the name of the person from which such a name is derived: in the Middle Ages, Brutus was thought to be the eponym of Britain . eponym. 1. the name of a real or legendary person that has been applied to a thing, institution, etc, as atlas. 2. the name of a person that is used to describe a time or period, as the Augustan Age. — eponymic, eponymous, adj."}, {"url": "http://www.vetstreet.com/our-pet-experts/the-dos-and-donts-of-helping-a-friend-whose-pet-has-cancer", "passage_text": "The Bible, Glamour and parenting websites all have one thing in common: eponymous lists of dos and don’ts. But when it comes to supporting someone whose pet has a potentially life-threatening illness, such as cancer, there aren't too many primers out there to tell you what you should and should not do — or even say. "}, {"url": "http://medical-dictionary.thefreedictionary.com/eponym", "passage_text": "Etymology: Gk, epi, above, onyma, name. a name for a disease, organ, procedure, or body function that is derived from the name of a person, usually a physician or scientist who first identified the condition or devised the object bearing the name. Examples include fallopian tube, Parkinson's disease, and Billing's method. "}, {"url": "http://www.ajronline.org/doi/full/10.2214/AJR.07.7137", "passage_text": "Radiography is the principal imaging technique to diagnose Paget disease, and the disease can be in a lytic, mixed, or blastic phase (Fig. 13). Most cases of Paget disease are in the mixed phase, which is characterized by thickening of trabeculae and cortex [ 44 ]. Eponyms were used as a simple way to describe different tumors and tumorlike lesions at the beginning of our understanding of those entities and to acknowledge contributions of pioneers who helped to improve our understanding."}, {"url": "http://www.ajronline.org/doi/full/10.2214/AJR.07.7137", "passage_text": "Askin tumor is a malignant small cell tumor of the thoracopulmonary region that was first reported in 1979 by Askin et al. [ 1 ]. The tumor involves soft tissue of the chest wall and occasionally involves peripheral lung and ribs and closely resembles Ewing sarcoma (EWS) in histology. Eponyms were used as a simple way to describe different tumors and tumorlike lesions at the beginning of our understanding of those entities and to acknowledge contributions of pioneers who helped to improve our understanding."}, {"url": "https://en.wikipedia.org/wiki/Brenner_tumour", "passage_text": "Brenner tumors are an uncommon subtype of the surface epithelial-stromal tumor group of ovarian neoplasms. The majority are benign, but some can be malignant. They are most frequently found incidentally on pelvic examination or at laparotomy. Brenner tumours very rarely can occur in other locations, including the testes."}, {"url": "http://medical-dictionary.thefreedictionary.com/Eponyms", "passage_text": "eponym. [ep′ənim]. Etymology: Gk, epi, above, onyma, name. a name for a disease, organ, procedure, or body function that is derived from the name of a person, usually a physician or scientist who first identified the condition or devised the object bearing the name. Medtalk A syndrome, lesion, surgical procedure or clinical sign that bears the name of the author who first described the entity, or less commonly, the name of the index Pt(s) in whom the lesion was first described."}]