[{"url": "http://home.costhelper.com/house-cleaning-service.html", "passage_text": "1 Biweekly cleaning of the same five-room apartment costs $59-$124, the seven-room single-story home runs $79-$150, and the larger nine-room two-story home costs $104-$180. 2  More Hands.com in Texas offers a website calculator to help determine cleaning costs according to the number and type of rooms. 1 Biweekly cleaning versus one-time means a savings of $50-$200, depending on the size of the home. 2  When choosing to hire an individual through a classified ad or personal referral, The US Department of Labor outlines the regulations."}, {"url": "https://nz.answers.yahoo.com/question/index?qid=20070925192423AAjsifS", "passage_text": "Report Abuse. Well my mom had a cleaning lady and she would only charge my mother about 100 dollars but i kno it is not hourly for the majority of the places. marie m · 8 years ago. Thumbs up."}, {"url": "http://maidschicago.com/cleaning-rates.htm", "passage_text": "If a cleaning lady will not manage to clean your home in the 3 hours you’ll be asked to pay additional $27 for every hour spent. After the first initial cleaning if you decide to become our regular customer you’ll be given a flat rate. For larger projects we will send one of our representatives for a FREE estimate. "}, {"url": "http://home.costhelper.com/house-cleaning-service.html", "passage_text": "1 Generally, a cleaning service will bring all the cleaning products and tools. 2  MaidPro in Boston, Massachusetts bundles cleaning into 3, 5 and 7-hour packages varying from $129 to $266 for a one-time service. 3  Biweekly jobs take 2-3 hours per visit and run $50-$70. 1 Biweekly cleaning versus one-time means a savings of $50-$200, depending on the size of the home. 2  When choosing to hire an individual through a classified ad or personal referral, The US Department of Labor outlines the regulations."}, {"url": "http://home.costhelper.com/house-cleaning-service.html", "passage_text": "1 One-time cleaning of a 900-square foot two-bedroom apartment with five rooms, costs $74-$200. 2  A 1,300 square-foot single-story home with seven rooms runs $95-$300. 3  A 2,200 two-story three-bedroom home with nine rooms averages $149-$400. 1 Biweekly cleaning versus one-time means a savings of $50-$200, depending on the size of the home. 2  When choosing to hire an individual through a classified ad or personal referral, The US Department of Labor outlines the regulations."}, {"url": "http://www.costowl.com/home-improvement/other-maid-service-cost.html", "passage_text": "Maid Service Costs. The average costs of hiring a maid service to clean your home will rang based upon the services they provide and the time they spend in your home. There are a myriad of basic household cleaning chores that most maid services will do for an hourly rate of $15 to $30. Hiring a maid service may be just what you need. The average costs of hiring a maid service to clean your home will rang based upon the services they provide and the time they spend in your home. There are a myriad of basic household cleaning chores that most maid services will do for an hourly rate of $15 to $30."}, {"url": "https://nz.answers.yahoo.com/question/index?qid=20070925192423AAjsifS", "passage_text": "Report Abuse. The beginning rate of pay for the average licensed/ bonded and insured cleaning person starts at around $20 per hour and can go as high as $45 an hour depending upon what area of the country you live, if they are independent or do they work for a large national franchise. Well my mom had a cleaning lady and she would only charge my mother about 100 dollars but i kno it is not hourly for the majority of the places. marie m · 8 years ago. Thumbs up."}, {"url": "http://www.kompareit.com/homeandgarden/home-services-compare-diy-vs-hiring-cleaning-company.html", "passage_text": "Most maid services charge about $15 to $30 per hour for a routine house cleaning. Rates vary based upon region of the country, the size of your home and how dirty it is. It is not uncommon for cleaning services to set a $50 or $75 minimum to make the trip worth their while. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090221160205AAhf7mG", "passage_text": "Asker's rating. Report Abuse. Around here a cleaning lady is paid $10.00 an hour or part hour..and the job time should be agreed upon before they start...like allow them 4 hours to do it all or something reasonable, so you both know where the other stands. Here there is usually a 2 hour minimum charge. pissy_old_lady · 7 years ago. Thumbs up."}]