[{"url": "http://www.answers.com/Q/Why_is_the_stomata_found_on_the_bottom_of_the_leaf", "passage_text": "This is because, to prevent water loss. If the stomata were on the upper side of the leaf, it would be in direct contact with the sun, which would absorb all the water from the leaf, when the stomata is open (which is around 9am and 3pm)."}, {"url": "http://www.answers.com/Q/Where_are_the_stomata_located", "passage_text": "----  Stomata are microscopic pores found on the under side of leaves. You will find the stomata in the epidermal tissue. The stomata is bounded by two half moon sha … ped guard cells that function to vary the width of the pore. Plants Carbon Dioxide from air through tiny pores of leaf.These pores are covered with 'Guard Cell'.These pores are called stomata. They are located in plants leaf. It is ve … ry easy answer. 7 people found this useful."}, {"url": "https://answers.yahoo.com/question/index?qid=20130101044857AACcXf8", "passage_text": "Stomata are scattered throughout the epidermis of every leaf. Each stomata is protected by a pair of guard cells that open in response to heat and light, exposing the stomata to the outside atmosphere. Best Answer: They are mostly located on the ventral(lower) side of the leaf. They are present on the epidermis of the leaf and are protected by two guard cell on either side of the stomata."}, {"url": "http://www.answers.com/Q/Where_are_the_stomata_located", "passage_text": "Stomata are scattered throughout the epidermis of every leaf. Each stomata is protected by a pair of guard cells that open in response to heat and light, exposing the stomata to the outside atmosphere. Plants Carbon Dioxide from air through tiny pores of leaf.These pores are covered with 'Guard Cell'.These pores are called stomata. They are located in plants leaf. It is ve … ry easy answer. 7 people found this useful."}, {"url": "http://www.esa.org/tiee/vol/v1/experiments/stomata/stomata_description.html", "passage_text": "Leaf stomata are the principal means of gas exchange in vascular plants. Stomata are small pores, typically on the undersides of leaves, that are opened or closed under the control of a pair of banana-shaped cells called guard cells (see figure above). When open, stomata allow CO 2 to enter the leaf for synthesis of glucose, and also allow for water, H 2 O, and free oxygen, O 2, to escape."}, {"url": "https://en.wikipedia.org/wiki/Stoma", "passage_text": "In botany, a stoma (plural stomata), also called a stomate (plural stomates) (from Greek στόμα, mouth), is a pore, found in the epidermis of leaves, stems, and other organs, that is used to control gas exchange. Stomata are present in the sporophyte generation of all land plant groups except liverworts. Dicotyledons usually have more stomata on the lower epidermis than the upper epidermis. Monocotyledons, on the other hand, usually have the same number of stomata on the two epidermes. In plants with floating leaves, stomata may be found only on the upper epidermis and submerged leaves may lack stomata entirely"}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/L/Leaf.html", "passage_text": "Typically, most of the stomata (thousands per square centimeter) are located in the lower epidermis. Although most of the cells of the lower epidermis resemble those of the upper epidermis, each stoma is flanked by two sausage-shaped cells called guard cells. "}, {"url": "https://answers.yahoo.com/question/index?qid=20130101044857AACcXf8", "passage_text": "When the stomata are exposed, carbon dioxide, oxygen, and water vapor can pass either in or out for photosynthesis, respiration, and transpiration to take place. There are usually more found on the underside of the leaf. PS You got this question under the wrong category. It's not under geography. Best Answer: They are mostly located on the ventral(lower) side of the leaf. They are present on the epidermis of the leaf and are protected by two guard cell on either side of the stomata."}, {"url": "http://www.answers.com/Q/Where_are_the_stomata_located", "passage_text": "A stomate (plural: stomata) is a pore on the under layer of a leaf, used for gas exchange in plants. One guard cell is located on either side of the stomate, and these are res … ponsible for the opening and closing of the hole. Plants Carbon Dioxide from air through tiny pores of leaf.These pores are covered with 'Guard Cell'.These pores are called stomata. They are located in plants leaf. It is ve … ry easy answer. 7 people found this useful."}]