[{"url": "http://www.nationaldefensemagazine.org/archive/2015/February/Pages/NuclearPowerPlantsonNewSubmarinesMayLast40PlusYears.aspx", "passage_text": "By Stew Magnuson. The Navy hopes to have the first replacement for the Ohio-class ballistic missile submarine on duty by 2031. When that vessel is launched, the onboard nuclear power plant is expected to last its entire 40-year service life. That is seven years longer than the current reactors aboard U.S. submarines. "}, {"url": "http://csbaonline.org/2015/01/21/nuclear-power-plants-on-new-submarines-may-last-40-plus-years/", "passage_text": "The Virginia-class attack submarines were the first to have a core reactor designed to last the life of the vessel, which for it, is about 33 years. The Ohio-class replacement submarines, which will carry the nation’s sea-launched nuclear missiles, will be considerably larger than the Virginia-class ships. When that vessel is launched, the onboard nuclear power plant is expected to last its entire 40-year service life. That is seven years longer than the current reactors aboard U.S. submarines."}, {"url": "https://en.wikipedia.org/wiki/Refueling_and_Overhaul", "passage_text": "In the United States Navy, Refueling and Overhaul (ROH) refers to a lengthy process or procedure performed on nuclear-powered Naval ships, which involves replacement of expended nuclear fuel with new fuel and a general maintenance fix-up, renovation, and often modernization of the entire ship. A particularly lengthy refueling, maintenance, and modernization process for a nuclear aircraft carrier can last up to almost three years and be referred to as a Refueling Complex Overhaul (RCOH) ."}, {"url": "http://science.howstuffworks.com/transport/engines-equipment/submarine3.htm", "passage_text": "Submarines also have batteries to supply electrical power. Electrical equipment is often run off the batteries and power from the diesel engine or nuclear reactor is used to charge the batteries. In cases of emergency, the batteries may be the only source of electrical power to run the submarine."}, {"url": "https://en.wikipedia.org/wiki/Nuclear_submarine", "passage_text": "A nuclear submarine is a submarine powered by a nuclear reactor. The performance advantages of nuclear submarines over conventional (typically diesel-electric) submarines are considerable. The nuclear reactor also supplies power to the submarine's other subsystems, such as for maintenance of air quality, fresh water production by distilling salt water from the ocean, temperature regulation, etc. All naval nuclear reactors currently in use are operated with diesel generators as a backup power system."}, {"url": "http://science.howstuffworks.com/transport/engines-equipment/submarine3.htm", "passage_text": "Nuclear generators need no oxygen, so a nuclear sub can stay underwater for weeks at a time. Also, because nuclear fuel lasts much longer than diesel fuel (years), a nuclear submarine does not have to come to the surface or to a port to refuel and can stay at sea longer. Nuclear subs and aircraft carriers are powered by nuclear reactors that are nearly identical to the reactors used in commercial power plants. Electrical equipment is often run off the batteries and power from the diesel engine or nuclear reactor is used to charge the batteries. In cases of emergency, the batteries may be the only source of electrical power to run the submarine."}, {"url": "https://en.wikipedia.org/wiki/Refueling_and_Overhaul", "passage_text": "An ROH usually takes one to two years for submarines and up to almost three years for an aircraft carrier, to perform at a Naval shipyard. Time periods between ROHs on a ship have varied historically from about 5–20 years (for submarines) to up to 25 years (for Nimitz-class aircraft carriers). For modern submarines and aircraft carriers, ROHs are typically carried out about midway through their operating lifespan. A particularly lengthy refueling, maintenance, and modernization process for a nuclear aircraft carrier can last up to almost three years and be referred to as a Refueling Complex Overhaul (RCOH) ."}, {"url": "http://argee.net/DefenseWatch/Tomorrows%20Submarine%20Fleet--The%20Non-nuclear%20Option.htm", "passage_text": "By comparison, the USS Seawolf cost about $2.1 billion, and the average cost of Los Angeles class subs was around $1 billion. The annual operating cost for any of these subs is approximately $21 million. The typical service life of a nuclear sub is about 30 years. Refueling and modernizing at the half-life point costs about $200 million. Near the end of the service life, another refueling and extensive overhaul for about $410 million will extend the life another 12 years, for a total service life of 42 years. This totals to about $3.6 billion in constant dollars over the lifetime of a Seawolf class sub."}, {"url": "http://csbaonline.org/2015/01/21/nuclear-power-plants-on-new-submarines-may-last-40-plus-years/", "passage_text": "The Navy hopes to have the first replacement for the Ohio-class ballistic missile submarine on duty by 2031. When that vessel is launched, the onboard nuclear power plant is expected to last its entire 40-year service life. That is seven years longer than the current reactors aboard U.S. submarines."}]