[{"url": "http://www.cbsnews.com/news/cell-phone-turns-40-martin-coopers-first-call-on-the-dynatac/", "passage_text": "It was about 10 years before Motorola made the cell phone available to the mass market. Cooper and his colleagues filed a patent for a radio telephone system in October of 1973, but the phone did not become commercially available until 1983. It cost about $4,000 to purchase. The idea for cell phones was born out of Bell Laboratories in the late 1940s."}, {"url": "http://www.dailymail.co.uk/sciencetech/article-1373272/The-day-Martin-Cooper-took-mobile-phone-public-leaving-New-Yorkers-bemused-bewildered.html", "passage_text": "Dialling his destiny: Motorola's Martin Cooper makes the world's first public mobile phone call in New York on April 3, 1973. On April 3 that year Martin Cooper, who was then 44, took a prototype mobile phone for a walk around New York City. It would be ten years before Motorola finally introduced the Dyna-TAC, the first commercially available mobile phone, into service in 1983. The device weighed 1lb and cost a staggering $3,500 (£2,170)."}, {"url": "https://en.wikipedia.org/wiki/History_of_mobile_phones", "passage_text": "Motorola was the first company to produce a handheld mobile phone. On 3 April 1973 when Martin Cooper, a Motorola researcher and executive, made the first mobile telephone call from handheld subscriber equipment, placing a call to Dr. Joel S. Engel of Bell Labs. A man talks on his mobile phone while standing near a conventional telephone box, which stands empty. Enabling technology for mobile phones was first developed in the 1940s but it was not until the mid 1980s that they became widely available."}, {"url": "http://mashable.com/2013/04/03/first-mobile-phone-call/", "passage_text": "It was the first commercially available mobile phone, and despite its meager specs for today's standards — it weighed 2.5 pounds and only had a one-line, text-only LED display — it cost a whopping $3,995. SEE ALSO: Cell-ebration! 40 Years of Cellphone History. SEE ALSO: Cell-ebration! 40 Years of Cellphone History. "}, {"url": "http://www.sfgate.com/business/article/Cost-of-a-1983-Motorola-cell-phone-3-995-2334996.php", "passage_text": "$3,995. That was the price of a Motorola DynaTAC 8000X, the first commercially available cell phone, when it was introduced in 1983. The 2 1/2-pound brick was the result of a decade of research that cost more than $100 million, and it became a symbol of power and wealth"}, {"url": "http://inventors.about.com/library/weekly/aa070899.htm", "passage_text": "A year later, the first American commercial analog cellular service or AMPS (Advanced Mobile Phone Service) was made available in Chicago by Ameritech. Despite the incredible demand, it took cellular phone service 37 years to become commercially available in the United States. Cooper made the first call on a portable cell phone in April 1973. He made the call to his rival, Joel Engel, Bell Labs head of research. Bell Laboratories introduced the idea of cellular communications in 1947 with the police car technology."}, {"url": "http://inventors.about.com/library/weekly/aa070899.htm", "passage_text": "Dr Martin Cooper, a former general manager for the systems division at Motorola, is considered the inventor of the first modern portable handset. Cooper made the first call on a portable cell phone in April 1973. He made the call to his rival, Joel Engel, Bell Labs head of research. Bell Laboratories introduced the idea of cellular communications in 1947 with the police car technology."}, {"url": "http://www.answers.com/Q/What_year_was_the_cell_phone_available_to_the_public", "passage_text": "The idea of cell phones dates to the 1920's and police radios. The first cell phone was made by Bell labs in 1947, but it wasn't until 1974 when Dr. Cooper of Motorola made th … e first cell phone we would call a cell phone for the government. In 1984 the first cell phone was sold to the public"}, {"url": "https://en.wikipedia.org/wiki/Motorola_DynaTAC", "passage_text": "A DynaTAC 8000X (First commercially available mobile phone from 1984). DynaTAC is a series of cellular telephones manufactured by Motorola, Inc. from 1984 to 1994. The Motorola DynaTAC 8000X commercial portable cellular phone received approval from the U.S. FCC on September 21, 1983. A full charge took roughly 10 hours, and it offered 30 minutes of talk time."}]