[{"url": "http://www.knowswhy.com/why-is-blood-a-tissue/", "passage_text": "Nutrients such as oxygen and the likes are transported all throughout the different part of the body through the blood vessels (composed of arteries, arterioles, capillaries, venules and veins). Many scientists believe that blood is a specialized form of connective tissue. The reason is because of its origin in the bones and the presence of fibers in the form of fibrinogen. Not all liquids can be a connective tissue. The only reason why blood is considered that way is due to the fact that is has a concentration of ‘ground substances, like calcium, minerals and phosphorus in its extra-cellular matrix. It may not be able to connect things but it is from the same ‘ebryotic layer, on which all other connective tissues are classified. "}, {"url": "http://www.answers.com/Q/Why_is_blood_considered_connective_tissue", "passage_text": "Yes blood is considered a connective tissue. It is an irregular connective tissue because it does not support or connect things but is labeled as a connective tissue because … it forms from the same embryotic layer as all other connective tissues. 12 people found this useful. Invigilator - 007. What defines a connective tissue is living cells surrounded by a non-living extracellular matrix. The red and white blood cells are the living cells and the plasma they float … in is the non-living extracellular matrix therefore blood is classified as"}, {"url": "http://www.answers.com/Q/Why_is_blood_considered_a_connective_tissue", "passage_text": "Yes blood is considered a connective tissue. It is an irregular connective tissue because it does not support or connect things but is labeled as a connective tissue because … it forms from the same embryotic layer as all other connective tissues. 12 people found this useful. The cells of a connective tissue are loosely scattered in a matrix.  The matrix can be a fluid, jelly like, dense or rigid. The nature  of matrix depends on the function a c … onnective tissue serves.as  Blood is composed of blood cells, platelets and plasma."}, {"url": "http://www.knowswhy.com/why-is-bone-considered-a-connective-tissue/", "passage_text": "This is the role of connective tissue. Connective tissues include the blood, cartilage tissues, and even the bone. Our bone is considered as a specialized form of connective tissue. Specifically, it is the tissues in the bone which makes up the skeleton. "}, {"url": "http://lifesci.dls.rutgers.edu/~babiarz/Bloodtx.htm", "passage_text": "Blood is considered a connective tissue for two basic reasons: (1) embryologically, it has the same origin (mesodermal) as do the other connective tissue types and (2) blood connects the body systems together bringing the needed oxygen, nutrients, hormones and other signaling molecules, and removing the wastes. "}, {"url": "http://www.biology.lifeeasy.org/479/why-blood-is-considered-as-a-connective-tissue", "passage_text": "1 Forms packing around various body organs so called as packing tissue. 2  It is mesodermal in origin. 3  It has all the three components of a connective tissue i.e. cells, fibers and matrix. 4  Fibroblast is the most important cell of connective tissues which is present in blood. "}, {"url": "https://en.wikipedia.org/wiki/Connective_tissue", "passage_text": "Connective tissue (CT) is one of the four types of biological tissue that support, connect, or separate different types of tissues and organs in the body. The other three types are epithelial, muscle, and nervous tissue. Connective tissue is found in between other tissues everywhere in the body, including the nervous system. In the central nervous system the outer membranes, the meninges, that cover the brain and spinal cord are composed of connective tissue."}, {"url": "http://www.answers.com/Q/Why_is_blood_considered_a_connective_tissue", "passage_text": "What defines a connective tissue is living cells surrounded by a non-living extracellular matrix. The red and white blood cells are the living cells and the plasma they float … in is the non-living extracellular matrix therefore blood is classified as a connective tissue. The cells of a connective tissue are loosely scattered in a matrix.  The matrix can be a fluid, jelly like, dense or rigid. The nature  of matrix depends on the function a c … onnective tissue serves.as  Blood is composed of blood cells, platelets and plasma."}, {"url": "http://biology.about.com/od/anatomy/a/aa122807a.htm", "passage_text": "Interestingly enough, blood is considered to be a type of connective tissue. Even though it has a different function in comparison to other connective tissues it does have an extracellular matrix. The matrix consists of the plasma, while red blood cells, white blood cells, and platelets are suspended in the plasma. Lymph. Lymph is another type of fluid connective tissue. This clear fluid originates from blood plasma that exits blood vessels at capillary beds."}]