[{"url": "http://www.lyonsroofing.com/blog/how-much-does-a-new-tile-roof-cost-in-arizona/", "passage_text": "As you can see, clay tile costs more, but it also lasts longer and the color holds longer. No surprise here. Larger roof = more tiles and labor hours needed = larger cost. So if your two-story home has 1,500 sq ft of roofing, then the average cost of a new concrete roof could be around $6,000 to $15,000. For a clay roof, it could be $10,000 to $45,000. "}, {"url": "http://www.networx.com/article/average-roof-replacement-cost", "passage_text": "Metal roofing is the most expensive and can cost up to $30,000-$40,000 for large roof replacements. The quality of the roofing material will also determine the cost of roof replacement. For example, asphalt shingles can cost anywhere from $50 for average quality to $150 or more for the highest quality (per square). The following are figures for the average cost of roof replacement: 1  Asphalt: $700-$3,700. 2  Slate: $17,000-$84,000. 3  Wood shingles or shake: $7,000-$20,000. 4  Concrete tile: $8,000-$21,000. 5  Ceramic clay tile: $12,000-$21,000"}, {"url": "http://homeguides.sfgate.com/average-repair-costs-roof-104288.html", "passage_text": "Fixing a simple roof leak in an asphalt or metal roof costs just $350 on average, according to the Lehigh Valley Roofing Company. Different materials may cost more to fix, with clay or concrete tile repairs averaging $360, wooden shakes at $420 and basic slate roof repairs averaging $500 as of 2014. The average asphalt roof replacement project in the U.S. costs $18,913 as of 2014, according to Remodeling Magazine. This figure includes removal and disposal of the old roof, new underlayment, flashing and drip edges, as well as new asphalt shingles."}, {"url": "http://home.costhelper.com/tile-roof.html", "passage_text": "1 Concrete tiles cost about $4.50-$9 a square foot for installing standard-grade tiles, or $7,650-$19,000 for a basic roof on a one-story ranch-style home (1,700-2,100 square feet of roof). 2  It runs $7-$10 or more a square foot for deluxe concrete tiles, or $11,900-$21,000 or more for 1,700-2,100 square feet. Typical costs: 1 "}, {"url": "http://www.costowl.com/home-improvement/roof-tile-cost.html", "passage_text": "1 Ceramic roof tile costs starts at approximately $5 to $15 per square foot but could cost as much as $15 to $30 per square foot or more. 2  For a 2,000 square foot roof, this amounts to a total cost of around $10,000 to $60,000. 1 For a 2,000 square foot roof, this amounts to a total cost of around $10,000 to $60,000. 2  Concrete roof tile costs are generally around $5 to $10 per square foot, or $10,000 to $20,000 for a 2,000 square foot roof."}, {"url": "http://www.homeadvisor.com/cost/roofing/install-replace-tile-roof/", "passage_text": "On average, tile roofs cost $700 to $800 per square to install, though they can cost anywhere between $400 and $1,000 per square. Tiles come in clay or concrete but can be shaped in many different ways even to the point of looking like wood shake. 1 Tile sealer – Tile sealer covers about 1,000 square feet per gallon at 1 mil thickness and costs from $20-$40 per gallon. 2  Be aware, however, that sealing roof tiles is entirely optional. 3  It can help prolong the life of a cracked tile for about a year, but that should be plenty of time for you to replace it."}, {"url": "http://thehousingforum.com/how-much-does-it-cost-to-replace-a-roof/", "passage_text": "Total Costs. Based on the prices listed above, a replacement roof with mid-grade materials can cost $10,000 and up. A 24 square roof with asphalt shingles and a single layer of tear-off can cost as little as $6,700, while the same roof with zinc or copper roofing can cost as much as $30,000. "}, {"url": "http://www.homewyse.com/services/cost_to_install_tile_roof.html", "passage_text": "Get an INSTANT estimate of the cost to Install a Tile Roof! Our free calculator uses recent, trusted data to estimate costs for your Tile Roofing Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Tile Roof ranges between $9.49 - $15.25 per square foot* . To estimate costs for your project: 1."}]