[{"url": "https://en.wikipedia.org/wiki/Annelid", "passage_text": "The annelids (Annelida, from Latin anellus, little ring), also known as the ringed worms or segmented worms, are a large phylum, with over 17,000 extant species including ragworms, earthworms, and leeches. In addition, the Pogonophora, Echiura and Sipuncula, previously regarded as separate phyla, are now regarded as sub-groups of polychaetes. Annelids are considered members of the Lophotrochozoa, a super-phylum of protostomes that also includes molluscs, brachiopods, flatworms and nemerteans. The basic annelid form consists of multiple segment"}, {"url": "https://au.answers.yahoo.com/question/index?qid=20071113154555AAv0dSX", "passage_text": "None of these features are found in flatworms or roundworms. Primitive molluscs, like annelids, are also segmented, unlike flatworms or roundworms. Having said that, i have often wondered if flatworms are really primitive or actually degenerate gastropods, but that's just me, not a scientific thing. Source(s): grayure · 8 years ago."}, {"url": "http://wps.aw.com/bc_campbell_essentials_4_oa/144/36967/9463710.cw/content/index.html", "passage_text": "They have a digestive system with two openings. Their body plan has two main tissue layers. They are segmented. Nematodes are most closely related to _____. flatworms. arthropods. rotifers. annelids. chordates. Earthworms are in the phylum _____. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080721132428AA5AyqV", "passage_text": "Best Answer: Annelids The annelids, collectively called Annelida (from Latin anellus little ring), are a large phylum of animals comprising the segmented worms, with about 15,000 modern species including the well-known earthworms and leeches. I also want to know what evidence is used to separate annelids, arthropods and molluscs from the echinoderms and chordates. Add your answer. Source. Submit Cancel. I think this question violates the Community Guidelines."}, {"url": "http://www.answers.com/Q/What_evidence_exists_to_indicate_that_annelids_and_mollusks_may_be_closely_related", "passage_text": "Mollusks and segmented worms have a one-way digestive system, a separate mouth and anus, and their larvae are very similar. This is the best evidence that they have a common a … ncestor. 12 people found this useful. Scientists also believe they have a common ancestor because both phylla contain species w … hich produce free-swimming Trochophore Larvae (most molluscs except Cephalopods, and Class Polychaeta in Annelids). "}, {"url": "http://www.tulane.edu/~bfleury/diversity/labguide/mollannel.html", "passage_text": "Protostomes like molluscs, annelids, and arthropods develop by spiral cleavage, and their embryonic cells are determinate, the fate of the embryonic cells is fixed very early on in development. The protostome coelom forms from a split within the mesoderm tissue, so they are sometimes refereed to as schizocoels. Bivalves form a pair of siphons, sometimes formed by folds of the mantle, which let water in (incurrent siphon) or let water out (excurrent siphon). The flow of water is caused by the beating of the cilia that cover the gills. The water current brings in oxygen, food, and gametes, and carries off waste materials."}, {"url": "https://answers.yahoo.com/question/index?qid=20100628045212AA4eLi1", "passage_text": "Molluscs and annelids also share a eucoelomate body cavity; i,e,. the coelom is completely lined with mesoderm tissue. A major difference between them is that annelids are segmented and have a closed circulatory system whereas molluscs are not segmented and have an open circulatory system. Phylum: Mollusca - [soft body] snails, bivalves, squid and octopi. Molluscs are a diverse group with over 50,000 described species. Annelids are characterized by having elongate, conspicuously segmented body. Unlike the molluscs with their reduced coelom, annelids have a large coelom that is divided by septa between individual segments. Extreme segmentation believed to be an adaptation for burrowing in soil."}, {"url": "http://www.tulane.edu/~bfleury/diversity/labguide/mollannel.html", "passage_text": "Molluscs include such familiar creatures as clams, oysters, snails, and octopi. They share a distant common ancestor with the annelid worms, an evolutionary heritage suggested by their larval form, called a trochophore larva, found in all molluscs and in certain marine annelids called polychaete worms. Bivalves form a pair of siphons, sometimes formed by folds of the mantle, which let water in (incurrent siphon) or let water out (excurrent siphon). The flow of water is caused by the beating of the cilia that cover the gills. The water current brings in oxygen, food, and gametes, and carries off waste materials."}, {"url": "http://www.answers.com/Q/What_evidence_exists_to_indicate_that_annelids_and_mollusks_may_be_closely_related", "passage_text": "Cnidarians include jellyfish and corals. Cnidarians are less  complex than annelids or mollusks because the latter have gills  with many layers of tissue. Scientists also believe they have a common ancestor because both phylla contain species w … hich produce free-swimming Trochophore Larvae (most molluscs except Cephalopods, and Class Polychaeta in Annelids). 2 people found this useful."}]