[{"url": "http://britishfood.about.com/od/introtobritishfood/a/roastbeef.htm", "passage_text": "3. Cooking Temperature. There are varying opinions about what the perfect temperature to cook a roast beef but in my experience starting the beef in a very hot oven 425F/220C/Gas 7 for the first 30 mins then lower the temperature to 375F/190C/Gas5 for the remaining cooking time then .... "}, {"url": "http://www.ehow.com/info_12319441_internal-temp-rare-roast-beef.html", "passage_text": "The current minimum required temperature for cooked beef, as set by the U.S. Department of Agriculture, is 145 degrees Fahrenheit. A rare roast beef attains an internal temperature of only 130 degrees. You Say Rare, I Say Raw. Rare roast beef is red and cool, but not cold, which is extra-rare -- also known as blue or essentially raw -- in the center. The internal temperature of rare roast beef is approximately 120 to 130 degrees Fahrenheit. Medium rare is 130 to 140 degrees Fahrenheit"}, {"url": "http://www.recipetips.com/kitchen-tips/t--1542/roast-beef-cook-time.asp", "passage_text": "The oven temperature used to cook a beef roast is usually set somewhere between 300 degrees and 450 degrees Fahrenheit. The recommended cooking temperature for your roast is usually determined by the type of beef cut that you plan to roast. "}, {"url": "http://www.food.com/recipe/perfect-medium-rare-prime-rib-roast-246601", "passage_text": "1 Place the roast (ribs down or fat side up) in roasting pan. 2  Sear the rib roast for 15 minutes at 450°F, then turn the oven to 325°F for the rest of the cooking time. 3  Every 1/2 hour, baste the cut ends of the roast with the fat accumulated in the roasting pan. Directions. 1  Preheat oven to 450°F. 2  Pat the rib roast dry with a paper towel or napkin. 3  Smear the cut ends of the roast with the butter. 4  Place the roast (ribs down or fat side up) in roasting pan. 5"}, {"url": "http://southernfood.about.com/od/foodsafety/fl/Meat-and-Poultry-Temperature-Chart.htm", "passage_text": "Marinated Grilled Steak. The proper temperature to cook a medium-rare steak is 130° - 135° F. Although, according to foodsafety.gov, beef, lamb, and pork should be cooked to at least 145° (or above, if desired). Ground meat must be cooked to at least 160° F. Ground poultry must be cooked to at least 165°. "}, {"url": "http://ochef.com/343.htm", "passage_text": "How long and at what temperature should I cook a beef roast in the oven? Roasting is a great cooking method for a large, tender cut of beef  such as a rib or sirloin roast. Sirloin-tip, rump, rolled-rump, eye-of-round or top-round roasts will also benefit from this cooking method if they are graded prime or choice. Cooking at a constant oven temperature of 300°F (160°C), a 5- to 8-lb standing rib roast will take 17-19 minutes per pound for rare, 20-22 for medium rare, 23-25 minutes for medium, and 27-30 minutes for well done."}, {"url": "http://meatandwildgame.about.com/od/Beef_Veal/a/Perfect-Medium-Rare.htm", "passage_text": "Now, let your meat come to room temperature, at least 1 hour and up to 3 hours for a roast. There is some disagreement about this next step, but after years of cooking and perfecting medium-rare beef, searing the meat does prove very effective in my getting the stage of doneness I want. "}, {"url": "http://www.recipetips.com/kitchen-tips/t--390/beef-doneness.asp", "passage_text": "Traditional guidelines for doneness state that beef cooked very rare, rare, or medium-rare should have an internal temperature ranging between 115ºF to 140°F. Many people prefer beef cooked rare (especially steak), but this decision is up to the consumer and is certainly not recommended by the USDA. Whole beef cuts usually have bacteria only on the surface, but it is possible for harmful bacteria to be present in the internal portions, so cooking the meat to an internal temperature of 145°F is sufficient to kill the bacteria."}]