[{"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-b.html", "passage_text": "Some babies might get 4 doses, for example, if a combination vaccine containing hepatitis B is used. (This is a single shot containing several vaccines.) The extra dose is not harmful. 1  Anyone through 18 years of age who didn't get the vaccine when they were younger should also be vaccinated. Hepatitis B virus is easily spread through contact with the blood or other body fluids of an infected person. People can also be infected from contact with a contaminated object, where the virus can live for up to 7 days. 1  A baby whose mother is infected can be infected at birth;"}, {"url": "https://answers.yahoo.com/question/index?qid=20060801224157AA23irw", "passage_text": "... show more My 30 month old was accidently given his second dosage of the Hepatitis A vaccine one month too early. (long story on how this happened). I am wondering if this could in any way raise his liver enzymes. Also they are wanting to give him a third dose in six months from now (Like I said long story). "}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-b.html", "passage_text": "Hepatitis B vaccine can prevent hepatitis B, and the serious consequences of hepatitis B infection, including liver cancer and cirrhosis. Hepatitis B vaccine may be given by itself or in the same shot with other vaccines. Hepatitis B virus is easily spread through contact with the blood or other body fluids of an infected person. People can also be infected from contact with a contaminated object, where the virus can live for up to 7 days. 1  A baby whose mother is infected can be infected at birth;"}, {"url": "http://www.webmd.com/vaccines/features/hepatitis-vaccines", "passage_text": "Hepatitis A and B: Diseases of the Liver. Hepatitis is an inflammation of the liver, most often caused by a viral infection. There are three common types of hepatitis caused by viruses: hepatitis A, hepatitis B, and hepatitis C. Vaccines have been developed that protect people from contracting hepatitis A and B. There is no vaccine for hepatitis C. Hepatitis A and hepatitis B can be spread from person to person, although in different ways. Over the last 20 years, there has been a 90% decrease in cases of hepatitis A and an 80% decrease in hepatitis B cases in the U.S. Health experts believe that immunization efforts have led to this drop in rates of"}, {"url": "http://immunize.org/catg.d/p4110.pdf", "passage_text": "How many doses of hepatitis B vaccine will my baby receive? The basic series is 3 or 4 doses. The first dose should be given in the hospital (at birth), the second dose 1–2 months later, and the third dose at age 6 months or later. A baby who gets infected with the hepatitis B virus during the first five years of life has a 15% to 25% risk for pre­mature death from liver disease, including liver failure or liver cancer. Hepatitis B vaccine is your baby’s “insurance policy” against being infected with the hepatitis B virus."}, {"url": "http://www.healthlinkbc.ca/medications/content.asp?hwid=zb1228", "passage_text": "The hepatitis B vaccine is given to protect people from getting the infection. In response to the vaccine, the body develops antibodies against hepatitis B virus (HBV). This response is known as active immunity. The hepatitis B vaccine is given as a series of 2, 3, or 4 shots (injection) in the upper arm or leg to provide long-lasting immunity. All babies need three doses: 1  The time between the first and second shot should be at least 1 month. "}, {"url": "http://epi.publichealth.nc.gov/cd/lhds/manuals/hepB/docs/hbv_vaccination.pdf", "passage_text": "HEPATITIS B VACCINATION The first hepatitis B vaccine became commercially available in the United States in 1982. In 1986, a hepatitis B vaccine produced by recombinant DNA technology was licensed and a second recombinant-type hepatitis B vaccine was licensed in 1989. "}, {"url": "http://immunize.org/catg.d/p4110.pdf", "passage_text": "Hepatitis B is a serious disease caused by the hepatitis B virus. The virus can enter the bloodstream, attack the liver, and cause serious damage. When babies get infected, the virus usually remains in the body for a lifetime (this is called chronic hepatitis B). A baby who gets infected with the hepatitis B virus during the first five years of life has a 15% to 25% risk for pre­mature death from liver disease, including liver failure or liver cancer. Hepatitis B vaccine is your baby’s “insurance policy” against being infected with"}, {"url": "http://www.mayoclinic.org/drugs-supplements/hepatitis-b-vaccine-intramuscular-route/description/DRG-20068700", "passage_text": "HBV infection is a major cause of serious liver diseases, such as hepatitis and cirrhosis, and a type of liver cancer called primary hepatocellular carcinoma. Pregnant women who have hepatitis B infection or are carriers of hepatitis B virus can give the disease to their babies when they are born. Immunization against hepatitis B disease is recommended for all newborn babies, infants, children, and adolescents up to 19 years of age. It is also recommended for adults who live in areas that have a high rate of hepatitis B disease or who may be at increased risk of infection from hepatitis B virus."}, {"url": "http://www.walgreens.com/topic/scheduler/hepatitis-b-vaccine_34.jsp", "passage_text": "The hepatitis B vaccine is the best way to prevent infection. It is a series of 3 or 4 shots usually given over a 6-to-12 month period. It is given by an injection into the arm muscle of adolescents and adults and thigh muscle of infants and young children. Acute (short-term) illness, the symptoms of which are flu-like. Most adults who get hepatitis B have this acute form of hepatitis B, and then get better. Chronic (long-term) infection which can be very serious, and often leads to liver damage, liver cancer, or death."}]