[{"url": "http://www.answers.com/Q/What_are_deer_antlers_made_out_of", "passage_text": "Deer are not the only species to have antlers; m … oose, elk, reindeer and caribou also have antlers that are grown and used in the same way. Pronghorns, though not a part of the deer species, also regrow their antlers (actually called horns) every year. to show that they are a male and to defend them self."}, {"url": "http://www.iwla-rh.org/html/DGIF_articles/deer_antlers.html", "passage_text": "Antlers are found on all members of the deer family (Cervidae) in North America including deer, elk, caribou, and moose. Caribou are the only species in which antlers are typically found on females. Antlers are often called “horns” by deer hunters, but they are not. "}, {"url": "https://en.wikipedia.org/wiki/Velvet_antler", "passage_text": "Velvet antler refers to the whole cartilaginous antler in a precalcified growth stage of the Cervidae family including the species of deer, elk, moose and caribou. Velvet Antler is not to be confused with only the velvety skin on growing antlers. Most of the world's supply of velvet antler comes from Sika deer, red deer and elk or wapiti, including a large deer ranching industry in New Zealand. New Zealand is the world’s largest producer of velvet, producing 450-500 tons of red deer velvet antler annually."}, {"url": "https://shop.antlerfarms.com/", "passage_text": "Highly concentrated deer antler velvet extract liquid made from fresh, raw deer velvet with a 75:1 extract ratio. One month supply containing 25,000 ng of pure, natural IGF-1 and balanced amounts of the accompanying full growth factor matrix. 1 We are the only deer antler velvet producer that excludes the inferior bottom segment of whole stick antler in our capsules. 2  Our deer antler velvet extract is made with a proprietary process that yields an unmatched"}, {"url": "https://en.wikipedia.org/wiki/Antler", "passage_text": "In the velvet antler stage, antlers of elk and deer have been used in Asia as a dietary supplement or alternative medicinal substance for more than 2,000 years. In tropical species, antlers may be shed at any time of year, and in some species such as the sambar, antlers last several years. Some equatorial deer never shed their antlers. Antlers function as weapons in combats between males, which sometimes cause serious wounds, and as dominance and sexual displays."}, {"url": "http://wanttoknowit.com/what-are-deer-antlers-made-out-of/", "passage_text": "Deer antlers come in many shapes and sizes. The size and shape of the antler allow the female deer to judge the condition of the male deer. It is also thought that it may allow other males to determine whether they will fight them. What Are Deer Antlers Made Out Of. 26 Aug, 2012 what are 0. Antlers are the large growths that are found on the heads of many deer species. It is mostly the male members that have antlers, but female caribou and reindeer also have antlers. The main function of the antlers are as a weapon and defense. Male deer often use the antlers to battle another deer in a show of dominance and as a way of attracting a mate"}, {"url": "http://www.suwanneeriverranch.com/WTinfoIantlers.htm", "passage_text": "Antlers are made of true bone that is fed by blood which is carried in the outer velvet covering. Velvet antlers are hot to the touch, with brushy hair and a waxy feeling coating. Deer need both protein and minerals to grow their antlers. This is in contrast to horned animals whose horns are made of keratin (like fingernails), who do not shed, and who need only protein to grow their horns optimally. Appreciate too that whitetails must grow a new set of antlers every year, while animals who have horns only need to add gradually to their existing horns. This buck's antlers have quite a bit of growing to do as you can tell by the clublike tips. A buck in velvet is sensitive and extremely protective of his antlers."}]