[{"url": "http://writingcenter.unc.edu/handouts/semi-colons-colons-and-dashes/", "passage_text": "2. To join sentences. You can use a colon to connect two sentences when the second sentence summarizes, sharpens, or explains the first. Both sentences should be complete, and their content should be very closely related. Note that if you use colons this way too often, it can break up the flow of your writing. Common colon mistakes. 1. Using a colon between a verb and its object or complement. To correct this, simply remove the colon. 2. Using a colon between a preposition and its object. To correct this, simply remove the colon. 3. Using a colon after “such as,” “including,” “especially,” and similar phrases."}, {"url": "http://susanireland.com/job-lounge/cover-letter-punctuation-when-to-use-commas-and-semicolons/", "passage_text": "Within a sentence, commas may be used to set off words, phrases, and clauses that are not essential to the sentence. For example: I drew up a sales plan, primarily for the West Coast, that requires new contracts in Los Angeles. Your plan, therefore, is without regard to the East Coast sales representatives. Those little commas and semicolons are key to stringing words and concepts together so they make sense. It sometimes isn't easy to figure out which one to use where, so I put together a brief guide to cover letter punctuation. In this post I focus on commas and semicolons. Here you go..."}, {"url": "http://www.grammarbook.com/punctuation/colons.asp", "passage_text": "Rule 6. Use a colon rather than a comma to follow the salutation in a business letter, even when addressing someone by his or her first name. (Never use a semicolon after a salutation.) A comma is used after the salutation in more informal correspondence. Rule 1. Use a colon to introduce a series of items. Do not capitalize the first item after the colon (unless it's a proper noun). Examples: You may be required to bring many things: sleeping bags, pans, utensils, and warm clothing."}, {"url": "https://en.wikipedia.org/wiki/Semi-colons", "passage_text": "The semicolon or semi-colon (;) is a punctuation mark that separates major sentence elements. A semicolon can be used between two closely related independent clauses, provided they are not already joined by a coordinating conjunction. Semicolons can also be used in place of commas to separate items in a list, particularly when the elements of that list contain commas. The first printed semicolon was the work of the Italian printer Aldus Manutius the Elder in 1494."}, {"url": "http://study.com/academy/lesson/semicolon-uses-rules-examples.html", "passage_text": "Let's do a quick review of the rules! Use a semicolon to: 1. Join two related sentences. 2. Join two related sentences when the second sentence contains an introductory word or phrase. 3. Join two sentences when the second sentence begins with an introductory word or phrase, and is followed by a list. 4. Replace commas in a list where list items contain commas. 5. Join two sentences when the first sentence contains an introductory clause. Using semicolons is important as we grow as writers."}, {"url": "http://writing.wisc.edu/Handbook/Semicolons.html", "passage_text": "When a semicolon is used to join two or more ideas (parts) in a sentence, those ideas are then given equal position or rank. Some people write with a word processor; others write with a pen or pencil. Use a semicolon between two independent clauses that are connected by conjunctive adverbs or transitional phrases. Use a semicolon between items in a list or series if any of the items contain commas. There are basically two ways to write: with a pen or pencil, which is inexpensive and easily accessible; or by computer and printer, which is more expensive but quick and neat."}, {"url": "http://www.grammarbook.com/punctuation/colons.asp", "passage_text": "Colons. A colon means that is to say or here's what I mean.. Colons and semicolons should never be used interchangeably. Rule 1. Use a colon to introduce a series of items. Do not capitalize the first item after the colon (unless it's a proper noun). Examples: You may be required to bring many things: sleeping bags, pans, utensils, and warm clothing. I want the following items: butter, sugar, and flour"}, {"url": "http://www.libraryonline.com/default.asp?pid=32", "passage_text": "COLON and SEMICOLON: The proper use of the colon and semicolon as punctuation in written works. COLON: The colon is used: a) To introduce a list. Example: You will have to order several accessory components: chargers, cases, cords, cables, and speakers. b) To introduce an extract or quotation that follows an introductory sentence."}]