[{"url": "http://missmustardseed.com/2010/09/ironstone-101/", "passage_text": "Ironstone china is a glaze-covered earthenware. It was first patented by Charles James Mason in 1813 and other manufacturers followed suit. At one point, there were almost 200 makers of ironstone china and they made everything from plates and bowls to tureens, covered casseroles, and gravy boats. Even chamber pots."}, {"url": "http://www.whiteironstonechina.com/careandcleaning.htm", "passage_text": "Ironstone china is not porcelain; it is a porous, glaze-covered earthenware, consisting of clay mixed with iron slag and feldspar, and a small amount of cobalt. First patented in 1813 by Charles James Mason in Staffordshire, England, it was decorated with under-glaze transfer patterns."}, {"url": "http://www.thepotteries.org/features/ironstone.htm", "passage_text": "Technically the clay body of ironstone is a very dense earthenware containing china stone. In colour and hardness it resembles Chinese porcelain, being of a bluish colour, though the body is generally opaque, not translucent. The glaze, however, is not so flinty hard and has a soft 'orange-peel' texture."}, {"url": "https://en.wikipedia.org/wiki/Ironstone_china", "passage_text": "Ironstone in Britain's Staffordshire potteries was closely associated with the company founded by Charles James Mason following his patent of 1813, with the name subsequently becoming generic."}, {"url": "http://www.thepotteries.org/types/ironstone.htm", "passage_text": "Ironstone was first patented in 1813 by Charles Mason as a cheap alternative to porcelain. A type of stoneware introduced in England early in the 19th century by the Staffordshire potters who looked for a substitute for porcelain that could be mass-produced for the cheaper market."}, {"url": "https://en.wikipedia.org/wiki/Ironstone_china", "passage_text": "Ironstone was patented by the British potter Charles James Mason in 1813. His father, Miles Mason (1752–1822) married the daughter of Richard Farrar, who had a business selling imported Oriental porcelain in London."}, {"url": "http://ironstonepottery.com/", "passage_text": "Welcome to our website-your specialist online source for antique English Ironstone and similar pottery from the early 19th century. If you love Ironstone, we're sure you'll enjoy viewing the selection of antique pottery we're offering."}, {"url": "https://en.wikipedia.org/wiki/Ironstone_china", "passage_text": "An ironstone pitcher and washbowl. Ironstone's resistance to chipping made it a popular material for pitchers and other everyday tableware in the 19th century. Ironstone china, ironstone ware or most commonly just ironstone, is a type of vitreous pottery first made in the United Kingdom in the early"}]