[{"url": "http://www.answers.com/Q/Can_a_widowed_catholic_woman_marry_a_divorced_protestant", "passage_text": "If the man was baptized Catholic, married in a civil ceremony and then divorced, yes, he can marry a Catholic woman in a Church ceremony in the presence of the priest or deaco … n with proper paper work completed. He could also marry again in a civil ceremony."}, {"url": "http://www.answers.com/Q/Can_a_widowed_catholic_woman_marry_a_divorced_protestant", "passage_text": "A. Yes but not in a Catholic Church. And, if a divorced Catholic man m … arries a non-catholic woman-without first securing an annulment of his 1st marriage -- then his 2nd marriage to the non-catholic woman is invalid."}, {"url": "http://forums.catholic.com/showthread.php?t=445864", "passage_text": "Religion: Catholic. Re: Marrying Divorced Protestant. My understanding is that a Protestant who marries in a non-religious ceremony is basically in the same position as a Catholic who marries in a non-religious ceremony-ie the marriage is invalid."}, {"url": "http://www.answers.com/Q/Can_a_catholic_man_marry_a_divorced_protestant_woman", "passage_text": "If the man was baptized Catholic, married in a civil ceremony and then divorced, yes, he can marry a Catholic woman in a Church ceremony in the presence of the priest or deaco … n with proper paper work completed. He could also marry again in a civil ceremony."}, {"url": "http://www.catholic.com/quickquestions/may-my-divorced-friend-marry-a-catholic-in-the-church", "passage_text": "Answer. Your friend will need to have her first marriage looked at for validity or nullity before she can marry in the Catholic Church. Civil divorce does not end a valid marriage so if it is determined that her marriage was valid when contracted, then it is still valid and she is not free to marry at all."}, {"url": "http://catholicexchange.com/does-divorced-protestant-need-annulment", "passage_text": "I am a divorced Protestant who would one day like to marry his Catholic girlfriend in the Catholic Church. Is this possible? Will the Catholic Church overlook my previous marriage since it wasn't in the RC Church? Would I need an annulment?"}, {"url": "http://forums.catholic.com/showthread.php?t=445864", "passage_text": "Religion: Catholic. Re: Marrying Divorced Protestant. A Catholic cannot marry a divorced protestant until and unless that person has been declared free to marry by the Catholic Church. Their prior marriage is presumed to be valid."}]