[{"url": "http://emedicine.medscape.com/article/218271-overview", "passage_text": "Haemophilus influenzae is a small (1 µm × 0.3 µm), pleomorphic, gram-negative coccobacillus. Some strains of H influenzae possess a polysaccharide capsule, and these strains are serotyped into 6 different types (a-f) based on their biochemically different capsules. The most virulent strain is H influenzae type b (Hib). "}, {"url": "http://www.health.state.mn.us/divs/idepc/diseases/hflu/hflufacts.html", "passage_text": "What are the symptoms of Haemophilus influenzae? Haemophilus influenzae causes a variety of illnesses including meningitis (inflammation of the coverings of the spinal column and brain), bacteremia (infection of the blood), pneumonia (infection of the lungs), and septic arthritis (infection of the joints)."}, {"url": "http://www.cdc.gov/hi-disease/index.html", "passage_text": "Haemophilus influenzae (including Hib) is a bacterium that can cause a severe infection, occurring mostly in infants and children younger than five years of age. It can cause lifelong disability and be deadly. In spite of its name, Haemophilus influenzae bacteria do not cause influenza (the flu). There are six identifiable types of Haemophilus influenzae bacteria (a through f) and other non-identifiable types (called nontypeable). The one most people are familiar with is Haemophilus influenzae type b, or Hib"}, {"url": "https://en.wikipedia.org/wiki/Pneumococcus", "passage_text": "Both Haemophilus influenzae (H. influenzae) and S. pneumoniae can be found in the human upper respiratory system. A study of competition in vitro revealed S. pneumoniae overpowered H. influenzae by attacking it with hydrogen peroxide. Streptococcus pneumoniae, or pneumococcus, is a Gram-positive, alpha-hemolytic, facultative anaerobic member of the genus Streptococcus. A significant human pathogenic bacterium, S. pneumoniae was recognized as a major cause of pneumonia in the late 19th century, and is the subject of many humoral immunity studies."}, {"url": "http://www.sciencedirect.com/science/article/pii/B9780123739445001747", "passage_text": "Haemophilus influenzae is a Gram-negative, opportunistic pathogen that remains a significant human pathogen. It is commonly found as a member of the normal flora of the nasopharynx. H. influenzae strains are distinguished by the presence of a capsule. "}, {"url": "http://microbewiki.kenyon.edu/index.php/Haemophilus_influenzae", "passage_text": "Haemophilus influenzae, also know as H. influenzae, is a common resident of the nasopharyngeal mucosa and, in some instances, of the conjunctivae and genital tract.(3). H. influenzae is commonly transmitted by direct contact also can be transmitted by inhalation of the respiratory tract droplets. Haemophilus influenzae is a small gram negative bacteria which is about 1x 0.3um in size and it also lack the presence of flagella and pili, which means it lack mobility. (6) Some of these bacteria contain polysaccharide capsule which function as protection and colonization."}, {"url": "http://microbewiki.kenyon.edu/index.php/Haemophilus_influenzae", "passage_text": "Pathology. Haemophilus influenzae requires two growth factor which are X (hemin) and V (nicotinamide-adenine-dinucleotide). These two factors are related to the red blood cell, therefore when infection occurs red blood cell the first infected area resulting in the idea that humans are the only natural hosts. Haemophilus influenzae is a small gram negative bacteria which is about 1x 0.3um in size and it also lack the presence of flagella and pili, which means it lack mobility. (6) Some of these bacteria contain polysaccharide capsule which function as protection and colonization."}, {"url": "http://www.health.state.mn.us/divs/idepc/diseases/hflu/hflufacts.html", "passage_text": "Haemophilus influenzae serotype B (Hib) is commonly associated with infants and young children and was once the most common cause of severe bacterial infection in children. Due to widespread use of Hib vaccine in children, few cases are reported each year. Haemophilus influenzae causes a variety of illnesses including meningitis (inflammation of the coverings of the spinal column and brain), bacteremia (infection of the blood), pneumonia (infection of the lungs), and septic arthritis (infection of the joints)."}, {"url": "http://www.vdh.virginia.gov/Epidemiology/factsheets/Haemophilus.htm", "passage_text": "Haemophilus influenzae is a bacteria that is commonly found in the nose and throat of children and adults. A particular type, Haemophilus influenzae serotype B (Hib), can invade and cause infections. "}, {"url": "https://en.wikipedia.org/wiki/Haemophilus_influenzae", "passage_text": "H. influenzae, in a Gram stain of a sputum sample, appear as Gram-negative coccobacilli. Haemophilus influenzae requires X and V factors for growth. In this culture haemophilus has only grown around the paper disc that has been impregnated with X and V factors. Naturally acquired disease caused by H. influenzae seems to occur in humans only. In infants and young children, H. influenzae type b (Hib) causes bacteremia, pneumonia, epiglottitis and acute bacterial meningitis. On occasion, it causes cellulitis, osteomyelitis, and infectious arthritis."}]