[{"url": "http://www.diffen.com/difference/Compound_vs_Element", "passage_text": "The difference between an element and a compound is that an element is a substance made of same type of atoms, whereas a compound is made of different elements in definite proportions."}, {"url": "http://www.diffen.com/difference/Compound_vs_Element", "passage_text": "Elements and compounds are pure chemical substances found in nature. The difference between an element and a compound is that an element is a substance made of same type of atoms, whereas a compound is made of different elements in definite proportions. Examples of elements include iron, copper, hydrogen and oxygen."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_gateway_pre_2011/periodictable/fundamentalrev1.shtml", "passage_text": "All matter is made of atoms. There are over a hundred different types of atom, called elements, and each one has a symbol. The atoms of a particular element are identical to each other. When atoms of different elements join together they make a compound."}, {"url": "http://www.iun.edu/~cpanhd/C101webnotes/matter-and-energy/compounds.html", "passage_text": "There are two basic types of compounds. They are distinguished by by the manner in which the atoms bind to one another in the compound. These two types are called molecular compounds and salts (or equivalently ionic compounds): Molecular compounds: These compounds are made up of molecules whose atoms bind to one another through covalent bonds. Salts: The atoms in salts are held together with ionic bonds. Unlike molecules, salts always form solids in a regular array called a crystalline solid."}, {"url": "http://www.answers.com/Q/What_are_2_types_of_compounds", "passage_text": "Making the world better, one answer at a time. There are two types of compounds: molecular and ionic. ill give you an example of each Water-H20 molecular compound Salt-NaCl ionic compound. There are ionic compounds which is a compound formed by a positive metal ion and a negative nonmetal ion. And there are convalent compounds which is a compound formed in which atoms share electrons."}, {"url": "http://www.emsb.qc.ca/laurenhill/science/name.html", "passage_text": "Ionic compounds are formed when a metal gives up its electrons to a non-metal. Basically if the compound contains a metal, it is ionic. But there are different sets of rules for transition metals. A transition metal is an element with an atomic number of 21 to 30, 39 to 48 or 57 to 80."}]