[{"url": "https://en.wikipedia.org/wiki/Dolomite", "passage_text": "Dolomite /ˈdɒləmaɪt/ is an anhydrous carbonate mineral composed of calcium magnesium carbonate, ideally CaMg(CO 3) 2. The word dolomite is also used to describe the sedimentary carbonate rock, which is composed predominantly of the mineral dolomite (also known as dolostone)."}, {"url": "http://geology.com/rocks/dolomite.shtml", "passage_text": "Dolomite, also known as dolostone and dolomite rock, is a sedimentary rock composed primarily of the mineral dolomite, CaMg(CO 3) 2. Dolomite is found in sedimentary basins worldwide. It is thought to form by the postdepositional alteration of lime mud and limestone by magnesium-rich groundwater. "}, {"url": "https://en.wikipedia.org/wiki/Dolomite", "passage_text": "In horticulture, dolomite and dolomitic limestone are added to soils and soilless potting mixes as a pH buffer and as a magnesium source. Home and container gardening are common examples of this use. Dolomite is also used as the substrate in marine (saltwater) aquariums to help buffer changes in pH of the water. The word dolomite is also used to describe the sedimentary carbonate rock, which is composed predominantly of the mineral dolomite (also known as dolostone)."}, {"url": "https://pender.ces.ncsu.edu/2013/01/does-your-lawn-or-garden-need-lime/", "passage_text": "Dolomitic lime is made from dolomite, a type of rock very similar to limestone except it also contains magnesium. In North Carolina, dolomite is found only in the mountains. Both types of lime provide calcium for plants, but dolomitic lime also supplies magnesium, a nutrient often low in soils in our area. Lime is a soil amendment made by grinding limestone, a naturally occurring type of rock that is very high in calcium. Two types of lime are commonly used in lawns and gardens, agricultural lime and dolomitic lime. Agricultural lime, also sold as garden lime, is made from calcium carbonate."}, {"url": "http://www.wisegeek.org/what-is-dolomitic-limestone.htm", "passage_text": "Dolomitic limestone is a type of rock that includes up to 50% dolomite. Normal limestone is primarily made up of calcite and aragonite, but dolomite forms in the stone when the calcium ions in the calcite part are replaced by magnesium ions — this process is called dolomitization."}, {"url": "http://homeguides.sfgate.com/dolomite-used-plants-71587.html", "passage_text": "What It Contains. Dolomite is a limestone compound that contains calcium and magnesium. The best mixtures contain 8 to 12 percent magnesium and 18 to 22 percent calcium. These elements help influence the pH of the soil and provide valuable nutrients to plants. Tomato vines benefit from the nutrients in dolomite. Dolomite, a type of limestone, provides valuable nutrients to plants and helps change the pH of the soil by raising it to match the plants' needs. It's sometimes called dolomitic lime or dolomitic limestone, and provides more nutrients than straight lime."}, {"url": "http://www.braenstone.com/2014/12/agricultural-lime-vs-dolomite-lime/", "passage_text": "Pros. Although both agricultural lime and dolomitic lime are able to successfully raise the pH levels of acidic soil, dolomitic lime is generally chosen for pastures that have a history of grass tetany to raise forage magnesium levels or in fields, gardens and lawns where the soil is particularly magnesium deficient. It’s important to keep in mind that, as stated above, dolomitic lime is really intended only for soil that has a magnesium deficiency. As a general rule of thumb, soil should always have a calcium to magnesium ratio of between 7:1 (for sandier soils) and 10:1 (for more clay-based soils)."}, {"url": "http://www.ehow.com/about_6637147_dolomitic-limestone_.html", "passage_text": "Dolomitic Limestone Characteristics. Dolomitic lime is a soil amendment made by grinding dolomite down so that it can be used in gardens and lawns. Although it is not technically limestone, dolomite is very similar to limestone in its high calcium content. "}, {"url": "http://homeguides.sfgate.com/differences-between-hydrated-dolomite-lime-85354.html", "passage_text": "Hydrated Lime. Both calcitic lime and dolomitic lime can be processed into hydrated lime, also known as slaked lime. Ground limestone is heated in an oven to produce burnt lime. Burnt lime is then mixed with water to produce hydrated lime, which is essentially calcium hydroxid"}]