[{"url": "http://www.biotopics.co.uk/JmolApplet/glycogen2.html", "passage_text": "Glycogen is a polysaccharide composed of glucose units linked by alpha 1-4 glycosidic bonds, with occasional alpha 1-6 glycosidic bonds which provide branching points. (Zoom in to view branching point/ return to original view). Glycogen-also known as animal starch-is found in the liver and muscles. It is effectively similar in structure to the amylopectin fraction of starch, which has longer branches (24-30 glucose units). This simple model-specifically prepared for this website by the Sweet program-shows 40 glucose units."}, {"url": "http://themedicalbiochemistrypage.org/glycogen.php", "passage_text": "Stores of readily available glucose to supply the tissues with an oxidizable energy source are found principally in the liver, as glycogen. Glycogen is a polymer of glucose residues linked by α-(1,4)- and α-(1,6)-glycosidic bonds. A second major source of stored glucose is the glycogen of skeletal muscle. However, muscle glycogen is not generally available to other tissues, because muscle lacks the enzyme glucose-6-phosphatase. Glycogen Structure. "}, {"url": "http://academic.brooklyn.cuny.edu/biology/bio4fv/page/starch.html", "passage_text": "Starch and glycogen. starch and glycogen are polymers of alpha glucose. amylose, a form of starch, have alpha 1-4 glycosidic bonds. amylopectin, a form of starch, and glycogen have alpha 1-4 glycosidic bonds and alpha 1-6 glycosidic bonds. starch. "}, {"url": "https://en.wikibooks.org/wiki/Structural_Biochemistry/Carbohydrates/Polysaccharides", "passage_text": "Amylose and Amylopectin are polysaccharides of starch. Amylose has a linear chain structure made up of hundreds of glucose molecules that is linked by a alpha 1,4 glycosidic linkage. Due to the nature of these alpha 1,4 bonds, the macromolecule often assumes a bent shape. Many organisms store energy in the form of polysaccharides, commonly homopolymers of glucose. Glycogen, the sugar used by animals to store energy, is composed of alpha-1,4-glycosidic bonds with branched alpha-1,6 bonds present at about every tenth monomer."}, {"url": "http://www.answers.com/Q/The_main_structural_difference_between_starch_glycogen_cellulose_comes_from", "passage_text": "In amylopectin there are two types of glycosidic bonds: 1,4 and 1,6. The 1,4 links are the same as in amylose. In addition some glucose molecules have a glycosidic link from carbon atom number 6 to carbon atom number 1 in a new glucose molecule. This produces a branch point in the amylopectin molecule. Both, cellulose and starch, has a linear structure of glucose monomers connected by glyosidic bonds (1-4 glycosidic bond = Carbon atom number 1 linked with Carbon atom number … 4 of the next glucose monomer's). The basic structural difference is whether the linkage is alpha or beta glycosidic bond."}, {"url": "https://en.wikipedia.org/wiki/Glycogen", "passage_text": "It has a similar structure to amylopectin (a component of starch), but is more extensively branched and compact than starch. Glycogen is found in the form of granules in the cytosol /cytoplasm in many cell types, and plays an important role in the glucose cycle. Branches are linked to the chains from which they are branching off by α(1→6) glycosidic bonds between the first glucose of the new branch and a glucose on the stem chain. Due to the way glycogen is synthesised, every glycogen granule has at its core a glycogenin protein."}, {"url": "https://en.wikipedia.org/wiki/Glycogen", "passage_text": "Glycogen is a multibranched polysaccharide of glucose that serves as a form of energy storage in animals and fungi. The polysaccharide structure represents the main storage form of glucose in the body. Branches are linked to the chains from which they are branching off by α(1→6) glycosidic bonds between the first glucose of the new branch and a glucose on the stem chain. Due to the way glycogen is synthesised, every glycogen granule has at its core a glycogenin protein."}, {"url": "http://oregonstate.edu/instruct/bb450/summer09/lecture/glycogennotes.html", "passage_text": "Glycogen Structure. Glycogen is a polymer of glucose (up to 120,000 glucose residues) and is a primary carbohydrate storage form in animals. The polymer is composed of units of glucose linked alpha(1-4) with branches occurring alpha(1-6) approximately every 8-12 residues. Linkage of the first few glucose units to form the minimal primer needed for glycogen synthase recognition is catalyzed by a protein called Glycogenin, which attaches to the first glucose and catalyzes linkage of the first eight glucoses by alpha(1,4) bonds."}, {"url": "http://www.answers.com/Q/The_main_structural_difference_between_starch_glycogen_cellulose_comes_from", "passage_text": "They differ in the type of glucose present and the bonds which link thr glucose monomers together. Starch and glycogen are made from alpha-glucose. This is an isomer of glucose in which the hydroxyl (-OH) group attached to carbon number 1 is below the plane of the ring. Both, cellulose and starch, has a linear structure of glucose monomers connected by glyosidic bonds (1-4 glycosidic bond = Carbon atom number 1 linked with Carbon atom number … 4 of the next glucose monomer's). The basic structural difference is whether the linkage is alpha or beta glycosidic bond."}]