[{"url": "http://presentationsoft.about.com/od/powerpointtipsandfaqs/qt/select_slides.htm", "passage_text": "Slide Sorter view is in all versions of PowerPoint. However, the Outline / Slides pane is specific to PowerPoint 2003. PowerPoint 2000 has a similar view, but it is strictly an Outline view. Select ALL slides. 1  Slide Sorter view-Hold the Shift key and click on the first slide. 2  Outline / Slides pane-Click the first slide, press the Shift key and then click on the last slide."}, {"url": "http://www.techtalkz.com/microsoft-office-powerpoint/155155-select-all-text-powerpoint.html", "passage_text": "You can either select text within a text box or select all shapes on a. slide. You cannot select all the text in the shapes. So process each text. object and copy/paste to Word and then move to the next shape. --. Regards, Shyam Pillai. Animation Carbon: Copy/Paste/Share animation libraries."}, {"url": "https://support.office.com/en-us/article/Apply-multiple-slide-masters-to-a-new-or-existing-presentation-EABE270F-56B9-4B3D-BF8D-8827B738E9FF", "passage_text": "Open the presentation that you want to add a slide to. On the Home tab, in the Slides group, click New Slide, and then click Reuse Slides. In the Reuse Slides pane, in the Insert slide from box, do one of the following: Enter the location of the Slide Library, and then click the arrow to find the Slide Library."}, {"url": "http://www.home.apu.edu/~pcliffe/PowerPointDirections.html", "passage_text": "Set the transitions for your slides. You will first want to select a slide. The best way to do this is from the slide sorter view. To get there, click on the icon in the bottom left corner of the screen. This will allow you to see all of your slides at once. Click once on the first slide to select it."}, {"url": "http://www.techrepublic.com/blog/microsoft-office/select-multiple-objects-in-a-powerpoint-slide/", "passage_text": "Highlight an object in the pane to select it in the slide. Hold down the Shift key to select multiple items. It's the same principle, but the selection pane eliminates the need to click or surround the actual objects. This route is easier when you have lots of objects, layered objects, or small objects. 1  Comments 0."}]