[{"url": "http://www.medicinenet.com/giardia_lamblia/article.htm", "passage_text": "Giardiasis (gee-ar-die-a-sis with a soft G) is an infection of the small intestine that is caused by the parasite, Giardia intestinalis, also known as Giardia lamblia. As a result, giardiasis is the most common cause of water-borne, parasitic illness in the U.S.. Domestic mammals (for example, dogs, cats, calves) and wild mammals (for example, beavers) can become infected with Giardia; however, it is not clear how often domestic or wild mammals transmit giardiasis to humans."}, {"url": "http://www.rightdiagnosis.com/g/giardia/intro.htm", "passage_text": "Giardia: Introduction. Giardia is the name of a type of parasite, Giardia lamblia. Giardia lamblia is a microscopic organism that can cause food borne illness or food poisoning. An infection of Giardia is also called giardiasis. Giardia infection is the most common food borne illness caused by a parasite"}, {"url": "http://wiki.ggc.edu/wiki/Giardia_lamblia", "passage_text": "Giardia is a microscopic parasite of humans and several other mammals which is known to cause an illness called giardiasis. Organism is either called G. lamblia, G. intestinalis, G. duodenalis and is found in soil, food, and water that has been contaminated with feces from an infected individual. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/giardia-infection/basics/definition/con-20024686", "passage_text": "Definition. Giardia infection is an intestinal infection marked by abdominal cramps, bloating, nausea and bouts of watery diarrhea. Giardia infection is caused by a microscopic parasite that is found worldwide, especially in areas with poor sanitation and unsafe water. Giardia infection (giardiasis) is one of the most common causes of waterborne disease in the United States. The parasites are found in backcountry streams and lakes but also in municipal water supplies, swimming pools, whirlpool spas and wells."}, {"url": "http://www.rightdiagnosis.com/g/giardia/basics.htm", "passage_text": "Giardia is the name of a type of parasite, Giardia lamblia. Giardia lamblia is a microscopic organism that can cause food borne ... more 1  ». Giardia: Contagious parasitic digestive infection. 2  Giardia: A species of parasitic protozoa that attaches itself to the intestinal mucosa and feeds on mucous secretions."}, {"url": "http://www.medicalnewstoday.com/articles/167079.php", "passage_text": "Knowledge center. Giardiasis, also known as beaver fever or giardial infection is an infection of the digestive system, caused by giardia lamblia, a single-celled organism (parasite). According to the US CDC (Centers for Disease Control and Prevention), there are approximately 20,000 cases in the USA each year. "}, {"url": "https://en.wikipedia.org/wiki/Giardia", "passage_text": "Giardia (/dʒiːˈɑrdiə/ or /ˈdʒɑrdiə/) is a genus of anaerobic flagellated protozoan parasites of the phylum Sarcomastigophora that colonise and reproduce in the small intestines of several vertebrates, causing giardiasis. Giardia lives inside the intestines of infected humans or other animals. Individuals become infected through ingesting or coming into contact with contaminated food, soil, or water. The Giardia parasite originates from contaminated items and surfaces that have been tainted by the feces of an infected carrier."}, {"url": "http://www.cdc.gov/parasites/giardia/index.html", "passage_text": "Giardia is a microscopic parasite that causes the diarrheal illness known as giardiasis. Giardia (also known as Giardia intestinalis, Giardia lamblia, or Giardia duodenalis) is found on surfaces or in soil, food, or water that has been contaminated with feces (poop) from infected humans or animals. "}, {"url": "http://www.emedicinehealth.com/giardiasis/article_em.htm", "passage_text": "1 Giardiasis is the name of the disease caused by Giardia lamblia parasites that infect the small bowel. 2  Giardiasis is caused by Giardialamblia parasites that damage the small intestine; Giardia lamblia forms cysts are transmitted to humans in contaminated water or food and by person-to-person contact. 1"}]