[{"url": "http://www.thefreedictionary.com/pullet", "passage_text": "pullet. n. 1. (Animals) a young hen of the domestic fowl, less than one year old. [C14: from Old French poulet chicken, from Latin pullus a young animal or bird]. Now there's Morgan le Fay, as fresh and young as a Vassar pullet, to all appearances, and here is this old duke of the South Marches still slashing away with sword and lance at his time of life, after raising such a family as he has raised."}, {"url": "http://www.betterhensandgardens.com/definition-of-a-pullet/", "passage_text": "Definition of a Pullet. I had to look this definition up, because we ordered “pullets” from the feed store in Amish territory and expected to pick up young hens – instead we picked u p day-old peeps! The definition for a pullet from the dictionary is: a young hen; specifically: a hen of the domestic chicken less than a year old. So I guess that leaves it pretty much wide open. When we think of a pullet, we think of a female chicken that’s just old enough to start laying eggs. But that’s not what the definition is in Amish territory in Ohio – there it’s a day-old female laying chicken – as opposed to a day-old female broiling chicken, for example"}, {"url": "http://www.backyardchickens.com/t/80640/what-is-a-pullet", "passage_text": "In the Shorter Oxford English Dictionary it says that a pullet is a hen from the time she lays her first egg until her first moult, so perhaps English pullets are different from American ones. I've only got 2 hens. They have names of course. "}, {"url": "http://smallfarm.about.com/od/glossary/g/pullet.htm", "passage_text": "Ben Miller/The Image Bank/Getty Images. Definition: The term pullet refers to a young hen, usually under one year of age. It can refer to a laying hen or a meat chicken but is more typically used in reference to a laying hen. Common Misspellings: poulet, pulet."}, {"url": "http://www.merriam-webster.com/dictionary/pullet", "passage_text": "Full Definition of PULLET. : a young hen; specifically: a hen of the domestic chicken less than a year old. See pullet defined for English-language learners. See pullet defined for kids. ADVERTISEMENT. Middle English polet, from Anglo-French pullet young bird, chicken, diminutive of pulle, poule young animal, from Late Latin pullus, from Latin, young animal, chicken, sprout — more at foal. First Known Use: 14th century"}, {"url": "http://www.thefreedictionary.com/pullet", "passage_text": "pul•let. a hen less than one year old. [1325–75; Middle English polet poulet, diminutive of poul pullus chicken, young of an animal]. poultry, - Poultry is derived from Latin pullus, young animal or chicken; a pullet is a young hen between the ages of a chicken and a mature fowl. Now there's Morgan le Fay, as fresh and young as a Vassar pullet, to all appearances, and here is this old duke of the South Marches still slashing away with sword and lance at his time of life, after raising such a family as he has raised."}, {"url": "http://www.audioenglish.org/dictionary/pullet.htm", "passage_text": "The noun PULLET has 2 senses: 1. flesh of a medium-sized young chicken suitable for frying. 2. young hen usually less than a year old. Familiarity information: PULLET used as a noun is rare. "}, {"url": "https://en.wikipedia.org/wiki/Chicken", "passage_text": "For chickens as food, see Chicken (food) . For the broader species of which chickens form a subspecies, see Red junglefowl. For other uses, see Chicken (disambiguation) , Chooks (disambiguation) , or Red junglefowl. The chicken (Gallus gallus domesticus) is a domesticated fowl, a subspecies of the red junglefowl. As one of the most common and widespread domestic animals, with a population of more than 24 billion in 2003, there are more chickens in the world than any other species of bird. Humans keep chickens primarily as a source of food, consuming both their meat and their eggs"}]