[{"url": "http://www.ancient-origins.net/history-famous-people/dramatic-life-and-death-atahualpa-last-emperor-inca-empire-002873", "passage_text": "The Inca ruler, Atahualpa, is one of the key figures in the history of the European colonialization of South America. As the last emperor of the largest empire in pre-Columbian Empire, Atahualpa was an immensely powerful leader. In 1532, however, Atahualpa was taken captive by a small Spanish force of 200 men under the conquistador Francisco Pizarro at Cajamarca. In just one hour, 5,000 Incas were slaughtered by the Spanish. The only injury sustained on the Spanish side was Pizarro himself, who was cut on his hand as he rescued Atahualpa from death and captured him, knowing that the Inca ruler was more valuable alive than dead."}, {"url": "https://en.wikipedia.org/wiki/Atahualpa", "passage_text": "Atahualpa, also Atahuallpa, Atabalipa (in hispanicized spellings) or Atawallpa (Quechua) (c.1500–26 July 1533) was the last Sapa Inca (sovereign emperor) of the Inca Empire (Tawantinsuyu) before the Spanish conquest. He was given the name Francisco Atahualpa in honor of Francisco Pizarro. In accordance with his request, he was strangled with a garrote on 26 July 1533. Following his execution, his clothes and some of his skin were burned, and his remains were given a Christian burial."}, {"url": "http://study.com/academy/lesson/atahualpa-history-facts-quiz.html", "passage_text": "Atahualpa was the last ruler of the Incan empire and was killed by the Spanish conquistador Francisco Pizarro in 1533. Atahualpa is perhaps best known for providing a room full of gold and silver as his ransom for the Spanish, though they still executed him. Atahualpa invited the Spanish explorers, led by Francisco Pizarro, to his camp since there was less than 200 of them. Atahualpa entered on a litter with his unarmed escorts, and the Spanish ambushed him and slaughtered his escorts."}, {"url": "http://latinamericanhistory.about.com/od/theconquestofperu/p/The-Capture-Of-Inca-Atahualpa.htm", "passage_text": "In early 1532 Huascar huáscar was defeated and captured And atahualpa was lord of The. Andes pizarro and The: Spanish Francisco pizarro was a seasoned soldier and conquistador who had played a large role in the conquest and exploration Of. panama Atahualpa and the Inca Empire in 1532: Atahualpa was the reigning Inca (a word similar in meaning to King or Emperor) of the Inca Empire, which stretched from present-day Colombia into parts of Chile."}, {"url": "http://latinamericanhistory.about.com/od/theconquestofperu/p/The-Capture-Of-Inca-Atahualpa.htm", "passage_text": "On November 16, 1532, Atahualpa, lord of the Inca Empire, was attacked and captured by Spanish conquistadors under Francisco Pizarro. Once he was captured, the Spanish forced him to pay a mind-boggling ransom amounting to tons of gold and silver. Although Atahualpa produced the ransom, the Spanish executed him anyway. Atahualpa and the Inca Empire in 1532: Atahualpa was the reigning Inca (a word similar in meaning to King or Emperor) of the Inca Empire, which stretched from present-day Colombia into parts of Chile."}, {"url": "https://en.wikipedia.org/wiki/Atahualpa", "passage_text": "The role of Atahualpa was played by Robert Stephens and by David Carradine (who received a Tony Award nomination) in the 1965 Broadway production. Christopher Plummer was Atahualpa in the 1969 movie version of the play. He was given the name Francisco Atahualpa in honor of Francisco Pizarro. In accordance with his request, he was strangled with a garrote on 26 July 1533. Following his execution, his clothes and some of his skin were burned, and his remains were given a Christian burial."}, {"url": "https://en.wikipedia.org/wiki/Atahualpa", "passage_text": "Noticing their lust for precious metals, Atahualpa offered to fill a large room about 22 feet (6.7 m) long and 17 feet (5.2 m) wide up to a height of 8 feet (2.4 m) once with gold and twice with silver within two months. He was given the name Francisco Atahualpa in honor of Francisco Pizarro. In accordance with his request, he was strangled with a garrote on 26 July 1533. Following his execution, his clothes and some of his skin were burned, and his remains were given a Christian burial."}, {"url": "http://latinamericanhistory.about.com/od/theconquestofperu/p/08Atahualpa.htm", "passage_text": "Atahualpa was the last of the native lords of the mighty Inca Empire, which spanned parts of present-day Peru, Chile, Ecuador, Bolivia and Colombia. He had just defeated his brother Huascar in a violent civil war when Spanish conquistadors led by Francisco Pizarro arrived in the Andes. This argument was very weak – the Inca did not care who was older, any son of Huayna Capac could have been king – but it sufficed. By 1572 there was a complete smear campaign in place against Atahualpa, who was called a cruel tyrant and worse."}, {"url": "http://www.biography.com/people/atahualpa-9191364", "passage_text": "Atahualpa was the last Inca ruler, executed by Spanish conquistador Francisco Pizarro in 1533, marking the end of the Inca empire. Born c. 1502, Atahualpa was the younger son of Inca ruler Huayna Capac. At Huayna's death, the kingdom was divided between his sons. This lead to a bloody civil war, which Atahualpa won in 1532. Before he could celebrate, he was captured by the Spanish conquistador Francisco Pizarro. Atahualpa paid an immense ransom in gold, but Pizarro still executed him, marking an end to"}]