[{"url": "http://www.hgtv.com/remodel/bathroom-remodel/bathroom-granite-countertop-costs", "passage_text": "Basic granite countertops will generally cost around $50 - $60 per linear foot for materials and installation. This type of granite will not be of the highest quality—it may be less durable than higher quality granite, for example—but it will still have a beautiful appearance at a budget price. "}, {"url": "http://home.costhelper.com/granite-countertops.html", "passage_text": "1 Slab granite countertops--solid pieces of granite custom cut to the width and shape of a countertop -- cost $60-$100 per square foot depending on the color and rarity of the granite, the style of edging. 2  Expect to pay $1,800-$3,000 for a typical kitchen, installed. 1 Granite-cutting circular saw blades cost about $20; granite-cutting drill bits cost about $10. 2  Most granite countertops require frequent resealing treatments to avoid damage to the surface. 3  Sealant costs $15-$20 per ounce; one ounce treats 50 square feet of countertop."}, {"url": "http://www.homeadvisor.com/cost/cabinets-and-countertops/install-countertops/", "passage_text": "Granite countertops are among the most popular countertops in kitchens today. The average cost to install granite countertops is between $3,100 and $4,500, depending on surface size and materials. Generally, granite is cut into long slabs, negating the need for seams and grout. Then it’s polished and sealed to protect against extreme heat, scratches and stains. "}, {"url": "http://home.costhelper.com/granite-countertops.html", "passage_text": "1 Some manufacturers require a minimum purchase. 2  Slab granite countertops--solid pieces of granite custom cut to the width and shape of a countertop -- cost $60-$100 per square foot depending on the color and rarity of the granite, the style of edging. 3  Expect to pay $1,800-$3,000 for a typical kitchen, installed. 1 Granite-cutting circular saw blades cost about $20; granite-cutting drill bits cost about $10. 2  Most granite countertops require frequent resealing treatments to avoid damage to the surface. 3  Sealant costs $15-$20 per ounce; one ounce treats 50 square feet of countertop."}, {"url": "http://home.costhelper.com/kitchen-countertops.html", "passage_text": "1 Stone countertops, including granite, other natural stone and quartz resin (engineered stone) cost $4-$150 per square foot, or $120-$4,500 for a typical 30 square foot kitchen countertop. 2  Stone tiles cost $4-$20 per square foot; slab stone countertops cost $50-$150 per square foot. 1 Solid surface countertops cost $40-$80 per square foot, or $1,200-$2,400 for a typical kitchen. 2  Tile countertops cost $1-$255 per square foot, or $30-$7,65"}, {"url": "http://home.costhelper.com/granite-countertops.html", "passage_text": "1 No-stain slab granite countertops cost $50-$90 per square foot, or $1,500-$2,700 for an average kitchen, typically including professional installation. 1 Granite-cutting circular saw blades cost about $20; granite-cutting drill bits cost about $10. 2  Most granite countertops require frequent resealing treatments to avoid damage to the surface. 3  Sealant costs $15-$20 per ounce; one ounce treats 50 square feet of countertop."}, {"url": "http://www.countertopguides.com/guides/granite-countertops-cost.html", "passage_text": "As we’ve noted in other posts, granite countertop prices for the material and installation range from about $30 per square foot up to $155. That’s a broad spectrum! Here are the factors that affect the price you’ll pay for granite counters. "}, {"url": "http://www.homewyse.com/services/cost_to_install_granite_countertops.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Granite Countertop Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Granite Countertops ranges between $58.97 - $86.41 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://granitecountertopsunlimited.com/planning/how-to-measure/", "passage_text": "Granite Countertops Installaton Cost Estimate. If you would like a cost estimate for installation of granite countertops or quartz countertops, please use this page to give us the measurements of your countertop area, edge style, and the color of granite or quart, and we will be happy to give you a free estimate. "}]