[{"url": "http://www.marksdailyapple.com/cumin/", "passage_text": "You can make some delicious mexican spiced nuts and seeds with cumin, coriander, cayenne, cinnamon, salt and pepper as your spice blend. Toss the nuts and seeds in egg white so the spices will stick, and toast till golden. My fave blend is sliced almonds, pepitas and sunflower seeds. I love lots of cumin in (legume-free) chili. Cumin is the spice heavily used in middle eastern countries. It’s used a LOT in dishes in the country of Turkey. My sister lived in Sri Lanka for awhile, it’s used heavily there, too. I’m not a fan of cumin even though I’m 50% balkan…it’s a nasty tasting spice, yuck"}, {"url": "http://www.marksdailyapple.com/cumin/", "passage_text": "Cumin is excellent in a lot of cuisines. I like to use it for it’s depth of flavor in my chili, also as a basis for a rub on steak. I have had luck with rubbing a pork loin with fresh coriander and cumin seeds. I love lots of cumin in (legume-free) chili. Cumin is the spice heavily used in middle eastern countries. It’s used a LOT in dishes in the country of Turkey. My sister lived in Sri Lanka for awhile, it’s used heavily there, too. I’m not a fan of cumin even though I’m 50% balkan…it’s a nasty tasting spice, yuck"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-635-CUMIN.aspx?activeIngredientId=635&activeIngredientName=CUMIN", "passage_text": "People take cumin for digestion problems including diarrhea, colic, bowel spasms, and gas. Cumin is also used to increase urine flow to relieve bloating (as a diuretic); to start menstruation; and to increase sexual desire (as an aphrodisiac). "}, {"url": "http://healthyeating.sfgate.com/cumin-good-you-7294.html", "passage_text": "Expanding your spice cabinet to include cumin may help to prevent chronic disease and fight off infection. Cumin is a spice used in culinary traditions and traditional medicines from around the world. It is a small seed used often in Indian dishes such as curries and has a pungent, nutty and earthy flavor. It is rich in antioxidants, calcium, iron and magnesium. In addition to preventing disease, incorporating more cumin into your diet may reduce blood sugar and improve digestion."}, {"url": "https://answers.yahoo.com/question/index?qid=20080206143744AA47L71", "passage_text": "Cumin seeds are used as a spice for their distinctive aroma, popular in North African, Middle Eastern, Western Chinese, Indian, Cuban and Mexican cuisine. Cumin's distinctive flavour and strong, warm aroma is due to its essential oil content. Cumin is a hot spice that doesn't actually have a spicy flavor. If you want the warmth of spicy food without having a burning hot tongue, this is for you. I use it in chili, tacos, and enchiladas."}, {"url": "https://answers.yahoo.com/question/index?qid=20080206143744AA47L71", "passage_text": "Cumin seeds are from a different plant all together not from the cilantro plant. Cumin is very strong and bold tasting, and used in chili, hummus, Indian food etc....its good added to just about anything but has a very distinctive taste so you have to be in the mood for it. Cumin is a hot spice that doesn't actually have a spicy flavor. If you want the warmth of spicy food without having a burning hot tongue, this is for you. I use it in chili, tacos, and enchiladas."}, {"url": "http://healthyeating.sfgate.com/cumin-good-you-7294.html", "passage_text": "Cumin is commonly used in ayurveda, traditional Indian medicine, as a carminative. A carminative is a substance that helps to prevent the formation of gas in the intestines and also helps to alleviate symptoms of gas. It is a small seed used often in Indian dishes such as curries and has a pungent, nutty and earthy flavor. It is rich in antioxidants, calcium, iron and magnesium. In addition to preventing disease, incorporating more cumin into your diet may reduce blood sugar and improve digestion."}, {"url": "http://theepicentre.com/spice/cumin/", "passage_text": "Cumin is native to the Levant and Upper Egypt. It now grows in most hot countries, especially India, North Africa, China and the Americas. The spice is especially associated with Morocco, where it is often the fragrance of the abundant street cookery of the medinas. "}, {"url": "http://www.tablespoon.com/posts/spicy-sunday-what-is-cumin/d052e975-5fdf-440f-8318-1eaede2ab519", "passage_text": "If so, you noticed that there's a lot of cumin in curry powder! In addition to India's curries, cumin is also a component in the garam masala spice blend. Cumin is common in Mexican cooking, often used in tandem with chili powder — in fact, most pre-packaged chili powder you buy at the supermarket has cumin in it."}]