[{"url": "http://www.nrcan.gc.ca/earth-sciences/geography/place-names/origins-geographical-names/9190", "passage_text": "The name Calgary is variously spelled as it appears on the Mackenzie estate on the Isle of Mull. In one account it is spelled Calgarry but on a recent map of the Isle of Mull the spelling as used in the Alberta city is evident. The translation of the Gaelic word is Clear Running Water.. Calgary. This city was so named in 1876 by Lieutenant-Colonel James Farquharson Macleod of the North West Mounted Police. It is the name of the ancestral estate of his cousins, the MacKenzies, on the Isle of Mull, Scotland, which he had visited shortly before."}, {"url": "http://www.smo.uhi.ac.uk/gaidhlig/aite/Canada/calgary.html", "passage_text": "Then, however, an expert pointed out that the correct Gaelic translation for the phrase would be *sruthain shoilleir* or *uisge soilleir*. Obviously there had to be another explanation for the origin of the city's name. As it turns out, the name comes from an entirely different source. Long before the formation of the NWMP, James Macleod had visited Calgary Bay on the Isle of Mull, Scotland, where his sister's relatives through marriage owned a small castle named Calgary House. The original name in Gaelic was *Cala-ghearridh* [sic], with the first part *Cala*, meaning harbour or bay, and the second part, *ghearridh* [sic], meaning preserved piece of pasture, enclosed pature, or farm."}, {"url": "http://www.rampantscotland.com/placenames/placename_calgary.htm", "passage_text": "1 Colonel Macleod's relatives owned a small castle in Scotland called Calgary House, located on Calgary Bay on the Isle of Mull (Argyll & Bute). 2  According to Ayto & Crofton (2005), the compilers of a new book on British and Irish place names, there are two possibilities for the origin of the name Calgary in Scotland. 1 Banff Trail (Banff in Aberdeenshire) but referring in this instance to the town of Banff in the foothills of the Rockies to the west of Calgary. 2  Bonnybrook-this does not appear to be a place name in Scotland or elsewhere in the UK."}, {"url": "http://www.rampantscotland.com/placenames/placename_calgary.htm", "passage_text": "Calgary itself is a Scottish place name, the city being named for Calgary Bay on the Isle of Mull. Judging purely by the names of its subdivisions and neighbourhoods, Calgary can justifiably claim to be one of the most 'Scottish' of all the Canadian cities. 1 Banff Trail (Banff in Aberdeenshire) but referring in this instance to the town of Banff in the foothills of the Rockies to the west of Calgary. 2  Bonnybrook-this does not appear to be a place name in Scotland or elsewhere in the UK."}, {"url": "https://en.wikipedia.org/wiki/Calgary", "passage_text": "In the 2011 census, the City of Calgary had a population of 1,096,833 and a metropolitan population of 1,214,839, making it the largest city in Alberta, and the third-largest municipality and fifth-largest census metropolitan area (CMA) in Canada. The Calgary area was inhabited by pre-Clovis people whose presence has been traced back at least 11,000 years. Before the arrival of Europeans, the area was inhabited by the Blackfoot, Blood, Peigan and the Tsuu T'ina First Nations peoples, all of which were part of the Blackfoot Confederacy."}, {"url": "http://www.smo.uhi.ac.uk/gaidhlig/aite/Canada/calgary.html", "passage_text": "Colonel Macleod, wrote Irvine to his superiors in Ottawa, has suggested the name of Calgary, which I believe in Scotch means, 'clear running water', a very asppropriate name, I think.. Ottawa promptly agreed, and the name of the post was officially changed to Fort Calgary. The original name in Gaelic was *Cala-ghearridh* [sic], with the first part *Cala*, meaning harbour or bay, and the second part, *ghearridh* [sic], meaning preserved piece of pasture, enclosed pature, or farm."}, {"url": "https://en.wikipedia.org/wiki/Calgary", "passage_text": "Calgary was named after Calgary on the Isle of Mull, Scotland. In turn, the name originates from a compound of kald and gart, similar Old Norse words, meaning cold and garden, likely used when named by the Vikings who inhabited the Inner Hebrides. The Calgary area was inhabited by pre-Clovis people whose presence has been traced back at least 11,000 years. Before the arrival of Europeans, the area was inhabited by the Blackfoot, Blood, Peigan and the Tsuu T'ina First Nations peoples, all of which were part of the Blackfoot Confederacy."}, {"url": "http://canadaonline.about.com/cs/provinces/g/alberta.htm", "passage_text": "By Susan Munroe. Definition: The province of Alberta is one of the ten provinces and three territories that make up Canada. Alberta is one of three prairie provinces in Canada. Origin of the Name Alberta: The province of Alberta was named after Princess Louise Caroline Alberta, the fourth daughter of Queen Victoria. See Also: 1  Alberta Facts. 2  Province of Alberta."}, {"url": "http://www.rampantscotland.com/placenames/placename_calgary.htm", "passage_text": "1 Calgary was the name suggested by Colonel James F. Macleod in 1876 for the fort that had been built a year earlier. 2  Colonel Macleod's relatives owned a small castle in Scotland called Calgary House, located on Calgary Bay on the Isle of Mull (Argyll & Bute). 1 Banff Trail (Banff in Aberdeenshire) but referring in this instance to the town of Banff in the foothills of the Rockies to the west of Calgary. 2  Bonnybrook-this does not appear to be a place name in Scotland or elsewhere in the UK."}]