[{"url": "http://homebuildingsmart.com/average-home-building-cost-per-square-foot/", "passage_text": "A Well and Septic could cost between $10,000 and $20,000 depending on location. Cost of structural building materials $20 to $30 per square foot, whether stick built, Concrete Insulated Panels, (CIP) Structural Insulated Panels, (SIP) or lowest of all, log kits and log panels. • Basement – $25 to $35 per square foot depending on local prices, soil and climate. • Crawl Space – $15 to $20 per square foot. • Slab – around $10 per square foot (plus you won’t need floor joists or a sub-floor). * Remember that a basement actually gives you more square footage."}, {"url": "http://www.b4ubuild.com/faq/faq_0002.shtml", "passage_text": "Home prices of $55, $66, $72, $80, $84, $92, $110, $118, and $328 per square foot combine to produce an average of $112 per square foot, which is probably a reasonable figure for many areas of the country. However, the difference between the lowest figure and the highest is very substantial. "}, {"url": "http://loghomelinks.com/cost.htm", "passage_text": "The average cost to build a log home in the U.S. is approximately *$150.00-$200.00+ per square foot turnkey. The square footage you need to be concerned with is the actual living area on the main and second floor if applicable. *** Note: covered decks can cost anywhere from $25.00 to $35.00 per square foot. The term turnkey means that the home has been constructed to a move-in state. Turnkey cost does not include the cost for the land or any site improvements such as installation of utilities, landscaping, road building, etc.."}, {"url": "http://homebuildingsmart.com/average-home-building-costs-per-square-foot/", "passage_text": "At first glance, the average home building cost per square foot seems extremely high. People who do a lot of home improvement jobs are usually the first ones to question, because they know the cost of materials. The fact is that the materials are about 25-33 percent of the cost of a house. What factors keep the average home building costs per square foot high: Unexpected Expenses and Liability. In any home building job there is a certain amount of waste, water damage, costly crew mistakes, work slowdowns due to weather, and other unforeseeable expenses."}, {"url": "http://www.trulia.com/voices/Home_Buying/What_is_the_average_cost_per_square_foot_to_build_-196163", "passage_text": "I calculated the cost to build an attractive home in Birmingham, AL to have a total cost, including a General Contractora€™contractorâ s markup of35,392, 35392 to be294,496 294496 or$ 132 per sq. Ft for an owner, builder subtract The General€™contractora contractorâ s markup and it dropsto $ 115 per. sq ft I calculated the cost to build an attractive home in Birmingham, AL to have a total cost, including a General Contractora€™contractorâ s markup of35,392, 35392 to be294,496 294496 or$ 132 per sq. ft"}, {"url": "http://home.costhelper.com/build-custom-home.html", "passage_text": "1 It's possible to custom-build an 800-square-foot dome house for $1 million or a 12,000-square-foot rural ranch house for $400,000. 2  However, the $400,000 custom-built house is the exception rather than the rule. 1 A great deal depends on location plus the complexity of the project and the quality of the materials chosen. 2  It's possible to custom-build an 800-square-foot dome house for $1 million or a 12,000-square-foot rural ranch house for $400,000. 3"}, {"url": "http://www.ehow.com/facts_7438100_average-home-per-square-feet.html", "passage_text": "Midwest. During 2008 in the Midwest, buyers could expect to spend, on average, $87.99 per square foot of living space in a single family home. In 1992, the cost was $59.65 per square foot. According to the National Association of Home Builders (NAHB), the average price per square foot of a U.S. home in 2008 was $88.31, although the numbers do vary depending on the region of the country where the home is located. Other People Are Reading."}]