[{"url": "http://www.vodacom.co.za/vodacom/services/financial-solutions/m-pesa", "passage_text": "Deposit money via EFT. You can deposit money into your M-Pesa account via EFT using your internet banking. Search for M-Pesa on your Internet banking website and select load 'M-Pesa Customer Payments' as a beneficiary from the pre-defined list. Remember to use your M-Pesa cellphone number as a reference."}, {"url": "http://softkenya.com/m-pesa/buy-goods-by-m-pesa/", "passage_text": "If you are already registered for M-PESA but do not have the ‘Buy Goods’ option on your menu, select ‘My Account’ in your M-PESA menu, select ‘Update Menu’ and a new menu will be sent to your phone at no cost."}, {"url": "http://www.vodacom.co.tz/mpesa/faqs", "passage_text": "1 No. Your M-PESA account is completely separate from your Vodacom airtime. 2  You cannot buy M-PESA using airtime. 3  However you can use your M-PESA e-money to buy airtime for your own or another Vodacom subscriber's phone."}, {"url": "http://now.vodacom.co.za/article/2014/08/04/vodacom-relaunches-m-pesa-in-sa", "passage_text": "Then m-pesa is just the service you’ve been waiting for. ‘M-pesa has the potential to transform how South Africans manage money.’– Shameel Joosub, Vodacom Group CEO. With m-pesa’s mobile money wallet you can send or receive money, buy airtime or pay for other services from your mobile phone."}, {"url": "http://www.cgap.org/blog/10-things-you-thought-you-knew-about-m-pesa", "passage_text": "5 – You thought M-PESA cash merchants held funds belonging to M-PESA or its customers The M-PESA cash merchants (or ‘agents’ in M-PESA parlance) pre-buy mobile money so that they can sell it against cash to the customers who come to their retail store for cash-in operations."}, {"url": "http://www.icicibank.com/Personal-Banking/faq/detail.page?identifier=prod-mpesa-20133011015030012", "passage_text": "Presently, you can use m-pesa at all our Vodafone stores and authorised m-pesa agents across West Bengal, Bihar&Jharkhand, Kolkatta, Rajasthan, Delhi, Mumbai, Maharashtra&Goa, Assam, Uttar Pradesh, North East."}, {"url": "http://www.vodacom.co.za/vodacom/services/financial-solutions/m-pesa", "passage_text": "Set up your account & link an M-Pesa Visa card. Once you've completed the simple steps to activate your M-Pesa wallet, you can upgrade your account to premium status and link a prepaid M-Pesa Visa card. Visit an M-Pesa outlet with your green barcoded ID book and complete the quick FICA process in-store."}]