[{"url": "http://www.galco.com/comp/prod/relay.htm", "passage_text": "Relays are switches that open and close circuits electromechanically or electronically. Relays control one electrical circuit by opening and closing contacts in another circuit. As relay diagrams show, when a relay contact is normally open (NO), there is an open contact when the relay is not energized. "}, {"url": "http://www.sourceresearch.com/newsletter/Automotive-Relays-and-How-They-Works.cfm?emART", "passage_text": "Automotive Relays and How They Work. Automotive relays of all shapes and sizes can be found in just about every car, truck, and even boats. Relays in general are used to enable a low amperage circuit to switch on or off a higher amperage circuit, like turning on your headlights. If you were to try and directly hook up your headlights to the headlight switch you would exceed the amperage rating of the switch, melt wires, and risk an electrical fire. Relays are also used to switch multiple things at the same time using one output."}, {"url": "http://www.rowand.net/Shop/Tech/AllAboutRelays.htm", "passage_text": "A mechanical relay does this through the use of an electromagnet-a magnet that is only on when there's power running through it-that pulls a set of spring loaded contacts to make or break the connection and achieve the on-off effect. It's a electrical device that functions something like a wired remote control switch. Instead of having the switch you push/flip/whatever do the work of supplying power to whatever you wanted it to, you have it control a relay which then does the real on/off switching work. That's it."}, {"url": "http://autoshop101.com/forms/hweb2.pdf", "passage_text": "Our example will use a commonly used 4 -pin relay. Relays have two circuits: A control circuit (shown in GREEN) and a load circuit(shown in RED). The control circuit has a small control coil while the load circuit has aswitch. The coil controls the operation of the switch. RELAY ENERGIZED (ON) Current flowing through the control circuit coil (pins 1 and 3) creates a small magnetic fieldwhich causes the switch to close, pins 2 and 4. The switch, which is part of the load circuit,is used to control an electrical circuit that may connect to it. "}, {"url": "http://www.enginebasics.com/Engine%20Basics%20Root%20Folder/Automotive%20Relays.html", "passage_text": "You will usually see 3, 4, and 5 prong relays. An automotive relay will be working with either a 12v or 5v signal. 12v, the standard of all automotives batteries, and 5v the standard for automotive sensors. For this article, lets just assume we are talking about standard 12v relays. "}, {"url": "http://www.sourceresearch.com/newsletter/Automotive-Relays-and-How-They-Works.cfm?emART", "passage_text": "Automotive Relay Circuit Design. Most automotive relays that you will see are either Single-Pole, Single-Throw (SPST) or Single-Pole, Double-Throw (SPDT) and draw very little current (less than 200 milliamps). If you were to try and directly hook up your headlights to the headlight switch you would exceed the amperage rating of the switch, melt wires, and risk an electrical fire. Relays are also used to switch multiple things at the same time using one output."}, {"url": "http://electronics.howstuffworks.com/relay1.htm", "passage_text": "In this figure, you can see that a relay consists of two separate and completely independent circuits. The first is at the bottom and drives the electromagnet. In this circuit, a switch is controlling power to the electromagnet. When the switch is on, the electromagnet is on, and it attracts the armature (blue). "}, {"url": "http://www.howacarworks.com/accessories/how-to-check-a-relay-switch", "passage_text": "(See How car electrical systems work). of the battery to the feed terminal on the component, thereby bypassing the relay and supply wiring. If the component still does not work, it is faulty; if it works, then the supply is faulty and the fault will be in the relay or the connections to it. If the tester lights, there is power arriving at the relay. If it does not light, check the connection at the battery. If the tester lights, turn on the switch inside the car which controls the component and use the tester again to check for power on the thin wire leading from the switch to"}, {"url": "http://www.accessconnect.com/car_relays.htm", "passage_text": "Car Relays. A car relay is a electro-magnetic switch that uses a small amount of current to control a larger amount of current. How they work is by a wire wound magnetic coil that when excited by a electric current, moves a mechanical spring contact inside the relay, completing a circuit. The most common relays used to control electrical accessory devices in the automotive industry are ISO Mini and Micro relays. 4 and 5 pin designs, SPST / SPDT are used in both styles of automotive relays. Normally open or normally closed types."}, {"url": "http://www.explainthatstuff.com/howrelayswork.html", "passage_text": "How relays work. Here are two simple animations illustrating how relays use one circuit to switch on a second circuit. When power flows through the first circuit (1), it activates the electromagnet (brown), generating a magnetic field (blue) that attracts a contact (red) and activates the second circuit (2)."}]