[{"url": "http://www.foodnetwork.com/recipes/bobby-flay/perfectly-grilled-steak-recipe.html/", "passage_text": "Turn the steaks over and continue to grill 3 to 5 minutes for medium-rare (an internal temperature of 135 degrees F), 5 to 7 minutes for medium (140 degrees F) or 8 to 10 minutes for medium-well (150 degrees F). About 20 minutes before grilling, remove the steaks from the refrigerator and let sit, covered, at room temperature. Heat your grill to high. Brush the steaks on both sides with oil and season liberally with salt and pepper. Place the steaks on the grill and cook until golden brown and slightly charred, 4 to 5 minutes."}, {"url": "http://www.cooks.com/rec/search/0,1-0,steak_in_foil,FF.html", "passage_text": "ROUND STEAK IN FOIL. Cut steak into serving pieces. Cut heavy-duty foil into 5 pieces, ... sealing edge well. Bake at 375 degrees for 1 hour and 15 minutes or grill for 45 minutes. 6."}, {"url": "http://www.trinidadbenham.com/aluminum-foil-food-contact/usage/grilling-with-aluminum-foil.html", "passage_text": "Grilling with Aluminum Foil Grilling Tips Foil and grilling were made for each other. The flavors of your favorite foods blend and become even more delicious. Foil allows you to grill small items, like sliced vegetables, that would normally fall through the grill. "}, {"url": "http://dish.allrecipes.com/how-to-cook-steak/", "passage_text": "Transfer the cooked steaks to a warm platter and tent loosely with aluminum foil. Let meat rest for 5 to 10 minutes before serving. During this time the meat continues to cook (meat temperature will rise 5 to 10 degrees after it is removed from the oven) and the juices redistribute. 6. Cook 1 to 2 minutes without moving; turn steaks with tongs, and cook another 1 to 2 minutes. 4. Transfer the pan with the seared steaks to the hot oven. Roast in the center of the oven until the steaks are cooked to your liking, about 3 to 5 minutes."}, {"url": "http://www.ehow.com/info_10073730_long-grill-fish-foil.html", "passage_text": "Average Times. Grill fish steaks and fillets eight to 10 minutes per inch of thickness, or four to five minutes per half-inch of thickness. White fish usually takes less time to cook than red fish, such as salmon or tuna. A whole fish will need to be grilled 10 minutes per inch of thickness. Preheating the Grill. The cut of fish you're grilling will determine how hot the grill needs to be. A grill is considered very hot if you can hold your hand over it for less than a second, hot for two to three seconds, and moderately hot for four to five seconds."}, {"url": "http://www.cooks.com/rec/search/0,1-0,steak_in_foil,FF.html", "passage_text": "Heat oven to ... of heavy-duty aluminum foil in baking pan; place steak on foil. Mix ... foil over and seal securely. Bake until tender, about 1 1/2 hours. Cut heavy-duty foil into 5 pieces, ... sealing edge well. Bake at 375 degrees for 1 hour and 15 minutes or grill for 45 minutes. 6."}, {"url": "https://answers.yahoo.com/question/index?qid=20080609153902AAcFTxd", "passage_text": "You don't say whether this is a fillet, steak, or whole salmon, but there are lots of ways to grill salmon in foil. It usually doesn't take more for 5-7 minutes per inch of thickness over medium heat for it to cook. You can also cook it with salt, pepper, and butter on the salmon, wrap it in foil and cook it. You can also leave the butter out and cook it with lemon slices or use lemo pepper. I also like to use taragon. My father-in-law made a nice grilled salmon using olive oil, salt, and pepper."}, {"url": "http://www.ehow.com/how_12302096_cook-steak-tinfoil.html", "passage_text": "Instructions. Turn your grill to a medium flame. Make a sturdy foil packet with a sheet of heavy-duty tin foil or two sheets of thin foil. Cut a piece (or pieces) large enough to cover the steak as well as any other ingredients. Spray the foil generously with nonfat cooking spray. Place the steak in the middle of the foil. The thicker your steak is, the longer it will take to cook on the grill, especially in a packet that you will not flip as the steak cooks. Consider flattening a thick steak with a meat pounder to expedite the grilling"}, {"url": "http://www.outdoorcookingmagic.com/make-cook-foil-dinners/", "passage_text": "To make foil dinners, place the following in the middle of the shiny side of a large piece of aluminum foil: 1  Some type of meat-common ones are hamburger, steak, chicken, kielbasa. 2  Season if desired. 3  Some sliced or cubed potatoes-sliced will cook faster, cubed may be less likely to burn. "}]