[{"url": "http://www.investopedia.com/terms/b/brand-loyalty.asp", "passage_text": "When consumers become committed to your brand and make repeat purchases over time. Brand loyalty is a result of consumer behavior and is affected by a person's preferences. Loyal customers will consistently purchase products from their preferred brands, regardless of convenience or price."}, {"url": "http://www.quickbabynames.com/meaning-of-Loyalty.html", "passage_text": "The name Loyalty has the following meaning: One who is faithful, loyal. It is a male name, suitable for baby boys. Origins. The name Loyalty is very likely a(n) English variant of the name Loyal. See other suggested English boy baby names. You might also like to see the other variants"}, {"url": "http://www.quickbabynames.com/meaning-of-Loyalty.html", "passage_text": "In one word, you might describe Loyalty as a(n)  loyal  person. See other loyal names for boys. Popularity. See worldwide popularity rankings of Loyalty as a baby name (outside USA). As a baby boy name, Loyalty is currently not a popular baby name in the USA."}, {"url": "http://www.babynamespedia.com/meaning/Loyalty/m", "passage_text": "Loyalty is derived from English origins. Loyalty is a variant of the name Loyal (English). Loyalty is rarely used as a baby name for boys. It is not listed in the top 1000 names. Baby names that sound like Loyalty include Loyaltee, Loyaltey, Loyalti, Loyaltie, Lioslaith, Lalit (Indian), and Lalyt."}, {"url": "http://www.quickbabynames.com/meaning-of-Loyalty.html", "passage_text": "The name Loyalty is a variant of Loyal. Other popular variants of the name Loyal are: Loyaltea, Loyaltee, Loyaltey, Loyalti, Loyaltie, Loyalty, Loyce, Loys, Loyse."}, {"url": "http://www.merriam-webster.com/dictionary/loyalty", "passage_text": "Synonym Discussion of LOYALTY. loyalty and allegiance mean faithfulness owed by duty or by a pledge or promise. loyalty is used of a very personal or powerful kind of faithfulness. allegiance is used of a duty to something other than a person, especially to a government or idea."}]