[{"url": "https://en.wikipedia.org/wiki/Terracotta_Army", "passage_text": "The Terracotta Army was discovered on 29 March 1974 to the east of Xi'an in Shaanxi province by farmers digging a water well approximately 1.6 kilometres (0.99 mi) east of the Qin Emperor's tomb mound at Mount Li (Lishan), a region riddled with underground springs and watercourses. The figures include warriors, chariots and horses. Estimates from 2007 were that the three pits containing the Terracotta Army held more than 8,000 soldiers, 130 chariots with 520 horses and 150 cavalry horses, the majority of which remained buried in the pits nearby Qin Shi Huang's mausoleum."}, {"url": "http://www.highlightskids.com/stories/terra-cotta-army-emperor-qin-0", "passage_text": "For more than two thousand years, Chinese children have heard fantastic stories about China's first great ruler, Emperor Qin Shihuangdi (chin sure-hwang-dee). The stories told about a great army made up of terra-cotta soldiers and of a burial tomb filled with jewels and magical rivers that flowed to the sea. In 1974, the Chinese made an amazing discovery--the stories about Emperor Qin and his great army are not fantastic at all; they're true. An army of more than eight thousand soldiers made of terra cotta, a baked reddish clay, is buried fifteen to twenty feet beneath the earth not far from the tomb pyramid where Emperor Qin is believed to be buried along with riches of his dynasty. People learned by accident that the stories about Emperor Qin were true."}, {"url": "http://www.answers.com/Q/What_is_the_Terracotta_Army_made_of", "passage_text": "Confidence votes 108. The Terracotta Army was made of yellow clay, which is mainly composed of silicon oxide, aluminium oxide, ferric oxide, has the same structure and texture with Qin's eave tile. But the source of clay are not the same for making warriors and horses. and the dick was real. Viewpoint 1  Around 209 BCE, the Terracotta Army was made. That was over 2200 years ago.    Viewpoint 2  Construction started in 221 BCE and ended in 206 BCE with t … he fall of the Qin Dynasty."}, {"url": "http://www.chinahighlights.com/xian/terracotta-army/", "passage_text": "The Terracotta Army is one of the top attractions in China. It is significant because the hundreds of detailed life-size models represent the army that triumphed over all other Chinese armies in the Warring States Period, and who ushered in the united imperial China era 2,200 years ago. History-How They Were Discovered. The Terracotta Army figures’ excavation is regarded as one of the greatest discoveries of the 20th century. It had lain underground for more than 2000 years before farmers digging a well in 1974 uncovered what is now considered one of the greatest archaeological sites in the world."}, {"url": "https://en.wikipedia.org/wiki/Terracotta_Army", "passage_text": "From Wikipedia, the free encyclopedia. The Terracotta Army or the Terracotta Warriors and Horses is a collection of terracotta sculptures depicting the armies of Qin Shi Huang, the first Emperor of China. The figures include warriors, chariots and horses. Estimates from 2007 were that the three pits containing the Terracotta Army held more than 8,000 soldiers, 130 chariots with 520 horses and 150 cavalry horses, the majority of which remained buried in the pits nearby Qin Shi Huang's mausoleum."}, {"url": "http://www.personal.psu.edu/dvz5004/terracottaStyle.html", "passage_text": "written by Donna Zhao. The most fascinating archeological discovery of modern time is the Terracotta Army in Shaanxi province, China. The Terracotta Army is made out of with terracotta. Terracotta has been significantly used in Ancient Greek Tanagra figurines, Ancient Mesopotamia’s Burney Relief, West African sculpture, and China’s First Emperor Qin’s Terracotta Army. Other usages of terracotta include potteries, vessels, surface embellishment, and sculpture."}, {"url": "https://en.wikipedia.org/wiki/Terracotta", "passage_text": "Roundel by Luca and Andrea della Robbia. Terracotta, terra cotta or terra-cotta (Italian : baked earth, from the Latin terra cocta), a type of earthenware, is a clay-based unglazed or glazed ceramic, where the fired body is porous. Glazed architectural terracotta and its unglazed version were used in Asia for some centuries before becoming popular in the West in the 19th century. In archaeology and art history, terracotta is often used to describe objects such as figurines not made on a potter's wheel."}, {"url": "https://en.wikipedia.org/wiki/Terracotta", "passage_text": "Chinese sculpture made great use of terracotta, with and without glazing and colour, from a very early date. The famous Terracotta Army of Emperor Qin Shi Huang, 209–210 BC, was somewhat untypical, and two thousand years ago reliefs were more common, in tombs and elswhere. Glazed architectural terracotta and its unglazed version were used in Asia for some centuries before becoming popular in the West in the 19th century. In archaeology and art history, terracotta is often used to describe objects such as figurines not made on a potter's wheel."}]