[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0023062/", "passage_text": "Systemic circulation carries oxygenated blood from the left ventricle, through the arteries, to the capillaries in the tissues of the body. From the tissue capillaries, the deoxygenated blood returns through a system of veins to the right atrium of the heart."}, {"url": "http://www.dummies.com/how-to/content/the-path-of-blood-through-the-human-body.html", "passage_text": "The pulmonary veins enter the left atrium. When the left atrium relaxes, the oxygenated blood drains into the left ventricle through the left AV valve. This valve is also called the bicuspid valve because it has only two flaps in its structure. Now the heart really squeezes."}, {"url": "http://www.csulb.edu/divisions/students/hrc/health_topics/heart.htm", "passage_text": "Blood moves through each side of the heart systematically. Deoxygenated blood is delivered into the right atrium. It then enters the right ventricle, from where it is pumped out into the pulmonary artery and to the lungs. Oxygenated blood returning in the pulmonary veins flows into the left atrium."}, {"url": "http://www.medicinenet.com/heart_how_the_heart_works/page3.htm", "passage_text": "1 Blood enters the heart through two large veins, the inferior and superior vena cava, emptying oxygen-poor blood from the body into the right atrium of the heart. 2  As the atrium contracts, blood flows from your right atrium into your right ventricle through the open tricuspid valve."}, {"url": "http://www.biosbcc.net/b100cardio/htm/heartant.htm", "passage_text": "The right atrium pumps blood through the right atrioventricular (tricuspid) valve to the right ventricle. From the right ventricle, blood flows through the pulmonary valve to the lungs via the pulmonary arteries (deoxygenated blood). In the lungs the blood becomes more red in color as it is oxygenated. Blood returns to the heart via the pulmonary veins (oxygenated blood) to the left atrium."}, {"url": "http://www.dummies.com/how-to/content/the-path-of-blood-through-the-human-body.html", "passage_text": "From the right atrium, the deoxygenated blood drains into the right ventricle through the right atrioventricular (AV) valve, which is so named because it is between the atrium and the ventricle. This valve is also referred to as the tricuspid valve because it has three flaps in its structure."}, {"url": "http://www.saburchill.com/chapters/chap0082.html", "passage_text": "The aorta carries oxygenated blood to the body. The pulmonary artery carries deoxygenated blood to the lungs and it is the only artery to carry deoxygenated blood. There are two veins associated with the heart. The vena cava, or great vein, carries deoxygenated blood back to the heart from the body."}, {"url": "http://my.clevelandclinic.org/services/heart/heart-blood-vessels/how-does-blood-flow-through-heart", "passage_text": "This is called the pulmonary circulation. From your pulmonic valve, blood travels to the pulmonary artery to tiny capillary vessels in the lungs. Here, oxygen travels from the tiny air sacs in the lungs, through the walls of the capillaries, into the blood."}, {"url": "http://www.medicinenet.com/heart_how_the_heart_works/page3.htm", "passage_text": "Left Side of the Heart. 1  The pulmonary vein empties oxygen-rich blood from the lungs into the left atrium of the heart. 2  As the atrium contracts, blood flows from your left atrium into your left ventricle through the open mitral valve. 3  When the ventricle is full, the mitral valve shuts."}]