[{"url": "https://answers.yahoo.com/question/index?qid=20131219183218AAYhmXa", "passage_text": "Best Answer: 1. Maple syrup-Replace the vanilla with an equal amount of maple syrup. 2. Almond extract-Swap out the vanilla with half as much almond extract. (I don't use any extract because they all have alcohol in it) 3. Vanilla milk-Replace the vanilla with an equal amount of vanilla milk. 4. Vanilla Bean-Scrape out the seeds from half of a vanilla bean, and use them for one tablespoon of vanilla extract. 5."}, {"url": "http://www.ehow.com/how_7700421_replace-vanilla-extract.html", "passage_text": "If your recipe calls for 3/4 tsp. of vanilla extract, replace the extract with vanilla sugar if the vanilla flavor is vitally important to the recipe. Use 1 tbsp. vanilla sugar for each 1/4 tsp. vanilla extract in the original recipe. So you would use 3 tbsp. vanilla sugar to replace the 3/4 tsp. vanilla extract in the recipe. Reduce the amount of granulated sugar in the recipe accordingly, if possible, as vanilla extract adds only flavor rather than sweetness."}, {"url": "http://frugalliving.about.com/od/makeyourowningredients/r/Vanilla-Extract-Substitute.htm", "passage_text": "Vanilla Paste-Replace the vanilla extract with an equal amount of vanilla paste. If you have more than one of these substitutes on hand, choose the one that seems to be the best flavor match for the recipe that you're making."}, {"url": "http://frugalliving.about.com/od/makeyourowningredients/r/Vanilla-Extract-Substitute.htm", "passage_text": "Use it to replace the vanilla measure for measure. Rum or brandy-If you aren't trying to avoid the alcohol, try an equal amount of rum or brandy. Vanilla Bean-Scrape out the seeds from half of a vanilla bean, and use them as a stand in for one Tablespoon of vanilla."}, {"url": "http://www.ehow.com/how_7700421_replace-vanilla-extract.html", "passage_text": "Substitute another flavorful liquid for vanilla extract if you do not have vanilla sugar or if the vanilla flavor is not vital to the recipe. Some options include maple syrup, triple sec, almond extract and rum."}, {"url": "http://www.buzzle.com/articles/vanilla-extract-substitute.html", "passage_text": "Maple syrup is one of the best substitutes for vanilla extract. You can replace vanilla extract with an equal amount of maple syrup. While preparing the recipe, use a slightly less amount of sugar, as maple syrup is sweet. You may also use maple extract instead of the syrup."}, {"url": "http://www.ehow.com/way_5161973_substitutes-vanilla-extract-recipe.html", "passage_text": "If you use vanilla bean, scrape half of a vanilla bean for every tablespoon of vanilla extract. When you substitute liquor, such as brandy or a liqueur, be sure that the flavor of the substitute does not compete with the rest of the recipe ingredients."}, {"url": "http://everydaylife.globalpost.com/there-anything-can-used-vanilla-extract-substitute-21899.html", "passage_text": "Vanilla-flavor liqueur works as a suitable vanilla extract replacement -- as long as you don't mind the addition of alcohol. If you don't have vanilla liqueur try almond or rum. Use 1 tablespoon of liqueur for every teaspoon of vanilla extract."}]