[{"url": "http://japansgeography.weebly.com/landforms.html", "passage_text": "More than 80% of Japan is covered in mountains. These mountains are in clusters, separated by lowlands. Faults or cracks occur because of this formation, this causes the land to either lift up into a mountain or drop down to form lowlands. The Kanto Plain is the largest stretch of lowlands in Japan. The tallest mountain in Japan is Mount Fuji which is an also an active volcano. Japan is located in the Ring of Fire, one of the world's most active volcanic area. It borders the Pacific Ocean, and most of the worlds volcanoes and earthquakes occur here."}, {"url": "http://traveltips.usatoday.com/landforms-japan-35872.html", "passage_text": "Farther toward the edges of the islands, Japan's mountains lower to plains and basins. The island's Backbone Range sharply drops off to the Kibi Plateau on one side and the Iwami Plateau on the other. Japan's dramatic system of arcs means that a great percentage of the island nation is mountainous. Mountain ranges line the interior of the islands, with some of the highest peaks toward the southern end of the main island, centered around the Kanto, Hida, Kiso and Akaishi mountain ranges."}, {"url": "http://www.answers.com/Q/What_are_Japan's_major_landforms_such_as_mountains_and_valleys", "passage_text": "1 Japan's landforms are controlled by it being an island arc formed when one plate of the earth's crust is thrust under another plate. 2  The thrust under the plate melts as it goes under, and the molten material floats upward to feed the volcano. 1 Japan is probably one of the most easily defensible countries in the world. 2  Not only is it composed of small islands, but it has a mountanious terrain in the greatest part of its main islands. 3  Mt. Fuji is located in Japan and is an active volcano there. 4  It is also Japan's highest point in elevation."}, {"url": "http://www.answers.com/Q/What_are_Japan's_major_landforms_such_as_mountains_and_valleys", "passage_text": "Over 70% of japan is mountains, so the most constant landforms are mountains. Tokyo's main landforms may be mountains, rivers, lakes, vallys etc. the are also a few famous lan … d forms in Tokyo. :) In Tokyo there is alot of volcanos .. such as the one in Kobe .. which had erupted without warning in 1995. 1 Japan is probably one of the most easily defensible countries in the world. 2  Not only is it composed of small islands, but it has a mountanious terrain in the greatest part of its main islands. 3  Mt. Fuji is located in Japan and is an active volcano there. 4  It is also Japan's highest point in elevation."}, {"url": "http://www.answers.com/Q/What_kind_of_landform_is_Japan", "passage_text": "1 All About Japan's Culture Japan is situated in the Pacific Ocean in East Asia. 2  Japan is east of China, Russia, North Korea, and South Korea. 3  Japan's culture is strongly influenced by North America, Eu…. 1 From dogs to bears, the people of this Asian country are proud of the wide variety of pets, wildlife, and reptiles that call it home…. 2  All About Japan's Culture Japan is situated in the Pacific Ocean in East Asia. 3"}, {"url": "http://traveltips.usatoday.com/landforms-japan-35872.html", "passage_text": "Plains form as material from mountains settles and deposits along lower-lying landforms, creating gentle slopes and flat lands. The Kanto Plain is one of the major plains of Japan and offers a home to much human settlement and agriculture. In between individual mountains, valleys tend to take a V-shape. Rivers and coastal terraces also are common, relatively flat landforms. Japan's dramatic system of arcs means that a great percentage of the island nation is mountainous. Mountain ranges line the interior of the islands, with some of the highest peaks toward the southern end of the main island, centered around the Kanto, Hida, Kiso and Akaishi mountain ranges."}, {"url": "http://www.worldatlas.com/webimage/countrys/asia/japan/jpland.htm", "passage_text": "The archipelago of Japan contains over 4,000 islands stretching along the Pacific coast of East Asia, with four major islands (sometimes referred to as the Home Islands): Hokkaido, Honshu, Kyushu and Shikoku. The second largest, Hokkaido, is also the northernmost of Japan's islands; while on the other end, Kyushu is the most southwesterly. Shikoku is the smallest and least populous of the four main islands."}, {"url": "http://traveltips.usatoday.com/landforms-japan-35872.html", "passage_text": "Japan has a dramatic landscape, with mountainous peaks in relative proximity to its lengthy shoreline. The island has the essential structure of multiple island arcs, each following the gentle curve of a tectonic plate boundary. Japan's dramatic system of arcs means that a great percentage of the island nation is mountainous. Mountain ranges line the interior of the islands, with some of the highest peaks toward the southern end of the main island, centered around the Kanto, Hida, Kiso and Akaishi mountain ranges."}, {"url": "http://web-japan.org/factsheet/en/pdf/e01_geography.pdf", "passage_text": "mountains of the Chubu region through Niigata Prefecture to the Sea of Japan. Second in length is the Tone River, which flows through the Kanto Plain to the Pacific Ocean, and third in length is the Ishikari River in Hokkaido, at 268 kilometers. "}]