[{"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "How much your monthly disability check will be depends on whether you'll receive Social Security Disability (SSD) or Supplemental Security Income (SSI). SSD is for workers who are insured under the Social Security retirement system. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663."}, {"url": "http://www.ssdrc.com/disabilityquestions4-36.html", "passage_text": "If they do not, their disability benefit amount will be lowered to less than the maximum amount. Note: Currently, the maximum amount that one individual may receive for SSI disability is $721 per month. Social Security disability is very different in some ways than SSI disability. If it is very low, however, you may be eligible to receive both SSI and social security disability. This is known as a concurrent claim. On the other hand, if you have had higher earnings and consistent work activity, your monthly disability benefit pay will be higher."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-does-long-term-disability-pay.html", "passage_text": "The offset works like this: if you receive $1,400 in LTD benefits and are approved for $1,100 from Social Security, you will receive the full $1,100 from Social Security, but only $300 from your insurance company, for a total of $1,400. Calculating Your Base LTD Payment. Depending on your policy, your long-term disability (LTD) plan will typically pay between 50% and 80% of your pre-disability earnings, up to a maximum."}, {"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "The SSI program currently pays a maximum benefit of $733 a month if you are single or $1,100 a month for a couple. This is the total amount you are eligible to receive, but it will be reduced by certain other benefits or income you may receive. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-social-security-disability-ssdi-benefits-can-you-get.html", "passage_text": "To give you an idea of what you might receive, for 2015, the average SSDI benefit amount is $1,165 per month, but you can receive anywhere up to $2,663. If you're interested in how Social Security calculates your AIME and PIA, here's how. How much your Social Security disability benefit will be is based on your covered earnings -- the wages that you paid Social Security taxes on -- prior to becoming disabled. (Social Security Disability Insurance (SSDI) is the federal insurance program that provides benefits to qualified workers who can no longer work"}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-does-long-term-disability-pay.html", "passage_text": "Long-term disability (LTD) benefits pay a percentage of your salary or wages and can be increased by cost-of-living adjustments (COLAs) and/or decreased by offsets of other benefits, earnings from work, and taxes. Calculating Your Base LTD Payment. Depending on your policy, your long-term disability (LTD) plan will typically pay between 50% and 80% of your pre-disability earnings, up to a maximum."}, {"url": "http://ssa.gov/planners/disability/dapproval.html", "passage_text": "Social Security. If your application is approved, your first Social Security benefit will be paid for the sixth full month after the date we find that your disability began. For example, if your disability began on June 15, 2014, your first benefit would be paid for the month of December 2014, the sixth full month of disability. When Your Benefits Start. If your application is approved, your first Social Security benefit will be paid for the sixth full month after the date we find that your disability began."}, {"url": "http://www.disabilitysecrets.com/page4-44.html", "passage_text": "Everyone on SSI disability (Supplemental Security Income) is eligible for the same base amount, $733. But your actual monthly SSI payment will depend on whether you have any countable income, whether you are married, and what state you live in. "}]