[{"url": "http://www.slate.com/articles/news_and_politics/explainer/2011/01/what_kind_of_a_name_is_reince.html", "passage_text": "Think Northern Europe. Campaign materials from Priebus' failed 2004 Wisconsin state senate bid note that his first name  rhymes with 'Heinz .'  That's somewhat misleading, though, since Americans really stretch out the z at the end of their favorite ketchup, while Reince concludes with a harder, German-sounding tz. (Eight of the Boehners were named John.) There is only one Obama. Reince is a very rare first name, although a few immigrants from Flemish Belgium have brought Reince to the United States as a last name. Forty-one people with the last name Reince have died in the United States since 1962. When he passes on, Chairman Priebus could become the only person with the first name Reince in the death index. But it's not clear that Reince is, in fact, his given name. His name sometimes appears as Reince R. Priebus, and other times as Reinhold R. Priebus. Fred Priebus, the family patriarch, came to the United States near the turn of the 20 th century"}, {"url": "http://surnames.meaning-of-names.com/genealogy/priebus/", "passage_text": "Priebus in RootsWeb surname mailing lists. Priebus genealogy mailing list for correspondence and sharing of information pertaining to family histories of the Priebus surname and its variations. Or check the index of mailing lists for a sound-alike name"}, {"url": "http://www.genealogytoday.com/surname/finder.mv?Surname=Priebus", "passage_text": "Welcome to the Priebus Family page at Surname Finder, a service of Genealogy Today. Our editors have compiled this checklist of genealogical resources, combining links to commercial databases along with user-contributed information and web sites for the Priebus surname. Sometimes two people can look at the same handwritten record, and come up with different spellings of the name. Be creative when searching for your Priebus ancestors -- we often search for misspellings intentionally to see if we missed any records."}, {"url": "http://www.democraticunderground.com/10021210221", "passage_text": "Forty-one people with the last name Reince have died in the United States since 1962. When he passes on, Chairman Priebus could become the only person with the first name Reince in the death index. But it's not clear that Reince is, in fact, his given name. Reinhold Priebus could easily be a German name. I have no idea where the Reince comes from, and neither does anyone else I can find on Google. One source says that Reince is an obscure French family name."}, {"url": "http://www.usnews.com/news/articles/2011/01/24/10-things-you-didnt-know-about-reince-priebus", "passage_text": "+ More. 1. Reince R. Priebus was born on March 18, 1972, in Kenosha, Wis., to Dimitra and Roula Priebus, a former electrician who works in real estate. 2. Priebus graduated cum laude in 1994 with a political science and English degree from the University of Wisconsin-Whitewater, where he was study body president. 3. "}, {"url": "http://www.ancestry.com/name-origin?surname=priebus", "passage_text": "You can use census records and voter lists to see where families with the Priebus surname lived over the years. While the questions in census records vary from place to place, and year to year, you can generally find information like name of household members, ages, birthplaces, residences, occupations, etc. Find out where people with the family name Priebus lived before coming to the United States. View all Priebus ancestors in the SSDI. Census records can tell you a lot of little known facts about your Priebus ancestors, such as occupation. Occupation can tell you about your ancestors social and economic status."}, {"url": "http://surnames.meaning-of-names.com/genealogy/priebus/", "passage_text": "Welcome to some of the best Priebus genealogy resources found on the web. We hope you will participate on the Priebus forums, it is a great place to find or post information on Priebus genealogy and is completely free to participate. Priebus genealogy mailing list for correspondence and sharing of information pertaining to family histories of the Priebus surname and its variations."}, {"url": "http://www.genealogytoday.com/surname/finder.mv?Surname=Priebus", "passage_text": "Origins of the Priebus Surname. It is quite possible for two people with the Priebus last name to have been given that surname for entirely different reasons. Discovering the country from which your Priebus ancestors originated can often yield additional clues for the meaning of the surname. Keep in mind that it was not unusual for a last name to be altered as an ancestor entered a new country. Sometimes two people can look at the same handwritten record, and come up with different spellings of the name. Be creative when searching for your Priebus ancestors -- we often search for misspellings intentionally to see if we missed any records."}, {"url": "http://www.democraticunderground.com/10021210221", "passage_text": "I know other Priebus families in Wisconsin, it not an uncommon surname in Wisconsin, and Reinhold is obviously German. Lots of Germans here (beer, brats, cheese after all). But I never have heard the name Reince. That's a new one, apparently for almost everyone. Reinhold Priebus could easily be a German name. I have no idea where the Reince comes from, and neither does anyone else I can find on Google. One source says that Reince is an obscure French family name."}]