[{"url": "http://www.altiusdirectory.com/Sports/wnba-salaries.php", "passage_text": "WNBA Salaries in the year. According to the estimations, average salary of WNBA team member in 2014 will be around $72,000. While the total average wages of league will be approximately $10,368,000. The minimum salary for the player in the WNBA team will be $37,950. While the players who have at least played six seasons then it is estimated that they will be able to earn an amount of $107,000 in this season. WNBA salaries Vs NBA salaries: Comparing with the craze on the match is good with both the Leagues. But the salaries are very low when compared to NBA salaries. The minimum salary of the player starts from 3 Lakh dollars to a maximum of 30 million dollars in the NBA."}, {"url": "http://www.altiusdirectory.com/Sports/wnba-salaries.php", "passage_text": "Average salaries of the WNBA players will be varying from season to season but there will be very little variation. According to the records, in the year 2010 salary for the entire team of WNBA was $827,000. WNBA salaries Vs NBA salaries: Comparing with the craze on the match is good with both the Leagues. But the salaries are very low when compared to NBA salaries. The minimum salary of the player starts from 3 Lakh dollars to a maximum of 30 million dollars in the NBA."}, {"url": "http://www.huffingtonpost.com/visualnewscom/visualizing-the-yearly-sa_b_4184716.html", "passage_text": "That's right, $5.15 million a year multiplied by the average NBA career length of 4.8 years, I would have netted $24.7 million. Those are the latest salary figures, visualized by the folks at Sports Interaction. Looks like I should have gotten better at basketball while I had the chance. The figures are staggering, with NBA's average player salary clocking in at $5.15 million, $1.85 million more than players in Major League Baseball who average close to $3.2 million a year. Major League Soccer rounds out the bottom of the list, with players making a relatively meager average salary of $0.16 million. "}, {"url": "http://www.livestrong.com/article/347157-what-is-the-average-salary-of-a-basketball-player/", "passage_text": "In the United States, professional women's basketball players make significantly less than men's players. The minimum salary for a WNBA player in 2011 is $35,880, with the maximum $103,500 for a six-year veteran who qualifies for a maximum contract. Major League Baseball players earn an average of $3,014,572 a year, with top players making $20 million to $25 million a season. National Football Players average less, partially due to the greater number of players per team."}, {"url": "http://www.ridiculousupside.com/2014/1/9/5291852/has-the-maximum-nba-d-league-player-salary-increased", "passage_text": "Salaries remain flat: $25,500, $19,000 and $13,000 for the league's three player classifications, which means D-League players are virtually playing for free -- and a modest per diem on the road of $40 compared to $120 in the NBA -- although they do receive housing and insurance benefits. Something interesting to note is that, according to Stein, the per-team salary cap has actually decreased, from $178,000 to a now $173,000. With ten players per team, that's an average D-League salary of $17,300. For more, see below:"}, {"url": "http://www.blackenterprise.com/lifestyle/wnba-player-salaries-vs-nba-salaries/", "passage_text": "That’s just barely over six figures. The average salary of a WNBA player for the 2012 season was $72,000 while the league minimum rests just above $35,000 for rookies. Players with three or more years experience earn at least $51,000. $72,000 is still a decent check to people earning thousands lesser"}, {"url": "http://www.livestrong.com/article/347157-what-is-the-average-salary-of-a-basketball-player/", "passage_text": "The average salary for NBA players varies depending on how many years they have been in the league, averaging out at just over $3 million per year. The minimum salary for a rookie in the 2010-11 season is $473,604, jumping up to $885,120 after three years in the league and $1,352,181 for a 10-year veteran. Elite players make $10 million to $15 million per year, with Los Angeles Lakers guard Kobe Bryant having the highest salary in 2010-11 at $24,806,250. Major League Baseball players earn an average of $3,014,572 a year, with top players making $20 million to $25 million a season. National Football Players average less, partially due to the greater number of players per team."}, {"url": "http://www.buzzfeed.com/lindseyadler/52-nba-players-who-make-more-than-the-entire-wnba", "passage_text": "This makes the average total league-wide wages $10,368,000. It’s important to note that the WNBA, unlike the NBA, forbids publicly disclosing the details of a player’s contract/salary. The WNBA consists of 12 teams with 12-player rosters and a minimum salary of $37,950. The maximum (for players who have played at least six seasons) is $107,000. The average salary of a WNBA player is estimated to be around $72,000. It’s important to note that the WNBA, unlike the NBA, forbids publicly disclosing the details of a player’s contract/salary."}, {"url": "http://www.businessinsider.com/chart-nba-average-salary-2014-4", "passage_text": "Follow Business Insider: Manchester City is the highest-paid team in the world as their players have an average annual salary of $8.1 million. But if we look at all the teams, basketball players in the NBA have the largest average salary of any league in the world. The average NBA player made $4.5 million last year, slightly better than the average salary for players in India's top cricket league, the Indian Premier League. "}]