[{"url": "http://genxfinance.com/what-does-etf-stand-for/", "passage_text": "ETF is the abbreviation of exchange traded fund, sometimes people will refer to this as electronic traded fund but the first is more correct. So that is it, that is all you wanted to know, you can click away from the page now. Well I guess I will say a little more on the subject. An ETF is a mutual fund which is traded on a stock exchange, blending the primary aspects of both traditional mutual funds and individual stocks. For more information on etfs vs. mutual funds go here."}, {"url": "http://www.answers.com/Q/What_does_ETF_stand_for", "passage_text": "ETF stands for Exchange-Traded Fund. ETF's are investment funds. They are traded on the stock market like stocks. They are a very popular exchange-traded product. Edit. Share to: Jpipper. The acronym ETF stands for 'exchange-traded fund', referring to investments that can be bought and sold like stocks. Some of the ETF commodities currently on the stock market … include the PowerShares Global Agriculture Portfolio and the Market Vectors Gold Miners ETF. Answers Publisher."}, {"url": "http://www.ehow.com/info_7737372_etf-stock-exchange-definitions-stand.html", "passage_text": "Types of ETFs. The first ETF was the SPDR S&P 500 fund, symbol SPY, which owns the same stocks in the same proportion as the S&P 500 stock index. There are ETFs that track all of the major stock indexes and a wide range of sector focused stock indexe"}, {"url": "http://www.answers.com/Q/What_does_ETF_stand_for", "passage_text": "ETF stands for exchange traded funds. It is a portfolio of  stocks or bonds that is sold to investors on open exchanges. The  investor purchases these shares through a br … oker. ETFs are often  inexpensive and are generally indexed to a particular published  benchmark. They are not mutual funds however. The acronym ETF stands for 'exchange-traded fund', referring to investments that can be bought and sold like stocks. Some of the ETF commodities currently on the stock market … include the PowerShares Global Agriculture Portfolio and the Market Vectors Gold Miners ETF. Answers Publisher."}, {"url": "http://www.investopedia.com/terms/e/etf.asp", "passage_text": "BREAKING DOWN 'Exchange-Traded Fund (ETF)'. An ETF is a type of fund which owns the underlying assets (shares of stock, bonds, oil futures, gold bars, foreign currency, etc.) and divides ownership of those assets into s hares. DEFINITION of 'Exchange-Traded Fund (ETF)'. An ETF, or exchange traded fund, is a marketable security that tracks an index, a commodity, bonds, or a basket of assets like an index fund. Unlike mutual funds, an ETF trades like a common stock on a stock exchange. ETFs experience price changes throughout the day as they are bought and sold"}, {"url": "http://www.nasdaq.com/etfs/what-are-ETFs.aspx", "passage_text": "ETFs for Passive Management. The purpose of an ETF is to match a particular market index, leading to a fund management style known as passive management. Passive management is the chief distinguishing feature of ETFs, and it brings a number of advantages for investors in index funds. In the simplest terms, Exchange Traded Funds (ETFs) are funds that track indexes like the NASDAQ-100 Index, S&P 500, Dow Jones, etc."}, {"url": "http://www.ehow.com/info_7737372_etf-stock-exchange-definitions-stand.html", "passage_text": "Save. ETFs, or exchange-traded funds, are investment funds whose shares are bought and sold through the stock exchanges. The first ETF was launched in 1993 and by December, 2010, the Index Universe website listed almost 1,100 ETFs in its database. The first ETF was the SPDR S&P 500 fund, symbol SPY, which owns the same stocks in the same proportion as the S&P 500 stock index. There are ETFs that track all of the major stock indexes and a wide range of sector focused stock indexes"}]