[{"url": "http://judaism.about.com/od/judaismbasics/a/whatisahamsa.htm", "passage_text": "The name “hamsa” comes from the Hebrew word “hamesh,” which means five. “Hamsa” refers to the fact that there are five fingers on the talisman, though some also believe it represents the five books of the Torah. Sometimes it is called the Hand of Miriam, after Moses’ sister. In Islam, the hamsa is called the Hand of Fatima, in honor of one of the daughters of the Prophet Mohammed. Some say that in Islamic tradition the five fingers represent the Five Pillars of Islam. Many scholars believe that the hamsa predates both Judaism and Islam, though no one is certain of its origin."}, {"url": "http://judaism.about.com/od/judaismbasics/a/whatisahamsa.htm", "passage_text": "By Ariela Pelaia. A hamsa is an amulet shaped like a hand, with three extended fingers in the middle and a curved thumb or pinky finger on either side. It is thought to protect against the “evil eye” and is a popular motif in both Jewish and Middle Eastern jewelry. In Islam, the hamsa is called the Hand of Fatima, in honor of one of the daughters of the Prophet Mohammed. Some say that in Islamic tradition the five fingers represent the Five Pillars of Islam. Many scholars believe that the hamsa predates both Judaism and Islam, though no one is certain of its origin."}, {"url": "http://jewelryinfoplace.com/symbolism-in-jewelry/", "passage_text": "The Hamsa Hand is an ancient Middle Eastern amulet symbolizing the Hand of God. In all faiths it is a protective sign. It brings it’s owner happiness, luck, health, and good fortune. The hamsa hand has a wide variety of different spellings which includes hamesh, hamsa, chamsa, and khamsa. The hamsa hand sometimes includes an eye symbol, which is thought to protect against the evil eye. It is often worn as a pendant on a necklace but also is found on key chains, house decorations, baby carriages, and other jewelry items."}, {"url": "http://www.kashgar.com.au/articles/The-Hamsa-Hand-of-Fatima", "passage_text": "By Linda Heaphy. The Hamsa, also known as the Humes hand, the Hand of Fatima and the Hand of Miriam is a popular symbol found throughout the Middle East and northern Africa, particularly within the Islamic and Jewish faiths. It is one of the national symbols of Algeria and appears in its emblem. "}, {"url": "http://www.hamsameaning.com/hamsa_islam.html", "passage_text": "FATIMA’S HAND. Hamsa is the hand of Prophet Muhammad's daughter Fatima. It is the symbol of patience, loyalty, faith and resistance against difficulties. According to common belief, it tells of the Fatima's struggle for dignity and her tough life. "}, {"url": "http://goood.co.il/items~18~36.htm", "passage_text": "The hamsa hand is a popular apotropaic talisman for magical protection against the evil eye, and is one of the most popular amulets for good luck and prosperity. The word Hamsa means 5 and refers to the five fingers. The number 5 is a powerful number and symbolizes defence, power and fortune. "}, {"url": "http://www.canaan-online.com/Hamsa_hand_s/24.htm", "passage_text": "The Hamsa hand (Also known as the hand of Miriam) is an old popular amulet for protection from the evil eye known to draw positive energy, happiness, riches and health. The Hamsa includes 5 fingers and symbolizes the Creator’s protective hand. Five is by itself a number which is known as a protector. "}, {"url": "http://www.hamsameaning.com/", "passage_text": "In its simplest form the symbol for Hamsa is the hand. It is talismanic symbol that they believed would protect them from harm against the evil forces and bring them goodness, abundance, fertility, luck and good health. Hamsa is an icon used by man as a defence, in his struggle against the forces of evil. "}, {"url": "http://goodlucksymbols.com/hamsa-hand/", "passage_text": "The Hamsa Hand and the Hand of Fatima have become popular good luck symbols worldwide. They are common symbols in both Jewish and Muslim communities. In Jewish communities it is called the Hamsa Hand or the Hand of Miriam. In Muslim communities it is called the Hand of Fatima or the Khamsa. Hamsa is the Hebrew word for five. Likewise Khamsa is the Arabic word for five. The Hamsa hand and the Hand of Fatima are equally best known for the power to protect the owner from the evil eye and bring happiness to the holder. "}]