[{"url": "http://en.climate-data.org/location/14872/", "passage_text": "Temperature graph. January is the warmest month of the year. The temperature in January averages 22.3 °C. The lowest average temperatures in the year occur in July, when it is around 9.9 °C. "}, {"url": "http://www.worldweatheronline.com/v2/weather.aspx?q=Drakensberg+Garden,+South+Africa", "passage_text": "Drakensberg Garden weather summary for coming week. The maximum temperature for Drakensberg Garden over the next 7 day will be 29℃ (or 84℉) on Sunday 18 th October at around 2 pm. In the same week the minimum temperature will be 6℃ (or 42℉) on Saturday 17 th October at around 2 am. Our Drakensberg Garden weather forecaster is reporting Monday 19 th October to be the wettest day in the coming week with around 8.00mm (or 0.3 inches) of rainfall. It looks on Friday, 23 October the Drakensberg Garden weather is going to be patchy rain nearby. The visibility is going to be around 9 km i.e. 5 miles and an atmospheric pressure of 1017 mb. The daytime temperature is going to reach 23 °c and the temperature is going to dip to 8 °c at night."}, {"url": "http://www.sa-venues.com/weather/kwazulunatal.htm", "passage_text": "In Durban the air is heavy with humidity and the subtropical latitude of the city brings with it long, hot summers with rainfall, and very mild winters. Durban boasts an average of 320 days of sunshine a year. Temperatures range from 16 to 25 C in winter. During the summer months temperatures range from 23 to 33 C (between September and April). "}, {"url": "http://www.zoover.co.uk/south-africa/kwazula-natal/drakensberg/weather", "passage_text": "On holiday but what will the weather be like in Drakensberg?Here you will find the 14 day weather forecast for Drakensberg. "}, {"url": "http://www.responsibletravel.com/holidays/kwazulu-natal/travel-guide/kwazulu-natal-weather-climate", "passage_text": "Durban. Durban’s temperate, sub-tropical climate is famous for its mild and sunny winters with up to 320 days of sunshine annually. Temperatures range from 16°-25°C during the winter months but can reach 32C with relatively high humidity in summer and an annual rainfall of 1009 mm peaking in January and February. The hottest and coldest months in Durban are February and July with average temperatures around 28°C and 23°C respectively. The south coast climate is very similar to Durban itself while north of the city the summer weather is generally more humid the further north you travel. Summer temperatures vary from 24°-32°C and winter temperatures average 20°C. Sea temperatures vary from 18°-25°C in winter"}, {"url": "http://www.zoover.com/south-africa/kwazulu-natal/drakensberg/weather", "passage_text": "The Zoover 14 day weather forecast! On holiday but what will the weather be like in Drakensberg?Here you will find the 14 day weather forecast for Drakensberg. "}, {"url": "http://www.worldweatheronline.com/v2/weather.aspx?q=Drakensberg+Garden,+South+Africa", "passage_text": "Drakensberg Garden weather text for Sun 18 th October. The weather is going to be sunny. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1018 mb. The daytime temperature is going to reach 28 °c and the temperature is going to dip to 11 °c at night. It looks on Friday, 23 October the Drakensberg Garden weather is going to be patchy rain nearby. The visibility is going to be around 9 km i.e. 5 miles and an atmospheric pressure of 1017 mb. The daytime temperature is going to reach 23 °c and the temperature is going to dip to 8"}, {"url": "http://www.kwathabeng.co.za/weather/northern-drakensberg-weather.html", "passage_text": "Printable weather forecast. Weather for Northern Drakensberg: Current weather, tomorrows forecast and 15 day forecast for Northern Drakensberg in South Africa. We hope that the weather forecast will be useful in planning your holiday trip to Northern Drakensberg. Climate for Northern Drakensberg: current weather, weather forecast, humidity, temperature, highs and lows, rain forecast, snowfall, wind direction, wind speed. Klimaat vir Northern Drakensberg: weervoorspelling, weeruitsig, lugvogtigheid, temeratuur, warmtegraad, reenkaans, windrichting, windsterkte."}, {"url": "http://www.zoover.com/south-africa/kwazulu-natal/drakensberg/drakensberg-sun/hotel/weather", "passage_text": "On holiday but what will the weather be like in Drakensberg?Here you will find the 14 day weather forecast for Drakensberg. "}]