[{"url": "http://www.h1base.com/visa/work/h1bvisacaph1bquotasystem/ref/1568/", "passage_text": "The H1B cap is the number of H1B visas available during a Fiscal Year The H1B visa cap is also more commonly termed as the H1B visa quota. H1B visas applied for in 2014 are for the FY 2015 H1B Cap system. Foreign nationals issued H1B FY 2015 visas can start work in the US during 2014. H1B Status and Visa Petition Tracking. To check the status of an H1B visa that has been filed and a receipt number issued, both the sponsoring company and the future H1B worker can track the status of the application during processing by the USCIS."}, {"url": "http://www.myvisajobs.com/H1B_Visa.aspx", "passage_text": "Overview: H-1B Visa is a non-immigrant visa which allows U.S. employers to temporarily employ foreign professionals in specialty occupations for three years, extendable to six years. Family: Spouse and unmarried children under 21 years of age could apply for H-4 non-immigrant visa. "}, {"url": "http://www.h1bvisa.info/h1b_visa_quota", "passage_text": "The H1B Quota is the Allocation of H1B Visas That Are Available and That Can Be Issued Each Fiscal Year:(the H1B quota is also commonly known as the H1B cap)- The number of H1B visas issued each year through the quota system is subject to a cap limit that is determined by US Congress. How the H1B Cap / Quota System Works:The number of new H1B visas issued each year in the United States is subject to an annual congressionally-mandated H1B cap / quota.Each H1B quota applies to a particular Financial year which begins on October 1 (when the US Governments Financial year starts)."}, {"url": "http://www.hooyou.com/h-1b/", "passage_text": "The initial H-1B visa may be issued for up to three years. It may then be extended in the first instance for up to two years, and later on for one year, for a maximum of 6 consecutive years. In some cases, the H-1B visa can be extended beyond the 6 year limit. Please refer to our article “H-1B Extension beyond the 6 Year Limit.” The H1B visa can also “recapture” time spent abroad while in H-1B status. If an alien opts to “recapture” time abroad, then periods of time spent not in the US will NOT count gainst the 6 year limit of the H1B visa."}, {"url": "http://www.h1base.com/visa/work/check%20the%20status%20of%20your%20h1b%20visa%20application/ref/1171/", "passage_text": "For each H1B visa application, the USCIS assigns a unique 13 digit alphanumeric number. There are 4 USCIS service centers to handle H1B applications. The first 3 character of your receipt signifies the particular service center, where the application is being processed. They can be any one of WAC, EAC, SRC, and LIN. Following are the USCIS service center telephone numbers to find out your H1B visa status. Call the appropriate number and keep your receipt number ready in order to use this service."}, {"url": "http://www.hooyou.com/h-1b/", "passage_text": "The number of H-1B visas issued each year is subject to an annual cap (known as H1B cap) that is determined by the US Congress. Foreign workers must possess at least a bachelor's degree or its equivalent (this requirement can usually be met by having a 3-year degree and 3 years of relevant post-graduate experience). Please refer to our article “H-1B Extension beyond the 6 Year Limit.” The H1B visa can also “recapture” time spent abroad while in H-1B status. If an alien opts to “recapture” time abroad, then periods of time spent not in the US will NOT count gainst the 6 year limit of the H1B visa."}, {"url": "https://en.wikipedia.org/wiki/H-1B_visa", "passage_text": "The H-1B is a non-immigrant visa in the United States under the Immigration and Nationality Act, section 101(a)(15)(H). It allows U.S. employers to temporarily employ foreign workers in specialty occupations. Even though the H-1B visa is a non-immigrant visa, it is one of the few visa categories recognized as dual intent, meaning an H-1B holder can have legal immigration intent (apply for and obtain the green card) while still a holder of the visa."}, {"url": "http://www.h1bvisa.info/h1b_visa_quota", "passage_text": "- The current H1B visa allocation for the 2011 H1B quota is set at a Total of 85,000 (65,000 plus an additional 20,000 for International students that graduate with an MBA or higher from a US University). As H1B visas are filed and issued during the year, the available quota reduces. How the H1B Cap / Quota System Works:The number of new H1B visas issued each year in the United States is subject to an annual congressionally-mandated H1B cap / quota.Each H1B quota applies to a particular Financial year which begins on October 1 (when the US Governments Financial year starts)."}, {"url": "http://www.visapro.com/H1B-Visa/H1B-Visa.asp?_kk=how%20to%20get%20h1%20visa&_kt=ba7edd81-1dfe-4f79-9525-12a5b49217ab", "passage_text": "The H1B visa category allows organizations with a Federal Identification Number/IRS tax number to employ a foreign professional to work in a specialty occupation for up to six years. Examples of specialty occupations include accountant, computer analyst, engineer, financial analyst, scientist or architect. "}]