[{"url": "http://www.answers.com/Q/What_magma_is_the_the_most_abundant_type_erupted_at_oceanic_spreading_centers", "passage_text": "The type of volcano and eruption from basaltic magma would be a  cinder cone volcano. The eruption would be a mild explosive  eruption. It would be mainly ash and scoria. 3 people found this useful. The most violent type of volcanic eruption is a Plinian eruption.  This is also one of the largest types of eruptions. This was the  type of eruption of the famed Mount Vesu … vius in 79 AD. Answered."}, {"url": "http://www.answers.com/Q/What_magma_is_the_most_abundant_type_erupted_at_oceanic_spreading_centers", "passage_text": "Share to: The ocean being made of water, hydrogen and oxygen are the most common elements in the ocean. Also, the ocean is made up of salt water, so, sodium, chlorine, magnesium, sulfur … , calcium, and potassium are abundant in the ocean. There is about 86% oxygen, 11% hydrogen and each of the rest is less than 2%. 1  The Periodic Table of Elements Life is sustained by a number of chemical elements. The type of eruption that is characterized by an abundant  pyroclasts is Strombolian eruption. Large blobs of lava and hot  rock, called pyroclasts, are tossed from its cent … ral vent during  this eruption."}, {"url": "http://www.answers.com/Q/What_magma_is_the_the_most_abundant_type_erupted_at_oceanic_spreading_centers", "passage_text": "The ocean being made of water, hydrogen and oxygen are the most common elements in the ocean. Also, the ocean is made up of salt water, so, sodium, chlorine, magnesium, sulfur … , calcium, and potassium are abundant in the ocean. There is about 86% oxygen, 11% hydrogen and each of the rest is less than 2%. The most violent type of volcanic eruption is a Plinian eruption.  This is also one of the largest types of eruptions. This was the  type of eruption of the famed Mount Vesu … vius in 79 AD. Answered."}, {"url": "http://volcano.oregonstate.edu/book/export/html/198", "passage_text": "The lava produced at the spreading centers is basalt, and is usually abbreviated MORB (for Mid-Ocean Ridge Basalt). MORB is by far the most common rock type on the Earth's surface, as the entire ocean floor consists of it. Shield Volcanoes. Shield volcanoes are the largest volcanoes on Earth that actually look like volcanoes (i.e. not counting flood basalt flows). The Hawaiian shield volcanoes are the most famous examples. Shield volcanoes are almost exclusively basalt, a type of lava that is very fluid when erupted. For this reason these volcanoes are not steep (you can't pile up a fluid that easily runs downhill)"}, {"url": "http://www.answers.com/Q/What_magma_is_the_most_abundant_type_erupted_at_oceanic_spreading_centers", "passage_text": "The type of volcano and eruption from basaltic magma would be a  cinder cone volcano. The eruption would be a mild explosive  eruption. It would be mainly ash and scoria. The type of eruption that is characterized by an abundant  pyroclasts is Strombolian eruption. Large blobs of lava and hot  rock, called pyroclasts, are tossed from its cent … ral vent during  this eruption."}, {"url": "https://answers.yahoo.com/question/index?qid=20111111212222AAP3wdM", "passage_text": "Answers. Best Answer: Basalt eruptions are most prevalent in oceanic eruptions, at sea floor spreading zones and formation of island arcs. Felsic eruptions, which are typically granitic or rhyolytic, are more common in continental eruptions. The predominant eruptions are oceanic, so basaltic eruptions are more common. A theory of the evolution of a volcano maintains that eruptions of young volcanoes start out basaltic and become more and more felsic as the volcano matures. This is thought to be to magma differentiation and fractionation. Source(s):"}]