[{"url": "http://www.answers.com/Q/What_organelle_surrounds_the_nucleus", "passage_text": "The nucleus of a cell is surrounded by the nuclear envelope, which is the semipermeable membrane around the nucleus. The organelle that surrounds the nucleus is the cytoplasm."}, {"url": "http://cellprojectscience.weebly.com/nucleus-nucleolus-and-nuclear-membrane.html", "passage_text": "The Nucleus is what is usually around the center of the cell that contains the Nucleolus and is surrounded by the Nuclear Membrane or the Nuclear Envelope. The Nucleus is the brain of the cell. Its function is that it tells the cell what to do and how to do that."}, {"url": "http://cellsorganelles.weebly.com/the-control-center.html", "passage_text": "The nucleus is surrounded by a nuclear envelope, which is a double membrane that protects the nucleus by filtering what can leave and enter (like the cell membrane), and separates the nucleus from the rest of the cell."}, {"url": "http://cellprojectscience.weebly.com/nucleus-nucleolus-and-nuclear-membrane.html", "passage_text": "There is a whole other world inside the Nucleus. The Nucleus is what is usually around the center of the cell that contains the Nucleolus and is surrounded by the Nuclear Membrane or the Nuclear Envelope. The Nucleus is the brain of the cell. Its function is that it tells the cell what to do and how to do that."}, {"url": "http://www.fallriverschools.org/Chart%20on%20Cell%20Organelles.pdf", "passage_text": "- contains chromatin which consists of DNA and protein-contains the nucleolus-controls all of the cell’s activities because it contains DNA which is the master plan for the whole organism. - surrounded by a double membrane called the nuclear envelope. - contains the. nucleolus."}, {"url": "http://cellsorganelles.weebly.com/the-control-center.html", "passage_text": "The nuclear envelope is a double membrane (meaning it has a Primary/Outer and a Secondary/Inner layer) that surrounds the nucleus itself. It is made of a phospholipid bi-layer, like the cell membrane, and contains many pores for filtering."}]