[{"url": "http://smallbusiness.chron.com/lineup-object-sketchup-27546.html", "passage_text": "Click the Google SketchUp folder, then click the Google SketchUp entry. Step 2. Open the scene that you would like to work on by clicking File, then Open.. Use the Windows Explorer box that appears to locate your scene and double-click to open it. Click the Select tool, located in the upper left-hand corner of the user interface, then triple-click the object that you would like to manipulate. Step 4. Click the red Move tool, then click the object that you are aligning the first object with."}, {"url": "http://www.dummies.com/how-to/content/how-to-move-objects-in-google-sketchup-8.html", "passage_text": "The Move tool is the one that looks like crossed red arrows. Using this tool involves clicking the entity you want to move, moving it to where you want it to be, and clicking again to drop it. The maneuver isn’t complicated, but getting the hang of it takes a bit of time. Here are tips for using Move successfully: Click, move, and click. Don’t drag your mouse. To move something in one of the colored directions, just wait until you see the dotted On Axis linear inference appear; then hold down Shift to lock yourself in that direction. Don’t forget about the Measurements box. You can move things precise distances with the Measurements box. 1  Add a Comment."}, {"url": "http://www.ehow.com/how_10071629_make-objects-smaller-sketchup.html", "passage_text": "Instructions. Click the Select tool located in the upper left-hand corner of the SketchUp interface. Click the object that you would like to resize. Click Tools, then select Scale.. Click one of the small, green boxes that appear on the object."}, {"url": "http://www.mastersketchup.com/10tricksmovetool/", "passage_text": "1 Reference other points in your model – You don’t have to select a point on the object you want to move, in order to move it. 2  You simply need to have it pre-selected. 3  When you want to move something in SketchUp, you can pre-select it with the Select tool (Spacebar) . 1 Tap ESC to deselect any entities, then hover over a point with the Move tool (M) , until the inference system snaps to it. ( 2 Notice how the Autofold feature kicks in here). 3  Merge edges or points together – In SketchUp, no two points or edges can exist in the same space (Within the same group or component) ."}, {"url": "http://howtech.tv/graphics/how-to-move-objects-in-google-sketchup/", "passage_text": "This makes the dotted line bold and its color will change to the one corresponding with the parallel axis. Step # 6 – Copy the object. The move tool in Sketchup can also be used to copy different objects to set up your scene. For this, select your object and while working with the move tool press down “ctrl”. When you do this a “+” sign appears on top of the move cursor. "}, {"url": "http://www.mastersketchup.com/10tricksmovetool/", "passage_text": "1 When you want to move something in SketchUp, you can pre-select it with the Select tool (Spacebar) . 2  Then use the Move tool (M) to reference a different set of points in your model for length or alignment. 1 Tap ESC to deselect any entities, then hover over a point with the Move tool (M) , until the inference system snaps to it. ( 2 Notice how the Autofold feature kicks in here). 3  Merge edges or points together – In SketchUp, no two points or edges can exist in the same space (Within the same group or component) ."}, {"url": "http://www.dummies.com/how-to/content/how-to-move-objects-in-google-sketchup-8.html", "passage_text": "To stack these boxes precisely, click the bottom corner of the soon-to-be top box to grab it there and then move the cursor over the top corner of the bottom box to drop it. Now the boxes are lined up perfectly. Press the Esc key to cancel a move operation. To move something in one of the colored directions, just wait until you see the dotted On Axis linear inference appear; then hold down Shift to lock yourself in that direction. Don’t forget about the Measurements box. You can move things precise distances with the Measurements box. 1  Add a Comment."}, {"url": "http://www.youtube.com/watch?v=-k2IigiJJ0k", "passage_text": "Step # 6 -- Copy the object. The move tool in Sketchup can also be used to copy different objects to set up your scene. For this, select your object and while working with the move tool press down ctrl. When you do this a + sign appears on top of the move cursor. Drag it while pressing ctrl and another copy emerges. To know more as to how to move objects in Google SketchUp follow the steps given below. Don't forget to check out our site http://howtech.tv/ for more free how-to videos! http://youtube.com/ithowtovids-our feed. http://www.facebook.com/howtechtv-join us on facebook. https://plus.google.com/1034403827176.."}, {"url": "http://www.youtube.com/watch?v=wNjyBm6n_-8", "passage_text": "Learn how to move and copy objects in your Sketchup projects using the Move tool. 1  Science & Technology. 2  Standard YouTube License. "}]