[{"url": "https://en.wikipedia.org/wiki/Ventricular_septum", "passage_text": "The interventricular septum (IVS) , (or ventricular septum, or during development septum inferius), is the stout wall separating the lower chambers (the ventricles) of the heart from one another. The ventricular septum is directed obliquely backward to the right, and curved with the convexity toward the right ventricle; its margins correspond with the anterior and posterior longitudinal sulci."}, {"url": "http://www.merriam-webster.com/medical/interventricular%20septum", "passage_text": "Medical Definition of INTERVENTRICULAR SEPTUM. : the curved slanting wall that separates the right and left ventricles of the heart and is composed of a muscular lower part and a thinner more membranous upper part. What made you want to look up interventricular septum? Tweet. : the curved slanting wall that separates the right and left ventricles of the heart and is composed of a muscular lower part and a thinner more membranous upper part."}, {"url": "http://medical-dictionary.thefreedictionary.com/Ventricular+septum", "passage_text": "1). interventricular septum (septum interventricula´re cor´dis) the partition separating the right and left ventricles of the heart; called also ventricular septum. nasal septum a plate of bone and cartilage covered with mucous membrane that divides the nasal cavity. septum lu´cidum septum pellucidum"}, {"url": "http://medical-dictionary.thefreedictionary.com/interventricular+septum", "passage_text": "atrioventricular septum the part of the membranous portion of the interventricular septum between the left ventricle and the right atrium. deviated septum an injury or malformation of the nasal septum so that one part of the nasal cavity is smaller than the other; this is fairly common and seldom causes complications. the part of the membranous portion of the interventricular septum between the left ventricle and the right atrium. bulbar septum. a septum, formed by merging of the bulbar cushions, divides the bulbus cordis into aortic and pulmonary outflows. cystic septum pellucidum."}, {"url": "http://medical-dictionary.thefreedictionary.com/interventricular+septum", "passage_text": "atrioventricular septum. the part of the membranous portion of the interventricular septum between the left ventricle and the right atrium. bulbar septum. a septum, formed by merging of the bulbar cushions, divides the bulbus cordis into aortic and pulmonary outflows. cystic septum pellucidum."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4002", "passage_text": "Interventricular septum: The stout wall that separates the lower chambers (the ventricles) of the heart from one another. A hole in the interventricular septum is termed a ventricular septal defect (VSD). "}, {"url": "https://en.wikipedia.org/wiki/Ventricular_septal_defect", "passage_text": "A ventricular septal defect (VSD) is a defect in the ventricular septum, the wall dividing the left and right ventricles of the heart. The ventricular septum consists of an inferior muscular and superior membranous portion and is extensively innervated with conducting cardiomyocytes. The membranous portion, which is close to the atrioventricular node, is most commonly affected in adults and older children in the United States. Ventricular septal defect. Figure A shows the structure and blood flow in the interior of a normal heart. Figure B shows two common locations for a ventricular septal defect. The defect allows oxygen-rich blood from the left ventricle to mix with oxygen-poor blood in the right ventricle."}, {"url": "http://medical-dictionary.thefreedictionary.com/Ventricular+septum", "passage_text": "a congenital heart defect in which there is persistent patency of the ventricular septum in either the muscular or fibrous portion most often due to failure of the bulbar septum to completely close the interventricular foramen. interventricular septum (septum interventricula´re cor´dis) the partition separating the right and left ventricles of the heart; called also ventricular septum."}, {"url": "http://medical-dictionary.thefreedictionary.com/interventricular+septum", "passage_text": "interventricular septum (septum interventricula´re cor´dis) the partition separating the right and left ventricles of the heart; called also ventricular septum. nasal septum a plate of bone and cartilage covered with mucous membrane that divides the nasal cavity. the part of the membranous portion of the interventricular septum between the left ventricle and the right atrium. bulbar septum. a septum, formed by merging of the bulbar cushions, divides the bulbus cordis into aortic and pulmonary outflows. cystic septum pellucidum."}]