[{"url": "http://en.mimi.hu/astronomy/north_celestial_pole.html", "passage_text": "Because of precession, we see the ~ , which is currently located close to Polaris, swing across the stars in a wide loop around the north ecliptic pole every 26,000 years. The south celestial pole similarly loops around in the far-southern sky. Today, the ~ points to within just 1 of the arc of Polaris. Similarly, a Dec of +90 degrees points to the  ~  and -90 degrees points to the  South Celestial Pole .. The word Celestial is used to distinguish between, for example, the North Pole in the sky and the North Pole on the Earth."}, {"url": "https://en.wikipedia.org/wiki/Pole_star", "passage_text": "A similar concept also applies to other planets than the Earth. In practice, the term pole star usually refers to Polaris, which is the current northern pole star, also known as the North Star. The south celestial pole lacks a bright star like Polaris to mark its position. It is consequently known as Polaris (from Latin stella polaris pole star). It was formerly sometimes known as Cynosura, from a time before it was the pole star, from its Greek name meaning dog's tail (as the constellation of Ursa Minor was interpreted as a dog, not a bear, in antiquity)."}, {"url": "https://en.wikipedia.org/wiki/Pole_star", "passage_text": "The closest bright star to the north celestial pole is Polaris. At magnitude 1.97 (variable), it is the brightest star in the Ursa Minor constellation (at the end of the handle of the Little Dipper asterism). As of October 2012 its declination is +89°19′8″ (at epoch J2000 it was +89°15′51.2″). It is consequently known as Polaris (from Latin stella polaris pole star). It was formerly sometimes known as Cynosura, from a time before it was the pole star, from its Greek name meaning dog's tail (as the constellation of Ursa Minor was interpreted as a dog, not a bear, in antiquity)."}, {"url": "http://en.mimi.hu/astronomy/north_celestial_pole.html", "passage_text": "It is a common misconception that the North Star is the brightest in the sky. The North Star is current Polaris (right ascension, declination) since it is closest to the ~ . However, due to precession of the equinoxes, the pole rotate s through the sky with a period of about 26,000 years. Similarly, a Dec of +90 degrees points to the  ~  and -90 degrees points to the  South Celestial Pole .. The word Celestial is used to distinguish between, for example, the North Pole in the sky and the North Pole on the Earth."}, {"url": "http://en.mimi.hu/astronomy/north_celestial_pole.html", "passage_text": "In the northern hemisphere, the ~ is within a degree of Polaris, the North Star. celestial sphere ... Our current name for the star, Polaris, is Latin and abbreviation for Stella Polaris, The Pole Star .. The name reflects the position of the star near the ~ . Similarly, a Dec of +90 degrees points to the  ~  and -90 degrees points to the  South Celestial Pole .. The word Celestial is used to distinguish between, for example, the North Pole in the sky and the North Pole on the Earth."}, {"url": "http://www.space.com/15567-north-star-polaris.html", "passage_text": "So at any hour of the night, at any time of the year you can readily find Polaris and it is always found in a due northerly direction. If you were at the North Pole, the North Star would be directly overhead. That’s true now, anyway. But Polaris won’t always be the North Star. "}, {"url": "http://www.constellation-guide.com/polaris-the-north-star/", "passage_text": "Polaris, also known as the North Star or Alpha Ursae Minoris, is the brightest star in Ursa Minor constellation and the closest bright star to the North Celestial Pole. Polaris was used as the pole star by navigators at least from Late Antiquity. It is currently 0.7° away from the pole and revolves around it in a small circle about one and a half degrees in diameter. Polaris wasn’t always the North Star."}, {"url": "https://en.wikipedia.org/wiki/Celestial_pole", "passage_text": "The north celestial pole currently is within a degree of the bright star Polaris (named from the Latin stella polaris, meaning pole star). Polaris can, of course, only be seen from locations in the northern hemisphere. Polaris is near the celestial pole for only a small fraction of the 25,700-year precession cycle. It will remain a good approximation for about 1,000 years, by which time the pole will have moved to be closer to Alrai (Gamma Cephei)."}, {"url": "https://en.wikipedia.org/wiki/Pole_star", "passage_text": "Currently, there is no South Star as useful as Polaris. Sigma Octantis is the closest naked-eye star to the south Celestial pole, but at apparent magnitude 5.45 it is barely visible on a clear night, making it unusable for navigational purposes. It is consequently known as Polaris (from Latin stella polaris pole star). It was formerly sometimes known as Cynosura, from a time before it was the pole star, from its Greek name meaning dog's tail (as the constellation of Ursa Minor was interpreted as a dog, not a bear, in antiquity)."}, {"url": "https://en.wikipedia.org/wiki/Celestial_pole", "passage_text": "In about 5,500 years, the pole will have moved near the position of the star Alderamin (Alpha Cephei), and in 12,000 years, Vega (Alpha Lyrae) will become our north star, but it will be about six degrees from the true north celestial pole. Polaris can, of course, only be seen from locations in the northern hemisphere. Polaris is near the celestial pole for only a small fraction of the 25,700-year precession cycle. It will remain a good approximation for about 1,000 years, by which time the pole will have moved to be closer to Alrai (Gamma Cephei)."}]