[{"url": "http://www.cooksinfo.com/sardines", "passage_text": "For the most part, though, any of the fish called a sardine will be a small fish, averaging 12 to 20 cm (4 1/2 to 7 1/2 inches), and can be used interchangeably (pace pilchard fans.) They will all be small, silvery fish that live in schools, and all have oily flesh. Tinned sardines are sold packed in either olive oil, vegetable oil, or a mustard sauce or a ketchup sauce. Fresh sardines are very popular in Spanish cooking and taste very different to the canned ones."}, {"url": "http://www.cooksinfo.com/sardines", "passage_text": "In Europe, the word sardine is used frequently, but not always, to mean a young pilchard; in North America, what is labelled as a sardine is frequently a sprat or a herring. In general, they are small versions of blue fish. Tinned sardines are sold packed in either olive oil, vegetable oil, or a mustard sauce or a ketchup sauce. Fresh sardines are very popular in Spanish cooking and taste very different to the canned ones."}, {"url": "http://intfishcan.com/ifc/retail-brisling-sardines.html", "passage_text": "Sild / Brisling Sardines / Sprats. Brisling sardines are tiny delicious fish caught in the icy waters of the North Atlantic during prime winter catching months. Brisling sardines can be unsmoked, lightly smoked or traditionally oak-smoked; when producing smoked products we use woodchips from a combination of 'Douglas Fir', Oak, and 'Beech."}, {"url": "https://en.wikipedia.org/wiki/Sardine", "passage_text": "Sardines, or pilchards, are common names used to refer to various small, oily fish within the herring family of Clupeidae. The term sardine was first used in English during the early 15th century and may come from the Mediterranean island of Sardinia, around which sardines were once abundant. The terms sardine and pilchard are not precise, and what is meant depends on the region. The United Kingdom's Sea Fish Industry Authority, for example, classifies sardines as young pilchards. One criterion suggests fish shorter in length than 15 cm (6 in) are sardines, and larger ones pilchards"}, {"url": "https://www.john-west.co.uk/products/brisling-sild/", "passage_text": "Brisling are also called Skippers and Sild are young Herring, and both are tasty little oil-rich fish that are similar to Sardines. Now that’s a lot of different fish types to think about, so we hope we haven’t confused you. "}, {"url": "http://www.thefreedictionary.com/sild", "passage_text": "sild. n. pl. sild or silds. A young herring that is processed as a sardine, especially in Scandinavia. [Norwegian and Danish, from Old Norse. n., pl. silds, (esp. collectively) sild. any immature or small herring, other than a sprat, that is canned as a sardine in Scandinavia."}, {"url": "http://www.thefreedictionary.com/sild", "passage_text": "Noun. 1. sild-any of various young herrings (other than brislings) canned as sardines in Norway. sardine-any of various small edible herring or related food fishes frequently canned. n., pl. silds, (esp. collectively) sild. any immature or small herring, other than a sprat, that is canned as a sardine in Scandinavia."}, {"url": "http://www.merriam-webster.com/dictionary/sild", "passage_text": "Definition of SILD. : a young herring other than a brisling that is canned as a sardine in Norway. ADVERTISEMENT. Norwegian. First Known Use: 1921"}, {"url": "http://www.holisticdogkitchen.com/englishlang/sardines.html", "passage_text": "* Brisling/sprats from the North/Baltic Seas * Herrings/Mackerels from the Americas. Brisling and Sild. The brisling (clupea sprattus) is a species of tiny fish found only in northern waters, and is considered by epicures to be the finest sardine available. There is no fish of any kind, anywhere, in anybody of water, which bears the name “sardine” in its natural original element, either in the scientific or commercial sense of the word."}]