[{"url": "http://www.ehow.com/info_8343697_magnet-keepers.html", "passage_text": "Stockbyte/Stockbyte/Getty Images. A permanent magnet is a piece of iron or a similar metal having its own magnetic field. Under ideal conditions, it will retain its magnetic strength for many years. Frequent drops, impacts or high temperatures weaken it. Magnetic Circuit. A magnetic field holds its strength best when the entire magnetic loop, or circuit, passes through a ferromagnetic metal at all points. A horseshoe magnet has an air gap between its two poles; the keeper closes this gap. A bar magnet, left by itself, will lose its strength over several months."}, {"url": "https://en.wikipedia.org/wiki/Magnet_keeper", "passage_text": "A magnet keeper, or armature is a ferromagnetic bar made from soft iron or steel which is placed across the poles of a permanent magnet to help preserve the strength of the magnet by completing the magnetic circuit; it is particularly useful for magnets which have a low magnetic coercivity, such as Alnico magnets. "}, {"url": "http://www.tutorvista.com/content/physics/physics-i/magnetism/magnetic-keepers.php", "passage_text": "Magnetic Keepers. If two magnets are placed side by side there will be mutual repulsion or attraction. This weakens the strength of the magnet. To prevent this, bar magnets are placed side by side with opposite poles near. A soft iron piece called a keeper is placed across the poles as shown in figure. This soft iron piece provides a path for the magnetic field lines to form a continuous loop. Thus it helps in preserving the magnetic field"}, {"url": "http://www.youtube.com/watch?v=-TXXVDQaeYM", "passage_text": "This shows some fun ways to manipulate and see magnetic fields using a horseshoe magnet, a steel keeper and some iron filings. To manipulate the magnetic field it talks about the concept of magnetic permeability. Watch my how-to video, http://www.wonderhowto.com/how-to-vid... How to use a horseshoe magnet, steel keeper & iron filings to explore magnetic fields on WonderHowTo. - http://rimstar.org"}, {"url": "http://brightsparkmagnetos.com/faqs/FAQs%20about%20magnetism%20and%20remagnetising/What%20is%20a%20keeper,%20and%20do%20I%20need%20to%20use%20one%20if%20I%20take%20the%20armature%20out%20of%20my%20rotating-coil%20magneto.htm", "passage_text": "FAQs (1) What is a 'keeper', and (2) do I need to use one if I take the armature out of my rotating-coil magneto? In short, (1) a keeper is a piece of iron or steel used to help a magnet retain its strength, and (2) for some magnetos, 'no', but for others, 'yes'. In detail, permanent magnets like to have an easy external path of, for example, steel or iron for the magnetic flux to flow along between their poles. When the armature core is aligned with the poles (as in Fig. 1) or rotated through, say, 60 degrees (as in Fig. 2), there is a relatively easy path for the magnetic flux through the pole laminations and the armature core and across the narrow but extensive air gaps between the poles and the core."}, {"url": "http://www.answers.com/Q/What_is_magnetic_keeper", "passage_text": "Yes, because the keepers are made up of iron, when the magnet is in contact with it they become temporary magnet. Keepers also have a useful safety function as they stop exter … nal metal being attracted to the magnet. 12 people found this useful. magnets tend to become weaker after some time if their poles are  left free. This is called self demagnetization to  avoid this bar magnets are kept in pairs separated by a … piece of  wood. A horseshoe magnet only needs one keeper across its poles."}, {"url": "http://www.ehow.com/info_8343697_magnet-keepers.html", "passage_text": "All permanent magnets exhibit what scientists call ferromagnetism, when a magnetic field produces a strong attractive force in the metal. Under the right conditions, a ferromagnetic metal piece acquires its own field, becoming magnetized. Magnetic Circuit. A magnetic field holds its strength best when the entire magnetic loop, or circuit, passes through a ferromagnetic metal at all points. A horseshoe magnet has an air gap between its two poles; the keeper closes this gap. A bar magnet, left by itself, will lose its strength over several months."}, {"url": "http://www.factmonster.com/dk/science/encyclopedia/magnetism.html", "passage_text": "MAGNETIC DOMAINS. MAGNETIC FIELD. FIND OUT MORE. Magnetism is what gives magnets their ability to attract objects made of iron or steel. A magnet creates around itself a region of space with special properties. This region is known as a MAGNETIC FIELD. When two magnets come near each other, their fields create forces that attract or repel. This turns the material into a magnet. A magnet often has an iron keeper to help it stay magnetized. A magnet creates a magnetic flux, which is rather like a current flowing through an electrical circuit – although in a magnet, nothing actually moves. A high magnetic flux keeps the magnet’s domains lined up."}]