[{"url": "http://k6educators.about.com/od/educationglossary/g/earlychildhoode.htm", "passage_text": "By Beth Lewis. Definition: Early Childhood Education is a term that refers to educational programs and strategies geared toward children from birth to the age of eight. This time period is widely considered the most vulnerable and crucial stage of a person's life. Early childhood education often focuses on guiding children to learn through play. The term often refers to preschool or infant/child care programs."}, {"url": "http://education.laws.com/early-childhood-education", "passage_text": "Early childhood education is a term that is used to commonly describe the formal teaching and care of young children by individuals or professionals other than their family or in settings outside the child’s home. That being said, the general definition adopted by the majority of school districts throughout the world will typically employ a system of early childhood education starting from birth to when a child starts school—which typically occurs at the age of five."}, {"url": "http://www.naeyc.org/DAP", "passage_text": "OVERVIEW. Developmentally appropriate practice, often shortened to DAP, is an approach to teaching grounded in the research on how young children develop and learn and in what is known about effective early education. Its framework is designed to promote young children’s optimal learning and development. "}, {"url": "http://www.globalpartnership.org/focus-areas/early-childhood-care-and-education", "passage_text": "Investing in quality Early Childhood Care and Education can improve their well-being and close the education and poverty gap. Early childhood is defined as the period from birth to 8 years old. Quality Early Childhood Care and Education (ECCE) helps children develop their potential and promotes their social, emotional, physical and cognitive development. "}, {"url": "https://en.wikipedia.org/wiki/Early_childhood_education", "passage_text": "Early childhood education (ECE) is a branch of education theory which relates to the teaching of young children (formally and informally) up until the age of about eight. Infant/toddler education, a subset of early childhood education, denotes the education of children from birth to age two. In a more contemporary approach, organizations such as the National Association of the Education of Young Children (NAEYC) promote child-guided learning experiences, individualized learning, and developmentally appropriate learning as tenets of early childhood education."}, {"url": "https://en.wikipedia.org/wiki/Early_childhood_education", "passage_text": "While the first two years of a child's life are spent in the creation of a child's first sense of self, most children are able to differentiate between themselves and others by their second year. This differentiation is crucial to the child's ability to determine how they should function in relation to other people. In a more contemporary approach, organizations such as the National Association of the Education of Young Children (NAEYC) promote child-guided learning experiences, individualized learning, and developmentally appropriate learning as tenets of early childhood education."}, {"url": "http://www.healthofchildren.com/E-F/Early-Childhood-Education.html", "passage_text": "Early childhood education (ECE) programs include any type of educational program that serves children in the preschool years and is designed to improve later school performance. One of the first early childhood education initiatives in the United States was the Head Start program, started in 1965. Head Start is a federal government education initiative that has provided children from low-income families free access to early education."}, {"url": "http://www.healthofchildren.com/E-F/Early-Childhood-Education.html", "passage_text": "Description. Early childhood education (ECE) programs include any type of educational program that serves children in the preschool years and is designed to improve later school performance. In the second half of the twentieth century, the early education system in the United States grew substantially. One of the first early childhood education initiatives in the United States was the Head Start program, started in 1965. Head Start is a federal government education initiative that has provided children from low-income families free access to early education."}, {"url": "http://www.communityplaythings.com/resources/articles/2010/history-of-early-childhood-education", "passage_text": "Early childhood education, the care and instruction of young children outside of the home, over the last half century has become a downward extension of schooling. It is now the first rung on the educational ladder. "}, {"url": "https://www.naeyc.org/policy/excellence", "passage_text": "Early Years Are Learning Years. The demand for early childhood care and education programs continues to increase not only in response to the growing demand for out-of-home child care but also in recognition of the critical importance of educational experiences during the early years. An equitable and sufficient system of financing early childhood education in the United States is still elusive. Child care is financed through a patchwork of government, parent, and private sector resources."}]