[{"url": "https://www.bryantsuretybonds.com/auto-dealer-bonds", "passage_text": "An auto dealer surety bond is an agreement between three parties: the obligee (the state requiring the bond), the principal (the auto dealer) and the surety (the provider of the bond). The motor vehicle dealer bond guarantees that your dealership will operate in compliance with state regulations. "}, {"url": "https://www.suretybonds.com/auto-dealer-bonds.html", "passage_text": "Bond costs and requirements vary greatly by state as the bond amounts and regulations surrounding each license are established on a state level. Select your state below for more information about Auto Dealer Bonds in your area or call 1-800-308-4358 to speak with a surety expert. Georgia Auto Dealer Bonding. The state of Georgia does not require all auto dealers to provide surety bonds in Georgia. However, dealers who sell used vehicles must provide $35,000 of coverage that will be valid for two years."}, {"url": "http://www.dmv.org/buy-sell/car-dealers/surety-bonds.php", "passage_text": "Additionally, having a surety bond gives your dealership credibility to both your customers and the appropriate agencies in your state. Depending on where you work and what kind of dealership you plan to operate, you might need to file one of many different auto dealer bond types. Some common ones include: 1  DMV bonds. 2  RV bonds. 3  Motorcycle dealer bonds. 4  Used car dealer bonds."}, {"url": "http://www.dmv.org/buy-sell/car-dealers/surety-bonds.php", "passage_text": "Surety Bonds for Vehicle Dealers. Auto dealers in most states must file a surety bond with the state's Department of Motor Vehicles (DMV) before they can receive their auto dealer license. Unfortunately, purchasing an auto dealer bond can be one of the most confusing parts of getting a dealer license. Depending on where you work and what kind of dealership you plan to operate, you might need to file one of many different auto dealer bond types. Some common ones include: 1  DMV bonds. 2  RV bonds. 3  Motorcycle dealer bonds. 4  Used car"}, {"url": "http://www.bondsexpress.com/motor-vehicle-dealer-bonds/", "passage_text": "Motor Vehicle Dealer Bonds. Most of the time, a surety bond's purpose is to protect a consumer against damages due to fraud, defaulting on a contract, or other negative and wrongful behaviors on the part of a business providing a service or product."}, {"url": "http://www.bondsexpress.com/motor-vehicle-dealer-bonds/", "passage_text": "A motor vehicle dealer bond, sometimes also called a DMV bond, used car dealer bond, or auto dealer bond, guarantees that the motor vehicle dealer complies with all federal laws, state laws, local laws, and tax and judgment guidelines that relate to motor vehicles. Most of the time, a surety bond's purpose is to protect a consumer against damages due to fraud, defaulting on a contract, or other negative and wrongful behaviors on the part of a business providing a service or product."}, {"url": "http://www.jwsuretybonds.com/surety-bonds/commercial-bonds/auto_dealer_bond.htm", "passage_text": "Once you have your auto dealer bond in your hands you will need to: 1  Sign your bond. 2  Make a copy for your records. 3  Send the signed bond to the state (along with any other important paperwork provided by the state or bond agency). If you're just beginning your research, select your state from the map below to determine your requirements (you may see several bonds listed, such as new and used car dealer bonds, or none at all). If you have any doubts about which bond you need, it is best to contact a bond professional."}, {"url": "http://www.abcbondingoftexas.com/auto-dealer-bond/", "passage_text": "Auto dealer bond also known as MVD bond. C ar dealer bond is required by the State motor vehicle department to obtain a Car dealership license. Used Auto dealer bond does not protect the used car dealer from lawsuits, but it protects the consumer from fraud or misrepresentation by the car dealer. Dealer bond guarantee compliance with state laws, each state sets its own bond amount and expiration date. A two-year Texas motor vehicle dealer bonds are set by the state of Texas at $25,000."}, {"url": "http://www.jwsuretybonds.com/surety-bonds/commercial-bonds/auto_dealer_bond.htm", "passage_text": "#1: Determine Your Requirements. Most states require auto dealer bonds to operate a dealership, but not all. If you're just beginning your research, select your state from the map below to determine your requirements (you may see several bonds listed, such as new and used car dealer bonds, or none at all). If you have any doubts about which bond you need, it is best to contact a bond professional."}, {"url": "https://www.suretybonds.org/auto-dealer-bonds", "passage_text": "Lance Surety writes more Auto Dealer Bonds than any other type of bond, so our staff is experienced with each state’s specific requirements. Due to strong relationships with many top bonding companies, we offer exclusive programs to dealers throughout the nation at prices that cannot be matched. In most cases, applicants pay annual premium, which is a percentage of the bond amount. Dealers with excellent personal credit typically pay between 1 to 3% of the bond amount. However, customers with damaged are usually required to pay more. Bad credit programs range between 5 to 15"}]