[{"url": "http://www.answers.com/Q/How_much_does_a_General_Lee_Car_cost", "passage_text": "Tuition at Lee University (Cleveland, TN) costs $5,550 per semester. The estimated average cost per semester for full-time students with room and board (not including person … al expenses, books, or special fees) is $8,680. The estimated average cost per semester for full-time students without room and board (not including personal expenses, books, or special fees) is $5,805. Cost ranges from around one hundred dollars US for a tiny, off brand portable generator up to millions of dollars for large permanently installed generators. It really d … epends on the size and use."}, {"url": "http://money.cnn.com/2007/05/04/autos/general_lee_ebay_record/index.htm", "passage_text": "NEW YORK (CNNMoney.com) -- If the bids are real-and the eBayMotors.com auction was stopped once for fake bidding-a modified 1969 Dodge Charger, painted to look like the General Lee from the TV Show The Dukes of Hazzard, nearly became the most expensive car ever auctioned. I do something nice for the General about once a year, said Schneider. The car now has a 725 horsepower Hemi motor, Dodge Viper brakes and a roll cage, all of which allow it to race at over 200 miles per hour."}, {"url": "http://www.answers.com/Q/How_much_does_a_General_Lee_Car_cost", "passage_text": "Confidence votes 262K. A General Lee Car costs about 20,000 dollars, depending on the model and make. Another big cost that it may have is how many miles it has and the engine condition. Cost ranges from around one hundred dollars US for a tiny, off brand portable generator up to millions of dollars for large permanently installed generators. It really d … epends on the size and use."}, {"url": "http://www.autoblog.com/2007/05/04/holy-john-schneiders-general-lee-sold-for-nearly-10-mil/", "passage_text": "When we first posted that John Schneider, aka Bo Duke, was selling his personal 1969 General Lee Dodge Charger used in the cult classic show The Dukes of Hazzard and various other productions, the bidding on eBay Motors was at $2.3 million. According to this CNN article, if the winning bid holds, the General Lee will be the second most expensive car ever auctioned behind a rare 1931 Bugatti Type 41 Royal Sports Coupe that was sold by Christie's Auction House in 1987 for $11 million."}, {"url": "http://www.homeadvisor.com/cost/garages/build-a-garage/", "passage_text": "NEXT STEP. Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. The average national cost to build a garage is $23,573, with most homeowners spending between $14,621 and $32,525. When it comes to building a garage, a lot of factors come into play, which mimic other large-scale building projects"}, {"url": "http://money.cnn.com/2007/05/04/autos/general_lee_ebay_record/index.htm", "passage_text": "It speaks to the passion around the show and how iconic the General Lee is, said Andy Holeman, vice president of consumer marketing for Country Music Television, said of the auction when bids had reached $2.7 million. I do something nice for the General about once a year, said Schneider. The car now has a 725 horsepower Hemi motor, Dodge Viper brakes and a roll cage, all of which allow it to race at over 200 miles per hour."}, {"url": "http://money.cnn.com/2007/05/04/autos/general_lee_ebay_record/index.htm", "passage_text": "Ordinarily, a production-used General Lee would be worth about $150,000 to $200,000, said McKeel Hagerty, president of Hagerty Insurance, a collector car insurance company. About 20 of those are known to exist in reasonably good condition. I do something nice for the General about once a year, said Schneider. The car now has a 725 horsepower Hemi motor, Dodge Viper brakes and a roll cage, all of which allow it to race at over 200 miles per hour."}, {"url": "http://money.cnn.com/2007/05/04/autos/general_lee_ebay_record/index.htm", "passage_text": "That puts it just $1.1 million away from the $11 million paid for a 1931 Bugatti Type 41 Royale Sports Coupe sold by the auction house Christie's in 1987. To date, that is the highest price ever paid for a car at auction, according to Christie's. I do something nice for the General about once a year, said Schneider. The car now has a 725 horsepower Hemi motor, Dodge Viper brakes and a roll cage, all of which allow it to race at over 200 miles per hour."}, {"url": "http://www.smithbrosrestorations.com/why.php", "passage_text": "You can trust the Smith Bros to build your General Lee with the passion and integrity it deserves-fully endorsed by the original Dukes of Hazzard family-from the actors, mechanics, and stuntmen! And most importantly of all – the Smith Bros. ALONE have received the ‘mantle’ of authority to continue the General Lee building tradition; from none other than Chief Warner Bros General Lee mechanic and creator of the General Lee Wheelstander: Rich Sephton."}]