[{"url": "http://www.med.nyu.edu/radiology/about-us/subspecialties/neuro-interventional/our-services/brain-dural-arteriovenous-fistula", "passage_text": "An arteriovenous fistula is an abnormal connection between an artery and a vein. Any part of the body can have a fistula. The brain is surrounded by a tough fibrous cover called “dura mater” or “dura”. "}, {"url": "http://www.texasheart.org/HIC/Topics/Proced/vascular_access_surgery.cfm", "passage_text": "1 A fistula (also called an arteriovenous fistula or A-V fistula) is made by joining an artery and a vein under the skin in your arm. 2  When the artery and vein are joined, the pressure inside the vein increases, making the walls of the vein stronger. 3  The stronger vein can then receive the needles used for hemodialysis. There are 3 kinds of vascular access sites: 1 "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=22&ContentID=PulmonaryArteriovenousFistula", "passage_text": "A pulmonary arteriovenous fistula is an abnormal blood vessel that creates a potentially troublesome connection between a vein and an artery in the lung. It acts as a detour, sidestepping the normal route the blood is supposed to take. If a patient has symptoms or problems, medical attention is essential. "}, {"url": "https://en.wikipedia.org/wiki/Dural_arteriovenous_fistula", "passage_text": "A dural arteriovenous fistula (DAVF), not to be confused with dural arteriovenous malformation (DAVM), is an abnormal direct connection (fistula) between a meningeal artery and a meningeal vein or dural venous sinus. "}, {"url": "http://www.surgery.usc.edu/vascular/vascularaccess.html", "passage_text": "Types of Vascular Access. Arteriovenous Fistula. A surgeon creates an arteriovenous fistula by making a connection between an artery (which carries blood away from the heart) and a vein (which carries blood back to the heart). This artificial connection allows the vein to become larger and for the walls of the vein to thicken, a process termed maturation. An arteriovenous fistula is the preferred type of vascular access due to lower rate of infection and clot formation, resulting in greater longevity than other types of vascular access. However, not everyone is a good candidate for an arteriovenous fistula, particularly older patients and patients with small veins."}, {"url": "https://en.wikipedia.org/wiki/Arteriovenous_fistula", "passage_text": "An arteriovenous fistula is an abnormal connection or passageway between an artery and a vein. It may be congenital, surgically created for hemodialysis treatments, or acquired due to pathologic process, such as trauma or erosion of an arterial aneurysm. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/arteriovenous-fistula/basics/definition/CON-20034876", "passage_text": "Arteriovenous fistula. An arteriovenous (AV) fistula is an abnormal connection between an artery and a vein. Normally, blood flows from your arteries to your capillaries to your veins. Nutrients and oxygen in your blood travel from your capillaries to tissues in your body. With an arteriovenous fistula, blood flows directly from an artery into a vein, bypassing some capillaries. When this happens, tissues below the bypassed capillaries receive a diminished blood supply. Arteriovenous fistulas usually occur in the legs, but can develop anywhere in the body"}, {"url": "http://medical-dictionary.thefreedictionary.com/arteriovenous+fistula", "passage_text": "An arteriovenous fistula is a disruption of the normal blood flow pattern. Normally, oxygenated blood flows to the tissue through arteries and capillaries. Following the release of oxygen in the tissues, the blood returns to the heart in veins. An arteriovenous fistula is an abnormal connection of an artery and a vein. The blood bypasses the capillaries and tissues, and returns to the heart"}, {"url": "http://www.surgery.usc.edu/vascular/vascularaccess.html", "passage_text": "Hemodialysis, also called dialysis, is the most common treatment for kidney failure. A dialysis machine is an artificial kidney which cleanses the blood. During dialysis, blood is drawn from the patient into the dialysis machine, circulated through the machine, and then returned to the patient. An arteriovenous fistula is the preferred type of vascular access due to lower rate of infection and clot formation, resulting in greater longevity than other types of vascular access. However, not everyone is a good candidate for an arteriovenous fistula, particularly older patients and patients with small veins."}]