[{"url": "http://www.mayoclinic.org/diseases-conditions/post-traumatic-stress-disorder/basics/symptoms/CON-20022540", "passage_text": "Symptoms. Post-traumatic stress disorder symptoms may start within three months of a traumatic event, but sometimes symptoms may not appear until years after the event. These symptoms cause significant problems in social or work situations and in relationships. "}, {"url": "https://www.adaa.org/understanding-anxiety/posttraumatic-stress-disorder-ptsd/symptoms", "passage_text": "Symptoms of PTSD. PTSD is diagnosed after a person experiences symptoms for at least one month following a traumatic event. However symptoms may not appear until several months or even years later. The disorder is characterized by three main types of symptoms:"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001923/", "passage_text": "Post-traumatic stress disorder (PTSD), general anxiety disorder (GAD), and major depression disorder (MDD) are common debilitating disorders with a lifetime prevalence rate of approximately 12%, 2.6%, and 8% of Canadians, respectively. Post-Traumatic Stress Disorder (PTSD). An anxiety disorder that develops in reaction to physical injury or severe mental or emotional distress, such as military combat, violent assault, natural disaster, or other life-threatening events. PubMed Health Glossary. (Source: NIH-National Cancer Institute)."}, {"url": "http://www.healthyplace.com/anxiety-panic/ptsd/ptsd-symptoms-and-signs-of-ptsd/", "passage_text": "Post-traumatic stress disorder is diagnosed using the latest version of the Diagnostic and Statistical Manual of Mental Disorders, the DSM-IV-TR. In order to receive a PTSD diagnosis, symptoms must meet the following DSM-IV-TR criteria: 1. 1  The person must have: This harm, or threat of harm, may be directed towards the sufferer or another individual. Post-traumatic stress disorder (PTSD) symptoms include the persistent reliving of the trauma, avoidance of any place that is a trauma-reminder, trouble sleeping and many others. PTSD symptoms can be terrifying and life-altering, as the person tries to avoid any situation that may bring about severe anxiety. This avoidance can make a person's world much smaller and allow them to do fewer and fewer things as they fear the re-emergence of their post-traumatic stress disorder symptoms."}, {"url": "http://psychcentral.com/lib/differential-diagnosis-of-ptsd-symptoms/", "passage_text": "While the symptoms of posttraumatic stress disorder (PTSD) may seem similar to those of other disorders, there are differences. For example, PTSD symptoms may seem similar to those of anxiety disorders, such as acute stress disorder or obsessive-compulsive disorder. However, there are distinct differences between these disorders. With PTSD, the thoughts are invariably connected to a past traumatic event. PTSD symptoms can also seem similar to adjustment disorder because both are linked with anxiety that develops after exposure to a stressor. With PTSD, this stressor is a traumatic event. With adjustment disorder, the stressor does not have to be severe or outside the “normal” human experience"}, {"url": "http://www.cancer.gov/about-cancer/coping/survivorship/new-normal/ptsd-pdq", "passage_text": "Patients may also have feelings of shock, fear, helplessness, or horror. These feelings may lead to cancer-related post-traumatic stress (PTS), which is a lot like post-traumatic stress disorder (PTSD). PTSD is a specific group of symptoms that affect many survivors of stressful events. These events usually involve the threat of death or serious injury to oneself or others. PTS has many of the same symptoms as depression, anxiety disorders, phobias, and panic disorder. Some of the symptoms that may be seen in post-traumatic stress and in other conditions include: 1  Feeling defensive, irritable, or fearful. 2  Being unable to think clearly."}, {"url": "http://psychcentral.com/lib/symptoms-and-diagnosis-of-ptsd/", "passage_text": "Posttraumatic Stress Disorder (PTSD) was one of the diagnoses that received some revisions (PDF). PTSD used to be considered a type of anxiety disorder and in this edition was moved into a new category: “Trauma and Stress-related Disorders”. This could help de-stigmatize PTSD since it is no longer an anxiety related mental illness, but a disorder connected to an external event. "}, {"url": "http://www.cancer.gov/about-cancer/coping/survivorship/new-normal/ptsd-pdq", "passage_text": "Symptoms of cancer-related post-traumatic stress (PTS) are a lot like symptoms of other stress-related disorders. PTS has many of the same symptoms as depression, anxiety disorders, phobias, and panic disorder. Some of the symptoms that may be seen in post-traumatic stress and in other conditions include: 1  Feeling defensive, irritable, or fearful. 2  Being unable to think clearly."}]