[{"url": "http://work.chron.com/starting-postal-service-employee-make-7342.html", "passage_text": "Grade 1 City Carriers. Grade 1 city carriers started at step A to earn a mean $21.29 an hour or $44,291 a year effective Sept. 10, 2011. This was the rate negotiated for full-time employees by the National Association of Letter Carriers with the Postal Service. Carriers had to wait 96 weeks before moving on to the pay step B with its higher salaries. Full-time grade 2 city carriers also started at step A, which paid $22.21 per hour or $46,210 per year, with regular overtime pay of $33.32 per hour and bi-weekly wages of $1,777. Part-time flexible employees began with $23.11 per hour. These carriers also had to wait for 96 weeks before obtaining their pay increas"}, {"url": "http://www.ehow.com/info_7743228_much-postal-worker-earn.html", "passage_text": "As of 2010, mail processors make a median $25.25 per hour, with a range of $16.58 to $25.26, or an annual $52,520, with a range of $34,490 to $52,540. The state with the greatest concentration of mail processors is New Jersey, where salaries are at $23.94 or $49,800. Those working full-time earn a median $52,200 per year, with a range of $37,950 to $53,700. Postal service clerks work the desks at post offices by selling postage, processing money orders, mailing packages and selling postal supplies."}, {"url": "http://work.chron.com/average-pay-postal-worker-2050.html", "passage_text": "Postal Clerks. Clerks work at post offices, assisting customers who come in to purchase stamps or send and pick up mail. Across the nation, U.S. Postal Service clerks report an average wage of $25.41 per hour and an average salary of $52,860 per year. As of May 2011, 80 percent of USPS mail clerks received wages of between $23.87 and $26.56 per hour, and the median wage reported was $25.53 per hour. Related Reading: The Average Pay for an Auto Workers' Union Member. As of May 2011, the average hourly wage of a mail sorter was $23.26, an annual salary of approximately $48,380. Eighty percent of mail sorters reported receiving hourly wages of between $12.01 and $25.53."}, {"url": "http://about.usps.com/careers/working-usps/benefits.htm", "passage_text": "We offer a competitive compensation and benefits package for Postal Service™ career employees. Compensation. In addition to competitive basic pay rates and regular salary increases, depending on the type of job held, most employees may also receive overtime pay, night shift differential, and Sunday premium pay. LeaveThe Postal Service offers generous annual (vacation) and sick leave – 13 days of annual leave per year for the first 3 years, increasing to 20 days per year after 3 years of service, and to 26 days per year after 15 years of service."}, {"url": "http://www.postalwork.net/pay_scales.htm", "passage_text": "The largest pay system in the Postal Service is predominantly for bargaining unit employees. There are also Executive and Administrative Schedules for non-bargaining unit members, with pay ranging from $23,279 up to an authorized maximum of $120,617. Each union negotiates the salary for their member. The Mail Handler Grade 4 and 5 pay scales are listed below and pay starts at the level 4 step AA at $16.08 per hour or $33,449 annually PLUS benefits."}, {"url": "http://work.chron.com/starting-postal-service-employee-make-7342.html", "passage_text": "These rates were effective on May 23, 2011 and were negotiated by the American Postal Workers Union. For postal workers in information technology or accounting, the pay tables started at grade 6, with salaries of $20.45 per hour or $40,896 per year as of Jan. 17, 2009. Carriers had to wait 96 weeks before moving on to the pay step B with its higher salaries. Full-time grade 2 city carriers also started at step A, which paid $22.21 per hour or $46,210 per year, with regular overtime pay of $33.32 per hour and bi-weekly wages of $1,777. Part-time flexible employees began with $23.11 per hour. These carriers also had to wait for 96 weeks before obtaining their pay increase"}, {"url": "http://www.ehow.com/info_7743228_much-postal-worker-earn.html", "passage_text": "Earnings per hour are and average of $25.10, as of 2010, with a range of $18.25 to $25.82, while annual income is $52,200, with a range of $37,950 to $53,700. The state paying the highest wages for postal clerks is the District of Columbia, with salaries at $24.81 per hour, or $51,600. The city with the same distinction is Fairbanks, Alaska, with wages at $25.25 per hour, or $52,350. Those working full-time earn a median $52,200 per year, with a range of $37,950 to $53,700. Postal service clerks work the desks at post offices by selling postage, processing money orders, mailing packages and selling postal supplies."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_postal_worker_earn", "passage_text": "Median annual earnings of Postal Service clerks were $40,950 in 2004. The middle 50 percent earned between $37,880 and $44,030. The lowest 10 percent had earnings of less than $36,040, while the top 10 percent earned more than $50,510. Median annual earnings of Postal Service mail sorters, processors, and processing machine operators were $39,430 in 2004. The middle 50 percent earned between $36,240 and $42,620. Although current 2007 updated salary ranges of USPS carriers … have not been released by the below figures from 2006 will give you a rough idea of the type of salary a carrier earns. Median annual earnings of Postal Service mail carriers were $44,450 in May 2004. The middle 50 percent earned between $37,590 and $50,580. The lowest 10 percent had earnings of less than $31,980, while the top 10 percent earned more than $54,24"}]