[{"url": "http://www.goodtherapy.org/blog/psychpedia/prefrontal-cortex", "passage_text": "The prefrontal cortex is a part of the brain located at the front of the frontal lobe. It is implicated in a variety of complex behaviors, including planning, and greatly contributes to personality development. Role of the Prefrontal Cortex. The prefrontal cortex is involved in a wide variety of functions, including: 1  Coordinating and adjusting complex behavior. 2  Impulse control and control and organization of emotional reactions. 3  Personality. 4  Focusing and organizing attention."}, {"url": "https://en.wikipedia.org/wiki/Frontal_lobe", "passage_text": "The frontal lobe contains most of the dopamine-sensitive neurons in the cerebral cortex. The dopamine system is associated with reward, attention, short-term memory tasks, planning, and motivation. "}, {"url": "http://neuroskills.com/brain-injury/frontal-lobes.php", "passage_text": "Frontal Lobes. The frontal lobes are considered our emotional control center and home to our personality. There is no other part of the brain where lesions can cause such a wide variety of symptoms (Kolb & Wishaw, 1990). The frontal lobes are involved in motor function, problem solving, spontaneity, memory, language, initiation, judgement, impulse control, and social and sexual behavior."}, {"url": "http://biology.about.com/od/anatomy/p/Frontal-Lobes.htm", "passage_text": "They are positioned at the frontmost region of the cerebral cortex and are involved in movement, decision-making, problem solving, and planning. There are three main divisions of the frontal lobes. They are the prefrontal cortex, the premotor area and the motor area. The prefrontal cortex is responsible for personality expression and the planning of complex cognitive behaviors. The premotor and motor areas of the frontal lobes contain nerves that control the execution of voluntary muscle movement. Function: "}, {"url": "https://en.wikipedia.org/wiki/Prefrontal_cortex", "passage_text": "For the reptile scale, see Prefrontal scale. In mammalian brain anatomy, the prefrontal cortex (PFC) is the cerebral cortex which covers the front part of the frontal lobe. The PFC contains Brodmann areas 9, 10, 11, 12, 46, and 47. A third definition of the prefrontal cortex is the area of frontal cortex whose electrical stimulation does not lead to observable movements. For example, in 1890 David Ferrier used the term in this sense."}, {"url": "http://www.wisegeek.org/what-is-the-prefrontal-cortex.htm", "passage_text": "The smaller braincases of extinct species such as Homo erectus indicate that they had a far less developed prefrontal cortex than modern Homo sapiens. The prefrontal cortex governs social control. The brain's prefrontal cortex is responsible for regulating behavior, emotions and social control. Modern Homo Sapiens are believed to have a more developed prefrontal cortex than that possessed by their Neanderthal predecessors. Unfortunately, the PFC is one of the brain regions most susceptible to injury. When the pathways between the prefrontal cortex and the rest of the brain are damaged or altered, serious personality changes can result."}, {"url": "http://science.howstuffworks.com/life/inside-the-mind/human-brain/teenage-brain1.htm", "passage_text": "The brain's remote control is the prefrontal cortex, a section of the brain that weighs outcomes, forms judgments and controls impulses and emotions. This section of the brain also helps people understand one another. "}, {"url": "http://www.wisegeek.org/what-is-the-prefrontal-cortex.htm", "passage_text": "The prefrontal cortex (PFC) is located in the very front of the brain, just behind the forehead. In charge of abstract thinking and thought analysis, it is also responsible for regulating behavior. Unfortunately, the PFC is one of the brain regions most susceptible to injury. When the pathways between the prefrontal cortex and the rest of the brain are damaged or altered, serious personality changes can result."}, {"url": "http://www.alleydog.com/glossary/definition.php?term=Prefrontal%20Cortex", "passage_text": "The Prefrontal Cortex is that part of the brain located behind our forehead that is responsible for the executive function, meaning that it acts like a conductor communicating, guiding, and coordinating the functions of the different parts of the brain. "}]