[{"url": "http://money.usnews.com/money/personal-finance/articles/2014/09/17/4-questions-to-consider-before-adding-onto-your-home", "passage_text": "How much will you spend? The cost of an addition varies widely depending on the type of room and where you live. But just to give you a sense of how much it might cost, CostHelper.com estimates that adding a bathroom or bedroom could run from $25,000 to $50,000. A bedroom could easily cost just as much. A large room, such as a family room, could run as high as $100,000. "}, {"url": "http://home.costhelper.com/add-room.html", "passage_text": "1 Adding a small 10x12-foot wood deck can run $500-$1,000 for do-it-yourself materials or $1,000-$1,900 to hire someone to build it. 2  A larger deck of wood or plastic composite can be $4,000-$25,000 or more depending on size, materials and complexity. 1 The cost of adding a porch can range from $50-$120 for do-it-yourself materials for a simple concrete slab to $3,000-$6,000 to have someone pour a 50x20-foot slab."}, {"url": "http://budgeting.thenest.com/average-cost-per-square-foot-add-addition-house-23356.html", "passage_text": "Costs Vary Widely. Nationally, estimates of room addition costs vary from $80 to $250 a square foot. A simple room addition with a basic foundation and no plumbing generally costs at least $100 a square foot with typical internal finishing, no expansion of a heating/cooling unit, and minimal structural changes. The cost per square foot decreases as the size of the addition increases. Framing an addition averages $6 to $8 a square foot nationally. That's the cost of building walls and adding or extending a roof with rafters or trusses. It does not include drywall, doors or windows, insulation, finishing trim or utilities."}, {"url": "http://home.costhelper.com/add-room.html", "passage_text": "1 Converting existing floor space into a family room as a do-it-yourself project runs anywhere from $200-$5,000 or more depending on the complexity of the project, the quality of the materials and your skill level; hiring a contractor for the conversion can be anywhere from $7,500-$25,000, depending on what's included. 1 The cost of adding a porch can range from $50-$120 for do-it-yourself materials for a simple concrete slab to $3,000-$6,000 to have someone pour a 50x20-foot slab."}, {"url": "http://homeguides.sfgate.com/calculate-room-addition-cost-8771.html", "passage_text": "1. Decide on the square footage of the room you will be adding to your home. Room additions can cost up to 50 percent higher, between $80 and $130 per square foot before considering wiring and plumbing, than that same room had been constructed with the rest of the house, according to the Home Addition Plus website."}, {"url": "http://www.trulia.com/voices/Remodel_and_Renovate/How_much_does_it_cost_to_add_arond_sft_to_the_exi-386842", "passage_text": "It depends. If you add something simple like a bedroom or family room the cost will be $100 to $150 per sq foot. If the add-on includes a bathroom, it will be much more. It also depends on your existing home. On the low end if this 500 sqft will be a 2 car garage then possibly you can build it for $100 a square foot..depending on who you hire, how much work you do yourself. if this new space will be a big kitchen and family room then it could easily cost $200k or even $300k depending on your taste."}, {"url": "http://budgeting.thenest.com/average-cost-per-square-foot-add-addition-house-23356.html", "passage_text": "An addition with a kitchen can run $250 to $300 a square foot, not counting finishing details like appliances and countertops. An addition with a bathroom can cost $125 to $200 a square foot, again with a number of cost variables including type of flooring, shower and tub, plumbing appliances or custom lighting. Framing an addition averages $6 to $8 a square foot nationally. That's the cost of building walls and adding or extending a roof with rafters or trusses. It does not include drywall, doors or windows, insulation, finishing trim or utilities."}, {"url": "http://home.costhelper.com/add-room.html", "passage_text": "1 Adding a 1,500-square-foot second floor with large sections done as a do-it-yourself project (plus serving as your own general contractor when needed) can run $105,000-$225,000; hiring a remodeling contractor for the same project can be $225,000-$450,000. 1 The cost of adding a porch can range from $50-$120 for do-it-yourself materials for a simple concrete slab to $3,000-$6,000 to have someone pour a 50x20-foot slab."}, {"url": "https://answers.yahoo.com/question/index?qid=20080316215320AACX2eV", "passage_text": "My husband just added a bedroom onto our house. It cost about $5,000 and didn't include a bathroom. He did all the work, so there was no labor cost. Remember that most contractors will add 1/3 material cost for labor. "}, {"url": "http://home.costhelper.com/bedroom-addition.html", "passage_text": "1 Adding new floor space for a simple bedroom and closet with a foundation (but no bathroom) costs about $25-$50 a square foot if you do all or most of the work yourself (requires high-level skills), and anywhere from $50-$150 or more a square foot to hire a builder, depending on complexity and local labor rates. "}]