[{"url": "http://www.mayoclinic.org/healthy-lifestyle/getting-pregnant/in-depth/symptoms-of-pregnancy/art-20043853", "passage_text": "Classic symptoms of pregnancy. In addition to a missed period, the earliest signs and symptoms of pregnancy might include: 1  Tender, swollen breasts. 2  Early in pregnancy hormonal changes might make your breasts tender, sensitive or sore. 3  Or your breasts might feel fuller and heavier. 4  Nausea with or without vomiting. 1 Early in pregnancy hormonal changes might make your breasts tender, sensitive or sore. 2  Or your breasts might feel fuller and heavier. 3  Nausea with or without vomiting. 4  Morning sickness, which can strike at any time of the day or night, sometimes begins as early as three weeks after conception."}, {"url": "http://www.babymed.com/pregnancy-symptoms/what-earliest-i-can-feel-pregnancy-signs-and-what-are-typical-pregnancy-signs", "passage_text": "Many women wonder how early and how soon you can get and have pregnancy symptoms, what the earliest pregnancy signs and symptoms are, and whether you can feel implantation, conception, or loss of appetite. The simple answer is that you can get early pregnancy symptoms and signs even before you have a missed period. One of the more common physical changes women often feel in early pregnancy is fatigue. When conception occurs, progesterone levels rise. Progesterone can cause early pregnancy fatigue. Estrogen levels also rise in early pregnancy. Estrogen can cause the stomach to empty more slowly, causing nausea and loss of appetite"}, {"url": "http://www.babycentre.co.uk/a25007925/pregnancy-signs-at-two-weeks", "passage_text": "This can be one of the earliest signs of pregnancy. You may notice how tender your breasts feel within a week or so of conception. Your usual bra may become uncomfortable, and feel more chafing than usual. However, sore breasts more commonly become noticeable about four weeks after conception. So you may experience early pregnancy symptoms just two weeks after conception. However, at this stage, your doctor will say that you're four weeks pregnant. She'll count your pregnancy from the first day of your last period, because there's no way of knowing for sure the exact day that you conceived."}, {"url": "http://www.babycenter.com/404_early-signs-of-pregnancy-when-will-i-feel-symptoms_10372077.bc", "passage_text": "Pregnancy symptoms at 6 weeks. For most women, morning sickness begins between 6 and 8 weeks. You may also be exhausted and experiencing mood swings, which could be due to hormonal changes as well as the stress of wondering what lies ahead in your pregnancy. About 25 percent of women have spotting in early pregnancy. Normally you get your period about 4 weeks from the start of your last period, but if you're pregnant, the clearest sign at this point is a missed period. Many women still feel fine at 4 weeks, but others may notice sore breasts, fatigue, frequent urination, and nausea."}, {"url": "http://www.babymed.com/pregnancy-symptoms/what-earliest-i-can-feel-pregnancy-signs-and-what-are-typical-pregnancy-signs", "passage_text": "Pregnancy Symptoms You Can Feel. Just a few days after the fetus is conceived, it implants in the uterus. This is when the first physical signs of pregnancy start. Women may feel cramping and experience spotting at this early stage. If spotting occurs, it may not show until one to two weeks after the fertilized egg is implanted. Spotting is called implantation bleeding. One of the more common physical changes women often feel in early pregnancy is fatigue. When conception occurs, progesterone levels rise. Progesterone can cause early pregnancy fatigue. Estrogen levels also rise in early pregnancy. Estrogen can cause the stomach to empty more slowly, causing nausea and loss of appetite"}, {"url": "http://www.babycenter.com/404_early-signs-of-pregnancy-when-will-i-feel-symptoms_10372077.bc", "passage_text": "Most women don't feel very different at 3 weeks, but some may notice a tiny bit of  implantation spotting  or feel early pregnancy symptoms such as fatigue, tender breasts, nausea, a heightened sense of smell, food aversions, and more frequent urination. Normally you get your period about 4 weeks from the start of your last period, but if you're pregnant, the clearest sign at this point is a missed period. Many women still feel fine at 4 weeks, but others may notice sore breasts, fatigue, frequent urination, and nausea."}, {"url": "http://www.webmd.com/baby/guide/pregnancy-am-i-pregnant", "passage_text": "A few days after conception, the fertilized egg attaches itself to wall of the uterus. This can cause one of the earliest signs of pregnancy -- spotting and, sometimes, cramping. That's called implantation bleeding. It occurs anywhere from six to 12 days after the egg is fertilized. The cramps resemble menstrual cramps, so some women mistake them and the bleeding for the start of their period"}, {"url": "http://americanpregnancy.org/getting-pregnant/early-pregnancy-symptoms/", "passage_text": "You may experience pregnancy signs within a week of conception. However, some women report that they did not experience any symptom for a few weeks. If you need free testing, you can search below or order affordable early detection pregnancy tests online. Headaches: The sudden rise of hormones in your body can cause you to have headaches early in pregnancy. Frequent Urination: Around 6-8 weeks after conception, you may find yourself making a few extra trips to the bathroom."}, {"url": "http://www.webmd.com/baby/features/8-early-signs-of-pregnancy", "passage_text": "One of the first signs is often achy, tender breasts. They may feel fuller and heavier. You might even notice the area around your nipple getting bigger and darker. Most early pregnancy symptoms, including tender breasts, are related to rising levels of the hormone progesterone, says Treesa McLean, a licensed midwife. "}]