[{"url": "http://www.healthgrades.com/conditions/kwashiorkor", "passage_text": "Kwashiorkor can be prevented by including foods in your diet that are rich in proteins, such as meat, fish, dairy products, eggs, soy, and beans. Treatment involves slow increases in calories from carbohydrates, sugars, and fats, followed by protein. Although kwashiorkor is not common in the United States, protein deficiency can occur with prolonged hospitalization or in nursing home residents. It is estimated that up to half of the elderly living in nursing homes have diets low in protein (Source: PubMedHealth)."}, {"url": "https://en.wikipedia.org/wiki/Kwashiorkor", "passage_text": "From Wikipedia, the free encyclopedia. Kwashiorkor /kwɑːʃiˈɔrkər/ is a form of severe protein–energy malnutrition characterized by edema, irritability, anorexia, ulcerating dermatoses, and an enlarged liver with fatty infiltrates. Sufficient calorie intake, but with insufficient protein consumption, distinguishes it from marasmus. "}, {"url": "http://www.nhs.uk/Conditions/kwashiorkor/Pages/Introduction.aspx", "passage_text": "Introduction. Kwashiorkor is a form of malnutrition that most often affects children in developing regions of the world where there is famine or a limited food supply. The main sign of kwashiorkor is having too much fluid in body tissues, causing swelling under the skin (oedema). Print this page. Kwashiorkor is a form of malnutrition that most often affects children in developing regions of the world where there is famine or a limited food supply."}, {"url": "http://www.healthline.com/health/kwashiorkor", "passage_text": "Kwashiorkor is the most common and widespread nutritional disorder in developing countries. It is a form of malnutrition caused by not getting enough protein in your diet. Every cell in your body contains protein. You need protein in your diet for your body to repair cells and make new cells. A healthy body regenerates cells in this manner constantly."}, {"url": "http://www.humanillnesses.com/original/Kid-Men/Kwashiorkor.html", "passage_text": "Kwashiorkor (kwash-e-OR-kor) is a form of severe malnutrition that affects children living in poverty in tropical and subtropical parts of the world. It is caused by a lack of protein in the diet. Kwashiorkor stunts growth and causes children to have bloated bellies and thin arms and legs. Kwashiorkor usually happens when a baby is weaned from protein-rich breast milk (for any reason) and switched to protein-poor foods. In impoverished countries, protein-rich foods are difficult to acquire."}, {"url": "http://www.healthgrades.com/conditions/kwashiorkor", "passage_text": "Kwashiorkor is a type of malnutrition that is rare in the United States; it is most common in areas of drought and famine. Kwashiorkor is due to inadequate protein in the diet despite an adequate caloric intake. Although kwashiorkor is not common in the United States, protein deficiency can occur with prolonged hospitalization or in nursing home residents. It is estimated that up to half of the elderly living in nursing homes have diets low in protein (Source: PubMedHealth)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080518084918AAGR5xd", "passage_text": "Best Answer: Kwashiorkor is a protein-malnutrition problem which arises because the body needs to break down its protein for energy due to lack of carbohydrates and fat instead. It usually affects children. Kwashiorkor is a disease which appears to be caused through severe malnutrition, and it primarily impacts children. It is most common in developing nations, where famine conditions can bring about the disease."}, {"url": "http://www.humanillnesses.com/original/Kid-Men/Kwashiorkor.html", "passage_text": "Kwashiorkor is a disease caused by the lack of protein in a child's diet. Kwashiorkor is a type of protein energy malnutrition (PEM) that is widespread throughout the developing world. Kwashiorkor usually happens when a baby is weaned from protein-rich breast milk (for any reason) and switched to protein-poor foods. In impoverished countries, protein-rich foods are difficult to acquire."}, {"url": "http://medical-dictionary.thefreedictionary.com/kwashiorkor", "passage_text": "kwashiorkor. marasmic kwashiorkor a condition in which there is a deficiency of both calories and protein, with severe tissue wasting, loss of subcutaneous fat, and usually dehydration. (kwae′kwä-shē′or′). ôr kor kôr"}]