[{"url": "http://www.chegg.com/homework-help/questions-and-answers/figure-edge-view-three-charged-metal-electrodes-1-draw-graph-versus-region--hint-assume--a-q962752", "passage_text": "The figure is an edge view of three charged metal electrodes: 1. Draw a graph of versus over the region. Hint: Assume that at. [along the y-axis, it's V(kV). along the x-axis it's x(cm). --The answer given on the Knight section book in here is wrong, so please don't copy that."}, {"url": "http://www.learningace.com/doc/7699005/9ec9d92e19096e5d1a4ebd3196c8be05/chapter-29-potential-and-field", "passage_text": "C/rn, where r is the distance from the center of the group and n is an unknown exponent. 0 cm metal electrodes are spaced ?0 mm apart and connected by wires to the terminals of a 9. || The electric potential in a region of space is V? 200/ ? x2 + y2, where x and y are in meters."}, {"url": "http://express-helpline.com/figure-edge-view-three-charged-metal-electrodes-draw-graph-versus-over-6535488.html", "passage_text": "Answer by Steve G. (Purchased 4 times and rated). the figure is an edge view of three charged metal electrodes: 1. draw a graph of versus over the region. hint: assume that at. [along the y-axis, it's v(kv)."}, {"url": "http://www.wisegeek.org/what-is-an-electrode.htm", "passage_text": "An example is the production of sodium metal from molten salt, or sodium chloride. When the current flows, positively charged sodium ions are attracted to the negative electrode, or cathode, where they gain electrons, forming sodium metal."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/figure-edge-view-3-charged-metal-elecrodes-let-left-electrode-zero-point-electric-potentia-q4497390", "passage_text": "home / study / questions and answers / science / physics / the figure is a edge view of 3 charged metal elecrodes."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0378775315001172", "passage_text": "Abstract. In this study, an energy storage device using a three-electrode battery is fabricated. The charging process takes place during electrolysis of the alkaline electrolyte where hydrogen is stored at the palladium bifunctional electrode."}, {"url": "http://physics.bu.edu/ulab/intro2/efield.pdf", "passage_text": "Such a path is an equipotential surface. Since there is a potential and electric field value at every point in space, there is no limit to the number of field lines and equipotential surfaces. In this experiment you will work in two dimensions to acquire a family of lines spaced at convenient intervals."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/figure-edge-view-three-charged-metal-electrodes-1-draw-graph-versus-region--hint-assume--a-q962752", "passage_text": "1. Draw a graph of versus over the region. Hint: Assume that at. [along the y-axis, it's V(kV). along the x-axis it's x(cm). --The answer given on the Knight section book in here is wrong, so please don't copy that."}]