[{"url": "https://en.wikipedia.org/wiki/Smallpox", "passage_text": "The last naturally occurring case of smallpox (Variola minor) was diagnosed on 26 October 1977. Infection with smallpox is focused in small blood vessels of the skin and in the mouth and throat before disseminating. In the skin it results in a characteristic maculopapular rash and, later, raised fluid-filled blisters. V. major produced a more serious disease and had an overall mortality rate of 30–35 percent. In the early 1950s an estimated 50 million cases of smallpox occurred in the world each year. To eradicate smallpox, each outbreak had to be stopped from spreading, by isolation of cases and vaccination of everyone who lived close by."}, {"url": "http://healthvermont.gov/emerg/smallpox/smallpox_fact.aspx", "passage_text": "Smallpox is a serious infectious disease caused by the Orthopox virus, variola. The last case in Vermont occurred in 1937, and there have been no confirmed cases worldwide since eradication was achieved in 1978. A single case today would be considered a national public health emergency. Smallpox spreads from person to person mainly by aerosolized droplets that come from the coughing of infected patients. Contact with smallpox scabs or contaminated clothing or linens can also spread the disease."}, {"url": "http://www.who.int/csr/disease/smallpox/faq/en/", "passage_text": "Smallpox is an ancient disease caused by the variola virus. Early symptoms include high fever and fatigue. The virus then produces a characteristic rash, particularly on the face, arms and legs. "}, {"url": "http://science.nationalgeographic.com/science/health-and-human-body/human-diseases/smallpox-article/", "passage_text": "Smallpox is an acute contagious disease caused by the variola virus. It gets its name from the Latin word for spotted, referring to the raised, pustular bumps that break out over the face and body of those affected. Historically the virus killed around 30 percent of people who caught it. Early Victims. Smallpox is thought to have originated in India or Egypt at least 3,000 years ago. The earliest evidence for the disease comes from the Egyptian Pharaoh Ramses V, who died in 1157 B.C. His mummified remains show telltale pockmarks on his skin."}, {"url": "https://en.wikipedia.org/wiki/History_of_smallpox", "passage_text": "In the early 1950s an estimated 50 million cases of smallpox occurred in the world each year. As recently as 1967, the World Health Organization estimated that 15 million people contracted the disease and that two million died in that year. "}, {"url": "http://www.answers.com/Q/Where_did_smallpox_come_from", "passage_text": "The smallpox virus is said to have emerged about 10 thousand years BC. The virus' genes suggest that it was once a rodent virus that made its trans-species jump into humans in one of the early agricultural river valleys. Smallpox is thought to have rooted itself early in people living in the river valleys of China. There is no known scapegoat for the disease smallpox, but it can be vaccinated with the pus from the 'spots' caused by the similar infection known as cowpox. As a result, sma … llpox was the first disease to have been permanently wiped off the face of the earth, and it is so far the only one."}, {"url": "http://coastalcarolinaresearch.com/?p=648", "passage_text": "Where Does Smallpox Come From. Smallpox is caused by exposure to the variola virus. The variola virus emerged in human populations thousands of years ago. Except for laboratory stockpiles, the variola virus has been eliminated. Smallpox Transmission. Generally, transmission of smallpox from one person to another occurs through inhalation of airborne variola virus through direct contact with infected bodily fluids (such as droplets expressed from the oral, nasal, or pharyngeal mucosa of an infected person)."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_what_is_smallpox", "passage_text": "Smallpox is a serious, contagious, and sometimes fatal infectious disease caused by a virus called the variola virus. The disease gets its name from the Latin word for spotted and refers to the small pus-filled blisters that appear on the face and body of an infected person. Smallpox is spread from person to person by several means, including: 1  Direct, face-to-face and fairly prolonged contact with an infected person – the saliva of the infected person can spread the disease. 2  Direct contact with the fluid in the blisters in the infected person’s skin or other infected bodily fluids."}, {"url": "http://www.sfcdcp.org/smallpox.html", "passage_text": "Smallpox disease is a serious, highly contagious, and often life-threatening infection marked by a rash of round pox (blisters) on the face, arms, and legs. It is caused by the Variola virus. The last case of smallpox in the United States was in 1949. The last case in the world was in Somalia in 1977. Worldwide vaccine campaigns have wiped out smallpox everywhere."}, {"url": "https://en.wikipedia.org/wiki/Smallpox", "passage_text": "Smallpox is caused by infection with variola virus, which belongs to the genus Orthopoxvirus, the family Poxviridae and subfamily chordopoxvirinae. The date of the appearance of smallpox is not settled. In the early 1950s an estimated 50 million cases of smallpox occurred in the world each year. To eradicate smallpox, each outbreak had to be stopped from spreading, by isolation of cases and vaccination of everyone who lived close by."}]