[{"url": "http://www.usclimatedata.com/climate.php?location=USFL0149", "passage_text": "Climate data for fort lauderdale, Longitude: -80.2011, Latitude: 26.1019. Average weather Fort Lauderdale, FL - 33301 - 1981-2010 normals. Jan: January, Feb: February, Mar: March, Apr: April, May: May, Jun: June, Jul: July, Aug: August, Sep: September, Oct: October, Nov: November, Dec: December."}, {"url": "http://goflorida.about.com/od/floridaweathe1/qt/Fort-Lauderdale-Weather.htm", "passage_text": "Walter Bibikow/The Image Bank/Getty Images. Fort Lauderdale, located in Southeast Florida, has an overall average high temperature of 84° and an average low of 67°. The highest recorded temperature in Fort Lauderdale was 99° in 1980 and the lowest recorded temperature was a very 28° in 1977. On average Fort Lauderdale's warmest month is July and January is the average coolest month. The maximum average rainfall usually falls in June"}, {"url": "http://www.world-guides.com/north-america/usa/florida/fort-lauderdale/fort_lauderdale_weather.html", "passage_text": "Related Guides: Fort Lauderdale enjoys a moderate climate with pleasant ocean breezes. Weather here is typical of the tropical climate in South Florida, with an average year-round temperature of 24°C / 76°F, and over 3,000 hours of sunny weather each year. The winter months of December, January and February feature the coolest climate of the year, with January temperatures dropping to around 24°C / 75°F. Wintertime also enjoys the driest weather of the year, which is usually between December, January, February and March."}, {"url": "http://www.weather2travel.com/holidayweather/united-states/florida/fort-lauderdale-fl.php", "passage_text": "Check on the weather in Fort Lauderdale, Florida before you book your holiday. Whatever kind of trip you are planning, take a look at today's temperature, the outlook for tomorrow and what the weather is usually like at this time of year. 1  View weather by month. "}, {"url": "http://www.areavibes.com/fort+lauderdale-fl/weather/", "passage_text": "The Fort Lauderdale, FL pollution index is the sum of the most hazardous air pollutants displayed in pounds. The Fort Lauderdale, FL pollution index is 95.6% less than the Florida average and 86.5% less than the national average."}, {"url": "https://weatherspark.com/averages/30277/8/Fort-Lauderdale-Hollywood-Florida-United-States", "passage_text": "Location. This report describes the typical weather at the Fort Lauderdale-Hollywood International Airport (Fort Lauderdale/Hollywood, Florida, United States) weather station over the course of an average August. It is based on the historical records from 1974 to 2012. Earlier records are either unavailable or unreliable. Fort Lauderdale/Hollywood, Florida has a tropical rainforest climate with no dry season. The area within 25 mi of this station is covered by oceans and seas (45%), marshes (23%), built-up areas (15%), grasslands (10%), and croplands (8%). The average fraction of time spent in various temperature bands: frigid (below 15A°15â), f (FREEZING°15a 15â F°To), 32a (32â°F cold 32A°32â), f (TO°50a 50â F°Cool), 50a (50â°F to 65A°65â), f (COMFORTABLE°65a 65â F°To), 75a (75â°F warm 75A°75â) f to (85a 85â°F). hot 85a 85â f to 100a 100â f and sweltering above 100a 100â f"}, {"url": "http://www.weather2travel.com/holidayweather/united-states/florida/", "passage_text": "Despite this winters in Florida are generally very pleasant. Even in Orlando, which is 400 kilometres north of the Florida Keys, daytime temperatures usually rise above 20°C most days during winter and will only fall below 10°C at night in January and February. In coastal areas especially on the east coast winters are particularly mild. In Florida you can get away with light clothing for most of the year, while some sort of protection from the rain is essential in summer. Unless you are only visiting the south of the state in winter you will need an extra layer for evenings."}, {"url": "http://www.areavibes.com/fort+lauderdale-fl/weather/", "passage_text": "The highest average temperature in Fort Lauderdale is August at 84.3 degrees. The coldest average temperature in Fort Lauderdale is February at 69.2 degrees. The most monthly precipitation in Fort Lauderdale occurs in June with 7.8 inches. The Fort Lauderdale weather information is based on the average of the previous 3-7 years of data. The Fort Lauderdale, FL pollution index is 95.6% less than the Florida average and 86.5% less than the national average."}]