[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/15491977", "passage_text": "Sigma ESR: an erythrocyte sedimentation rate adjusted for the hematocrit and hemoglobin concentration. Pawlotsky Y(1), Goasguen J, Guggenbuhl P, Veillard E, Jard C, Pouchard M, Perdriger A, Meadeb J, Chales Chalès. G author: (information)1 department Of, Rheumatology University hospital Of, Rennes, Rennes. france"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15491977", "passage_text": "The Sigma ESR formula was based on the sum of 2 unadjusted sedimentation levels, at 30 and 60 minutes, together with the hematocrit value and the hemoglobin concentration. Sigma ESR values in 274 healthy subjects showed a gaussian distribution, no difference between men and women, and no significant increase with age."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15491977", "passage_text": "The aim of the study was to simplify the first Sigma erythrocyte sedimentation rate (ESR) method (manual hematocrit adjustment to 0.35, sum of 4 sedimentation levels) and to confirm its clinical relevance."}, {"url": "http://www.thebigl.co/Interpreter/V2/Content/esr.html", "passage_text": "ERYTHROCYTE SEDIMENTATION RATE (ESR). The erythrocyte sedimentation rate (ESR) is a test which measures the height of the layer of red blood cells which precipitate and layer in a tube of anticoagulated blood over a specified length of time which is usually one hour. Two main factors determine the ESR, the degree of cellular aggregation and the hematocrit."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15491977", "passage_text": "Sigma ESR: an erythrocyte sedimentation rate adjusted for the hematocrit and hemoglobin concentration. Pawlotsky Y(1), Goasguen J, Guggenbuhl P, Veillard E, Jard C, Pouchard M, Perdriger A, Meadeb J, Chales Chalès. g"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15491977", "passage_text": "Sigma ESR: an erythrocyte sedimentation rate adjusted for the hematocrit and hemoglobin concentration. Pawlotsky Y(1), Goasguen J, Guggenbuhl P, Veillard E, Jard C, Pouchard M, Perdriger A, Meadeb J, Chales Chalès. G author: information"}, {"url": "http://www.thebigl.co/Interpreter/V2/Content/esr.html", "passage_text": "The normal range for the ESR is 15 mm/hr or less in males and 20 mm/hr or less in females when the patient s age is less than or equal to 50 years. For males over 50 years of age the upper limit of normal is (age in years)/2 and for females over 50 years of age, (age in years + 10)/2."}, {"url": "http://symptomstreatment.org/esr-normal-range-low-high/", "passage_text": "ESR is an abbreviated form for erythrocyte sedimentation rate. It is often referred to as the sedimentation rate or the sed rate. An ESR blood test is usually done to check and understand the degree of inflammation in the body such as cancers, various kinds of infections as well as autoimmune disorders and diseases."}]