[{"url": "https://en.wikipedia.org/wiki/Magnet", "passage_text": "Materials that can be magnetized, which are also the ones that are strongly attracted to a magnet, are called ferromagnetic (or ferrimagnetic). These include iron, nickel, cobalt, some alloys of rare earth metals, and some naturally occurring minerals such as lodestone. "}, {"url": "http://physics.stackexchange.com/questions/115181/why-does-magnet-attract-iron-but-not-other-metals", "passage_text": "2. First of all, magnets DO attract other metals. en.wikipedia.org/wiki/Magnet Secondly, read up on this: en.wikipedia.org/wiki/Magnetic_domain – Hasan May 31 '14 at 6:44. Related: physics.stackexchange.com/q/10827/2451, physics.stackexchange.com/q/23523/2451, physics.stackexchange.com/q/39299/2451 and links therein. "}, {"url": "https://www.superteacherworksheets.com/magnets/magnetism-experiment_EXPER.pdf", "passage_text": "Name: _______________________________________ Metals and Magnetism Question: Do magnets attract all metals? Materials: samples of different metals (copper, iron, aluminum, brass, and stainless steel);coins (penny, nickel, dime, and quarter);bar magnet or horseshoe magnet Step 1: Predict Examine the sample of each metal. Predict which types of metals will attract to the magnet."}, {"url": "http://science.howstuffworks.com/magnet.htm", "passage_text": "Magnets are objects that produce magnetic fields and attract metals like iron, nickel and cobalt. The magnetic field's lines of force exit the magnet from its north pole and enter its south pole. Permanent or hard magnets create their own magnetic field all the time. "}, {"url": "http://www.sciencekids.co.nz/sciencefacts/magnets.html", "passage_text": "Iron filings can be used to show magnetic fields created by magnets (such as in the picture to the right). Magnets only attract certain types of metals, other materials such as glass, plastic and wood aren't attracted. Metals such as iron, nickel and cobalt are attracted to magnets. Most metals however are not attracted to magnets, these include copper, silver, gold, magnesium, platinum, aluminium and more. They may however magnetize a small amount while placed in a magnetic field. Magnetism can attract magnetic objects or push them away."}, {"url": "http://www.acemagnetics.com/attracted-metals.html", "passage_text": "Magnets attract to ferrous metals such as iron, nickel, cobalt, certain steels and other alloys. Brass, aluminum, copper, and most stainless steels, however, are non ferrous. "}, {"url": "http://www.eduplace.com/marketing/expsci/pdf/166023_magnetselectromagnetism/act_166023.pdf", "passage_text": "magnet a material that attracts steel, iron, cobalt, and nickel Magnets come in many shapes and sizes. Materials that contain iron, steel, nickel, and cobalt are attracted to, or pulled toward, a magnet. Magnets also attract the mineral magnetite and other magnets. Materials that are attracted to a magnet are described as magnetic.magnetite a mineral that is naturally magnetic Magnetite contains iron and is a weak magnet. Early explorers used magnetite to ﬁ nd north. "}, {"url": "http://www.bbc.co.uk/bitesize/ks2/science/physical_processes/magnets/read/1/", "passage_text": "Introduction. Magnets have north poles and south poles. These attract each other. But two north poles will repel each other, as will two south poles. Iron is magnetic, so any metal with iron in it will be attracted to a magnet. Most other metals, like aluminium, copper or gold, are not magnetic."}, {"url": "http://superbeefy.com/how-does-a-magnet-attract-metal/", "passage_text": "A magnet is a metal that can pull pieces of iron toward itself and make them cling to it. A horseshoe magnet pointed at a clip will make it jump up from a table and cling to the magnet until it is pulled off. The horseshoe magnet has two poles, or ends, a positive and a negative one. "}, {"url": "http://www.answers.com/Q/Which_metals_do_not_attract_magnets", "passage_text": "All metals are not attracted by a magnet. Most metals are not attracted by a magnet. It is iron and steel which is made from iron that are attracted by a magnet. Most other … metals such a copper, aluminum, zinc, brass, nickel etc. are not attracted to a magnet... "}]