[{"url": "http://www.baileyblush.com/2012/12/10/hagina-japanese-mint-oil/", "passage_text": "December 10, 2012 · 3 Comments. Hagina Japanese Mint Oil is a 100% Natural product that has so many amazing benefits! I recently had a Zumba-athon in which I flailed around aimlessly trying to keep up, and in the process, I pretty well pulled every muscle in my body."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-616-JAPANESE%20MINT.aspx?activeIngredientId=616&activeIngredientName=JAPANESE%20MINT", "passage_text": "Some people use Japanese mint as a stimulant, a germ-killer, or a pain-killer. Japanese mint is applied directly to the skin for muscle pain, nerve pain, itchiness, and hives. When inhaled, Japanese mint is used for swelling of the lining of the upper respiratory tract. Japanese mint oil contains up to 95% menthol. In manufacturing, Japanese mint is also used as a fragrance in toothpaste, mouthwash, gargles, soaps, detergents, creams, lotions, and perfumes."}, {"url": "http://www.relaxusonline.com/hagina_Japanese_Mint_Oil_p/11700-par_japanesemint.htm", "passage_text": "A Natural Mint Essential Oil product that has a deep heating and penetrating effect. Japanese Mint Oil is known to be beneficial against rheumatic pain. Just a few drops massaged into the skin, stimulates circulation. Uses: (not recommended for full body massage) a few drops massaged into a specific area."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-616-JAPANESE%20MINT.aspx?activeIngredientId=616&activeIngredientName=JAPANESE%20MINT", "passage_text": "Japanese mint is a plant. The oil is removed from the parts that grow above the ground and used to make medicine. Japanese mint oil is used for various digestive complaints including poor appetite, gas, indigestion, nausea, diarrhea, gallstones, liver problems, and irritable bowel syndrome (IBS)."}, {"url": "http://www.baileyblush.com/2012/12/10/hagina-japanese-mint-oil/", "passage_text": "A friend of mine had mentioned that she uses Japanese Mint oil to alleviate chronic pain she has in her shoulder, so I thought I would pick some up, and I am glad I did."}, {"url": "http://www.hagina.ca/product/japanese-mint-oil/", "passage_text": "1 Original Japanese Mint Oil is a pure, natural product that has a deep heating and penetrating effects. 2  Japanese Mint Oil is known to be beneficial against rheumatic pain; just a few drops massaged into the skin stimulates circulation. 3  Its refreshing and invigorating feeling contributes to obtaining a healthy look."}, {"url": "http://www.baileyblush.com/2012/12/10/hagina-japanese-mint-oil/", "passage_text": "Hagina Japanese Mint Oil is a 100% Natural product that has so many amazing benefits! I recently had a Zumba-athon in which I flailed around aimlessly trying to keep up, and in the process, I pretty well pulled every muscle in my body."}]