[{"url": "http://www.homebuyinginstitute.com/mortgage-origination-fees.php", "passage_text": "2. On average, home buyers pay 1% of the loan amount in the form of an origination fee. For example, on a loan of $300,000, a 1% origination fee would come out to $3,000. So the more money you borrow, the higher the fee. If your lender is charging you a mortgage origination fee much higher than 1%, you should ask them why. "}, {"url": "http://www.mortgageqna.com/mortgage-costs-fees/are-mortgage-loan-origination-fees-tax-deductible.html", "passage_text": "Yes, mortgage loan origination fees are tax deductible in most cases. There are some rules, though, in applying tax deduction. To itemize deductions, it is recommended you use the services of a certified accountant. If loan origination points were high but you didn't pay other closing costs (e.g. escrow account setup fee, home appraisal and attorney fees, etc.), the loan origination fee is not tax deductible."}, {"url": "http://homeguides.sfgate.com/can-deduct-loan-origination-fees-taxes-2698.html", "passage_text": "3. Deduct the points over the life of the loan if you cannot meet all of the requirements to deduct them immediately. If your loan is for 30 years then you can deduct 1/30th of the points each year on your taxes. Typically you must deduct the points on a refinance mortgage over the life of the loan unless part of the refinance proceeds are used to improve the main home. The IRS allows deduction of mortgage points. Your lender is not keeping score when he mentions point, or 1 percent of your loan amount. A point can be classified as an origination point or discount point. You pay origination points directly to the mortgage originator for obtaining the financing. Borrowers pay discount points to the mortgage lender as prepaid interest to buy down the interest rate over the life of the loan"}, {"url": "http://www.mortgageqna.com/mortgage-costs-fees/are-mortgage-loan-origination-fees-tax-deductible.html", "passage_text": "Loan origination and discount points are both tax-deductible, as well as interest and property taxes. If loan origination points were high but you didn't pay other closing costs (e.g. escrow account setup fee, home appraisal and attorney fees, etc.), the loan origination fee is not tax deductible. To be tax deductible, it has to be clearly stated in points on top of the GFE and cannot pay for other item"}, {"url": "http://finance.zacks.com/loan-origination-fees-tax-deductible-8093.html", "passage_text": "However, if your mortgage was a refinance loan, you must typically spread the deductions over the life of the loan. For example, if your origination fees equal $4,500 for a 30-year loan, you can deduct $150 each year for the next 30 years. Unlike loan origination fees, most other fees you pay at the closing of a mortgage loan are nondeductible. Nondeductible closing expenses include appraisal fees, title insurance and attorney fees. However, you can deduct any prepaid interest you pay at closing."}, {"url": "http://finance.zacks.com/list-closing-fees-can-claimed-taxes-1562.html", "passage_text": "If you purchase a home you plan to live in, only the mortgage origination fees are deductible. Also called points, these fees are interest you pay to your lender in advance, and mortgage interest is tax deductible. One point is usually equal to 1 percent of the mortgage you're taking out. "}, {"url": "http://budgeting.thenest.com/loan-origination-fees-taxdeductible-25314.html", "passage_text": "...Or Later. Points you can't deduct this year have to be written off over the life of the loan. Suppose you pay $7,200 in deductible loan origination fees on a 30-year loan. To figure your annual deduction, divide up the points by the 360 monthly payments, which gives you $20 per payment. When you make 12 payments in a year, you get to write off $240 of loan origination fees."}, {"url": "http://budgeting.thenest.com/loan-origination-fees-reverse-mortgages-tax-deductible-31930.html", "passage_text": "For homes valued higher, the limit on origination fees is 2 percent on the first $200,000 in value and 1 percent on the amount over $200,000 (the maximum origination fee is $6,000). The borrower can pay the fee upfront or roll it into the loan. "}, {"url": "http://www.realestateabc.com/taxes/deductible1.htm", "passage_text": "When most people buy a home, they generally obtain a mortgage. Mortgages have costs and one of those costs is the loan origination fee.. The loan origination fee is usually a percentage of the loan amount, generally expressed as points.. For example, one point on a $150,000 loan would be $1500. One and a half points on the same loan amount would be $2250. On VA and FHA loans, points are often broken down into two categories: loan origination fee (which is usually one point) and discount points (which are also a percentage of the loan balance). Both are deductible."}]