[{"url": "https://en.wikipedia.org/wiki/Hydropower", "passage_text": "Hydropower or water power (from the Greek: ύδρω, water) is power derived from the energy of falling water or fast running water, which may be harnessed for useful purposes. "}, {"url": "http://www.greenenergyhelpfiles.com/hydroenergy.htm", "passage_text": "Other reasons that many want to use hydro energy is that it is cheaper than using other methods to convert energy to electricity. It is also reliable and can be used almost immediately when turned on to meet the demand for electricity. Many countries in the world use hydro energy for conversion to electricity. Canada maintains the highest use, while the United States comes in second. One of the main reasons that hydro energy is used is that it is a renewable energy, meaning it will not be depleted over time and it will consistently be replenished."}, {"url": "https://www.originenergy.com.au/blog/about-energy/what-is-hydropower.html", "passage_text": "Hydropower (or hydroenergy) is a form of renewable energy that uses the water stored in dams, as well as flowing in rivers to create electricity in hydropower plants. "}, {"url": "http://www.greenenergyhelpfiles.com/hydroenergy.htm", "passage_text": "Hydro energy is simply energy that is taken from water and converted to electricity. Hydro energy can be obtained by using many methods of capture. The most common method of using energy from water is a hydroelectric dam, where water coming down through an area causes turbines to rotate and the energy is captured to run a generator. Many countries in the world use hydro energy for conversion to electricity. Canada maintains the highest use, while the United States comes in second. One of the main reasons that hydro energy is used is that it is a renewable energy, meaning it will not be depleted over time and it will consistently be replenished."}, {"url": "http://www.renewableenergyworld.com/hydropower/tech.html", "passage_text": "The most common type of hydroelectric power plant uses a dam on a river to store water in a reservoir. Water released from the reservoir flows through a turbine, spinning it, which in turn activates a generator to produce electricity. But hydroelectric power doesn't necessarily require a large dam. Some hydroelectric power plants just use a small canal to channel the river water through a turbine. Another type of hydroelectric power plant-called a pumped storage plant-can even store power. The power is sent from a power grid into the electric generators."}, {"url": "https://en.wikipedia.org/wiki/Hydroelectricity", "passage_text": "Hydropower is produced in 150 countries, with the Asia-Pacific region generating 32 percent of global hydropower in 2010. China is the largest hydroelectricity producer, with 721 terawatt-hours of production in 2010, representing around 17 percent of domestic electricity use. The cost of hydroelectricity is relatively low, making it a competitive source of renewable electricity. The average cost of electricity from a hydro station larger than 10 megawatts is 3 to 5 U.S. cents per kilowatt-hour"}, {"url": "http://www.wisegeek.org/what-is-hydroelectric-power.htm", "passage_text": "Hydroelectric power (HEP), or hydroelectricity, is electrical power that is generated through the energy of flowing water. Hydroelectric power plants rely on the same basic principle, but instead of using the kinetic energy directly, the force of the water drives a turbine which in turn powers a generator, producing electricity which can be used on-site or transported to other regions."}, {"url": "http://www.kids.esdb.bg/hydro.html", "passage_text": "Hydro energy. Hydropower is a clean, renewable and reliable energy source which converts kinetic energy from falling water into electricity, without consuming more water than is produced by nature. Quite simply the oldest method by which renewable energy has been harnessed by the human race."}, {"url": "http://www.greenenergyhelpfiles.com/hydroenergy.htm", "passage_text": "One downside to using hydro energy is that it can sometimes change the natural flow of the water which can make it possible to harm plants and animals in the water. It can also damage areas and wildlife, as when creating a hydro electric dam, areas must be flooded. Many countries in the world use hydro energy for conversion to electricity. Canada maintains the highest use, while the United States comes in second. One of the main reasons that hydro energy is used is that it is a renewable energy, meaning it will not be depleted over time and it will consistently be replenished."}]