[{"url": "http://www.medicalnewstoday.com/articles/150999.php", "passage_text": "Health is a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.. The Definition has not been amended since 1948. During the Ottawa Charter for Health Promotion in 1986, the WHO said that health is: a resource for everyday life, not the objective of living."}, {"url": "http://www.medicalnewstoday.com/articles/150999.php", "passage_text": "An article in The Lancet states that health is not a state of complete physical, mental, and social well-being . Neither is it merely the absence of disease or infirmity ."}, {"url": "http://www.scleroderma.org/site/PageNavigator/patients_whatis.html", "passage_text": "The disease has been called “progressive systemic sclerosis,” but the use of that term has been discouraged since it has been found that scleroderma is not necessarily progressive. The disease varies from patient-to-patient. What scleroderma is not. Scleroderma is not contagious, infectious, cancerous or malignant."}, {"url": "http://www.alsa.org/about-als/what-is-als.html", "passage_text": "ALS, or amyotrophic lateral sclerosis, is a progressive neurodegenerative disease that affects nerve cells in the brain and the spinal cord. A-myo-trophic comes from the Greek language."}, {"url": "http://www.heart.org/HEARTORG/Caregiver/Resources/WhatisCardiovascularDisease/What-is-Cardiovascular-Disease_UCM_301852_Article.jsp", "passage_text": "Heart and blood vessel disease — also called heart disease — includes numerous problems, many of which are related to a process called atherosclerosis. Atherosclerosis is a condition that develops when a substance called plaque builds up in the walls of the arteries."}, {"url": "http://www.medicalnewstoday.com/articles/150999.php", "passage_text": "Health is a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.. a resource for everyday life, not the objective of living. Health is a positive concept emphasizing social and personal resources, as well as physical capacities.."}, {"url": "https://www.hss.edu/conditions_undifferentiated-connective-tissue-disease-faqs.asp", "passage_text": "1.What does the term undifferentiated connective tissue disease (UCTD) mean? This term is used to refer to patients who don't quite meet the criteria - the features doctors use to make the diagnosis of a disease -- for one of the well-defined connective tissue diseases, such as rheumatoid arthritis or lupus."}, {"url": "http://www.lupus.org/answers/entry/what-is-lupus", "passage_text": "Lupus is a chronic, autoimmune disease that can damage any part of the body (skin, joints, and/or organs inside the body). Chronic means that the signs and symptoms tend to last longer than six weeks and often for many years."}, {"url": "http://www.thefreedictionary.com/disease", "passage_text": "2. 'disease'. A disease is a particular kind of illness caused by bacteria or an infection. Diseases can often be passed from one person to another. Glaucoma is an eye disease. Children should be immunised against dangerous diseases. Animals and plants can also have diseases, but not illnesses."}, {"url": "http://www.merriam-webster.com/dictionary/ailment", "passage_text": "Full Definition of AILMENT. 1. : a bodily disorder or chronic disease. 2. : unrest, uneasiness. See ailment defined for English-language learners. See ailment defined for kids. ADVERTISEMENT."}]