[{"url": "https://en.wikipedia.org/wiki/Ceramic", "passage_text": "A ceramic is an inorganic, nonmetallic solid material comprising metal, nonmetal or metalloid atoms primarily held in ionic and covalent bonds. The crystallinity of ceramic materials ranges from highly oriented to semi-crystalline, and often completely amorphous (e.g., glasses). A ceramic material is an inorganic, non-metallic, often crystalline oxide, nitride or carbide material. Some elements, such as carbon or silicon, may be considered ceramics. Ceramic materials are brittle, hard, strong in compression, weak in shearing and tension."}, {"url": "http://www.overstock.com/guides/porcelain-tiles-vs-ceramic-tiles", "passage_text": "Ceramic tile is made from natural clay, sand and water. These materials are molded to form square or rectangular tiles and then baked in a kiln to remove most of the moisture. Porcelain tile is also made from clay but tends to be made using denser types of clay than ceramic. Ceramic is likely to chip or crack if objects are dropped on it, and the tiles are not expected to hold up for as long as porcelain units. Ceramic should not be used in most commercial applications, while porcelain can be used in light-or medium-duty commercial projects in addition to residential. 1  Installation."}, {"url": "https://en.wikipedia.org/wiki/Ceramic_art", "passage_text": "Ceramic art is art made from ceramic materials (including clay), which may take forms including art ware, tile, figurines, sculpture, and tableware. Ceramic art is one of the arts, particularly one of the visual arts, and of those, it is one of the plastic arts. While some ceramics are considered fine art, some are considered to be decorative, industrial or applied art objects. Ceramics may also be considered artifacts in archaeology. There is a long history of ceramic art in almost all developed cultures, and often ceramic objects are all the artistic evidence left from vanished cultures, like that of the Nok in Africa over 2,000 years ago."}, {"url": "https://en.wikipedia.org/wiki/Ceramic", "passage_text": "The word  ceramic comes from the Greek word κεραμικός (keramikos), of pottery or for pottery, from κέραμος (keramos), potter's clay, tile, pottery. The earliest known mention of the root ceram- is the Mycenaean Greek ke-ra-me-we, workers of ceramics, written in Linear B syllabic script. A ceramic material is an inorganic, non-metallic, often crystalline oxide, nitride or carbide material. Some elements, such as carbon or silicon, may be considered ceramics. Ceramic materials are brittle, hard, strong in compression, weak in shearing and tension."}, {"url": "http://www.ebay.com/gds/What-s-the-Difference-Between-Ceramic-and-Porcelain-Collectibles-/10000000177627912/g.html", "passage_text": "Ceramic is a broad term that includes earthenware, bone ware, pottery, and, yes, porcelain. The word ceramic is derived from a Greek word that means pottery, and describes any article made of natural clay hardened by heat. Buying Ceramic or Porcelain Collectibles on eBay. Once you find the ceramic or porcelain piece you are looking for, it is time to make the purchase. But, before you do, there are a few things to keep in mind so that your buying experience is a positive one."}, {"url": "http://depts.washington.edu/matseed/mse_resources/Webpage/Ceramics/ceramics.htm", "passage_text": "Ceramics are classified as inorganic and nonmetallic materials that are essential to our daily lifestyle. Ceramic and materials engineers are the people who design the processes in which these products can be made, create new types of ceramic products, and find different uses for ceramic products in everyday life. Ceramics are all around us. Ceramics can be found in products like watches (quartz tuning forks-the time keeping devices in watches), snow skies (piezoelectric-ceramics that stress when a voltage is applied to them), automobiles (sparkplugs and ceramic engine parts found in racecars), and phone lines."}, {"url": "http://matse1.matse.illinois.edu/ceramics/ware.html", "passage_text": "Ceramics encompass such a vast array of materials that a concise definition is almost impossible. However, one workable definition of ceramics is a refractory, inorganic, and nonmetallic material. Ceramics can be divided into two classes: traditional and advanced. "}, {"url": "http://pottery.about.com/od/meetingpotters/tp/pots101.htm", "passage_text": "All clay is a ceramic material, but there are other ceramic materials, as well. Glazes are also ceramic materials, because they permanently change during firing. Industrial ceramics include a range of materials such as silica carbide and zirconium oxide. "}, {"url": "http://depts.washington.edu/matseed/mse_resources/Webpage/Ceramics/ceramics.htm", "passage_text": "Ceramics are generally made by taking mixtures of clay, earthen elements, powders, and water and shaping them into desired forms. Once the ceramic has been shaped, it is fired in a high temperature oven known as a kiln. Often, ceramics are covered in decorative, waterproof, paint-like substances known as glazes. Ceramics can be found in products like watches (quartz tuning forks-the time keeping devices in watches), snow skies (piezoelectric-ceramics that stress when a voltage is applied to them), automobiles (sparkplugs and ceramic engine parts found in racecars), and phone lines."}]