[{"url": "http://electronics.howstuffworks.com/tv11.htm", "passage_text": "Color TV Signal. A color TV signal starts off looking just like a black-and-white signal. An extra chrominance signal is added by superimposing a 3.579545 MHz sine wave onto the standard black-and-white signal. Right after the horizontal sync pulse, eight cycles of a 3.579545 MHz sine wave are added as a color burst. Following these eight cycles, a phase shift in the chrominance signal indicates the color to display. The amplitude of the signal determines the saturation. Here is the relationship between color and phase: 1  Burst = 0 degrees. 2  Yellow = 15 degrees. 3  Red = 75 degrees. 4  Magenta = 135 degrees"}, {"url": "http://www.bluejeanscable.com/articles/signalconnector.htm", "passage_text": "2. Composite Video is a single signal which carries both the chrominance (color) and luminance (brightness) components of a video signal, along with sync information, on a single wire. Unlike an RF signal, a composite video signal does not need to be demodulated to be understood by a video display. Composite Video: Composite Video is a single signal which carries both the chrominance (color) and luminance (brightness) components of a video signal, along with sync information, on a single wire. Unlike an RF signal, a composite video signal does not need to be demodulated to be understood by a video display."}, {"url": "http://www.railroadsignals.us/basics/basics4.htm", "passage_text": "Signal Colors and Their Meaning. The colors used in today's signals are green, yellow, red, lunar, and white (remember, we're talking about signals in North America). The color of a signal tells the engineer what he has to do, the location of that color, determines the speed at which he is allowed to do it. We will get to the speed thing in a minute."}, {"url": "http://electronics.howstuffworks.com/tv11.htm", "passage_text": "A black-and-white TV filters out and ignores the chrominance signal. A color TV picks it out of the signal and decodes it, along with the normal intensity signal, to determine how to modulate the three color beams. Following these eight cycles, a phase shift in the chrominance signal indicates the color to display. The amplitude of the signal determines the saturation. Here is the relationship between color and phase: 1  Burst = 0 degrees. 2  Yellow = 15 degrees. 3  Red = 75 degrees. 4  Magenta = 135 degree"}, {"url": "http://blet375.com/csx-Signals-REDI-Center.pdf", "passage_text": "One very important part of these rules is the section on Fixed Signals. They are a means of communicating instructions to engineers, trainmen, and on track equipment. 2. One signal system used is the COLOR LIGHT SIGNAL SYSTEM. The three colors used are RED, GREEN, AND YELLOW. The names ordinarily associated with the colors are STOP with RED, CLEAR with GREEN and APPROACH with YELLOW. 3. Single, Double, or Triple COLOR LIGHTS may be used to convey instructions to engineers and trainmen. "}, {"url": "https://en.wikipedia.org/wiki/Chrominance", "passage_text": "In composite video signals, the U and V signals modulate a color subcarrier signal, and the result is referred to as the chrominance signal; the phase and amplitude of this modulated chrominance signal correspond approximately to the hue and saturation of the color. The presence of chrominance in a video signal is indicated by a color burst signal transmitted on the back porch, just after horizontal synchronization and before each line of video starts. If the color burst signal were visible on a television screen, it would appear as a vertical strip of a very dark oliv"}, {"url": "https://en.wikipedia.org/wiki/Chrominance", "passage_text": "Chrominance (chroma or C for short) is the signal used in video systems to convey the color information of the picture, separately from the accompanying luma signal (or Y for short). Chrominance is usually represented as two color-difference components: U = B′ − Y′ (blue − luma) and V = R′ − Y′ (red − luma). The presence of chrominance in a video signal is indicated by a color burst signal transmitted on the back porch, just after horizontal synchronization and before each line of video starts. If the color burst signal were visible on a television screen, it would appear as a vertical strip of a very dark olive color"}]