[{"url": "https://support.rockstargames.com/hc/en-us/articles/202892778-Transferring-Your-Previous-Grand-Theft-Auto-Online-Characters-and-Progression-to-PlayStation-4-Xbox-One-or-PC", "passage_text": "1 If you have previous character and progression data on both the PlayStation®3 and Xbox 360, you will be prompted to select one set of data. 2  You can only transfer one set of character and progression data for your PlayStation®Network account on PlayStation®4. In order to transfer your previous GTA Online character and progression data, you will need a Social Club account linked to the PlayStation®Network and/or Xbox Live account(s) used while previously playing Grand Theft Auto Online."}, {"url": "http://www.gamepur.com/guide/18575-gta-v-online-pc-characters-and-progress-transfer-transfer-ps4-xb1-ps3-or.html", "passage_text": "1 Grand Theft Auto V PC Copy. 2  Previous GTA Online character and progression data on PS3, PS4, Xbox 360 or Xbox One. 3  A Rockstar Games Social Club account. 4  If you do not already have a Social Club account, you will need to create a new one as part of the PC installation process. Below you can check out our step by step guide on how to Previous GTA Online/GTA V Characters and Progression From PS4/Xbox One to PC. What You Need To Transfer GTA Online Character and Progression from PS4/Xbox One to PC: 1 "}, {"url": "http://us.battle.net/support/en/article/previous/20558", "passage_text": "If you log in before the transfer is complete, it may fail and your character will be locked. The transfer may take up to 72 hours to complete. Make a selection Checking the Status of Your Transfer Restrictions and Limitations. Make a selection from the dropdown menu above. To check the status of your character transfer: 1  Log in to your Battle.net Account Management page and select the license that initiated the character transfer."}, {"url": "http://wowwiki.wikia.com/wiki/Paid_Character_Transfer_FAQ_(US)", "passage_text": "1 Log in to Battle.net Account Management. 2  Select the World of Warcraft license that has the character you want to transfer. 3  Click Character & Guild Services on the bottom ribbon. 4  Click Character Transfer. 5  Select your current realm and character from the list on the right. Edit. 1  Log into your Battle.net Account Management page and select the license that initiated the character transfer. 2  Click Character Transfer under Character Services on the bottom ribbon. 3  Click History/Status along the top of the Character Transfer page to view your transfer status and history."}, {"url": "https://support.rockstargames.com/hc/en-us/articles/202892778-Transferring-Your-Previous-Grand-Theft-Auto-Online-Characters-and-Progression-to-PlayStation-4-Xbox-One-or-PC", "passage_text": "1 If you have previous character and progression data on multiple systems, you will be prompted to select one set of data. 2  You can only transfer one set of character and progression data for your Social Club account on PC. 3  Once the transfer has completed, you will be prompted to choose a character and enter GTA Online. In order to transfer your previous GTA Online character and progression data, you will need a Social Club account linked to the PlayStation®Network and/or Xbox Live account(s) used while previously playing Grand Theft Auto Online."}, {"url": "http://us.battle.net/support/en/article/previous/20558", "passage_text": "Before you transfer a character, keep the following limitations in mind: 1  Characters can only be transferred between realms and accounts in the same region. 2  Certain realms may not be eligible transfer destinations. 3  You may not transfer to a realm where your character list is full. 4  The character must be at least level 10. 5  Starter Edition accounts ... Make a selection Checking the Status of Your Transfer Restrictions and Limitations. Make a selection from the dropdown menu above. To check the status of your character transfer: 1  Log in to your Battle.net Account Management page and select the license that initiated the character transfer."}, {"url": "http://www.gamepur.com/guide/18575-gta-v-online-pc-characters-and-progress-transfer-transfer-ps4-xb1-ps3-or.html", "passage_text": "You will still be able to play with your existing characters on PS3, PS4, Xbox 360 or Xbox One however any progress made with versions of the characters on those systems after a transfer will remain on the those systems only. Below you can check out our step by step guide on how to Previous GTA Online/GTA V Characters and Progression From PS4/Xbox One to PC. What You Need To Transfer GTA Online Character and Progression from PS4/Xbox One to PC: 1  Grand Theft Auto V PC Copy."}, {"url": "http://www.vg247.com/2015/04/14/gta-5-online-how-to-transfer-your-console-character-to-pc/", "passage_text": "Alex ‘s latest video is a step-by-step guide on how you can transfer your GTA Online character from any of the consoles to the PC version. Be warned though that the transfer is a one-time deal. "}, {"url": "https://support.rockstargames.com/hc/en-us/articles/202892778-Transferring-Your-Previous-Grand-Theft-Auto-Online-Characters-and-Progression-to-PlayStation-4-Xbox-One-or-PC", "passage_text": "1 If you have previous character and progression data on both Xbox 360 and PlayStation®3, you will be prompted to select one set of data. 2  You can only transfer one set of character and progression data for your Xbox Live account on Xbox One. In order to transfer your previous GTA Online character and progression data, you will need a Social Club account linked to the PlayStation®Network and/or Xbox Live account(s) used while previously playing Grand Theft Auto Online."}, {"url": "http://www.gamepur.com/guide/18575-gta-v-online-pc-characters-and-progress-transfer-transfer-ps4-xb1-ps3-or.html", "passage_text": "If you are transferring from PS3 or PS4, your Social Club account will need to be linked to the PSN account used while playing GTA Online. How to transfer your previous GTA Online Character and Progression data to PC: 1  Start Grand Theft Auto V on PC and log into the Social Club. Below you can check out our step by step guide on how to Previous GTA Online/GTA V Characters and Progression From PS4/Xbox One to PC. What You Need To Transfer GTA Online Character and Progression from PS4/Xbox One to PC: 1  Grand Theft Auto V PC Copy."}]