[{"url": "http://www.msn.com/en-us/money/companies/the-10-largest-privately-held-companies-in-america/ss-BBiKtaL", "passage_text": "While often the largest public companies are recognizable, some of the largest private companies are far less known. For example, privately owned Cargill, a large conglomerate heavily involved in agricultural and food production, had revenues of nearly $135 billion in 2014. The company went public in 1988 and became one of the largest publically-traded PC makers in the world. Dell became one of the largest privately held companies in the country after Michael Dell and private equity firm Silver Lake Partners bought back the publicly traded shares in 2013. The two parties acquired the company for $24.9 billion"}, {"url": "http://www.forbes.com/lists/2011/21/private-companies-11_land.html", "passage_text": "see photos. Cargill takes the top spot in Forbes' list of America's Largest Private Companies, the same as it has for 8 of the past 10 years. "}, {"url": "http://www.forbes.com/largest-private-companies/", "passage_text": "America's Largest Private Companies 2014. This year marks our 30th ranking of America’s largest private companies. The list debuted in 1985. Agricultural giant Cargill took the No.1 spot for the 28th time this year."}, {"url": "http://www.msn.com/en-us/money/companies/the-10-largest-privately-held-companies-in-america/ss-BBiKtaL", "passage_text": "1. Cargill Incorporated. Cargill is the largest privately held company in the United States by revenue. Founder W.W. Cargill started the company in 1865 in the grain business. Over the last 150 years it has grown into a massive and diversified conglomerate. The company went public in 1988 and became one of the largest publically-traded PC makers in the world. Dell became one of the largest privately held companies in the country after Michael Dell and private equity firm Silver Lake Partners bought back the publicly traded shares in 2013. The two parties acquired the company for $24.9 billion"}, {"url": "https://en.wikipedia.org/wiki/Privately_held_company", "passage_text": "More ambiguous terms for a privately held company are unquoted company and unlisted company. Though less visible than their publicly traded counterparts, private companies have major importance in the world's economy. For example, the U.S. Securities Exchange Act of 1934, section 12(g), limits a privately held company, generally, to fewer than 2000 shareholders, and the U.S. Investment Company Act of 1940, requires registration of investment companies that have more than 100 holders."}, {"url": "http://www.answers.com/Q/What_is_the_largest_privately_owned_company_in_the_world", "passage_text": "Making the world better, one answer at a time. Glencore AG is the largest privately owned company in the world in 2008, with annual revenues of approximately $250 billion dollars. "}, {"url": "https://en.wikipedia.org/wiki/Cargill", "passage_text": "Cargill, Inc. , is an American privately held, i.e. family business, global corporation, based in Minnetonka, Minnesota, a Minneapolis suburb. Founded in 1865, it is now the largest privately held corporation in the United States in terms of revenue. It owned 2/3 of the shares of The Mosaic Company (sold off in 2011), one of the world's leading producers and marketers of concentrated phosphate and potash crop nutrients. Cargill declared revenues of $136.7 billion and earnings of $2.31 billion in the 2013 fiscal year."}, {"url": "http://www.medline.com/about-us/key-facts/", "passage_text": "1 Medline is the largest privately held manufacturer and distributor of healthcare supplies in the United States. 2  Founded in 1966, Medline’s roots date back to 1910 when A.L. Mills, the great-grandfather of the current leadership, started sewing butcher’s aprons in Chicago. "}, {"url": "http://www.timesfreepress.com/news/business/aroundregion/story/2013/jun/04/top-10-largest-privately-held-companies/109806/", "passage_text": "June 4th, 2013 by Dave Flessner in Business Around the Region. The largest privately held companies in the United States last year were: 1. Cargill, food, drink and tobacco, including Horizon Milling in Chattanooga, $133.9 billion in revenues. 2. Koch Industries, conglomerate business, $115 billion in revenues"}]