[{"url": "http://www.answers.com/Q/Are_chimpanzees_carnivores", "passage_text": "Unlike other apes such as gorillas and orangutans which are almost entirely herbivorous (plant-eating), chimpanzees are known as omnivores. This means that they eat meat and p … lants!"}, {"url": "http://www.answers.com/Q/Are_chimpanzees_carnivores", "passage_text": "Chimpanzees are omnivores, meaning they eat both plant and animal material. Their diet primarily consists of plants, nuts, fruit, and insects like ants and termites. Meat is a … very small part of their diet. It is composed of small monkeys and forest deer. This prey is caught via coordinated efforts."}, {"url": "http://www-bcf.usc.edu/%7Estanford/chimphunt.html", "passage_text": "When Jane Goodall first observed wild chimpanzees hunting and eating meat nearly 40 years ago, skeptics suggested that their behavior was aberrant and that the amount of meat eaten was trivial. Today, we know that chimpanzees everywhere eat mainly fruit, but are also predators in their forest ecosystems."}, {"url": "http://www.answers.com/Q/Are_chimpanzees_carnivores_omnivores_or_herbivores", "passage_text": "Confidence votes 197. Unlike other apes such as gorillas and orangutans which are almost entirely herbivorous (plant-eating), chimpanzees are known as omnivores."}, {"url": "http://michaelbluejay.com/veg/natural.html", "passage_text": "Many consider chimpanzees to be omnivores but 95-99% of their diet is plants, and most of the rest isn't meat, it's termites. If humans are omnivores, then the anatomical evidence suggests that we're the same kind: the kind that eats almost exclusively plant foods."}, {"url": "http://michaelbluejay.com/veg/natural.html", "passage_text": "1 Human anatomy is much more similar to herbivores than carnivores. 2  If humans are omnivores because we're capable of eating meat, then so are cats, since most cats eat plant foods every day. 3  If we're supposed to eat animal foods, the evidence suggests it's a tiny part of our diets, not a large one."}, {"url": "http://www.allaboutwildlife.com/what-do-chimps-eat", "passage_text": "Unlike other apes such as gorillas and orangutans which are almost entirely herbivorous (plant-eating), chimps are classified as omnivores. This means that, like humans, they eat a variety of plant and animal foods."}]