[{"url": "http://names.whitepages.com/last/Bewley", "passage_text": "Meaning & Origins. English: habitational name from Bewley Castle in the former county of Westmorland (now part of Cumbria), from Bewley in Durham, or from Beaulieu in Hampshire (see Beaulieu), all named with beu ‘lovely’ + lieu ‘place’. See more."}, {"url": "http://www.surnamedb.com/Surname/Bewley", "passage_text": "Recorded in the spellings of Beaulieu, Beuly, Beauley, Bewlay, Bewley and Bewlie, this is an Anglo-Irish surname, but of French origins. "}, {"url": "http://www.ancestry.com/name-origin?surname=bewley", "passage_text": "Bewley Name Meaning. English: habitational name from Bewley Castle in the former county of Westmorland (now part of Cumbria), from Bewley in Durham, or from Beaulieu in Hampshire (see Beaulieu), all named with beu ‘lovely’ + lieu ‘place’. Source: Dictionary of American Family Names ©2013, Oxford University Press. You can find out where the majority of the Bewley families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists."}, {"url": "https://en.wikipedia.org/wiki/Bewley", "passage_text": "Bewley is a surname originating in England around the 13th century. It is said to come from France from the spelling Beaulieu. The story of the family has been told by one of his distinguished descendants, Sir Edmund Thomas Bewley (1837-1908) Q.C., J.P., of Fitzwilliam Place, Dublin, Ireland, in his book The Bewleys of Cumberland, published in 1904 (Download Bewleys of Cumberland)."}, {"url": "http://www.searchforancestors.com/surnames/origin/b/bewley.php", "passage_text": "For a more detailed definition for Bewley or other surnames, search the FREE Ancestry.com Name Dictionary. Bewley Last Name Meaning. You can Start your Bewley Family Tree and discover things you never knew about your own family. Construct a free family tree to trace your own genealogy and learn about your personal family history. Start by entering what you know about yourself and your family. Bewley at the Mormon LDS Database. Trace your Bewley family in the vast resources of the Mormon LDS genealogy online databases which includes the Ancestral File, transcribed census records, extracted church records from around the world, family trees, and the International Genealogical Index."}, {"url": "https://en.wikipedia.org/wiki/Bewley", "passage_text": "Some thousands of families today in the English-speaking world bear the surname of Bewley. A number of these families can trace their origins back to Thomas de Beaulieu, who lived in the 14th century in Thistlethwaite, Cumberland, England. The story of the family has been told by one of his distinguished descendants, Sir Edmund Thomas Bewley (1837-1908) Q.C., J.P., of Fitzwilliam Place, Dublin, Ireland, in his book The Bewleys of Cumberland, published in 1904 (Download Bewleys of Cumberland)."}, {"url": "http://www.searchforancestors.com/surnames/origin/b/bewley.php", "passage_text": "Bewley in Ancestry.com Records. Start your family tree and learn the story of your family in the world's largest online collection of genealogy records and family trees. Look for additional generations to add to your family history. Bewley at the Mormon LDS Database. Trace your Bewley family in the vast resources of the Mormon LDS genealogy online databases which includes the Ancestral File, transcribed census records, extracted church records from around the world, family trees, and the International Genealogical Index."}, {"url": "https://www.houseofnames.com/bewley-family-crest", "passage_text": "One of the first records of one of the surname's early variants was Simon de Bello Loco of Normandy who was listed there in 1180 and years later Alexander de Bello Loco paid a fine in Bedfordshire in 1255. Bewley Common is a small village in Wiltshire. More. With a full color Coat of Arms along with a very detailed History, full symbolism, bibliography and settlers listed by the centuries. More about the Bewley Family Crest..."}]