[{"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=eye-irritation%7Cred-(bloodshot)-eyes%7Cwatery-eyes&symptomids=95%7C186%7C253&locations=3%7C3%7C3", "passage_text": "WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms eye irritation, red (bloodshot) eyes and watery eyes including Hay fever, Pink eye (conjunctivitis), and Indoor allergens. There are 22 conditions associated with eye irritation, red (bloodshot) eyes and watery eyes. The links below will provide you with more detailed information on these medical conditions from the WebMD Symptom Checker and help provide a better understanding of causes and treatment of these related conditions. 1  Hay fever"}, {"url": "http://patient.info/health/allergic-conjunctivitis-leaflet", "passage_text": "Allergic conjunctivitis causes red, watery, itchy or gritty eyes. The condition is not usually painful and does not make eyes sensitive to light. It does not affect vision. The most common cause is an allergy to pollen in the hay fever season. "}, {"url": "http://www.avogel.co.uk/health/hayfever/symptoms/eye-problems/", "passage_text": "Introduction. Eye problems are perhaps the most common or significant symptom of hayfever. When pollen lands on the eye, not only does this irritate the sensitive tissues, but also triggers the release of a chemical called histamine. After your eyes become itchy, they also tend to become red. This is because the blood vessels on the white outer surface of the eye dilate or swell. This is an inflammatory response and is designed to fight off the irritant in your eye. When your eyes are itchy, it is tempting to rub them."}, {"url": "http://www.eyecare-information-service.org.uk/disorders/hayfever.html", "passage_text": "This encounter causes rhinitis or the immediate inflammation of the nose, and conjunctivitis, the inflammation of the eyes. 1  Aside from these two symptoms, a person with hay fever may also experience the more common symptoms such as runny nose, blocked nose, itchy red eyes and nose, and sneezing. Hay fever or seasonal allergic rhinitis is an allergic reaction caused by hay or grass pollen. From the months of March to May, this allergic reaction is commonly caused by other pollens like tree pollens but from May until July, hay fever due to grass pollen becomes very common."}, {"url": "http://www.nativeremedies.com/ailment/causes-of-bloodshot-eyes.html", "passage_text": "Bloodshot eyes are a term commonly used to describe red eyes. They are caused when the small blood vessels on the surface of the eye (sclera) become enlarged and congested with blood. This occurs as a result of insufficient oxygen supply to the cornea or the tissues covering the eyes. "}, {"url": "http://www.eyecare-information-service.org.uk/disorders/hayfever.html", "passage_text": "1 Aside from these two symptoms, a person with hay fever may also experience the more common symptoms such as runny nose, blocked nose, itchy red eyes and nose, and sneezing. Hay fever or seasonal allergic rhinitis is an allergic reaction caused by hay or grass pollen. From the months of March to May, this allergic reaction is commonly caused by other pollens like tree pollens but from May until July, hay fever due to grass pollen becomes very common."}, {"url": "http://www.markdarlingeyecare.co.uk/index.asp?selection=Hay%20fever", "passage_text": "Hay fever affects many people to varying degrees, with symptoms from a mild itch to full blown red eye, oedema (swelling) lacrimation (watering) and the common nasal problems such as runny nose and sneezing. It generally begins in childhood but can develop later in life and some years are better/worse than others. Wraparound sunglasses help prevent the pollen getting into your eyes and relieve the irritation caused by bright sun on an already irritated eye. Rinse the pollen out of your eyes with eyewash such as Optrex, and if you store it in the fridge you get a double soothing effect."}, {"url": "http://www.allaboutvision.com/conditions/red-eyes.htm", "passage_text": "Red eyes usually are caused by allergy, eye fatigue, over-wearing contact lenses or common eye infections such as pink eye (conjunctivitis). However, redness of the eye sometimes can signal a more serious eye condition or disease, such as uveitis or glaucoma. Red eyes occur when the blood vessels on the surface of the eye expand. The appearance of red eye ranges in severity from a bright red that completely covers the sclera to a few enlarged blood vessels that look like wiggly red or pink lines across the white of the eye."}, {"url": "http://www.healthline.com/health/allergies/hay-fever-rash", "passage_text": "Hay fever symptoms include sneezing, watery eyes, and congestion. Hay fever can cause a rash. Learn about the causes and symptoms of hay fever rash. Hay fever symptoms are fairly well-known. Sneezing, watery eyes, and congestion are all allergic reactions to airborne particles such as pollen. Skin irritation or rash is another symptom of hay fever that gets little attention. "}, {"url": "http://www.allaboutvision.com/conditions/red-eyes.htm", "passage_text": "We've all experienced red, bloodshot eyes from time to time, affecting one or both eyes. Red eye is caused by swollen or dilated blood vessels on the sclera, the white outer surface of the eye. Red eyes can be accompanied by eye pain, itching, eye discharge, swollen eyes or visual disturbances such as blurry vision. In other cases, a red eye may cause no irritation at all. Red eyes occur when the blood vessels on the surface of the eye expand. The appearance of red eye ranges in severity from a bright red that completely covers the sclera to a few enlarged blood vessels that look like wiggly red or pink lines across the whit"}]