[{"url": "https://en.wikipedia.org/wiki/Inulin", "passage_text": "Inulin is used by some plants as a means of storing energy and is typically found in roots or rhizomes. Most plants that synthesize and store inulin do not store other forms of carbohydrate such as starch. This is advantageous because inulin contains 25-35% of the food energy of carbohydrates (starch, sugar). In addition to being a versatile ingredient, inulin has many health benefits. It increases calcium absorption and possibly magnesium absorption, while promoting the growth of beneficial intestinal bacteria."}, {"url": "https://en.wikipedia.org/wiki/Inulin", "passage_text": "Inulin is generally recognized as safe (GRAS) by the U.S. Food and Drug Administration. A single report of what is claimed to be an allergic reaction to inulin exists in the literature. About 30–40% of people in Central Europe suffer from fructose malabsorption. This is advantageous because inulin contains 25-35% of the food energy of carbohydrates (starch, sugar). In addition to being a versatile ingredient, inulin has many health benefits. It increases calcium absorption and possibly magnesium absorption, while promoting the growth of beneficial intestinal bacteria."}, {"url": "http://health.usnews.com/health-news/blogs/eat-run/2015/05/05/what-is-inulin-chicory-root-fiber", "passage_text": "Since fiber doesn’t have calories by nature of its being indigestible, adding fiber like inulin to processed foods can provide substance and bulk without the calories. Secondly, inulin has a naturally sweet taste; in fact, powdered inulin is marketed as a calorie-free sweetener. Inulin is a type of fiber, meaning it's a plant-based carbohydrate whose bonds cannot be broken by human digestive enzymes. Inulin is also known as a “prebiotic” fiber based on the fact that it's highly fermentable by the friendly bacteria in our guts. Prebiotics are, in essence, like food for “ probiotics ;” or, a source of nutrition for gut bacteria that helps nourish them and enable them to thrive"}, {"url": "http://www.wisegeek.org/what-is-inulin.htm", "passage_text": "Inulin is a polysaccharide that is produced by plants such as onions, leeks, Jerusalem artichokes, and garlic. It can also be referred to as neosugar, alant starch, Alantin, and diabetic sugar. Many manufacturers are putting it in processed foods because it has tremendous health benefits. Onions and garlic are excellent natural sources of dietary inulin. The jerusalem artichoke, or sun choke, is a good source of inulin. Inulin is produced by plants such as spring onions. Too much inulin can lead to diarrhea in some people. Too much inulin can cause gas and bloating."}, {"url": "https://en.wikipedia.org/wiki/Inulin", "passage_text": "It can be used to replace sugar, fat, and flour. This is advantageous because inulin contains 25-35% of the food energy of carbohydrates (starch, sugar). In addition to being a versatile ingredient, inulin has many health benefits. It increases calcium absorption and possibly magnesium absorption, while promoting the growth of beneficial intestinal bacteria."}, {"url": "https://en.wikipedia.org/wiki/Inulin", "passage_text": "Inulin is a natural storage carbohydrate present in more than 36,000 species of plants, including wheat, onion, bananas, garlic, asparagus, sunchoke and chicory. For these plants, inulin is used as an energy reserve and for regulating cold resistance. This is advantageous because inulin contains 25-35% of the food energy of carbohydrates (starch, sugar). In addition to being a versatile ingredient, inulin has many health benefits. It increases calcium absorption and possibly magnesium absorption, while promoting the growth of beneficial intestinal bacteria."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1048-INULIN.aspx?activeIngredientId=1048&activeIngredientName=INULIN", "passage_text": "INULIN Overview Information. Inulin is a starchy substance found in a wide variety of fruits, vegetables, and herbs, including wheat, onions, bananas, leeks, artichokes, and asparagus. The inulin that is used for medicine is most commonly obtained by soaking chicory roots in hot water. Inulin is used for high blood fats, including cholesterol and triglycerides. It is also used for weight loss, constipation, and as a food additive to improve taste."}, {"url": "https://healingfoodscompany.com/inulin-secret-farting-fiber/", "passage_text": "Inulin is actually a naturally occurring water soluble fiber found in foods like bananas, yams, artichokes, onion and chicory root. In its natural state, inulin improves digestion, nutrient absorption and regularity. "}, {"url": "http://www.emaxhealth.com/1275/how-inulin-may-help-type-2-diabetes", "passage_text": "Inulin is a term used to describe a group of polysaccharides that is produced by numerous plants. This type of dietary fiber is usually found in the roots of plants, and the plant that most inulins are extracted from is the herb chicory. "}]