[{"url": "http://biology.about.com/od/anatomy/p/thalamus.htm", "passage_text": "It is involved in sensory perception and regulation of motor functions. The thalamus is a limbic system structure and it connects areas of the cerebral cortex that are involved in sensory perception and movement with other parts of the brain and spinal cord that also have a role in sensation and movement. "}, {"url": "http://biology.about.com/od/anatomy/p/diencephalon.htm", "passage_text": "Diencephalon: The diencephalon, along with the telencephalon (cerebrum) comprise the two major divisions of prosencephalon (forebrain). Main structures of the diencephalon include the hypothalamus, thalamus, epithalamus (including the pineal gland), and subthalamus. The diencephalon relays sensory information between brain regions and controls many autonomic functions of the peripheral nervous system. Function: The diencephalon is involved in several functions of the body including: 1  Directing Sense Impulses Throughout the Body. 2  Autonomic Function Control. 3  Endocrine"}, {"url": "http://study.com/academy/lesson/diencephalon-definition-location-function.html", "passage_text": "The diencephalon is a part of the brain that is responsible for many functions in the human body. In this lesson, you will learn about the diencephalon, including its location, parts, and functions. The thalamus is the size of an walnut, whereas the hypothalamus is the size of an almond; in total, the size of the diencephalon is about the size of an apricot. The diencephalon is located deep in the brain underneath the cerebrum and above the pituitary gland."}, {"url": "http://www.answers.com/Q/What_are_the_functions_of_diencephalon", "passage_text": "Confidence votes 96. The diencephalon is the part of the forebrain that contains such important structures as the thalamus, hypothalamus and the posterior portion of the pituitary gland. The diencephalon is the region of the brain that sits on top of the  brainstem, below the telencephalon. It includes the thalamus and  hypothalamus. Parts of diencephalon pe … rform numerous functions,  from regulating wakefulness to the control of the autonomic nervous  system. 1 person found this useful"}, {"url": "https://en.wikipedia.org/wiki/Diencephalon", "passage_text": "The diencephalon or interbrain is one of the major regions of the brain in vertebrates. It consists of several structures between the brainstem and the cerebrum, including the thalamus, hypothalamus, epithalamus, pituitary gland, and pineal gland. Embryologically, the diencephalon begins as the region of the embryonic vertebrate neural tube that gives rise to posterior forebrain structures. In prenatal development, the forebrain (prosencephalon) is the most anterior vesicle of the neural tube that later forms both the diencephalon and the telencephalon (which develops into the cerebrum)."}, {"url": "http://www.wisegeekhealth.com/what-is-the-diencephalon.htm", "passage_text": "The diencephalon, also known as the interbrain or betweenbrain, is one of the major areas of the brain, along with the brainstem, cerebellum, and cerebrum. This structure in the brain contains a number of smaller components of the brain which perform a variety of roles to keep the body functioning. The diencephalon accepts sensory input, such as the sound of an orchestra playing, and relays information to the brain so that it can be processed. The diencephalon plays a part in regulating breathing and swallowing. The diencephalon complements functions of the limbic system"}, {"url": "http://medical-dictionary.thefreedictionary.com/diencephalon", "passage_text": "diencephalon. 1. the posterior part of the prosencephalon, consisting of the hypothalamus, thalamus, metathalamus, and epithalamus; the subthalamus is often considered to be a distinct division. See also brainstem. 2. the posterior of the two brain vesicles formed by specialization of the prosencephalon in the developing embryo."}, {"url": "http://medical-dictionary.thefreedictionary.com/diencephalon", "passage_text": "diencephalon. 1. the posterior part of the forebrain, consisting of the hypothalamus, thalamus, metathalamus, and epithalamus; the subthalamus is often recognized as a distinct division. Diencephalon. 1. the posterior part of the prosencephalon, consisting of the hypothalamus, thalamus, metathalamus, and epithalamus; the subthalamus is often considered to be a distinct division. See also brainstem. 2. the posterior of the two brain vesicles formed by specialization of the prosencephalon in the developing embryo."}]