[{"url": "https://msdn.microsoft.com/en-us/library/eked04a7.aspx", "passage_text": "Optional. Boolean expression. If condition is Nothing, Visual Basic treats it as False. statements. Optional. One or more statements that are repeated while, or until, condition is True. Continue Do. Optional. Transfers control to the next iteration of the Do loop. Exit Do. Optional. Transfers control out of the Do loop. Loop. Required. Terminates the definition of the Do loop."}, {"url": "https://msdn.microsoft.com/en-us/library/t2at9t47.aspx", "passage_text": "Exit does not define the end of a statement. In the following example, the loop condition stops the loop when the index variable is greater than 100. The If statement in the loop, however, causes the Exit Do statement to stop the loop when the index variable is greater than 10. "}, {"url": "http://www.exceltip.com/using-loops/using-loops-in-vba-in-microsoft-excel.html", "passage_text": "In Microsoft Excel we use VBA for each loop. The purpose of a Excel VBA loops is to get Excel to repeat a piece of code a certain number of times. ActiveCell.Offset(1, 0).Select Loop Until IsEmpty(ActiveCell.Offset(0, -1)) End Sub. This macro places a formula into the active cell, and moves into the next cell down. It uses Loop Until to tell Excel to keep repeating the code until the cell in the adjacent column (column B) is empty."}, {"url": "http://www.excel-easy.com/vba/examples/interrupt-a-macro.html", "passage_text": "You can interrupt a macro in Excel at any time by pressing Esc or Ctrl + Break. Place a command button on your worksheet and add the following code lines: Dim x As Long. x = 5. Do While. x = x + 1. Loop. 1. Click the command button on the sheet. "}, {"url": "http://www.ehow.com/how_8763231_stop-vba-loop-break.html", "passage_text": "Instructions. Open the VBA Editor by pressing alt+f11 while in Excel. Enter the following code: Dim cell As Object. Dim count As Integer. count = 0. For Each cell In Selection. count = count + 1. Next cell. This is a typical loop in VBA. This counts the number of cells in a selection. Save. VBA (Visual Basic for Applications) is a scripting language that is included with the Microsoft Office Suite. It is used in combination with Microsoft Excel. Using a scripting language in this way allows programmers to quickly write programs using Excel's number crunching features."}, {"url": "http://www.exceltrick.com/formulas_macros/vba-loops-for-while-until-loops/", "passage_text": "To end a For or a For Each Loop you can use: Exit For. To end Do While or Do Until loop you can use: Exit Do. So, this was all about VBA Loops. Do let us know in case you have any queries related to the topic. On each iteration Until checks if the ‘ condition ’ evaluates to True or False. If the ‘ condition ’ is False then the loop continues otherwise the loop ends. How a Do Until Loop Works: Let’s say we have a Do Until loop as follows: 1  In the First statement a variable ‘ loop_ctr ’ is declared and initialized as 1."}, {"url": "https://support.microsoft.com/en-us/kb/164234", "passage_text": "Press & _ CTRL+BREAK to exit an infinite loop.) Do ' Because the Do...Loop is looking for the value of 'n' ' to equal 1, and because there is no code within the loop ' to change the value of the variable 'n' from it's initial ' value of zero, the Do...Loop will continue to loop indefinitely. There can be many causes for an infinite loop. For, example an infinite loop will occur if you create a loop to check the value of a variable that never changes, as in the following example: (https://partner.microsoft.com/global/30000104)."}]