[{"url": "http://www.dentistvet.com/enamel-dysplasia-or-hypoplasia.html", "passage_text": "Enamel Dysplasia or Hypoplasia. Enamel dysplasia literally means that the enamel, the outside layer of the tooth, did not form properly during development. It is either caused by enamel hypoplasia or hypocalcification. It can occur either on a few teeth or can affect the whole mouth. "}, {"url": "http://www.tandurust.com/oral-care/enamel-hypoplasia-causes-treatment.html", "passage_text": "Causes Of Enamel Hypoplasia. Enamel hypoplasia can be categorized into two basic types, based on the causative factors associated with the condition. 1  Hereditary type enamel hypoplasia: This condition is associated with disturbance during the embryonic development, especially in the ectoderm. 2  The other components of embryonic development are normal."}, {"url": "http://www.tandurust.com/oral-care/enamel-hypoplasia-causes-treatment.html", "passage_text": "1 Environmental type enamel hypoplasia: This condition is associated with a host of environmental factors (i.e. not genetic or hereditary) , which include, 2  Nutritional deficiency of vitamins including vitamin A, vitamin C and vitamin D. Enamel hypoplasia can be categorized into two basic types, based on the causative factors associated with the condition. 1  Hereditary type enamel hypoplasia: This condition is associated with disturbance during the embryonic development, especially in the ectoderm. 2  The other components of embryonic development are normal."}, {"url": "https://en.wikipedia.org/wiki/Enamel_hypoplasia", "passage_text": "(July 2009). Enamel hypoplasia is a defect of the teeth in which the enamel is hard but thin and deficient in amount, caused by defective enamel matrix formation with a deficiency in the cementing substance. Usually the condition involves part of the tooth having a pit in it. "}, {"url": "http://www.identalhub.com/article_enamel-hypoplasia-370.aspx", "passage_text": "Enamel Hypoplasia. Enamel Hypoplasia is the most common abnormality of development and mineralization of human teeth. The lesion is characterized by a quantitative defect in enamel tissue resulting from an undetermined metabolic injury to the formative cells – the ameloblasts. "}, {"url": "http://www.pdconline.com/what-is-enamel-hypoplasia/", "passage_text": "Enamel hypoplasia can occur on 1 tooth or many teeth. It can appear white, yellow, or brown in color with a rough or pitted surface. In some cases the quality of enamel is affected as well as the quantity of enamel. Some genetic disorders cause all teeth to have enamel hypoplasia. "}, {"url": "http://www.tandurust.com/oral-care/enamel-hypoplasia-causes-treatment.html", "passage_text": "Enamel hypoplasia is a defect associated with incomplete formation of organic enamel, which covers the teeth. In this condition, the enamel is thin and soft, which causes it to chip off and exposing the underlying dentin. There are two basic types-hereditary and environmental, which are associated with different causes. Enamel hypoplasia can be categorized into two basic types, based on the causative factors associated with the condition. 1  Hereditary type enamel hypoplasia: This condition is associated with disturbance during the embryonic development, especially in the ectoderm. 2  The other components of embryonic development are normal."}, {"url": "http://www.rightdiagnosis.com/medical/hereditary_enamel_hypoplasia.htm", "passage_text": "Hereditary enamel hypoplasia: Hereditary enamel hypoplasia is listed as a type of (or associated with) the following medical conditions in our database: 1  Dental conditions. 2  Oral conditions. 3  Head conditions. Hereditary enamel hypoplasia: Related Diseases. "}, {"url": "http://www.toothiq.com/dental-diagnosis/enamel-hypoplasia/", "passage_text": "Environmental enamel hypoplasia is a related condition, in which the ameloblast cells that make tooth enamel were affected by an event such as fever, malnutrition, or hypocalcemia in the patient, while the teeth were forming. "}, {"url": "http://www.rocklinpediatricdentistry.com/patient-education/enamel-hypoplasia/", "passage_text": "Enamel Hypoplasia. Enamel Hypoplasia is a condition that results in having less enamel than normal. It can affect both baby and permanent teeth. Most of the time it happens before the age of three, when the enamel is still developing and more vulnerable to genetic or environmental factors. "}]