[{"url": "http://www.thekitchn.com/heres-why-you-should-have-sumac-in-your-spice-cabinet-ingredient-intelligence-67042", "passage_text": "The sumac bush, native to the Middle East, produces deep red berries, which are dried and ground into coarse powder. While it's less common, the berries may also be sold whole. Ground sumac is a versatile spice with a tangy lemony flavor, although more balanced and less tart than lemon juice. A small sprinkle also adds a beautiful pop of color to any dish. Sumac is a widely used, essential spice in Middle Eastern and Mediterranean cooking. It's used in everything from dry rubs, marinades, and dressing. But its best use is sprinkled over food before serving. It's great over vegetables, grilled lamb, chicken and fish."}, {"url": "http://theepicentre.com/spice/sumac/", "passage_text": "Sumac comes from the berries of a wild bush that grows wild in all Mediterranean areas, especially in Sicily and southern Italy, and parts of the Middle East, notably Iran. It is an essential ingredient in Arabic cooking, being preferred to lemon for sourness and astringency. Many other varieties of sumac occur in temperate regions of the world. In North America Rhus glabra is known for its use in the tanning industry and for its medicinal properties. Also in North Americai is the related Toxicodendron radicans (poison ivy) which can cause a severe skin reaction when touched."}, {"url": "http://www.bbc.co.uk/food/sumac", "passage_text": "Sumac recipes. Sumac is a tangy, lemony spice often used in Mediterranean and Middle Eastern cooking. Try using it in salads instead of lemon juice or to season grilled meat and fish. It’s also delicious sprinkled over hummus. "}, {"url": "https://en.wikipedia.org/wiki/Sumac", "passage_text": "Sumac spice. Species including the fragrant sumac (R. aromatica), the littleleaf sumac (R. microphylla), the skunkbush sumac (R. trilobata), the smooth sumac, and the staghorn sumac are grown for ornament, either as the wild types or as cultivars. The word 'sumac' traces its etymology from Old French sumac (13th century), from Mediaeval Latin sumach, from Arabic summāq (سماق), from Syriac summāq (ܣܡܘܩ)- meaning red."}, {"url": "http://www.myrecipes.com/how-to/cooking-questions/what-is-sumac-spice", "passage_text": "I have a recipe that calls for it, but it is not at my grocery store. Sumac is a spice, used mostly in Middle Eastern cooking, that has a lovely tart mild lemon flavor. The deep red berries are most often used ground into a powder. I often sprinkle it over a platter of grilled vegetables or roasted chicken; it looks as appealing as it tastes. "}, {"url": "http://www.thespicehouse.com/spices/powdered-sumac", "passage_text": "Sumac has a tart flavor that is very nice sprinkled on fish, chicken, over salad dressings, rice pilaf, or over raw onions. Try substituting in any dish on which you might squeeze fresh lemon juice. If you enjoy hummus, try topping it with a sprinkling of sumac. It's delightful! Sumac is considered essential for cooking in much of the Middle East; it served as the tart, acidic element in cooking prior to the introduction of lemons by the Romans. Sumac has a very nice, fruity-tart flavor which is not quite as overpowering as lemon."}, {"url": "http://www.poison-ivy.org/poison-sumac", "passage_text": "Poison Sumac. Poison sumac, Toxicodendron vernix, is related to the poison ivies and poison oaks, not to the other sumacs. It is relatively rare, compared to the other members of the family. The rash-causing agent, urushiol, is the same, and it causes the same rashes. Poison sumac, Toxicodendron vernix, is related to the poison ivies and poison oaks, not to the other sumacs. It is relatively rare, compared to the other members of the family"}]