[{"url": "http://ods.od.nih.gov/factsheets/Iron-HealthProfessional", "passage_text": "The richest sources of heme iron in the diet include lean meat and seafood [ 11 ]. Dietary sources of nonheme iron include nuts, beans, vegetables, and fortified grain products. In the United States, about half of dietary iron comes from bread, cereal, and other grain products [ 2, 3, 5 ]."}, {"url": "http://patient.info/medicine/iron-supplements", "passage_text": "1 Iron is absorbed into your bloodstream best if the supplement is taken about an hour before a meal. 2  If, however, you feel queasy after taking iron, having some food in your stomach can help to reduce stomach irritation and feelings of queasiness."}, {"url": "http://ods.od.nih.gov/factsheets/Iron-HealthProfessional", "passage_text": "Iron is a mineral that is naturally present in many foods, added to some food products, and available as a dietary supplement. Iron is an essential component of hemoglobin, an erythrocyte protein that transfers oxygen from the lungs to the tissues [ 1 ]."}, {"url": "http://www.mayoclinic.org/drugs-supplements/iron-supplement-oral-route-parenteral-route/description/DRG-20070148", "passage_text": "Cereals, beans, and some vegetables contain poorly absorbed (nonheme) iron. Foods rich in vitamin C (e.g., citrus fruits and fresh vegetables), eaten with small amounts of heme iron-containing foods, such as meat, may increase the amount of nonheme iron absorbed from cereals, beans, and other vegetables."}, {"url": "http://www.wikihow.com/Increase-Iron-Absorption", "passage_text": "The human body typically absorbs iron from dietary sources. In order to absorb the iron, you must consume it through food or supplements. Vegetarians, young children, pregnant women, and individuals with certain chronic illnesses may be at increased risk for poor iron absorption or inadequate iron levels."}, {"url": "http://www.nelsonsnaturalworld.com/en-us/us/our-brands/pur-absorb/iron-essentials/iron-supplementation", "passage_text": "Not all iron supplements are the same. The absorption rate of most conventional iron tablets is estimated to be an average of 18%.[1] This means that you are taking a higher dose of iron because the average person only absorbs a small amount."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/007478.htm", "passage_text": "TIPS FOR TAKING IRON. Iron is absorbed the best on an empty stomach. Yet, iron supplements can cause stomach cramps, nausea, and diarrhea in some people. You may need to take iron with a small amount of food to avoid this problem."}, {"url": "http://healthyeating.sfgate.com/taking-iron-supplements-food-decrease-absorption-7202.html", "passage_text": "Dairy products inhibit iron absorption. If you have low levels of iron in your blood, your doctor may prescribe iron supplements, as well as a high-iron diet, to increase your blood iron levels to the recommended amount."}]