[{"url": "http://www.rightdiagnosis.com/sym/sacrum_pain.htm", "passage_text": "Sacrum pain: Introduction. Sacrum pain: sacrum pain can be characterized as aching or sharp pain, usually a pain in the low back, or a pain in the buttocks. See detailed information below for a list of 23 causes of Sacrum pain, Symptom Checker, including diseases and drug side effect causes."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/sacrum-sacral-region", "passage_text": "Back pain or leg pain (sciatica) can typically arise due to injury where the lumbar spine and sacral region connect (at L5 - S1) because this section of the spine is subjected to a large amount of stress and twisting during certain activities, such as sports and sitting for long periods of time."}, {"url": "http://www.livestrong.com/article/170580-causes-of-sacrum-joint-pain/", "passage_text": "There are numerous causes of sacrum, or sacroiliac, joint pain. According to the Sports Injury Clinic website, the sacroiliac, or SI joints, are located near the tailbone and connect the hip bones with the sacrum, which is a large, triangular bone situated at the base of the spine."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/causes-pain-lumbar-spine", "passage_text": "There are many structures in the lumbar spine that can cause pain-any irritation to the nerve roots that exit the spine, joint problems, the discs themselves, the bones and the muscles-can all be a source of pain. Many lumbar spine conditions are interrelated."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/sacrum-sacral-region", "passage_text": "The sacral region (sacrum) is at the bottom of the spine and lies between the fifth segment of the lumbar spine (L5) and the coccyx (tailbone). 1  See: Lumbar Spine Anatomy and Pain."}, {"url": "http://womenshealthency.com/articles/sacrum-pain/", "passage_text": "Bulging or herniated disc. A damaged disc in the lower lumbar region may cause sacrum pain as it compresses the spinal nerves. A bulging or herniated disc is often the result of too much sitting with associated poor posture. Improving posture and relieving pressure on the disc will facilitate healing. Contracted psoas muscle."}]