[{"url": "http://money.usnews.com/money/retirement/articles/2014/03/31/who-cant-contribute-to-retirement-accounts", "passage_text": "The tax deduction for traditional IRA contributions is phased out for people with workplace retirement accounts whose modified adjusted gross income is between $60,000 and $70,000 in 2014 ($96,000 and $116,000 for couples). If your employer doesn't offer a 401(k) plan, you typically miss out on a huge opportunity to save money on your taxes while saving for retirement. Most people who don’t have access to a 401(k) account at work can still contribute to an IRA, but the contribution limits are much lower."}, {"url": "http://money.cnn.com/retirement/guide/IRA_traditional.moneymag/index3.htm", "passage_text": "1 If you have a workplace retirement plan, the deduction for your traditional IRA contribution is phased out completely if your AGI is $109,000 or more (married couple filing jointly) or $66,000 or more (individual), or $10,000 for a married person filing separately. "}, {"url": "http://www.bankrate.com/finance/retirement/contributing-to-an-ira-during-retirement.aspx", "passage_text": "Roth vs. traditional IRA. Whether to use a Roth or a traditional IRA for those contributions depends on your individual tax situation. Hevert favors the Roth because there is no RMD, so funds can continue to grow throughout retirement and can be tapped at a later date in retirement or left to heirs in an estate. Contributing to an individual retirement account during retirement isn't a strategy many investors adopt, but it can make sense for those still earning income. That's because continuing to fund an IRA on a tax-deferred basis means more money will be available later in retirement."}, {"url": "https://en.wikipedia.org/wiki/Roth_IRA", "passage_text": "A Roth IRA can be an individual retirement account containing investments in securities, usually common stocks and bonds, often through mutual funds (although other investments, including derivatives, notes, certificates of deposit, and real estate are possible). A Roth IRA can also be an individual retirement annuity, which is an annuity contract or an endowment contract purchased from a life insurance company. As with all IRAs, the Internal Revenue Service mandates specific eligibility and filing status requirements."}, {"url": "http://www.answers.com/Q/Can_you_contribute_to_an_IRA_after_you_have_retired", "passage_text": "If you are … under 50 and contribute $2,000 to your Roth IRA then you can only contribute $3,000 to your Traditional IRA. For a traditional IRA, you no longer can contribute after the age of 70 1/2 (RMD checks in). For Roth, you can contribute forever since no RMD are taken from this type of IRA account. You can set up and make contributions to a traditional IRA if: You (or, if you file a joint return, your spouse) received taxable compensation during the year, and You were n … ot age 70½ by the end of the year. You can have a traditional IRA whether or not you are covered by any other retirement plan."}, {"url": "http://www.kiplinger.com/article/retirement/T046-C001-S001-making-roth-ira-contributions-in-retirement.html", "passage_text": "You can contribute up to $5,000 to your own Roth IRA (up to $6,000 if you’re 50 or older during the year) and up to $5,000 for your wife (or $6,000 if she’s 50 or older), as long as you earned at least as much for the year as the combined contributions. "}, {"url": "http://www.schwab.com/public/schwab/investing/retirement_and_planning/understanding_iras/faqs", "passage_text": "A Roth IRA is an individual retirement account to which you contribute after-tax dollars. Contributions and earnings can grow tax-free, and you can withdraw them tax-free after age 59½. Depending on your situation, a Roth IRA can be more flexible than a 401(k) or Traditional IRA. In any year in which your income exceeds the contribution limit, you won't be able to contribute to your Roth IRA. However, if your income dips in a subsequent year and returns to the acceptable income range, you can resume your Roth contributions."}, {"url": "http://www.ehow.com/about_7253111_can-put-money-roth-ira_.html", "passage_text": "You can contribute to a Roth IRA throughout your lifetime and delay taking distributions indefinitely. This is in contrast to a traditional IRA, which prohibits you from making contributions beginning the year you turn 70 1/2, the same year the IRS requires you to begin taking distributions. Due to IRS rules, you can only contribute to a Roth IRA if you are retired but hold a part-time job, earn self-employment income by selling a product or offering a service, or if you receive alimony. Your Roth IRA contribution cannot exceed amounts you make from these sources."}, {"url": "https://www.fidelity.com/retirement-ira/ira-rules-faq", "passage_text": "There are income limits for Roth IRAs. As a single filer, you can make a full contribution to a Roth IRA if your income is less than $114,000 ($114,000 - $129,000 for a partial contribution) in 2014 and $116,000 ($116,000 - $131,000 for a partial contribution) in 2015. If you are married filing jointly, you can make a full contribution to a Roth IRA if your income is less than $181,000 ($181,000 - $191,000 for a partial contribution) in 2014 and $183,000 ($183,000 - $193"}]