[{"url": "https://answers.yahoo.com/question/index?qid=20081025132407AAZVhA7", "passage_text": "Best Answer: igfxtray.exe is a process which allows you to access the Intel Graphics configuration and diagnostic application for the Intel 810 series graphics chip set. This program is a non-essential system process, and is installed for ease of use via the desktop tray. "}, {"url": "http://www.processlibrary.com/en/directory/files/igfxtray/24866/", "passage_text": "It is recommended that you check your registry to identify slowdown issues. igfxtray.exe is a task bar process that points to the Intel® Common User Interface, known also as the Intel Graphics Accelerator."}, {"url": "http://www.2-spyware.com/file-igfxtray-exe.html", "passage_text": "With its help, you ca} DUPipeline_QISnippet_FirstGood_Snippet_v1: {},{-1|-1|1|igfxtray.exe is a legitimate non-system process, which implements the system tray icon associated with the drivers for the Intel 81x series graphics chipset. With its help, you ca} DUPipeline_QISnippet_FirstGoodLong_Snippet_v1: {},{-1|-1|1|igfxtray.exe is a legitimate non-system process, which implements the system tray icon associated with the drivers for the Intel 81x series graphics chipset."}, {"url": "http://www.file.net/process/igfxtray.exe.html", "passage_text": "1 If igfxtray.exe is located in a subfolder of the user's profile folder, the security rating is 43% dangerous. 2  The file size is 158,208 bytes (15% of all occurrences), 99,840 bytes and 10 more variants. 3  The program has a visible window. Description: Igfxtray.exe is not essential for the Windows OS and causes relatively few problems. The igfxtray.exe file is located in the C:\\Windows\\System32 folder or sometimes in a subfolder of C:\\Windows\\System32."}, {"url": "http://www.pcpitstop.com/libraries/process/detail.asp?fn=igfxtray.exe.html", "passage_text": "Purpose: igfxtray.exe-Provides a tray icon for quick access to features of some Intel graphics chips, such as the ability to change color depth and resolution. Since Windows itself offers easy access to most of this functionality, we recommend that you remove this program from startup using MSCONFIG. Start this Free scan to check your threats to your PCs security. igfxtray.exe is a Microsoft or Windows process but some versions of this exe carry viruses. Check your PC for the bad versions of this file-with this Free Security Scan."}, {"url": "http://www.neuber.com/taskmanager/process/igfxtray.exe.html", "passage_text": "igfxTray Module by Intel Corporation. Just another process to take up more resources. igfxtray.exe is a process which allows you to access the Intel Graphics configuration and diagnostic application for the Intel 810 series graphics chipset. This program is a non-essential system process, and is installed for ease of use via the desktop tray. it is a valid file but trogans commonly mask themselves as igfxtray.exe so delete it and if it comes back its a trogan lucas. There is a windows driver update to stop the pop up window appearing at boot up."}, {"url": "http://www.neuber.com/taskmanager/process/igfxtray.exe.html", "passage_text": "it is ok. igfxtray.exe is a process which allows you to access the Intel Graphics configuration and diagnostic application for the Intel 810 series graphics chipset. This program is a non-essential system process, and is installed for ease of use via the desktop tray. it is a valid file but trogans commonly mask themselves as igfxtray.exe so delete it and if it comes back its a trogan lucas. There is a windows driver update to stop the pop up window appearing at boot up."}, {"url": "http://www.neuber.com/taskmanager/process/igfxtray.exe.html", "passage_text": "Not dangerous. Just another process to take up more resources. igfxtray.exe is a process which allows you to access the Intel Graphics configuration and diagnostic application for the Intel 810 series graphics chipset. This program is a non-essential system process, and is installed for ease of use via the desktop tray. it is a valid file but trogans commonly mask themselves as igfxtray.exe so delete it and if it comes back its a trogan lucas. There is a windows driver update to stop the pop up window appearing at boot up."}, {"url": "http://www.freefixer.com/library/file/igfxtray.exe-296/", "passage_text": "igfxtray.exe is part of Intel(R) Common User Interface and developed by Intel Corporation according to the igfxtray.exe version information. igfxtray.exe's description is  igfxTray Module . igfxtray.exe is digitally signed by Microsoft Windows Hardware Compatibility Publisher. "}]