[{"url": "http://web.clark.edu/rrausch/biolabs/histo/epithelia/epi_index.html", "passage_text": "Simple Squamous Epithelium: 1  Description: A single layer of flat cells. 2  Looks like a platter of fried eggs sunny-side up. 3  Location: Air sacs (alveoli) of lungs, lines the inside of heart and blood vessels. 4  Function: Filtration, diffusion, osmosis. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_a_squamous_epithelium", "passage_text": "There is different types of squamous epithelium: simple and stratified. The function of simple squamous epithelium: It is good for the passage of materials via diffusion. For example, it forms the tiny air sacs of the lungs and the walls of capillaries. It also forms the smooth, friction-reducing interior lining of the heart, blood vessels, thoracic cavity, and abdominal cavity. The alveoli is just one cell layer thick so that diffusion of gasses between the capillaries and the alveoli is easy. Simple squamous epithelium are found in the capillary wal … ls and the alveolar walls. They are thin so diffusion is eas"}, {"url": "https://en.wikipedia.org/wiki/Respiratory_epithelium", "passage_text": "Respiratory epithelium is a type of epithelium found lining the respiratory tract, where it serves to moisten and protect the airways. It also functions as a barrier to potential pathogens and foreign particles, preventing infection and tissue injury by action of the mucociliary escalator. "}, {"url": "https://en.wikipedia.org/wiki/Epithelia", "passage_text": "These can be arranged in a single layer of cells as simple epithelium, either squamous, columnar or cuboidal, or in layers of two or more cells deep as stratified (layered), either squamous, columnar or cuboidal. All glands are made up of epithelial cells. Classically, squamous epithelia are found lining surfaces utilizing simple passive diffusion such as the alveolar epithelium in the lungs. Specialized squamous epithelia also form the lining of cavities such as the blood vessels (endothelium) and pericardium (mesothelium) and the major cavities found within the body."}, {"url": "https://answers.yahoo.com/question/index?qid=20070424215239AAegpQj", "passage_text": "This epithelium is found in certain locations within the body. These include the linings of the peritoneal, pleural and pericardial cavities. Other places simple squamous epithelium can be found include; the glomerulus of the kidney, the walls of capillaries, and the alveoli of the lungs. Here they are forming a thin sheet-like layer which allows for minimal resistance to diffusion. They allow the lungs to diffuse oxygen and carbon dioxide quite easily. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_a_squamous_epithelium", "passage_text": "The function of the stratifed squamous epithelium: It functions to protect underlying tissues in areas subjected to abrasion. The keratinized type forms the outermost layer of the skin, where it functions to prevent water loss. The nonkeratinized variety forms the moist linings of the mouth,esophagus, anus, vagina. The alveoli is just one cell layer thick so that diffusion of gasses between the capillaries and the alveoli is easy. Simple squamous epithelium are found in the capillary wal … ls and the alveolar walls. They are thin so diffusion is easy"}, {"url": "https://answers.yahoo.com/question/index?qid=20090322081751AASBY4k", "passage_text": "Rating Newest Oldest. Best Answer: Squamous epithelium has two types, simple and stratified. Simple squamous epithelium consists of one layer of thin, flat epithelial cells resting on a basement membrane formed of connective tissue. It is found in such places as the alveoli of the lung and lining blood vessels. Squamous epithelial cells are flat, tightly adherent to each other, thin, and have a smooth surface. Stratified Epithelial Tissue-at least two layers of cells. Named by shape of the cells in the superficial layer. 1) Stratified squamous epithelium consists of several layers of cells in which the top layer is flat, bottom layers vary from cuboidal to columnar. Its function is protection."}, {"url": "http://www.livestrong.com/article/192286-what-are-the-functions-of-simple-squamous-epithelial-cells/", "passage_text": "Lungs. Simple squamous epithelium lines the air sacs, or alveoli, of the lungs. The alveoli are sites where air is exchanged in the lungs. Simple squamous epithelial cells in the alveoli allow oxygen from the air to enter the blood in the capillaries of the lung. Carbon dioxide, a waste product, passes across the epithelium of the alveoli to be removed from the body. Simple squamous epithelium refers to a single layer of thin, flat cells that line body surfaces. One side of the surface opens to the environment while the other is anchored to the underlying cells."}]