[{"url": "http://www.degreequery.com/which-degree-do-you-need-to-become-a-lawyer/", "passage_text": "Once you finish law school, you will need to determine which type of lawyer you want to specialize in such as divorce, real estate or personal injury, as well as other types including criminal, civil and immigration. Law school gives you the basic foundation you need to study any type of law."}, {"url": "http://www.criminaljusticeschoolguide.com/careers/lawyer/", "passage_text": "Next, students will need to attend a law school and earn a Juris Doctor Degree (J.D.).Most law schools require that you take the LSAT, or law school admissions test, as part of the application process. It will take 3-4 years to graduate from a law school program."}, {"url": "http://work.chron.com/educational-requirements-criminal-defense-lawyer-14182.html", "passage_text": "Four-Year Degree. To get on track to becoming a criminal defense lawyer, you must obtain a four-year degree from an accredited four-year institution. While pursuing your undergraduate degree, you don't need to take any particular course of study. Students enter law school after completing a variety of different disciplines."}, {"url": "https://ph.answers.yahoo.com/question/index?qid=20070512122103AAAOwNQ", "passage_text": "Best Answer: Basically, in order to become a lawyer, you are going to need to go to law school and then take and pass the bar exam for the state you want to work in. Before you can apply to law school, you are going to need at least a BA or BS."}, {"url": "http://study.com/criminal_lawyer_education.html", "passage_text": "The path to becoming a criminal lawyer starts with an undergraduate degree from a 4-year college or university. Though many schools offer a pre-law curriculum targeted towards future lawyers, there is not a specific bachelor's degree required for this field."}, {"url": "http://www.excite.com/education/legal/paralegal/law-legal/careers/how-to-become-a-lawyer", "passage_text": "A: You can't use the bachelors degree in criminal justice to become a lawyer in the United States. To become a lawyer and practice law in the country you need to opt for a program like the Juris Doctor degree that is accredited and approved by the ABA."}, {"url": "http://www.excite.com/education/legal/paralegal/law-legal/careers/how-to-become-a-lawyer", "passage_text": "A: To become a criminal lawyer, you need to first attend law college and acquire a law degree. Many law colleges offer law programs with specialization in criminal law. Once you have acquired at law degree in this field, the next step would be taking the bar examination in your state and earning a professional license."}, {"url": "http://www.wikihow.com/Become-a-Criminal-Defense-Lawyer", "passage_text": "Obtain a bachelor’s degree. In order to get into law school, you first need a bachelor’s degree (4 year degree) from an accredited college or university. It does not matter what kind of bachelor’s degree you get, but most pre-law students obtain bachelor’s degrees in political science, psychology, or sociology."}]