[{"url": "http://www.wikihow.com/Spray-Paint-Plastic", "passage_text": "It is now possible to spray paint plastic. New spray paints are on the market that will adhere to plastic. It only takes a little preparation, and you can effectively spray paint plastic furniture, crates, picture frames, mailboxes, planters, pots and other plastic ware. 1. Select your spray paint. You will need spray paint that is specially designed for painting on plastic. Read the label on the spray paint can to determine if you have the right kind of spray paint. Choose the color that you find most pleasing"}, {"url": "http://craftsbyamanda.com/tips-for-painting-on-plastic/", "passage_text": "1 Before painting, read the directions on your can of spray paint. 2  Generally, you’ll need to thoroughly shake the can before starting, and in-between applications. 3  To ensure you have a good can of paint, or even that it’s the right color, do a test spray on a piece of cardboard, newspaper or your drop cloth. Plastic is nonporous and removing its shiny surface will help your paint to adhere. Use a soft, clean brush or cloth to remove all dust from the sanding process. Paint your item: 1  Once your object’s surface is completely clean and dry, block off areas you don’t want painted with painter’s tape."}, {"url": "http://www.ehow.com/how_7325108_spray-paint-plastic.html", "passage_text": "You can generate a smooth, professional-looking finish on a plastic surface by spray painting. Before you rush into the paint application process, understand an important point -- nonporous plastic will reject new finishes unless you abrade it prior to painting. Coat the abraded plastic with acrylic spray primer. Spray in a sweeping, side-to-side motion. Maintain a distance of 8 inches between the plastic and the spray nozzle as you apply. Wait three hours for the primer to dry."}, {"url": "http://www.krylon.com/how-to/how-to-videos/how-to-spray-paint-plastic-video/", "passage_text": "Watch the How To Spray Paint Plastic video below to learn how Krylon® can help you give both new and used plastic patio furniture a colorful makeover. In five steps or less, quickly update plastic surfaces to better reflect your personal style: 1  Clean project surface. 2  For old plastic, use an ammonia-based cleaner on surface. 3  For new plastic, use paint thinner to clean surface."}, {"url": "http://craftsbyamanda.com/tips-for-painting-on-plastic/", "passage_text": "1 To ensure you have a good can of paint, or even that it’s the right color, do a test spray on a piece of cardboard, newspaper or your drop cloth. 2  To apply, position the nozzle toward your object, and spray a light, thin layer of paint. 3  With this first layer, your object should not be fully covered. Plastic is nonporous and removing its shiny surface will help your paint to adhere. Use a soft, clean brush or cloth to remove all dust from the sanding process. Paint your item: 1  Once your object’s surface is completely clean and dry, block off areas you don’t want painted with painter’s tape."}, {"url": "http://www.wikihow.com/Paint-on-Plastic", "passage_text": "Tips. 1  It may be possible to spray paint your plastic item with the plastic spray paint used as a primer, and then use regular exterior acrylic latex paint as a top coat. 2  This would give you a bigger selection of colors. 3  The plastic spray paint would allow the other paint to adhere to the surface of the plastic. 4. Tape off the plastic (optional). If you don’t want to paint the entire object, you can choose to tape some of it off. Use regular painters tape to mark off the sections you don’t want to be painted; the tape should be removed when you’re completely done painting while the paint is still wet."}, {"url": "http://www.ehow.com/how_7325108_spray-paint-plastic.html", "passage_text": "Coat the primed plastic with acrylic spray paint. Again, spray in a sweeping, side-to-side motion, maintaining a distance of 8 inches between the plastic and the spray nozzle as you apply. Coat the abraded plastic with acrylic spray primer. Spray in a sweeping, side-to-side motion. Maintain a distance of 8 inches between the plastic and the spray nozzle as you apply. Wait three hours for the primer to dry."}, {"url": "http://www.wikihow.com/Paint-on-Plastic", "passage_text": "1 It may be possible to spray paint your plastic item with the plastic spray paint used as a primer, and then use regular exterior acrylic latex paint as a top coat. 2  This would give you a bigger selection of colors. 3  The plastic spray paint would allow the other paint to adhere to the surface of the plastic. 4. Tape off the plastic (optional). If you don’t want to paint the entire object, you can choose to tape some of it off. Use regular painters tape to mark off the sections you don’t want to be painted; the tape should be removed when you’re completely done painting while the paint is still wet."}]