[{"url": "http://www.certified-mail-envelopes.com/2009-usps-certified-mail-rates/", "passage_text": "The United States Postal Service (USPS) has approved new 2015 postal rates that begin Sunday, May 31, 2015. The 2015 cost of sending a 1-ounce USPS Certified Mail letter with Return Receipt (old fashioned green card) will cost $6.74. If you send Certified Mail using Electronic Delivery Confirmation the cost is $4.69. USPS Mail Service: 2014 Rate VS: 2015 Rates: Certified Mail Fee $3.30 $3.45. "}, {"url": "http://www.costhowmuch.com/ps/usps-return-receipt.htm", "passage_text": "Home Ship & Postage. The price for a Return Receipt, as we progress through 2015, is $2.80 (up from $2.70 May 31st, 2015) to receive a postcard by mail, or, $1.40 for those that prefer an email (up from $1.35) . Previously, as of Jan 26, 2014, the fees were $2.55 and $1.25 respectively. Return Receipt forwards the sender a record of the delivery and among the included information is the delivery date along with the receiver and his or her signature."}, {"url": "http://www.wikihow.com/Send-Certified-Mail-%28USA%29", "passage_text": "3. Pay the appropriate postage for the specified type of mail delivery. Then pay for additional services, including a fee for USPS Certified Mail ($3.30USD as of 8/18/2014 and Return receipt (PS Form 3811) cost $2.70). 1  Both first-class and priority mail can be sent via certified mail."}, {"url": "http://www.des.wa.gov/services/PrintingMail/mail/Pages/ElectronicReturnReceipt.aspx", "passage_text": "Consolidated Mail Services (CMS) processes Certified Mail with Electronic Return Receipt (ERR) for customers. In 2012, CMS customers saved more than $100,000 by using ERR. CMS encourages the use of ERR whenever possible in order to reduce mailing costs. "}, {"url": "http://www.stamps.com/usps/return-receipt/", "passage_text": "Return Receipt is available for Priority Mail Express ® , Priority Mail ® , First Class Mail ® , Parcel Post ® and Media Mail. The cost of Return Receipt is $2.80 for a mailed receipt or $1.40 for an electronic receipt that is emailed to you. It can be combined with extra services including USPS Tracking, Signature Confirmation™, Special Handling, Restricted Delivery and Parcel Airlift Service. "}, {"url": "http://www.certified-mail-envelopes.com/certified-mail-return-receipt-requested/", "passage_text": "Certified Mail Return Receipt provides proof of USPS Certified Mail letter delivery. The ‘old fashioned green card’ is quickly being replaced by a the ‘Electronic Return Receipt’ PDF file that provides delivery confirmation and ‘in-route’ letter tracking authored by The United States Postal Service. "}, {"url": "http://www.costhowmuch.com/ps/usps-certified-mail.htm", "passage_text": "Certified is a fee that is independent of mailing or postage, and if the sender chooses to mail with an accompanying paper Return Receipt, there will be an extra $2.80 fee which went into effect the same May date. For an electronic receipt, half that much or $1.40. "}, {"url": "https://www.certifiedmaillabels.com/usps-postal-rates/", "passage_text": "2015 Certified Mail Rate Update: On May 31, 2015 the U.S. Postal Service announced new postal rates that were approved by the Postal Regulatory Commission. The new rates begin at 12:01 AM Sunday May 31 2015. The cost to send a 1-ounce USPS Certified Mail letter with Return Receipt (Green Card) will be $6.74. If you use Electronic Delivery Confirmation the cost can be reduced to $4.69. Additional options such as Return Receipt Signature Electronic in PDF format cost $1.40. The First Class 1 oZ. PC postage will not change."}, {"url": "https://www.certifiedmaillabels.com/usps-postal-rates/", "passage_text": "USPS Certified Mail rates increased to $3.45 per letter on May 31, 2015. Using the old-fashioned green cards with the traditional U. S. Postal Service Return Receipt service (PS Form 3811) will add $2.80 to your mailing cost. If you use Electronic Delivery Confirmation the cost can be reduced to $4.69. Additional options such as Return Receipt Signature Electronic in PDF format cost $1.40. The First Class 1 oZ. PC postage will not change."}]