[{"url": "http://webarchive.nationalarchives.gov.uk/+/http:/www.hm-treasury.gov.uk/d/oep_back_office_pu730.pdf", "passage_text": "100 Operational Efficiency Programme: back office operations and IT Estates Management Estates Indicators 3 1. Total property costs (management, occupancy and operational) per square metre 2. Total office accommodation (square metre) per staff full time equivalents (FTE) 3. Operational Efficiency Programme: back office operations and IT 43 4 IT: analysis Background 4.1 The efficient and effective use of IT has the potential to benefit every citizen through higher quality public services."}, {"url": "http://webarchive.nationalarchives.gov.uk/+/http:/www.hm-treasury.gov.uk/d/oep_back_office_pu730.pdf", "passage_text": "Operational Efficiency Programme: back office operations and IT 33 3 Back office operations: recommendations 3.1 The OEP’s analysis has identified that £4 billion a year of savings in back office operations are achievable by the end of three years. Operational Efficiency Programme: back office operations and IT 43 4 IT: analysis Background 4.1 The efficient and effective use of IT has the potential to benefit every citizen through higher quality public services."}, {"url": "http://www.bankrate.com/financing/banking/what-do-you-really-cost-your-bank/", "passage_text": "The upshot was that while each checking account customer costs banks an average of $349, but the average bank revenue per checking account is $268. Finkle wrote a follow-up recently responding to readers calling for her to look at marginal cost rather than average cost. "}, {"url": "http://smallbusiness.chron.com/average-cost-per-month-office-supplies-12771.html", "passage_text": "Writing utensils are common office supplies, with pens costing between $1 and $5 per pen, depending on the type of pen and ink. You can get a discount for bulk orders of many desk supplies. A box of 50 pens can cost as low as 24 cents per pen, according to the Staples website. The average monthly cost of office supplies in the U.S. is $19, according to the financial website Bundle. Your company's expenses may be higher or lower depending on the size of the company and rate of supply use."}, {"url": "http://webarchive.nationalarchives.gov.uk/+/http:/www.hm-treasury.gov.uk/d/oep_back_office_pu730.pdf", "passage_text": "Operational Efficiency Programme: back office operations and IT 5 Chart 1.A: Summary of estimates for the cost of back office operations across the public sector Source: HM Treasury analysis based on a variety of sources. Operational Efficiency Programme: back office operations and IT 43 4 IT: analysis Background 4.1 The efficient and effective use of IT has the potential to benefit every citizen through higher quality public services."}, {"url": "https://en.wikipedia.org/wiki/Back_office", "passage_text": "A back office in most corporations is where tasks dedicated to running the company itself take place. Examples of back-office tasks include IT departments that keep the phones and computers running (operations architecture), accounting, and human resources."}, {"url": "http://smallbusiness.chron.com/average-cost-per-month-office-supplies-12771.html", "passage_text": "Your company's average monthly spending on office supplies depends on how much of each item you use per month and how often each item needs to be replaced. The average monthly cost of office supplies in the U.S. is $19, according to the financial website Bundle. Your company's expenses may be higher or lower depending on the size of the company and rate of supply use."}, {"url": "http://www.bankpolicies.com/branch-manager", "passage_text": "The Branch Manager is responsible for the administration and efficient daily operation of a full service branch office, including operations, lending, product sales, customer service, and security and safety in accordance with the Bank's objectives. "}, {"url": "http://smallbusiness.chron.com/average-cost-per-month-office-supplies-12771.html", "passage_text": "The average cost per month for office supplies depends on the size and type of business as well as the cost of the supplies used. You can calculate your company's average monthly supply costs by multiplying the cost of each item used by the amount of each item you use per month. The average monthly cost of office supplies in the U.S. is $19, according to the financial website Bundle. Your company's expenses may be higher or lower depending on the size of the company and rate of supply use."}, {"url": "http://www.investopedia.com/terms/b/backoffice.asp", "passage_text": "DEFINITION of 'Back Office'. Administration and support personnel in a financial services company. They carry out functions like settlements, clearances, record maintenance, regulatory compliance, and accounting. When order processing is slow due to high volume, it is commonly referred to as back office crunch.."}]