[{"url": "http://www.3fatchicks.com/9-foods-with-tryptophan/", "passage_text": "The body cannot produce tryptophan, so it is essential that you get enough from your food. The following is a list of nine types of foods that contain tryptophan: 1  Dairy products: yogurt, milk, cheese. 2  Protein foods: beef, pork, turkey, chicken, fish, shellfish, eggs. 3  Soy products: tofu, soy milk, soybeans. 4  Legumes: beans, lentils, chickpeas. 5  Whole Grains: oats, brown rice, wheat, wheat germ"}, {"url": "https://en.wikipedia.org/wiki/Tryptophan", "passage_text": "Tryptophan is a routine constituent of most protein-based foods or dietary proteins. It is particularly plentiful in chocolate, oats, dried dates, milk, yogurt, cottage cheese, red meat, eggs, fish, poultry, sesame, chickpeas, almonds, sunflower seeds, pumpkin seeds, spirulina, bananas, and peanuts. Only the L-stereoisomer of tryptophan is used in structural or enzyme proteins, but the R-stereoisomer is occasionally found in naturally produced peptides (for example, the marine venom peptide contryphan)."}, {"url": "http://www.livestrong.com/article/402724-the-best-food-source-for-l-tryptophan/", "passage_text": "Poultry is especially rich in tryptophan, with turkey providing 250 milligrams in a 3-ounce serving of roasted dark meat and about 280 milligrams in the same amount of roasted breast meat. Chicken offers about 250 milligrams in one skinless drumstick or 1/2 cup of diced, roasted breast meat. Seeds, Nuts and Beans. Some types of seeds, nuts and beans are also good sources of tryptophan. For example, 1 cup of raw soybeans contains about 100 milligrams, while 1 cup of kidney beans provides about 55 milligrams. Certain seeds also contain lots of tryptophan, as do some nuts"}, {"url": "http://www.med-health.net/Foods-High-In-Tryptophan.html", "passage_text": "Foods High in Tryptophan. Amino acids help to create proteins that aid in neurotransmission messages to and from the brain. Tryptophan is an essential amino acid that plays a vital role in this process. Tryptophan is a precursor of 5-HTP or serotonin which is acquired from dietary sources. Tryptophan combines with vitamin B6, transforming into serotonin and niacin in the liver. Listed below are foods known to be high in tryptophan: Category. Food. Milk and Milk Products. Traditional milk products, yogurt and soy milk. Meat. Mutton, venison, beef liver, calf’s liver, chicken breast, turkey breast. Fish."}, {"url": "http://www.myfit.ca/foods_high_tryptophan.asp", "passage_text": "As a matter of fact, eating dairy foods before bed can improve your sleep. Dairy produce is a good source of tryptophan, which your body converts to melatonin and serotonin (both of which are thought to induce sleep). Some other foods which contain tryptophan include bananas, oats, poultry and peanuts. A light bedtime snack should consist of mostly carbohydrates with a small amount of protein. "}, {"url": "http://www.livestrong.com/article/402724-the-best-food-source-for-l-tryptophan/", "passage_text": "Amino acids are called building blocks of protein because your body uses them to manufacture proteins and other compounds that contain nitrogen. Some amino acids are called essential because you can't produce them but must obtain them from food. One of these, tryptophan, is especially rich in some common foods. Seeds, Nuts and Beans. Some types of seeds, nuts and beans are also good sources of tryptophan. For example, 1 cup of raw soybeans contains about 100 milligrams, while 1 cup of kidney beans provides about 55 milligrams. Certain seeds also contain lots of tryptophan, as do some nut"}, {"url": "http://plenteousveg.com/tryptophan-foods/", "passage_text": "So, to the surprise of many, the best tryptophan foods are likely those found in plants. Unlike animal products, plants are rich in anti-inflammatory healthy fats, fiber, antioxidants and also often contain the tryptophan cofactors. Pretty much any good source of protein is going to have tryptophan – but that doesn’t mean the body can use the tryptophan from these protein sources. For example, dairy products like milk have lots of tryptophan but they also contain lots of pro-inflammatory cytokines which will degrade tryptophan."}, {"url": "http://www.rd.com/health/beauty/foods-that-help-you-sleep/", "passage_text": "Walnuts are a good source of tryptophan, a sleep-enhancing amino acid that helps make serotonin and melatonin, the aâ body clocka clockâ hormone that sets-your sleep. Wake, Cycles additionally University of texas researchers found that walnuts contain their own source, of melatonin which may help you fall. asleep faster "}]