[{"url": "http://www.thinkbabynames.com/meaning/0/Devery", "passage_text": "Devery /de-v-ery/ [3 sylls.] as a girls' name. Devery's name origin is Hebrew, and the meaning of the name Devery is bee. Devery is a variant transcription of Devora (Hebrew): variation of Deborah. Devero is a popular surname. Kreatif forms: Davery, Divery."}, {"url": "http://www.ancestry.com/name-origin?surname=devery", "passage_text": "Click on a place to view Devery immigration records. The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Devery families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination."}, {"url": "http://www.thinkbabynames.com/meaning/0/Deseray", "passage_text": "Deseray /de-ser-ay/ [3 sylls.] as a girls' name is of French and Latin derivation, and the meaning of the name Deseray is desired. Deseray is an alternate form of Desiree (French, Latin): from Desider ta. Deshay is a common last name. Kreatif forms: Diaseray, Diseray, Doseray."}, {"url": "http://www.thinkbabynames.com/meaning/0/Devery", "passage_text": "Devery is an uncommonly occurring first name for females but a very prominent last name for all people (#46000 out of 150436, Top 31%). (2000 U.S. Census). Displayed below is the baby name popularity of Devery for girls. Devery has yet to be ranked in the list so far."}, {"url": "http://www.thinkbabynames.com/meaning/0/Devery", "passage_text": "Devery's name origin is Hebrew, and the meaning of the name Devery is bee. Devery is a variant transcription of Devora (Hebrew): variation of Deborah. Devero is a popular surname. Kreatif forms: Davery, Divery."}, {"url": "http://www.babynamespedia.com/meaning/Devery", "passage_text": "† approx English pronunciation for Devery: D as in day (D.EY) ; EH as in ebb (EH.B) ; V as in vow (V.AW) ; ER as in hurt (HH.ER.T) ; IY as in eat (IY.T)."}]