[{"url": "http://medical-dictionary.thefreedictionary.com/Fibrous+pericardium", "passage_text": "It is a closed sac having two layers: the visceral layer (epicardium), immediately surrounding and applied to all the heart's surfaces, and the outer parietal layer, forming the sac, composed of strong fibrous tissue (fibrous pericardium [TA]) lined with a serous membrane (serous pericardium [TA]). the fibroserous sac enclosing the heart and the roots of the great vessels, composed of external (fibrous) and internal (serous) layers. adherent pericardium one abnormally connected with the heart by dense fibrous tissue."}, {"url": "http://medical-dictionary.thefreedictionary.com/Fibrous+pericardium", "passage_text": "pericardium. the fibroserous sac enclosing the heart and the roots of the great vessels, composed of external (fibrous) and internal (serous) layers. See also pericardial. adherent pericardium. one abnormally connected with the heart by dense fibrous tissue. the fibroserous sac enclosing the heart and the roots of the great vessels, composed of external (fibrous) and internal (serous) layers. adherent pericardium"}, {"url": "http://www.vascularconcepts.com/content/pages.php?pg=patients_cardio_system", "passage_text": "The heart is constructed of a special kind of muscle called the myocardium or cardiac muscle, and is enclosed in a double-layered, membranous sac known as the pericardium. A wall of muscle, the septum, divides the heart into two cavities. The left cavity pumps blood throughout the body, while the right cavity pumps blood only through the lungs. Each cavity is in turn divided into two chambers, the upper ones called atria, the lower ones ventricles. Venous blood from the body, containing large amounts of carbon dioxide, returns to the right atrium."}, {"url": "http://www.thefreedictionary.com/heart+sac", "passage_text": "Noun. 1. pericardium-a serous membrane with two layers that surrounds the heart. epicardium, visceral pericardium-the innermost of the two layers of the pericardium. parietal pericardium-the tough outermost layer of the pericardium that is attached to the diaphragm and the sternum. per•i•car•di•um. the membranous sac enclosing the heart. perikardion, perikárdion. n use of neuter of perikardios perikárdios surrounding = the-heart - + -peri, peri. kardios adj derivative of; kardia-kardía ]. (heart′compare-cardium′pĕr-ĭ). kaer kär dē əm"}, {"url": "https://en.wikipedia.org/wiki/Pericardium", "passage_text": "For the footballer, see Vincent Pericard. The pericardium (from the Greek περί, around and κάρδιον, heart) is a double-walled sac containing the heart and the roots of the great vessels. The pericardial sac has two layers, a serous layer and a fibrous layer. It encloses the pericardial cavity which contains pericardial fluid. Structure [edit]. The pericardium is a tough double layered fibroserous sac which covers the heart. The space between the two layers of serous pericardium (see below), the pericardial cavity, is filled with serous fluid which protects the heart from any kind of external jerk or shock."}, {"url": "http://www.vascularconcepts.com/content/pages.php?pg=patients_cardio_system", "passage_text": "The endocardium is a thin layer of endothelium that lines the chambers of the heart and the valves. Pericardium. The pericardium (around the heart) is a triple-layered fluid-filled sac that surrounds the heart. The outer layer of this sac is the fibrous pericardium. It is a strong layer of dense connective tissue. The left cavity pumps blood throughout the body, while the right cavity pumps blood only through the lungs. Each cavity is in turn divided into two chambers, the upper ones called atria, the lower ones ventricles. Venous blood from the body, containing large amounts of carbon dioxide, returns to the right atrium."}, {"url": "http://www.thefreedictionary.com/heart+sac", "passage_text": "n. pl. per·i·car·di·a (-dē-ə). The membranous sac filled with serous fluid that encloses the heart and the roots of the aorta and other large blood vessels. [New Latin, from Greek. , from. , around the heart : , peri- +. , heart; see kerd-in Indo-European roots .]. per′i·car′di·al (-dē-əl) , per′i·car′di·ac′ (-dē-ăk′) adj. per•i•car•di•um. the membranous sac enclosing the heart. perikardion, perikárdion. n use of neuter of perikardios perikárdios surrounding = the-heart - + -peri, peri. kardios adj derivative of; kardia-kardía ]. (heart′compare-cardium′pĕr-ĭ). kaer kär dē əm"}]