[{"url": "http://www.bu.edu/handbook/appointments-and-promotions/classification-of-ranks-and-titles/", "passage_text": "Appointments with the standard professorial titles of Assistant Professor, Associate Professor, and Professor may be Non-Tenure-Track, Tenure-Track, or Tenured. All other faculty appointments are by definition Non-Tenure-Track and without tenure. "}, {"url": "http://www.differencebetween.com/difference-between-adjunct-and-vs-associate-professor/", "passage_text": "Adjunct and Associate Professor are designations you may have heard in colleges. When we are in a college, we often come across designations of teachers that are very confusing. There are lecturers, assistant professors, associate professors, adjunct professors, and of course there are professors. Students rarely know the difference between these designations as after all, what they are concerned with studies."}, {"url": "http://www.differencebetween.com/difference-between-assistant-professor-and-vs-associate-professor/", "passage_text": "Associate Professor. Associate professor is a rank that is a rung above assistant professor. Sometimes, an assistant professor is granted promotion to the rank of an associate professor as recognition of his services as a teacher after 3-4 years in a college. This may or may not be with tenure. The two intermediate levels are that of assistant professor and associate professor that are very confusing, at least for the one who is an aspiring teacher. This article attempts to highlight the difference between assistant and associate professor and what it takes to move from one rank to another."}, {"url": "https://answers.yahoo.com/question/index?qid=20100427214143AAnndPo", "passage_text": "Most assistant professors do not yet have tenure associate professor: An Associate Professor is the second level full-time position for college and university instructors who have a Ph.D. Unlike the entry-level full-time position with a Ph.D., called an assistant professor, Associate Professors have tenure. Associate Professors have more administrative responsibilities. They're able to serve on boards and committees whose membership is restricted to tenured faculty"}, {"url": "http://gradschool.about.com/od/gettingajob/g/Associate-Professor.htm", "passage_text": "The label of associate professor typically refers to a professor who is tenured. Associate professor is an intermediate rank, between assistant professors and full professors. Like all other professors, the associate professor participates in the three sets of duties that come with a career in academia: teaching, research, and service. "}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_an_assistant_professor_an_associate_professor_and_and_adjunct_professor", "passage_text": "Making the world better, one answer at a time. It has to do with the level or rank of the professor. assistant professors do not yet have tenure. Associate professors do have tenure. Adjunct professor are part-timer professors and it is not thought that they will earn tenure. In U.S. colleges and universities, professor is an academic rank awarded by the institution that employs faculty. The most common titles in order of ra … nk, lowest to highest, are instructor; assistant professor; associate professor; full"}, {"url": "https://answers.yahoo.com/question/index?qid=20070417084337AA96U57", "passage_text": "Almost without exception, a new professor is hired at the 'assistant professor' level. For the next few years, that professor goes through the 'tenure' process-establishing a track record for teaching and research in their field. The professor makes up exams, and usually does the lectures. The associate professor is a backup in case the professor is sick, etc. Usually the associate does the grading with help of assistants. Associate professors have just as much power as professors. An assistant professor does what the professors don't do, like grading homeworks and helping specific students with work in a larger class. The Ultimate Answer Guaranteed · 9 years ago"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_associate_professor_and_assistant_professor", "passage_text": "It has to do with the level or rank of the professor. assistant professors do not yet have tenure. Associate professors do have tenure. Adjunct professor are part-timer … professors and it is not thought that they will earn tenure. + 5 others found this useful. "}, {"url": "http://academia.stackexchange.com/questions/2536/assistant-professor-vs-associate-professor", "passage_text": "Typically, within about seven years an assistant professor will either be promoted to associate professor or will leave the university, although the timing can vary a little and it's theoretically possible to remain an assistant professor forever. An associate professor is one step up from an assistant professor. This promotion is usually the same as getting tenure, but not always. (Some universities, like MIT, frequently have non-tenured associate professors.) The final step for most faculty is a full professorship. NOT true, there ARE assistant professors in Australia: here is an example of a research assistant professor. Their rank is in between senior lecturer and associate"}]