[{"url": "http://www.marksdailyapple.com/slow-roasted-chicken/", "passage_text": "Low and slow. Most recipes for roasted whole chicken crank the oven temperature above 400 ºF/205 ºC in an attempt to crisp up the skin and quickly cook the meat before it dries out. This recipe keeps the temperature at a low 300 ºF/150 ºC and cooks the chicken slowly for 3 hours."}, {"url": "http://www.livestrong.com/article/438575-how-to-slow-cook-in-the-oven/", "passage_text": "Cook poultry to an internal temperature of about 165 degrees Fahrenheit. Depending on how you want the roast done, increase the oven's temperature to 500 degrees about 15 minutes before it reaches its final temperature. Roast it at the higher temperature for another 10 minutes for a browned and crunchier crust."}, {"url": "http://kidscooking.about.com/od/dinnerrecipes/r/ovenbakedbbqch.htm", "passage_text": "This oven baked BBQ chicken recipe is slow cooked in a low-temperature oven to allow the chicken to absorb all the flavors of the barbecue sauce. Serve this barbecue chicken with mustard potato salad and ramen noodle cole slaw."}, {"url": "http://www.livestrong.com/article/438575-how-to-slow-cook-in-the-oven/", "passage_text": "Step 2. Place the roasting pan or Dutch oven in the oven. Estimate the cooking time at approximately twice the time the meat or poultry would cook at 350 to 375 degrees Fahrenheit. If you're cooking meat, depending on the size of the cut, this could be as long as six to eight hours."}, {"url": "http://thepauperedchef.com/2007/02/slow_roasted_ch.html", "passage_text": "Preheat the oven to 400 degrees. Cover the chicken inside and out with salt and pepper. Then rub in a tablespoon or two of olive oil. Place the chicken on a rack in a roasting pan. Cook for 15 minutes. Turn the temperature down to 250. Cook for an hour. Crank heat to 450. Cook for another 20 minutes or until the inside temperature reaches 160."}, {"url": "http://blog.williams-sonoma.com/slow-cooker-vs-dutch-oven-a-conversion-guide/", "passage_text": "Be sure to check on the dishes as they cook to be sure you have plenty of liquid. Here are some average cook times for proteins: 1  Chicken: 1 to 1 1/2 hours in a Dutch oven; 2 hours high setting in slow cooker. 2  Cubed meat (lamb, beef or pork) : 2 to 3 hours in a Dutch oven; 2 to 3"}]