[{"url": "http://www.everymac.com/systems/apple/macbook_pro/faq/macbook-pro-battery-life-hotswap.html", "passage_text": "Based on this information, EveryMac.com originally recorded the battery life as approximately 3.5 - 4.5 hours on the specifications pages for the MacBook Pro Core Duo 1.83 15-Inch, MacBook Pro Core Duo 2.0 15-Inch, and MacBook Pro Core Duo 2.16 15-Inch. Without the streaming audio, however, the batteries lasted just over 3 hours. Battery life was better on the Santa Rosa MacBook Pro, clocking in at 3:34 versus the older laptop's 3:17. The improvement on the Better Battery life setting was in line with Apple's claims."}, {"url": "http://www.everymac.com/systems/apple/macbook_pro/macbook-pro-retina-display-faq/macbook-pro-retina-display-13-late-2012-battery-life.html", "passage_text": "The 13-inch Retina MacBook Pro had the shortest battery life of all the current Apple laptops. It averaged 4 hours and 40 minutes, 67 minutes shorter than the 13-inch non-Retina MacBook Pro with the same 2.5 GHz Core i5 processor, and 44 minutes shorter than the 13-inch MacBook Air. The 13-inch rMBP sets a new record for our new suite, outlasting the 13-inch MBA by 15% (despite having a 48% larger battery)."}, {"url": "https://discussions.apple.com/thread/3008527?start=0&tstart=0", "passage_text": "My MacBook Pro 13 is now 15 months old and has completed 318 cycles, according to Coconut Battery and my system info. I timed it the other day, with normal use (writing docs, email and the occasional Internet surf) and in 2.5 hours it went from fully charged to turning itself off when the battery ran out of charge. The concept of cycles is explained here: http://www.apple.com/batteries/. Apple says a battery should retain 80 percent of it health (not charge) after 300 cycles. The batteries in my Late 2007 MBP have not been so gracious."}, {"url": "http://www.apple.com/shop/question/answers/readonly/how-long-does-a-battery-last-on-a-macbook-aluminium/QY997JT2YHUKUFCDK", "passage_text": "Best Answer: Realistically this battery will last around 3 hours as long as there is not heavy usage of the CPU or GPU. So as long as you are doing basic things like e-mail, web surfing, etc you should get decent life out of it. I shall buy a new battery from Apple shop as I had a clone one which, whilst it charges fast (2 hours) loses charge in 10 to 20% steps when the Macbook is off (completely off). This means at the end of a session it will be, say, 60% charged and next time it goes on it may be down to 40% or less only 2 or 3 hours later."}, {"url": "http://www.everymac.com/systems/apple/macbook_pro/faq/macbook-pro-battery-life-hotswap.html", "passage_text": "With the introduction of the MacBook Pro Core Duo 2.16 17-Inch on April 26, 2006, Apple reported that the battery life of the 17-Inch model was 5.5 hours, and that the 15-Inch models provide 4.5 hours of battery life, officially confirming the earlier speculation. Without the streaming audio, however, the batteries lasted just over 3 hours. Battery life was better on the Santa Rosa MacBook Pro, clocking in at 3:34 versus the older laptop's 3:17. The improvement on the Better Battery life setting was in line with Apple's claims."}, {"url": "http://www.everymac.com/systems/apple/macbook_pro/faq/macbook-pro-battery-life-hotswap.html", "passage_text": "However, in real-world tests, a MacWorld review noted that the battery life of the MacBook Pro Core 2 Duo models remained unchanged and the author got 2 hours and 35 minutes of DVD playback and 3 hours and 9 minutes of wireless productivity. Without the streaming audio, however, the batteries lasted just over 3 hours. Battery life was better on the Santa Rosa MacBook Pro, clocking in at 3:34 versus the older laptop's 3:17. The improvement on the Better Battery life setting was in line with Apple's claims."}, {"url": "http://www.apple.com/shop/question/answers/readonly/how-long-does-the-black-macbook-battery-last/QYKDFUYUHU9K9PHU7", "passage_text": "I have a macbook 2,1 from around June 2007 (so around 3.5 years old) and I've used this machine every day since I had it. The full capacity of the (original) battery is currently around 4788mA after 975 charging cycles, and I get around 4.5 hours of browsing and general use (I'd get around 5 hours when it was new). Programming I get 2-3 hours depending on what I'm doing. The first battery of my Macbook black died after 2 years. Got replaced by apple. The replacement died after 14 months with 71 (seventyone!) loading cycles. As Apple Care ran out last year, I had to buy a new one myself."}, {"url": "https://answers.yahoo.com/question/index?qid=20090701204624AAMUlSP", "passage_text": "Just get a warranty. Apple offers the Apple Care warranty that will cover your laptop for 3 years. My last mac was a powerbook and I had it for about 4 years before I replaced it with my current MacBook Pro. In that time I had to replace the hard drive once, after about 3 years. I am going to get a laptop in a few years and I'm not sure how long a Macbook Pro would last. (with the new 8 hour battery) If anyone knows how long it lasts, please compare it to a PC so i know how longer it would actually be."}]