[{"url": "https://en.wikipedia.org/wiki/Bouquet_garni", "passage_text": "There is no generic recipe for bouquet garni, but most recipes include thyme and bay leaf. Depending on the recipe, the bouquet garni may also include parsley, basil, burnet, chervil, rosemary, peppercorns, savory and tarragon. Bouquet garni of thyme, bay leaves, and sage, tied with a string. The bouquet garni [bukɛ ɡaʁni] (French for garnished bouquet) is a bundle of herbs usually tied together with string and mainly used to prepare soup, stock, and various stews. The bouquet is cooked with the other ingredients, but is removed prior to consumpti"}, {"url": "http://www.chowhound.com/recipes/bouquet-garni-10566", "passage_text": "Makes: Makes one bouquet. Buy Now. The French term bouquet garni refers to a small bundle of herbs simmered in various dishes, gently infusing mild, aromatic flavor into the food. Add bouquet garni to soups, stews, or braises and remove before serving. Next Recipe Drunken Prunes 89 Saves. 89 Saves. Drunken Prunes."}, {"url": "http://www.wikihow.com/Make-Bouquet-Garni", "passage_text": "Three Methods: Fresh Version Dried Version Usage. Bouquet garni is a French herbal mixture. It consists of a collection of herbs, gathered and tied into a bundle or sachet in cheesecloth, or directly tied together when using fresh herbs. Bouquet garni is used to enhance the flavour of stews, broths, or stocks. There are two versions-a dried version and a fresh version"}, {"url": "http://frenchfood.about.com/od/dressingpreservessauces/r/bouquetgarni.htm", "passage_text": "Preparation. How to make a bouquet garni: Arrange the herbs in a neat stack, one on top of the other, and tie the ingredients into a tight bundle with string. Place it into broth, sauces, braising liquids, etc. "}, {"url": "http://ochef.com/375.htm", "passage_text": "No one we know is that interested in a bouquet garni. But it is a collection of herbs (traditionally fresh parsley, fresh or dried thyme, and bay leaf) that are bundled together and cast adrift in your pot to flavor a soup, stew, or broth. They are tied together so they can be removed easily at the end of the cooking. "}, {"url": "http://culinaryarts.about.com/od/glossary/g/bouquetgarni.htm", "passage_text": "A bouquet garni featuring thyme, rosemary, leeks, parsley and bay leaf. Ian O'Leary / Getty Images. A Bouquet Garni (pronounced bo-KAY gar-NEE) is bundle of herbs and aromatics (such as celery or leeks) tied together with cooking twine and simmered in stock, soups or sauces to add flavor and aroma. "}, {"url": "http://www.taste.com.au/how+to/articles/944/how+to+make+a+bouquet+garni", "passage_text": "A bouquet garni is a bundle of aromatic herbs. It adds flavour to stews and soups, such as our Pea & Ham Soup (see related recipe). Here's how to make a bouquet garni. For a classic bouquet garni, gather together a few fresh parsley stalks, thyme sprigs and bay leaves. "}]