[{"url": "http://healthyeating.sfgate.com/canned-salmon-healthy-3616.html", "passage_text": "Add canned salmon to a tossed green or Caesar salad. Stir canned salmon into your favorite soup recipe, or add it to pasta sauce. Combine canned salmon with low-fat mayonnaise, minced onions and fresh dill for a sandwich filling."}, {"url": "http://www.cleveland.com/healthfit/index.ssf/2009/10/canned_salmon_is_as_healthful.html", "passage_text": "All salmon is high in omega-3 fatty acids, the stuff that makes skin and hair look more youthful, and that's good for your brain and heart, too. Both canned and fresh also have a compound called astaxanthin, a carotenoid that improves skin's elasticity."}, {"url": "https://answers.yahoo.com/question/index?qid=20090301142837AAEQ7Z0", "passage_text": "Rating Newest Oldest. Best Answer: Canned salmon is high in protein, and the soft bones in it are high in calcium. Fish contains omega fatty oils, which are good for the heart. However, it should be eaten in moderation. That's because the high sodium content (typical of most canned foods) promotes high blood pressure."}, {"url": "http://healthyeating.sfgate.com/canned-salmon-healthy-3616.html", "passage_text": "Canned salmon is a nutritious type of fish that can be part of your regular diet. It's less expensive than fresh salmon filets, but it provides impressive amounts of certain vitamins and minerals."}, {"url": "https://answers.yahoo.com/question/index?qid=20090301142837AAEQ7Z0", "passage_text": "Best Answer: Canned salmon is high in protein, and the soft bones in it are high in calcium. Fish contains omega fatty oils, which are good for the heart."}, {"url": "http://www.berkeleywellness.com/healthy-eating/nutrition/article/salmon-whats-can", "passage_text": "Canned salmon is an excellent—and relatively inexpensive—source of heart-healthy omega-3 fats and other nutrients. But to net the most benefits, read the fine print on the cans. Here's what to watch for: 1  Omega-3s. 2  All canned salmon is rich in omega-3s, but the amounts vary a lot."}, {"url": "http://www.livestrong.com/article/391660-is-canned-salmon-healthy/", "passage_text": "One quarter cup of canned salmon contains 5 grams of total fat, only 1 gram of which is saturated. It is not the total amount of fat in your diet that is linked with weight or disease, but rather the type of fat you include in your diet, according to the Harvard School of Public Health."}, {"url": "http://www.livestrong.com/article/391660-is-canned-salmon-healthy/", "passage_text": "Like other varieties of canned fish, canned salmon is a convenient protein source that you can make into a salmon salad for a sandwich topping or for eating as is. Canned salmon contains essential nutrients such as protein and healthy monounsaturated fats."}, {"url": "http://healthyeating.sfgate.com/canned-salmon-healthy-3616.html", "passage_text": "Niacin. A 3.5-ounce serving of canned salmon supplies 7.43 milligrams of the 14 milligrams of niacin women need each day and the 16 milligrams men require on a daily basis. Niacin is a B vitamin that supports the health of your skin and nerves."}]