[{"url": "http://www.reptilesmagazine.com/How-to-Breed-Crested-Geckos/", "passage_text": "At Gorgeous Gecko, we incubate crested gecko eggs at room temperature, which fluctuates between 72 and 78 degrees Fahrenheit at the height of the breeding season. This temperature range will result in hatchlings emerging after 60 to 70 days during the warmer months, or up to 120 days as the days grow cooler. An egg-laying box in her enclosure will allow you to keep track of the eggs and remove them easily. It can be a plastic container approximately 8 inches long by 5 inches wide by 5 inches tall, filled to a depth of 4 inches with moistened sphagnum moss. Kimberly Lucas. Two crested gecko eggs rest on moss."}, {"url": "http://www.wikihow.com/Breed-Leopard-Geckos", "passage_text": "Part 1 of 4: Preparing to Breed. 1. Get a male and female leopard gecko. The males have hemipenal bulges below the vent whereas females do not. Males and females both have a V-shaped row of scales above the vent but only the male's scales here are hollow and produce wax. This wax is for scent marking their territory. Four Parts: Preparing to Breed Breeding Taking Care of the Eggs Taking Care of the Babies. Leopard geckos can be easy to breed for some, but difficult for others. In this article, you will see the simplest way to breed leopard geckos. The simplest way, is the best here."}, {"url": "https://answers.yahoo.com/question/index?qid=20070911094240AA6GocQ", "passage_text": "Report Abuse. BREEDING: Crested geckos can be easy to breed. Males and females should be approximately 35-40 grams (sexually mature weight) before breeding is attempted. This usually takes 9-12 months. It is best to raise the males away from the females until they are mature. When I was thinking of breeding my crested geckos all infor I could get was out of books or on the internet, and I will tell you what it is the best place to get the infor. as you will learn everything you will need and how to take care of the babies."}, {"url": "http://www.reptilesmagazine.com/How-to-Breed-Crested-Geckos/", "passage_text": "Both male and female must be sexually mature before you introduce the male into the female's enclosure. Female crested geckos need to weigh a minimum of 38 to 40 grams and be 11/2 years old to start breeding. An egg-laying box in her enclosure will allow you to keep track of the eggs and remove them easily. It can be a plastic container approximately 8 inches long by 5 inches wide by 5 inches tall, filled to a depth of 4 inches with moistened sphagnum moss. Kimberly Lucas. Two crested gecko eggs rest on moss."}, {"url": "http://www.reptilesmagazine.com/How-to-Breed-Crested-Geckos/", "passage_text": "During a breeding season, female crested geckos will lay a clutch of two eggs every 30 to 45 days. When a gravid female is ready to deposit eggs, she will seek out a moist place in which to do so. An egg-laying box in her enclosure will allow you to keep track of the eggs and remove them easily. It can be a plastic container approximately 8 inches long by 5 inches wide by 5 inches tall, filled to a depth of 4 inches with moistened sphagnum moss. Kimberly Lucas. Two crested gecko eggs rest on moss. If you notice the female digging holes in the moistened substrate during the evening, check the following morning to see if the substrate appears packed down, and if the holes are covered-both are good signs that the female crested gecko has deposited her eggs"}, {"url": "http://www.theurbangecko.com/breeding-crested-gecko", "passage_text": "breeding a crested gecko. Crested Geckos can be prolific breeders in captivity if you follow several basic but essential steps. We recommend waiting until your female Crested Geckos reach 12 months and your males 9 months before you start breeding them. Although they may breed at younger ages we have found waiting allows the geckos to reach full maturity and has resulted in greater breeding success. Sexing Crested Geckos is relatively easy once you know what to look for. You should examine the underside of the gecko, just below the vent and if you see enlarged hemipenal bulge you have a male. Females will not show a noticeable bulge."}, {"url": "http://www.stepbystep.com/how-to-breed-crested-geckos-34920/", "passage_text": "Make sure you have purchased the male crested gecko not less than 9 months of age. The age of female crested geckos should be between 12 to 14 months. 1  Temperature is the most important element that plays a vital role in normal breeding. 2  Make sure the temperature of the aquarium is between 75 to 80 degrees Fahrenheit at the day time and not less than 70 degrees at night."}, {"url": "http://www.youtube.com/watch?v=s7z5sK219B4", "passage_text": "Please try again later. How to breed Crested Geckos, including size requirements, age and weight, how to sex your gecko and techniques you can use. P.S. I forgot in the video to mention that at the age of 4-6 years old, breeding should slow down or stop altogether or health issues can occur. 1  Pets & Animals"}, {"url": "http://www.stepbystep.com/how-to-breed-crested-geckos-34920/", "passage_text": "1 First of all, you should put five females and one male crested gecko in an aquarium. 2  This is the most appropriate number of females for one male and the most traditional group for breeding. The age of female crested geckos should be between 12 to 14 months. 1  Temperature is the most important element that plays a vital role in normal breeding. 2  Make sure the temperature of the aquarium is between 75 to 80 degrees Fahrenheit at the day time and not less than 70 degrees at night."}]