[{"url": "http://www.answers.com/Q/What_type_of_Electromagnetic_wave_is_used_to_produce_a_thermogram", "passage_text": "Answered by The Community. Making the world better, one answer at a time. To produce thermogram it needs infrared wave. It is a radiant energy which cannot be seen by naked eyes and it was discovered by Sir William Herschel, an astronomer in the year 1800. A thermogram is a device which measures heat through use of picture. The darker the colour, the cooler the object. White is the hottest point of the scale and Black is the col … dest. A thermogram can be used in medicine-for brain scans and other explorative means."}, {"url": "http://imagine.gsfc.nasa.gov/science/toolbox/emspectrum1.html", "passage_text": "The electromagnetic (EM) spectrum is the range of all types of EM radiation. Radiation is energy that travels and spreads out as it goes  the visible light that comes from a lamp in your house and the radio waves that come from a radio station are two types of electromagnetic radiation. Radio waves are also emitted by stars and gases in space. Microwave: Microwave radiation will cook your popcorn in just a few minutes, but is also used by astronomers to learn about the structure of nearby galaxies. Infrared: Night vision goggles pick up the infrared light emitted by our skin and objects with heat."}, {"url": "http://imagine.gsfc.nasa.gov/science/toolbox/emspectrum1.html", "passage_text": "Are radio waves completely different physical objects than gamma-rays? They are produced in different processes and are detected in different ways, but they are not fundamentally different. Radio waves, gamma-rays, visible light, and all the other parts of the electromagnetic spectrum are electromagnetic radiation. Radio waves are also emitted by stars and gases in space. Microwave: Microwave radiation will cook your popcorn in just a few minutes, but is also used by astronomers to learn about the structure of nearby galaxies. Infrared: Night vision goggles pick up the infrared light emitted by our skin and objects with heat."}, {"url": "http://www.answers.com/Q/Which_type_of_electromagnetic_wave_is_used_to_produce_a_thermogram", "passage_text": "Visible light is a type of electromagnetic wave that is occasionally used for communication. More common examples, however, include radio waves and television waves. White is the hottest point of the scale and Black is the col … dest. A thermogram can be used in medicine-for brain scans and other explorative means. It can also be used to check insulation in buildings."}, {"url": "http://www.answers.com/Q/Which_type_of_electromagnetic_wave_is_used_to_produce_a_thermogram", "passage_text": "It is microwaves that are used for radar. They are high frequency, short wavelength electromagnetic waves, and a number of different frequency ranges of these microwaves are u … sed depending on the application. White is the hottest point of the scale and Black is the col … dest. A thermogram can be used in medicine-for brain scans and other explorative means. It can also be used to check insulation in buildings."}, {"url": "http://www.answers.com/Q/What_type_of_Electromagnetic_wave_is_used_to_produce_a_thermogram", "passage_text": "Visible light is a type of electromagnetic wave that is occasionally used for communication. More common examples, however, include radio waves and television waves. A thermogram is a device which measures heat through use of picture. The darker the colour, the cooler the object. White is the hottest point of the scale and Black is the col … dest. A thermogram can be used in medicine-for brain scans and other explorative means."}, {"url": "http://www.answers.com/Q/Which_type_of_electromagnetic_wave_is_used_to_produce_a_thermogram", "passage_text": "A thermogram is a device which measures heat through use of picture. The darker the colour, the cooler the object. White is the hottest point of the scale and Black is the col … dest. A thermogram can be used in medicine-for brain scans and other explorative means. It can also be used to check insulation in buildings."}, {"url": "http://imagine.gsfc.nasa.gov/science/toolbox/emspectrum1.html", "passage_text": "The other types of EM radiation that make up the electromagnetic spectrum are microwaves, infrared light, ultraviolet light, X-rays and gamma-rays. You know more about the electromagnetic spectrum than you may think. The image below shows where you might encounter each portion of the EM spectrum in your day-to-day life. Radio waves are also emitted by stars and gases in space. Microwave: Microwave radiation will cook your popcorn in just a few minutes, but is also used by astronomers to learn about the structure of nearby galaxies. Infrared: Night vision goggles pick up the infrared light emitted by our skin and objects with heat."}, {"url": "https://en.wikipedia.org/wiki/Thermography", "passage_text": "Infrared thermography (IRT) , thermal imaging, and thermal video are examples of infrared imaging science. Thermographic cameras usually detect radiation in the long-infrared range of the electromagnetic spectrum (roughly 9,000–14,000 nanometers or 9–14 µm) and produce images of that radiation, called thermograms. Thermal images, or thermograms, are actually visual displays of the amount of infrared energy emitted, transmitted, and reflected by an object. Because there are multiple sources of the infrared energy, it is difficult to get an accurate temperature of an object using this method."}, {"url": "http://jrhighsciencedmc.weebly.com/uploads/1/1/2/9/11297846/chapter_7_study_guide.doc", "passage_text": "Lesson 2~. All electromagnetic waves travel at the same speed in a vacuum, but they have different wavelengths and different frequencies. The electromagnetic spectrum is made up of radio waves, microwaves, infrared rays, visible light, ultraviolet rays, X-rays, and gamma rays. Lesson 3~. The color of an opaque object is the color of the light it reflects. The color of a transparent or translucent object is the color of the light it transmits. An electromagnetic wave is made up of vibrating electric and magnetic fields that move through space or some medium at the speed of light. Two different models are needed to explain the behavior of electromagnetic waves. A save model best explains many of the behaviors, but a particle model best explains others."}]