[{"url": "http://www.meaning-of-names.com/israeli-names/ephron.asp", "passage_text": "Meaning of Ephron. Israeli name. In Israeli, the name Ephron means-doubly fruitful form of hebrew ephraim. Other origins for the name Ephron include-Israeli, Hebrew.The name Ephron is most often used as a boy name or male name. Israeli Name Meaning-doubly fruitful form of hebrew ephraim. Origin-Israel"}, {"url": "https://en.wikipedia.org/wiki/Nora_(name)", "passage_text": "It mainly originates as a short form of Honora (also Honoria), a common Anglo-Norman name, ultimately derived from the Latin word Honor (with that meaning). In other European use the name may also originate as a short form of Eleonora or Eleanor. The Irish Nora nóra is likewise probably An irish form Of. honora In other European use the name may also originate as a short form of Eleonora or Eleanor. The Irish Nora nóra is likewise probably An irish form Of. Honora a-less likely derivation of This irish name is from The Irish. fionnualla"}, {"url": "http://www.ourbabynamer.com/meaning-of-Ephron.html", "passage_text": "Local language versions of biblical names of Hebrew origin such as Hannah and David are still widely internationally popular today. Modern Hebrew names are often derived from Hebrew vocabulary, for example Aviva (spring) and Dov (bear). In the U.S. in 2014 less than 5 boys given the name. Less than 5 girls were given the name. View the Ephron Name Popularity Page to see how the popularity trend for Ephron has changed since 1880, or to compare the popularity of Ephron to other names."}, {"url": "https://en.wikipedia.org/wiki/Nora_(name)", "passage_text": "A less-likely derivation of this Irish name is from the Irish Fionnualla. A diminutive form of Nora nóra Is; noirin nóirin this name Has numerous, anglicised forms: Such, As, noreen Norene. And norine nora has been among the most popular girl Names in norway in, the 2000s topping the list of most popular girl names. in 2012 In other European use the name may also originate as a short form of Eleonora or Eleanor. The Irish Nora nóra is likewise probably An irish form Of. Honora a-less likely derivation of This irish name is from The Irish. fionnualla"}, {"url": "http://www.babynamespedia.com/meaning/Ephron", "passage_text": "[ 2 syll. ep-hron, eph-r- on ] The baby boy name Ephron is pronounced as eh-FRahN †. Ephron is used mostly in English and Hebrew, and its language of origin is Hebrew. Ephron is a derivative (English and Hebrew) of the Hebrew name Efron. Ephron is also a derivative of the English, German, and Hebrew name Ephraim. Ephron is not popular as a baby name for boys. It is not in the top 1000 names. "}, {"url": "http://www.abarim-publications.com/Meaning/Ephron.html", "passage_text": "The name Ephron in the Bible. The name Ephron is applied three times in the Bible, although they all may have something to do with each other: 1  The first Ephron we meet in the Bible is a Hittite, a son of Zohar, from whom Abraham purchased the cave at Machpelah in order to bury Sarah (Genesis 23:8)."}, {"url": "http://www.abarim-publications.com/Meaning/Ephron.html", "passage_text": "Ephron meaning. For a meaning of the name Ephron, NOBSE Study Bible Name List appears to take the waw-nun extension quite liberally as a kind of adjective-maker and reads Fawn-like. Jones' Dictionary of Old Testament Proper Names sees in our waw-nun form an intensitive and proposes A Great And Choice Fawn. The name Ephron is applied three times in the Bible, although they all may have something to do with each other: 1  The first Ephron we meet in the Bible is a Hittite, a son of Zohar, from whom Abraham purchased the cave at Machpelah in order to bury Sarah (Genesis 23:8)."}, {"url": "http://www.ourbabynamer.com/meaning-of-Ephron.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Ephron in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Ephron in Nautical Flags page. In the U.S. in 2014 less than 5 boys given the name. Less than 5 girls were given the name. View the Ephron Name Popularity Page to see how the popularity trend for Ephron has changed since 1880, or to compare the popularity of Ephron to other names."}, {"url": "http://www.thinkbabynames.com/meaning/1/Ephron", "passage_text": "Ephron /eph-ron/ [2 sylls.] as a name for boys. Ephron's root is Hebrew, and the name Ephron means singing bird. Ephron is an alternate form of Efron (Hebrew). Compare surname Ephrem. Ephron is an uncommon first name for males but a somewhat popular last name for both adults and children (#130443 out of 150436, Top 87%). (2000 U.S. Census). Displayed below is the baby name popularity of Ephron for boys. Ephron has yet to be recorded in the Top 1000 thus far"}]