[{"url": "http://www.howmuchisit.org/shoulder-surgery-cost/", "passage_text": "1 In the worst cases, a total shoulder replacement may even be necessary. 2  This may be the only treatment available for severe arthritis. 3  On average, shoulder surgery can range anywhere from $6,000 to as much as $20,000 without any type of health insurance policy. 1 According to HealthcareBlueBook.com, the price for the surgery can reach anywhere from $7000 to $10,000. 2  The fee will cover hospitalization services as well as the fee for the physician that will perform the surgery. 3  The prices listed are for patients covered by their insurance providers."}, {"url": "http://www.buzzle.com/articles/shoulder-surgery-cost.html", "passage_text": "A surgery becomes necessary when the rotator cuff tears or the shoulder gets dislocated. The shoulder surgery costs could range anywhere between $5600 to $35,600, depending on the complexity of the procedure employed. Advertisement. The shoulder joint is held in place by muscles, tendons, and ligaments, which enable us to move or rotate our arm. The average cost for this type of procedure falls between $9,000 to $18,000. Open surgery is one of the conventional approaches, taken in case of severe damage to the shoulder joint."}, {"url": "http://www.nyorthosports.com/blog/bid/353616/is-rotator-cuff-surgery-expensive-if-i-have-insurance-most-insurances-accepted", "passage_text": "The Average Cost of Surgery. According to a number of studies, surgical treatment for rotator cuff tears can cost anything between $300 and $15,000 (hospital cost), and approximately $250 to $5,000 for surgeon fees. The medical cost depends very much on the surgery type that is carried out. The Arthroscopic Surgical Intervention"}, {"url": "http://health.costhelper.com/rotator-cuff.html", "passage_text": "1 Physical therapy following surgery can help to improve the shoulder's range of motion. 2  For insured patients out-of-pocket costs typically consist of a copay of $10 -$75 per session or coinsurance of 10%-50% or more. 3  For uninsured patients it typically costs $50 -$350 or more per session. 1 For uninsured patients, an office visit typically costs $50-$200 or more. 2  The Medical Expenditure Panel Survey, a set of large-scale surveys on the use and cost of health services conducted by the Agency for Healthcare Research and Quality, lists the average price of an office visit for an uninsured patient as $199."}, {"url": "http://www.howmuchisit.org/shoulder-surgery-cost/", "passage_text": "1 Since this procedure will be more than likely covered under your health insurance plan, you should only have to pay a small portion of this amount. 2  A simple surgery such as a shoulder arthroscopy procedure can cost anywhere from $5,000 to $8,000. 1 According to HealthcareBlueBook.com, the price for the surgery can reach anywhere from $7000 to $10,000. 2  The fee will cover hospitalization services as well as the fee for the physician that will perform the surgery. 3  The prices listed are for patients covered by their insurance providers."}, {"url": "http://health.costhelper.com/rotator-cuff.html", "passage_text": "Discounts: 1  Physical therapy following surgery can help to improve the shoulder's range of motion. 2  For insured patients out-of-pocket costs typically consist of a copay of $10 -$75 per session or coinsurance of 10%-50% or more. 3  For uninsured patients it typically costs $50 -$350 or more per session. 1 For uninsured patients, an office visit typically costs $50-$200 or more. 2  The Medical Expenditure Panel Survey, a set of large-scale surveys on the use and cost of health services conducted by the Agency for Healthcare Research and Quality, lists the average price of an office visit for an uninsured patient as $199."}, {"url": "http://www.howmuchisit.org/shoulder-surgery-cost/", "passage_text": "1 On average, shoulder surgery can range anywhere from $6,000 to as much as $20,000 without any type of health insurance policy. 2  Since this procedure will be more than likely covered under your health insurance plan, you should only have to pay a small portion of this amount. 1 According to HealthcareBlueBook.com, the price for the surgery can reach anywhere from $7000 to $10,000. 2  The fee will cover hospitalization services as well as the fee for the physician that will perform the surgery. 3  The prices listed are for patients covered by their insurance providers."}, {"url": "http://www.ehow.com/about_5568455_much-rotator-cuff-surgery-cost.html", "passage_text": "Average Surgery Cost. According to an online article by Blue Cross Blue Shield, Surgical Treatment for a Rotator Cuff Tear, the cost for rotator cuff surgery can vary from $300 to $15,000 for hospital expenses and between $225 to $4,750 for the physician fees. This depends on the type of surgery that is needed. "}, {"url": "http://health.costhelper.com/rotator-cuff.html", "passage_text": "1 A study published in the Journal of Shoulder and Elbow Surgery Board of Trustees in 2010 found that average surgical costs for patients who received a mini-open surgery was $7,841; patients who received arthroscopy paid $8,985 on average. 2  Surgery typically is covered by health insurance. 1 For uninsured patients, an office visit typically costs $50-$200 or more. 2  The Medical Expenditure Panel Survey, a set of large-scale surveys on the use and cost of health services conducted by the Agency for Healthcare Research and Quality, lists the average price of an office visit for an uninsured patient as $199."}, {"url": "http://health.costhelper.com/shoulder-pain.html", "passage_text": "Related articles: MRI, Fitness Club. 1  Without health insurance, diagnosis and treatment for a dislocated shoulder typically includes the cost of the X-ray, a facility fee and a doctor fee for a typical total of less than $1,000 if anesthesia is not required up to $8,000 or more if anesthesia is required. 1 A shoulder sling, often used during the recovery process, can cost $30 to $80 or more. 2  A shoulder brace, which might be worn by an athlete whose shoulder was dislocated, can cost $30 to $50 or more."}]