[{"url": "http://www.webmd.com/parenting/baby/temperature-fever", "passage_text": "If your baby is under age 3 months and has a fever, take her to a doctor. For at least the first 6 months of life, call your doctor anytime she has a fever. At your baby’s next checkup you can ask if the doctor has a “fever policy.” That will give you a better idea about when you need to call. Most doctors say a baby has a fever if her temperature rises to 100.4 F or above. It’s best to take her temperature rectally. Take a few readings when your infant is well to get a sense of what her normal temperature is."}, {"url": "http://www.modernmom.com/2c2371d2-051f-11e2-9d62-404062497d7e.html", "passage_text": "A baby’s temperature is no different. According to the American Academy of Pediatrics, normal body temperature for a health baby ranges between 97 degrees and 100.4 degrees Fahrenheit (36 degrees to 38 degrees Celsius). A rectal temperature reading above this range indicates a fever. "}, {"url": "http://www.parents.com/baby/care/american-baby-how-tos/treat-babys-first-fever/", "passage_text": "The American Academy of Pediatrics (AAP) says that the normal body temperature for a healthy baby is between 97&deg and 100.4&deg Fahrenheit (36&deg to 38&deg Celsius). A fever would be any temperature that rises to 100.4&deg F or above. "}, {"url": "http://www.babycentre.co.uk/a84/fever", "passage_text": "If you want to, you can use a thermometer to give you a better idea of her temperature. Normal body temperature is between 36 degrees C and 37 degrees C, but this can vary by a few points of a degree from child to child. A fever is anything that is high for your baby. You don’t need to buy an expensive thermometer. "}, {"url": "http://www.webmd.com/children/tc/fever-temperatures-accuracy-and-comparison-topic-overview", "passage_text": "1 The average normal oral temperature is 98.6°F (37°C) . 2  A rectal temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 3  An ear (tympanic) temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 1 A rectal temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 2  An ear (tympanic) temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 3  An armpit (axillary) temperature is usually 0.5°F (0.3°C) to 1°F (0.6°C) low"}, {"url": "http://www.webmd.com/children/tc/fever-temperatures-accuracy-and-comparison-topic-overview", "passage_text": "Generally, the correlation of temperature results are as follows: 1  The average normal oral temperature is 98.6°F (37°C) . 2  A rectal temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 3  An ear (tympanic) temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 1 A rectal temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 2  An ear (tympanic) temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 3  An armpit (axillary) temperature is usually 0.5°F (0.3°C) to 1°F (0.6°C) low"}, {"url": "http://www.healthlinkbc.ca/medicaltests/content.asp?hwid=hw198785", "passage_text": "Most people think a normal body temperature is an oral temperature (by mouth) of 37°C (98.6°F) . This is an average of normal body temperatures. Your normal temperature may actually be 0.6°C (1°F) or more above or below this. Also, your normal temperature changes by as much as 0.6°C (1°F) during the day, depending on how active you are and the time of day. Body temperature is very sensitive to hormone levels. So a woman's temperature may be higher or lower when she is ovulating or having her menstrual period"}, {"url": "http://www.babycenter.com/0_fever-in-babies_84.bc", "passage_text": "A higher-than-normal body temperature is called a fever. A fever is usually a sign that the body is waging a war against infection. Taking your baby's temperature can confirm your suspicions and help you and your child's doctor figure out the best way to get your baby back on the road to health. Most doctors – and the American Academy of Pediatrics (AAP) — agree that a normal body temperature for a healthy baby is between 97 and 100.3 degrees Fahrenheit. If your baby's rectal temperature is 100.4 degrees or higher, he has a fever"}, {"url": "http://www.webmd.com/children/tc/fever-temperatures-accuracy-and-comparison-topic-overview", "passage_text": "You can take a temperature using the mouth (oral), anus (rectal), armpit (axillary), or ear (tympanic). But the temperature readings vary depending on which one you use, and you need an accurate body temperature to determine if a fever is present. 1 A rectal temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 2  An ear (tympanic) temperature is 0.5°F (0.3°C) to 1°F (0.6°C) higher than an oral temperature. 3  An armpit (axillary) temperature is usually 0.5°F (0.3°C) to 1°F (0.6°C) low"}]