[{"url": "http://islamic-world.net/khalifah/definition.htm", "passage_text": "In the context of Islam, however, the word acquires a narrower meaning. The Muslim Khalifa is the successor (in a line of successors) to Prophet Muhammad's position as the political, military, and administrative leader of the Muslims. KHILAFAH (Arabic) - is used to denote the government of the Muslim state, of which the Khalifa is the head. A workable analogy of Khalifah and Khilafah is president and presidency or king and monarchy."}, {"url": "https://en.wikipedia.org/wiki/Khalifa", "passage_text": "Look up khalifa in Wiktionary, the free dictionary. Khalifa or Khalifah is an name or title which means successor or steward. It most commonly refers to the leader of a Caliphate, but is also used as a title among various Islamic religious groups and orders. Khalifa is sometimes also pronounced as kalifa"}, {"url": "http://www.islamweb.net/emainpage/index.php?page=showfatwa&Option=FatwaId&Id=87908", "passage_text": "Khalifa is an Arabic word, so I can't understand it, When I asked the meaning of Khalifa to my friends (Arabs), they told me that Khalifa is a person, who is has a full knowledge about Islam and who will show the right path of Islam to his countrymen. "}, {"url": "https://en.wikipedia.org/wiki/Wiz_Khalifa", "passage_text": "Khalifa stated to spinner.com that the name also came from being called young Wiz 'cause I was good at everything I did, and my granddad is Muslim, so he gave me that name; he felt like that's what I was doing with my music.. He got a tattoo of his stage name on his 17th birthday. Khalifa signed to the label shortly after and began a seven-year period of artist development. Khalifa released his first mixtape, Prince of the City: Welcome to Pistolvania, in 2005. The mixtape paved the way for his first full-length album entitled Show and Prove in 2006."}, {"url": "https://en.wikipedia.org/wiki/Wiz_Khalifa", "passage_text": "Cameron Jibril Thomaz (born September 8, 1987), better known by his stage name Wiz Khalifa, is an American rapper, songwriter and actor. He released his debut album, Show and Prove, in 2006, and signed to Warner Bros. Records in 2007. Khalifa signed to the label shortly after and began a seven-year period of artist development. Khalifa released his first mixtape, Prince of the City: Welcome to Pistolvania, in 2005. The mixtape paved the way for his first full-length album entitled Show and Prove in 2006."}, {"url": "https://simple.wikipedia.org/wiki/Burj_Khalifa", "passage_text": "Burj Khalifa or Khalifa Tower (Arabic: برج خليفة) is a very tall skyscraper in Dubai, United Arab Emirates and is the world's tallest building ever built, at 828m (2,717ft). Before the building opened, it was called Burj Dubai. "}, {"url": "https://en.wikipedia.org/wiki/Burj_Khalifa", "passage_text": "Burj Khalifa (Arabic: برج خليفة ‎,  Khalifa Tower, pronounced English /ˈbɜrdʒ kəˈliːfə/), known as Burj Dubai before its inauguration, is a megatall skyscraper in Dubai, United Arab Emirates. The spire of Burj Khalifa is composed of more than 4,000 tonnes (4,400 short tons; 3,900 long tons) of structural steel. The central pinnacle pipe weighing 350 tonnes (390 short tons; 340 long tons) was constructed from inside the building and jacked to its full height of over 200 m (660 ft) using a strand jack system."}, {"url": "https://www.leafly.com/hybrid/khalifa-kush", "passage_text": "Review. Khalifa Kush, or Wiz Khalifa OG, is a hybrid that was bred specifically for the rap artist Wiz Khalifa, who claims it descended from an OG strain. Strain Highlights. Khalifa Kush, or Wiz Khalifa OG, is a hybrid that was bred specifically for the rap artist Wiz Khalifa, who claims it descended from an OG strain."}]