[{"url": "https://www.sharecare.com/health/metabolic-disorders-diagnosis-and-screening/what-basal-metabolic-rate-bmr", "passage_text": "Basal metabolic rate (BMR), also called the resting metabolic rate, is the amount of energy needed to support the body's most basic functions when at rest in a neutral, or non-stressful, environment. The BMR is the number of calories a specific human needs per day to stay alive. Your basal metabolic rate (BMR) is the number of calories your body burns daily without your having to do anything. Your body uses around 75 percent of the calories you eat each day just to maintain life and perform basic functions."}, {"url": "http://www.calculator.net/bmr-calculator.html", "passage_text": "Reference. The Basal Metabolic Rate (BMR) is the amount of energy you need while resting in a temperate environment during the post-absorptive state, or when your digestive system is inactive. "}, {"url": "http://www.bodybuilding.com/fun/bmr_calculator.htm", "passage_text": "Basal metabolic rate (BMR) is the amount of energy expended while at rest in a neutrally temperate environment, in the post-absorptive state (meaning that the digestive system is inactive, which requires about twelve hours of fasting). Basal metabolic rate (BMR) is the amount of energy expended while at rest in a neutrally temperate environment. Find our your BMR with this handy calculator!"}, {"url": "http://www.busywomensfitness.com/basalmetabolicrate.html", "passage_text": "The basal metabolic rate (BMR) is the base rate at which your body consumes calories for basic metabolic functions like maintaining internal temperature, repairing cells, pumping blood, powering muscles at rest, etc. Your basal metabolic rate is also greatly affected by the amount of muscle mass you have. The more muscle fiber, the higher your BMI as muscle, even at rest, burns significantly more calories than fat and other tissues. This is the reason that strength training is so important to a weight loss program"}, {"url": "http://www.shapefit.com/health/basal-metabolic-rate.html", "passage_text": "Your BMR (Basal Metabolic Rate) is defined as the minimum number of calories your body burns whether at rest, working out or lying down. This means that everyone has a set number of calories that they need in order to stay alive and it’s as different for you as it is for your children, friends, parents or even siblings. "}, {"url": "http://www.fitday.com/fitness-articles/nutrition/understanding-metabolism-what-determines-your-bmr.html", "passage_text": "Metabolism refers to the processes that the body needs to function. Basal Metabolic Rate is the amount of energy expressed in calories that a person needs to keep the body functioning at rest. Your basal metabolic rate accounts for about 60 to 75% of the calories you burn every day. It is influenced by several factors. Body Composition. The more muscle you have, the higher your metabolic rate tends to be even at rest."}, {"url": "http://www.myfitnesspal.com/tools/bmr-calculator", "passage_text": "Your BMR (Basal Metabolic Rate) is an estimate of how many calories you'd burn if you were to do nothing but rest for 24 hours. It represents the minimum amount of energy needed to keep your body functioning, including breathing and keeping your heart beating. "}, {"url": "https://en.wikipedia.org/wiki/Basal_metabolic_rate", "passage_text": "Basal Metabolic Rate is the amount of energy expressed in calories that a person needs to keep the body functioning at rest. Some of those processes are breathing, blood circulation, controlling body temperature, cell growth, brain and nerve function, and contraction of muscles. Basal metabolic rate (BMR) is the minimal rate of energy expenditure per unit time by endothermic animals at rest. (McNab, B. K. 1997). On the Utility of Uniformity in the Definition of Basal Rate of Metabolism. Physiol. Zool. Vol.70; Metabolism refers to the processes that the body needs to function."}]