[{"url": "https://en.wikipedia.org/wiki/Lakota_language", "passage_text": "Lakota (also Lakhota, Teton, Teton Sioux) is a Siouan language spoken by the Lakota people of the Sioux tribes. Though generally taught and considered by speakers as a separate language, Lakota is mutually intelligible with the other two languages (cf. Dakota language), and is considered by most linguists one of the three major varieties of the Sioux language. The Lakota language represents one of the largest Native American language speech communities in the United States, with approximately 6,000 speakers living mostly in northern plains states of North Dakota and South Dakota. There is a Lakota language program online available for children to use."}, {"url": "http://www.tankabar.com/cgi-bin/nanf/public/viewStory.cvw?sectionname=Buffalo%20Nation&storyid=69759", "passage_text": "In Lakota, Tanka means large or great. It changes depending on how it is used when spoken. What Tanka means to me is a little different. When I see people doing good for themselves and their families, that is Tanka. "}, {"url": "http://www.thewildwest.org/nativeamericans/nativeamericanreligion/100-lakotaindiansconceptofwakan.html", "passage_text": "All the Wakan Tanka are pleased with the smoke of the Lakota pipe. White culture sometimes refers to the Lakota medicine man as a medicine man, or as the Lakota say, wicasa wakan, when he is performing ceremonies, and believe he is making medicine when doing so. "}, {"url": "http://www.sacred-texts.com/nam/pla/sdo/sdo49.htm", "passage_text": "Wakan means very many things. The Lakota understands what it means from the things that are considered wakan; yet sometimes its meaning must be explained to him. It is something that is hard to understand. Thus wasica wakan, means a white man medicineman; but a Lakota medicineman is called pejuta wacasa. "}, {"url": "http://www.babynamespedia.com/meaning/Tonja", "passage_text": "[ 2 syll. to-nja, ton-ja ] The baby girl name Tonja is pronounced T AO-NYuw- †. Tonja is of Latin origin and it is predominantly used in the Russian language. Tonja is a pet form of the Russian Antonija and a derivative of Antonia. Tonja is an uncommon baby name for girls. At the modest height of its usage in 1967, 0.030% of baby girls were given the name Tonja."}, {"url": "http://www.ourbabynamer.com/meaning-of-Lakota.html", "passage_text": "The Lakota, meaning friend, ally, are also known as the Teton Thithunwan meaning prairie dwellers as they are the westenmost Sioux living in North and South Dakota. The Lakota People, are known for their warrior and hunting culture. The Lakota People are part of a confederation of seven related Sioux tribes, who speak Lakota. They are also known as Teton, or Titunwan, meaning prairie dwellers. Lakota is one of the three language dialects spoken by the Sioux people. The other two are Nakota and Dakota. The Sioux are an indegenous Great Plains people comprised of three divisions"}, {"url": "http://www.ourbabynamer.com/meaning-of-Tonja.html", "passage_text": "Tonja is generally used as a girl's name. It consists of 5 letters and 2 syllables and is pronounced Ton-ja. In the U.S. in 2014 less than 5 girls were given the name. Less than 5 boys were given the name. View the Tonja Name Popularity Page to see how the popularity trend for Tonja has changed since 1880, or to compare the popularity of Tonja to other names. Tonja is a variant spelling of Tonya. "}, {"url": "http://www.answers.com/Q/What_does_Tanka_mean_in_Lakota", "passage_text": "Lakota is the name given to the western dialect of the Sioux language (the middle dialect was Nakota, the eastern dialect Dakota). Tribes speaking Lakota are also called the … Teton Sioux, from the Lakota term tetonwan, meaning dwellers on the Plains. They consisted of the Brule, Oglala, Hunkpapa, Minneconjou, Two Kettles, No Bows and Blackfoot Sioux tribes"}, {"url": "http://www.answers.com/Q/What_does_Tanka_mean_in_Lakota", "passage_text": "Wopila is a noun in the native American Lakota language referring to a sharing and/or a giveaway (Wopila). It is an offering of giving/sharing, a thanks given for all of exi … stence and the blessing inherent in each moment of it. Tribes speaking Lakota are also called the … Teton Sioux, from the Lakota term tetonwan, meaning dwellers on the Plains."}]