[{"url": "https://en.wikipedia.org/wiki/Stephen_Hawking", "passage_text": "Stephen William Hawking CH, CBE, FRS, FRSA (/ˈstiːvən ˈhɔːkɪŋ/; born 8 January 1942) is an English theoretical physicist, cosmologist, author and Director of Research at the Centre for Theoretical Cosmology within the University of Cambridge. Hawking was the first to set forth a theory of cosmology explained by a union of the general theory of relativity and quantum mechanics. He is a vigorous supporter of the many-worlds interpretation of"}, {"url": "http://www.hawking.org.uk/about-stephen.html", "passage_text": "Stephen William Hawking was born on 8 January 1942 (300 years after the death of Galileo) in Oxford, England. His parents' house was in north London, but during the second world war, Oxford was considered a safer place to have babies. At the age of eleven, Stephen went to St. Albans School and then on to University College, Oxford; his father's old college. Stephen wanted to study Mathematics, although his father would have preferred medicine. Mathematics was not available at University College, so he pursued Physics instead."}, {"url": "http://www.notablebiographies.com/Gi-He/Hawking-Stephen.html", "passage_text": "Early life. Stephen William Hawking was born on January 8, 1942, in Oxford, England. His father, a well-known researcher in tropical medicine, urged his son to seek a career in medicine, but Stephen found biology and medicine were not exact enough. Therefore, he turned to the study of mathematics and physics. "}, {"url": "http://www.biography.com/people/stephen-hawking-9331710", "passage_text": "Synopsis. Stephen Hawking was born on January 8, 1942, in Oxford, England. At an early age, Hawking showed a passion for science and the sky. At age 21, while studying cosmology at the University of Cambridge, he was diagnosed with amyotrophic lateral sclerosis. Early Life and Background. The eldest of Frank and Isobel Hawking's four children, Stephen William Hawking was born on the 300th anniversary of the death of Galileo—long a source of pride for the noted physicist—on January 8, 1942. He was born in Oxford, England, into a family of thinker"}, {"url": "http://www.telegraph.co.uk/news/uknews/5193802/Family-of-Stephen-Hawking-hopeful-of-full-recovery-after-hospital-admission.html", "passage_text": "Professor Hawking, who also has two sons Tim, 30, and Robert, 42, and a grandchild, is due to retire from his post in October, as is customary at the age of 67 at the university. The family of Professor Stephen Hawking were hopeful that he would make a full recovery  after he fell very ill with a respiratory infection. On his website Prof Hawking describes coxing and rowing during his time at Oxford University but gradually becoming more clumsy Photo: REUTERS."}, {"url": "http://www.special-education-degree.net/stephen-hawking/", "passage_text": "Jan. 8, 1942: Stephen William Hawking was born in Oxford, England to Frank and Isobel Hawking. His parents had two other children, Mary (1943) and Philippa (1947) and adopted their second son, Edward, in 1956. FACT: Hawking was born on the 300th anniversary of the death of Galileo. 1967 – Jane and Stephen’s first son Robert, was born in May 1967. 1968 – Hawking collaborated with Roger Penrose, a continuation of his work on the singularity theorem concepts proposed in his thesis. Their joint essay came in second place in the 1968 Gravity Research Foundation competition."}, {"url": "https://en.wikipedia.org/wiki/Stephen_Hawking", "passage_text": "Hawking was born on 8 January 1942 in Oxford, England, to Frank (1905–1986) and Isobel Hawking (nee Née; walker–1915). 2013 his mother Was. Scottish despite their' families financial, constraints both parents attended The university Of, oxford Where frank studied medicine And, Isobel, Philosophy politics And. economics Hawking was the first to set forth a theory of cosmology explained by a union of the general theory of relativity and quantum mechanics. He is a vigorous supporter of the many-worlds interpretation of"}]