[{"url": "http://elderscrollsonline.info/guides/how-to-enter-and-leave-cyrodiil", "passage_text": "Some players experience difficulties finding a way to enter and leave Cyrodiil. If you have never visited this PvP zone we recommend you to read this guide. All PVP fights in Elder Scrolls Online take place in Cyrodiil. It is a place where three alliances are fighting against each other in Alliance War."}, {"url": "http://gametipcenter.com/the-elder-scrolls-online-eso-how-to-enter-and-leave-cyrodiil", "passage_text": "To enter Cyrodiil, hit L on your keyboard to pull up the Alliance War tab on the main menu. Alternatively just pull up your characters screen or map screen and go to the tab at the top that looks like a castle (or kinda like a Rook in Chess)."}, {"url": "http://gametipcenter.com/the-elder-scrolls-online-eso-how-to-enter-and-leave-cyrodiil", "passage_text": "In The Elder Scrolls Online (ESO), the majority of the PVP (aka AvA, Alliance vs. Alliance) in the game is done in Cyrodiil."}, {"url": "http://www.uesp.net/wiki/Shivering:Door_to_Cyrodiil", "passage_text": "The Door to Cyrodiil is the gateway that connects the Province of Cyrodiil to the Shivering Isles (quest-related). The butterfly room. First impressions. On the first trip through the door, the player will encounter Haskill, who starts the Main Quest by offering a unique opportunity."}, {"url": "http://esoacademy.com/faq/how-do-you-enter-cyrodiil-pvp/", "passage_text": "Once you set a Home Campaign you can then enter by either selecting your Campaign and then selecting Travel To Campaign. This will place you in a queue to join. You can also just travel to the Cyrodiil Wayshrines to enter your Home Campaign. To leave Cyrodiil you must go back to the Wayshrines at your Alliance gates. More details can be found in the Cyrodiil And PVP Guide."}, {"url": "http://elderscrollsonline.info/guides/how-to-enter-and-leave-cyrodiil", "passage_text": "The fastest way to enter Cyrodiil is to use your Character menu. Choose Alliance War tab and you will see a list of campaigns. To find out more about Campaigns read this guide: Campaigns in ESO. Each Campaign is an independent instance of Cyrodiil where limited number of players is fighting. You can enter either your home campaign or guest campaign. Choose the campaign you want to enter and you will be allowed to take place in a queue. After your time to enter has come you will receive a notification telling you that you may enter a campaign."}]