[{"url": "http://whatis.techtarget.com/definition/Boltzmanns-constant", "passage_text": "This constant derives its name from the Austrian physicist Ludwig Boltzmann (1844-1906), and is equal to the ratio of the gas constant to the Avogadro constant. The value of Boltzmann's constant is approximately 1.3807 x 10 -23 joule s per kelvin (J · K -1). In general, the energy in a gas molecule is directly proportional to the absolute temperature. As the temperature increases, the kinetic energy per molecule increases. As a gas is heated, its molecules move more rapidly"}, {"url": "http://www.tech-faq.com/boltzmann-constant.html", "passage_text": "Boltzmann constant k acts as a bridge from macroscopic to microscopic physics. In the macroscopic aspect, the ideal gas law states that for an ideal gas, the product of pressure p and volume V is proportional to the product of the amount of substance n (in moles) and absolute temperature T : where R is the gas constant (8.314 472(15) J K−1 mol−1) . Introduction of the Boltzmann constant here, converts the ideal gas law into an equation that corresponds to the microscopic properties of molecules. where N is the number of molecules of gas."}, {"url": "https://en.wikipedia.org/wiki/Boltzmann_constant", "passage_text": "The Boltzmann constant (k B or k), named after Ludwig Boltzmann, is a physical constant relating energy at the individual particle level with temperature. The small numerical value of the Boltzmann constant in SI units means a change in temperature by 1 K only changes a particle's energy by a small amount. A change of 7002274149999999999♠1 °C is defined to be the same as a change of 7000100000000000000♠1 K."}, {"url": "http://www.tech-faq.com/boltzmann-constant.html", "passage_text": "Boltzmann Constant. The Boltzmann Constant (Boltzmann’s Constant) is a fundamental physics constant that plays a pivotal role in almost every single statistical formulation in both quantum and classical physics. where R is the gas constant (8.314 472(15) J K−1 mol−1) . Introduction of the Boltzmann constant here, converts the ideal gas law into an equation that corresponds to the microscopic properties of molecules. where N is the number of molecules of gas."}, {"url": "http://www.tech-faq.com/boltzmann-constant.html", "passage_text": "The Boltzmann Constant, symbolized by k or kB, is the relationship between absolute temperature and kinetic energy in each molecule of an ideal gas. where R is the gas constant (8.314 472(15) J K−1 mol−1) . Introduction of the Boltzmann constant here, converts the ideal gas law into an equation that corresponds to the microscopic properties of molecules. where N is the number of molecules of gas."}, {"url": "https://en.wikipedia.org/wiki/Boltzmann_constant", "passage_text": "Boltzmann's constant, k, is a bridge between macroscopic and microscopic physics. Macroscopically, the ideal gas law states that, for an ideal gas, the product of pressure p and volume V is proportional to the product of amount of substance n (in moles) and absolute temperature T : The small numerical value of the Boltzmann constant in SI units means a change in temperature by 1 K only changes a particle's energy by a small amount. A change of 7002274149999999999♠1 °C is defined to be the same as a change of 7000100000000000000♠1 K."}, {"url": "http://www.calculator.org/property.aspx?name=Boltzmann%20constant", "passage_text": "Named after Austrian physicist Ludwig Boltzmann, the Boltzmann constant is considered to be a bridge between energy at the particle level and temperature at the bulk level. This relationship is one that moves from the macroscopic level to the microscopic level, using the ideal gas law. The Boltzmann constant is found in semiconductor physics as well. Wherever there is a p-n junction, a voltage characteristic called thermal voltage (V T) can be related to the absolute temperature of the system with this equation:"}, {"url": "https://en.wikipedia.org/wiki/Boltzmann_constant", "passage_text": "The Boltzmann constant has the dimension energy divided by temperature, the same as entropy. The accepted value in SI units is 6977138064879999999♠1.3806488(13)×10−23 J/K. The small numerical value of the Boltzmann constant in SI units means a change in temperature by 1 K only changes a particle's energy by a small amount. A change of 7002274149999999999♠1 °C is defined to be the same as a change of 7000100000000000000♠1 K."}, {"url": "http://whatis.techtarget.com/definition/Stefan-Boltzmann-constant", "passage_text": "Part of the IT standards and organizations glossary: The Stefan-Boltzmann constant, symbolized by the lowercase Greek letter sigma (), is a physical constant involving black body radiation. A black body, also called an ideal radiator, is an object that radiates or absorbs energy with perfect efficiency at all electromagnetic wavelength s. "}, {"url": "http://whatis.techtarget.com/definition/Boltzmanns-constant", "passage_text": "Boltzmann's constant, also called the Boltzmann constant and symbolized k or k B, defines the relation between absolute temperature and the kinetic energy contained in each molecule of an ideal gas. The value of Boltzmann's constant is approximately 1.3807 x 10 -23 joule s per kelvin (J · K -1)."}]