[{"url": "http://www.kaplanuniversity.edu/arts-sciences/human-services-bachelor-degree.aspx", "passage_text": "Advanced Start. If you already have an associate's or bachelor's degree from a regionally or nationally accredited college or university and wish to pursue a career in the human services arena, our advanced start program can help you earn a Bachelor of Science in Human Services in as little as two years. "}, {"url": "http://kresge.org/programs/human-services", "passage_text": "Program Overview. To help historically and systematically disadvantaged individuals and communities, we believe it is necessary to transform the human services sector. Human Services. We seek to expand access and opportunity for individuals and families who are vulnerable and low-income by strengthening human services organizations and promoting new responses to challenges in the sector."}, {"url": "http://www.capella.edu/online-degrees/masters-social-community-services/", "passage_text": "Career Outcomes. Common jobs with an online program in social and community services include community organizer, family specialist, generalist case manager, probation or correctional treatment specialist, program coordinator or program manager. "}, {"url": "http://www.gradschools.com/programs/human-services", "passage_text": "Human Services Graduate Programs & Human Services Schools. A human services graduate program is the gateway to a number of fulfilling career paths. Human services degrees are an interdisciplinary field that helps people work towards self-sufficiency and a better quality of life. "}, {"url": "http://www.hhs.gov/programs/index.html", "passage_text": "Programs & Services. HHS administers more than 100 programs across its operating divisions. HHS programs protect the health of all Americans and provide essential human services, especially for those who are least able to help themselves. "}, {"url": "http://info.waldenu.edu/walden-programs/human-services", "passage_text": "Doctoral. 1  PhD in Human and Social Services. 2  Human and social services professionals are on the front line in serving and caring for those who are most vulnerable and in need. 3  Walden’s PhD in Human and Social Services program is designed to help professionals in a broad range of settings. "}, {"url": "http://www.excite.com/education/human-services/careers", "passage_text": "Careers in Human Services. Careers in human services are a great fit for those people who wish to dedicate themselves to caring for their community. At any point in time, society is burdened by many individuals who are suffering under personal and social ills. There are those who are struggling with alcohol, drug abuse and other ailments. "}, {"url": "http://www.tacomacc.edu/areasofstudy/careertraining/humanservices/", "passage_text": "Human Services. The Human Services program prepares you to serve people in need through community social service organizations. You’ll learn about human behavior and social problems and how individuals interface with systems to address these issues. You'll also learn ways to help people meet their physical, mental, and emotional needs. With a degree in human services, you may become a chemical dependency professional, youth worker, or mental health aide. You can work with nonprofit groups, schools, prisons, and government agencies."}, {"url": "http://www.capella.edu/online-human-services-degrees/", "passage_text": "Human Services Programs. Capella's Human Services programs teach valuable communication, partnership, and advocacy skills to help increase your understanding and awareness of cultural and social issues, public policy, and community resources. "}]