[{"url": "https://en.wikipedia.org/wiki/Fatal_familial_insomnia", "passage_text": "(June 2015). Fatal familial insomnia (FFI) is a very rare autosomal dominant inherited prion disease of the brain. It is almost always caused by a mutation to the protein PrPC, but can also develop spontaneously in patients with a non-inherited mutation variant called sporadic fatal insomnia (sFI). The disease has four stages: 1  The person has increasing insomnia, resulting in panic attacks, paranoia, and phobias. 2  This stage lasts for about four months. 3  Hallucinations and panic attacks become noticeable, continuing for about five months."}, {"url": "http://www.mayoclinic.org/diseases-conditions/insomnia/basics/causes/CON-20024293", "passage_text": "1 Examples of conditions linked with insomnia include arthritis, cancer, heart failure, lung disease, gastroesophageal reflux disease (GERD), overactive thyroid, stroke, Parkinson's disease and Alzheimer's disease. Common causes of insomnia include: 1  Stress. 2  Anxiety. 3  Depression. 4  Medical conditions. 5  Change in your environment or work schedule. 6  Poor sleep habits. 7  Medications. 8  Caffeine, nicotine and alcohol. 9  Eating too much late in the evening."}, {"url": "http://www.medicinenet.com/insomnia/related-conditions/index.htm", "passage_text": "Insomnia Related Diseases & Conditions. Medical conditions are often related to other diseases and conditions. Our doctors have compiled a list of ailments related to the topic of Insomnia. These conditions may be a cause or symptom of Insomnia or be a condition for which you may be at increased risk. Congestive Heart Failure (CHF) Congestive heart failure (CHF) refers to a condition in which the heart loses the ability to function properly."}, {"url": "http://www.mayoclinic.org/diseases-conditions/insomnia/basics/causes/CON-20024293", "passage_text": "Causes. Common causes of insomnia include: 1  Stress. 2  Concerns about work, school, health or family can keep your mind active at night, making it difficult to sleep. 3  Stressful life events — such as the death or illness of a loved one, divorce, or a job loss — may lead to insomnia. Common causes of insomnia include: 1  Stress. 2  Anxiety. 3  Depression. 4  Medical conditions. 5  Change in your environment or work schedule. 6  Poor sleep habits. 7  Medications. 8  Caffeine, nicotine and alcohol. 9  Eating too much late in the evening."}, {"url": "https://sleepfoundation.org/sleep-topics/parkinsons-disease-and-sleep", "passage_text": "Parkinson's disease is a disorder of the central nervous system that causes a loss of cells in the part of the brain that controls movement. People with Parkinson’s disease experience a range of symptoms, including tremor (shaking), rigidity (stiffness), slowness of movement, and problems with balance and coordination. They may also have memory problems, depression, and sleep complaints. In addition, people with Parkinson’s disease are at higher risk for restless legs syndrome (RLS) and periodic leg movement disorder, two conditions that may seriously disrupt sleep. However, there is no evidence that RLS or PLMD are risk factors for Parkinson’s disease."}, {"url": "http://www.rightdiagnosis.com/symptoms/sleeplessness/common.htm", "passage_text": "This information shows the various causes of Sleeplessness, and how common these diseases or conditions are in the general population. This is not a direct indication as to how commonly these diseases are the actual cause of Sleeplessness, but gives a relative idea as to how frequent these diseases are seen overall. The following causes of Sleeplessness are diseases or medical conditions that affect more than 10 million people in the USA: 1  COPD-sleeplessness. 2  Insomnia-sleeplessness. 3  Mental illness."}, {"url": "http://www.ninds.nih.gov/disorders/brain_basics/understanding_sleep.htm", "passage_text": "Sleeping problems are common in many other disorders as well, including Alzheimer's disease, stroke, cancer, and head injury. These sleeping problems may arise from changes in the brain regions and neurotransmitters that control sleep, or from the drugs used to control symptoms of other disorders. "}, {"url": "https://sleepfoundation.org/sleep-topics/parkinsons-disease-and-sleep", "passage_text": "As Parkinson’s disease progresses and symptoms get worse, sleep problems may become more serious. For example, pain and uncontrollable movements may cause severe insomnia. Nighttime symptoms may be improved by taking Parkinson’s medication later in the day or by taking hypnotic sleep aides. In addition, people with Parkinson’s disease are at higher risk for restless legs syndrome (RLS) and periodic leg movement disorder, two conditions that may seriously disrupt sleep. However, there is no evidence that RLS or PLMD are risk factors for Parkinson’s disease."}]