[{"url": "https://simple.wikipedia.org/wiki/Simple_aromatic_rings", "passage_text": "They are usually found as substructures of more complex molecules ( substituted aromatics). Typical simple aromatic compounds are benzene, indole, and cyclotetradecaheptaene. Simple aromatic rings with non-carbon ring atoms are called  heterocyclic . For example, rings can include oxygen, nitrogen, or sulfur. Molecules with one ring are called monocyclic as in benzene. Molecules with two rings are called bicyclic as in naphthalene. Molecules with more than two rings are called polycyclic as in anthracene. Simple monocyclic aromatic rings are usually five-membered rings like pyrrole or six-membered rings like pyridine. "}, {"url": "http://www.ilpi.com/msds/ref/aromatic.html", "passage_text": "1 An aromatic molecule or compound is one that has special stability and properties due to a closed loop of electrons. 2  Not all molecules with ring (loop) structures are aromatic. 3  A general scientific definition can be found below. For comparison, here are some molecules with ring structures that are not aromatic because they do not meet Hueckel'hückel S rule which requires that they have (2=n), 0 (6=n), 1 (10=n) 2 or (14=n) 3. etc-pi electrons in a: Ring MANY'pah s are extremely potent carcinogens or. mutagens"}, {"url": "http://www.oit.edu/docs/default-source/library-documents/library-publishing/che102-intro-organic-chemistry/chapter-3-12.pdf?sfvrsn=2", "passage_text": "The primary aromatic molecule is benzene whose structure is shown below. According to the naming rules we have given earlier, this would be named 1,3,5-cyclohexatriene. But it was named benzene by a German chemist at the time of its discover in 1833 and that name has been accepted as the systematic name. "}, {"url": "http://www.ilpi.com/msds/ref/aromatic.html", "passage_text": "For comparison, here are some molecules with ring structures that are not aromatic because they do not meet Hueckel'hückel S rule which requires that they have (2=n), 0 (6=n), 1 (10=n) 2 or (14=n) 3. etc-pi electrons in a: ring For comparison, here are some molecules with ring structures that are not aromatic because they do not meet Hueckel'hückel S rule which requires that they have (2=n), 0 (6=n), 1 (10=n) 2 or (14=n) 3. etc-pi electrons in a: Ring MANY'pah s are extremely potent carcinogens or. mutagens"}, {"url": "http://www.isis.stfc.ac.uk/science/biological-and-bio-medical-science/breakthrough-in-aromatic-molecule-research10853.html", "passage_text": "Breakthrough in aromatic molecule research. Benzene molecules have a simple ring structure with a ring of delocalised electrons either side of the molecule. These electron rings affect how molecules are arranged in relation to each other. View full-size image. In many cases the presence of the benzene-type functional unit in the drug molecule is essential for its biological activity, because the drug interacts with the target biological molecule (usually an enzyme), by aromatic π-π interactions."}, {"url": "http://www.isis.stfc.ac.uk/science/biological-and-bio-medical-science/breakthrough-in-aromatic-molecule-research10853.html", "passage_text": "Benzene molecules have a simple ring structure with a ring of delocalised electrons either side of the molecule. These electron rings affect how molecules are arranged in relation to each other. In many cases the presence of the benzene-type functional unit in the drug molecule is essential for its biological activity, because the drug interacts with the target biological molecule (usually an enzyme), by aromatic π-π interactions."}, {"url": "http://www2.chemistry.msu.edu/faculty/reusch/VirtTxtJml/react3.htm", "passage_text": "Benzene is the archetypical aromatic compound. It is planar, bond angles=120º, all carbon atoms in the ring are sp 2 hybridized, and the pi-orbitals are occupied by 6 electrons. The aromatic heterocycle pyridine is similar to benzene, and is often used as a weak base for scavenging protons. The six-membered ring in benzene is a perfect hexagon (all carbon-carbon bonds have an identical length of 1.40 A). å the cyclohexatriene contributors would be expected to show alternating bond, lengths the double bonds being (shorter.1 34) a å than the (single.bonds 1). 54 a å"}, {"url": "http://www.ilpi.com/msds/ref/aromatic.html", "passage_text": "Definition. 1  An aromatic molecule or compound is one that has special stability and properties due to a closed loop of electrons. 2  Not all molecules with ring (loop) structures are aromatic. 3  A general scientific definition can be found below. For comparison, here are some molecules with ring structures that are not aromatic because they do not meet Hueckel'hückel S rule which requires that they have (2=n), 0 (6=n), 1 (10=n) 2 or (14=n) 3. etc-pi electrons in a: Ring MANY'pah s are extremely potent carcinogens or. mutagens"}, {"url": "https://en.wikipedia.org/wiki/Aromaticity", "passage_text": "In terms of the electronic nature of the molecule, aromaticity describes the way a conjugated ring of unsaturated bonds, lone pairs of electrons, or empty molecular orbitals exhibit a stabilization stronger than would be expected by the stabilization of conjugation alone. In furan, the oxygen atom is sp² hybridized. One lone pair is in the π system and the other in the plane of the ring (analogous to C-H bond on the other positions). There are 6 π electrons, so furan is aromatic. Aromatic molecules typically display enhanced chemical stability, compared to similar non-aromatic molecules."}]