[{"url": "http://www.biography.com/people/jack-hanna-241514", "passage_text": "Zoo director, author, television personality and correspondent Jack Bushnell Hanna was born on January 2, 1947, in Knoxville, Tennessee. He is one of the best known animal experts, often appearing with wild creatures on a number of television shows, including his own, Jack Hanna's Animal Adventures. Because of his busy schedule, Hanna stepped down from running the day-to-day operations of the zoo in 1992 and became its director emeritus. After years of being a guest on many shows, he got his own syndicated program in 1993. Still popular, Jack Hanna's Animal Adventures has been on the air for almost fifteen years."}, {"url": "https://en.wikipedia.org/wiki/Jack_Hanna", "passage_text": "Jack Hanna was born in Knoxville, Tennessee. He grew up on his father's farm outside Knoxville, and volunteered for the family veterinarian, Dr. Roberts, when he was 11. He attended The Kiski School, an all-boys boarding school in Saltsburg, Pennsylvania, for high school, graduating in 1965. Hanna, nicknamed Jungle Jack, is known for his khaki safari outfit and deep tan."}, {"url": "http://www.biography.com/people/jack-hanna-241514", "passage_text": "Synopsis. Jack Hanna was born in Knoxville, Tennessee on January 2, 1947. The animal expert opened a pet store after college. He became Columbus Zoo's executive director in 1978 and began making TV appearances with zoo animals in the 1980s, appearing on shows like The Late Show with David Letterman and Larry King Live. Because of his busy schedule, Hanna stepped down from running the day-to-day operations of the zoo in 1992 and became its director emeritus. After years of being a guest on many shows, he got his own syndicated program in 1993. Still popular, Jack Hanna's Animal Adventures has been on the air for almost fifteen years."}, {"url": "https://en.wikipedia.org/wiki/Jack_Hanna", "passage_text": "Hanna published his autobiography, Monkeys on the Interstate in 1989. He has published many books for children as well. He has been the host of the syndicated television shows Jack Hanna's Animal Adventures (1993-2008), Jack Hanna's Into the Wild since 2007 and Jack Hanna's Wild Countdown since 2011. Hanna, nicknamed Jungle Jack, is known for his khaki safari outfit and deep tan."}, {"url": "http://www.youtube.com/watch?v=Fj_kiWuijx4", "passage_text": "Born Free USA's Adam Roberts debates Jack Hanna live on Good Morning America. This debate focused on the true value of keeping animals in zoos and was instigated by the mauling of three men, and death of one, by a tiger at the San Francisco Zoo in December 2007. 1  Pets & Animals. 2  Standard YouTube License. "}, {"url": "http://www.who2.com/bio/jack-hanna/", "passage_text": "Jack Hanna is a media savvy zoologist who makes frequent appearances on television talk shows and hosts his own syndicated series, Jack Hanna's Animal Adventures. Hanna got his start in the zoo business in Florida, but made his name as the director of Ohio's Columbus Zoo, a post he held from 1978 to 1992. "}, {"url": "http://www.browsebiography.com/bio-jack_hanna.html", "passage_text": "Email Print. John Bushnell Jack Hanna is an American zookeeper who is the Director Emeritus of the Columbus Zoo and Aquarium. He was Director of the zoo from 1978 to 1993, and is viewed as largely responsible for elevating its quality and reputation. "}, {"url": "https://en.wikipedia.org/wiki/Jack_Hanna", "passage_text": "His media appearances, particularly with Johnny Carson, David Letterman, and Maury Povich have made him one of the most notable animal experts in the United States. Hanna, nicknamed Jungle Jack, is known for his khaki safari outfit and deep tan."}, {"url": "http://www.imdb.com/name/nm0360208/", "passage_text": "Producer. Jack Hanna was born on January 2, 1947 in Knoxville, Tennessee, USA as John Bushnell Hanna. He is a producer, known for Jack Hanna's Into the Wild (2007), Animal Adventures (1992) and Late Show with David Letterman (1993). He has been married to Suzi Egli since December 20, 1968. They have three children. "}, {"url": "http://www.imdb.com/name/nm0360208/bio", "passage_text": "Mini Bio (1). Jack Hanna was born on January 2, 1947 in Knoxville, Tennessee, USA as John Bushnell Hanna. He is a producer, known for Jack Hanna's Into the Wild (2007), Animal Adventures (1992) and Late Show with David Letterman (1993). He has been married to Suzi Egli since December 20, 1968. They have three children. "}]