[{"url": "http://www.ign.com/boards/threads/is-the-wii-shop-channel-being-discontinued.453815855/", "passage_text": "Well their Wi-Fi on Wii and DS games are a joke (Super Smash Bros. Brawl had the worst of them all). lego_maniac said: ↑. No, the Wii Shop will still be functional. What they are disabling is the Nintendo Wi-Fi Connection that provided online gaming for Wii and DS games. Advertisement. I still need to get two more Virtual Console Arcade games; Shinobi and Golden Axe and a crapload of WiiWare games. BTW, I have both and Wii and Wii U and I buy stuff via Wii Mode."}, {"url": "https://en.wikipedia.org/wiki/Wii_Shop_Channel", "passage_text": "The Wii Channels section in the Wii Shop Channel was originally under the name of WiiWare in North America and Wii Software in Europe, before moving to its own dedicated space when WiiWare launched. On December 10, 2007 a gift feature was added to the Wii Shop Channel. This feature allows users to purchase and send games and channels to friends as gifts. Users select a title, select the gift option, and write a message to send with the gift."}, {"url": "https://en.wikipedia.org/wiki/Wii_Shop_Channel", "passage_text": "Software downloaded from the Wii Shop Channel is saved onto the Wii console's internal memory. After a download is complete, the new software appears on the Wii Menu as a channel. Software can be copied to SD cards or re-downloaded for free. On December 10, 2007 a gift feature was added to the Wii Shop Channel. This feature allows users to purchase and send games and channels to friends as gifts. Users select a title, select the gift option, and write a message to send with the gift."}, {"url": "https://en.wikipedia.org/wiki/WiiConnect24", "passage_text": "WiiConnect24 was a feature of the Nintendo Wi-Fi Connection for the Wii console. It was first announced at E3 Mid 2006 by Nintendo. It enabled the user to remain connected to the Internet while the console is on standby. Let's say your Wii is connected to the Internet in a mode that allows activation on a 24-hour basis. This would allow Nintendo to send monthly promotional demos for the DS, during the night, to the Wii consoles in each household."}, {"url": "http://www.gamefaqs.com/boards/631516-wii-u/64738254", "passage_text": "If you've got a Wii U, Wii mode is just a channel. There's one channel for Wii U games and one for Wii games. You go to that Wii channel, and the Wii shop channel is in there. "}, {"url": "https://en.wikipedia.org/wiki/Wii_Shop_Channel", "passage_text": "On March 25, 2009, the Wii Shop Channel was updated so that channels can be downloaded to and played directly from an SD card. On October 20, 2009, the Wii Shop Channel was updated so that demo versions of certain games could be purchased for free at different points in time. On December 10, 2007 a gift feature was added to the Wii Shop Channel. This feature allows users to purchase and send games and channels to friends as gifts. Users select a title, select the gift option, and write a message to send with the gift."}, {"url": "http://www.eurogamer.net/articles/2013-04-12-nintendo-shutting-down-wii-channels-and-online-services", "passage_text": "Nintendo will discontinue a bunch of online Wii services in June, the company has announced. You'll no longer be able to send and receive messages with other users via the Wii Message Board or access a number of Channel apps. The big switch-off will happen in the UK on 28th June, Nintendo confirmed to Eurogamer. For the chop are the Nintendo Channel, News Channel, Forecast Channel, Everybody Votes Channel and Mii Contest Channel. The News and Weather channels were kept updated for more than seven years, sniff. Notably, however, the Wii Shop Channel will remain open-for now. We at Nintendo sincerely thank you for your continued patronage of our company's products, said Mario. We apologise to those of you currently using these services, and ask for your understanding"}, {"url": "https://en.wikipedia.org/wiki/Wii_Shop_Channel", "passage_text": "The Wii Shop Channel is an online shop for the Wii video game console that allows users to download Virtual Console games, WiiWare games, and additional channels. On December 10, 2007 a gift feature was added to the Wii Shop Channel. This feature allows users to purchase and send games and channels to friends as gifts. Users select a title, select the gift option, and write a message to send with the gift."}, {"url": "http://www.answers.com/Q/Has_the_Wii_shop_closed", "passage_text": "You can get Zelda on the wii shop channel, but only on virtual console, so you need a gamecube controller or a wii classic controller to play them. The wii shop channel is by default give to you when you purchase your Nintendo Wii :D You can even buy a browser to browse the net for free from the channel :D Hope this helps … . 2 people found this useful."}]