[{"url": "http://www.top10homeremedies.com/how-to/how-to-get-rid-of-a-double-chin.html", "passage_text": "To get rid of a double chin, it is essential to keep your facial muscles toned and give the muscles in your jaw line a workout. One of the best ways to do that is to chew sugarless gum. Sugar free chewing gum can even help you maintain healthy teeth and gums. 4. Egg Whites. An egg white mask can be of great help in getting rid of a double chin because it has a skin tightening effect. Egg whites are also good for the overall health of the skin. 1  Whisk together two egg whites, one tablespoon each of milk, honey and lemon juice. 2  Add a few drops of peppermint essential oil."}, {"url": "http://www.3fatchicks.com/4-fast-ways-to-get-rid-of-a-double-chin/", "passage_text": "1. Chin Exercises. There are several chin exercises that you can do if you wish to get rid of your double chin. For the first exercise, begin by opening your mouth wide. Next, move your lower jaw in a downward and outward direction as though you are trying to “scoop” something with your lower jaw. Another easy exercise that you can do to reduce the appearance of your double chin is to raise your chin and move your mouth as though you are chewing. If you cannot do the chewing motion, a simple closing-and-opening motion is enough. You will gradually feel the muscles in your neck and jaw tensing."}, {"url": "http://www.ehow.com/how_5691060_rid-chin-flab.html", "passage_text": "Once your head is facing the ceiling, start to open and close your mouth as if you are chewing gum. This exercises the jaw and the area around your chin. You can find more exercises that get rid of chin flab at www.double-chin.com. Exercise daily to burn off calories and fat. Getting plenty of cardiovascular exercise daily helps burn off excess around the chin and anywhere else on the body that is storing stubborn fat. Make a 30 to 60 minute jog or power walk a part of your daily exercise routine. Avoid fatty junk foods."}, {"url": "http://www.ehow.com/how_5691060_rid-chin-flab.html", "passage_text": "Instructions. Perform specific mouth and jaw exercises designed to burn off fat around the chin. Such exercises are simple, and you can perform them without special devices or equipment. One effective chin exercise consists of you standing upright and tilting your head back as far as you can. Exercise daily to burn off calories and fat. Getting plenty of cardiovascular exercise daily helps burn off excess around the chin and anywhere else on the body that is storing stubborn fat. Make a 30 to 60 minute jog or power walk a part of your daily exercise routine. Avoid fatty junk foods."}, {"url": "http://www.top10homeremedies.com/how-to/how-to-get-rid-of-a-double-chin.html", "passage_text": "Glycerin. You can also make a natural mask with glycerin to get rid of a double chin. 1  Make a mask by mixing one tablespoon of glycerin, one-half tablespoon of Epsom salt and a few drops of peppermint oil. 2  Use a cotton pad to apply it on the neck and chin area. 3  Leave it on for several minutes so that it absorbs into the skin. 4. Egg Whites. An egg white mask can be of great help in getting rid of a double chin because it has a skin tightening effect. Egg whites are also good for the overall health of the skin. 1  Whisk together two egg whites, one tablespoon each of milk, honey and lemon juice. 2  Add a few drops of peppermint essential oil."}, {"url": "http://www.enformy.com/", "passage_text": "Other High Fat Foods. Avoid foods high in fat to get rid of your double chin. Look at the nutritional information on the foods you eat. When you go out to a restaurant, stick with salads and plant-based meals instead of fatty pastas, meat dishes and other foods. "}, {"url": "http://www.fitday.com/fitness-articles/fitness/weight-loss/how-to-get-rid-of-that-pesky-double-chin.html", "passage_text": "Add other double chin exercises to your workout to help stretch and tone the muscles of the jaw, face and neck. Try performing this exercise 10 to 15 times during your workouts: 1  Assume a standing or seated position. 2  Tilt your head back until you're looking skyward. 3  Pucker your lips, as if for a kiss. These exercises can keep skin from sagging to reduce the appearance of a double chin. The best double chin exercise works on the platysma, the muscle that runs from the jawline all the way down to your shoulder. Follow these steps to work the platysma: 1  Open your mouth wide."}, {"url": "http://www.top10homeremedies.com/how-to/how-to-get-rid-of-a-double-chin.html", "passage_text": "2. When cocoa butter is used regularly, it will improve the elasticity of your skin and help get rid of your double chin. 1  Slightly warm a few tablespoons of cocoa butter in the microwave. 2  Gently massage the warm oil into your neck and double chin for several minutes. 4. Egg Whites. An egg white mask can be of great help in getting rid of a double chin because it has a skin tightening effect. Egg whites are also good for the overall health of the skin. 1  Whisk together two egg whites, one tablespoon each of milk, honey and lemon juice. 2  Add a few drops of peppermint essential oil."}, {"url": "http://www.aworkoutroutine.com/how-to-lose-face-fat/", "passage_text": "So, if you want to get rid of your double chin, chubby cheeks, and overall fat looking face, you’re just going to have to lose fat, period. No amount of pointless face exercises (or anything equally dumb) will do anything but make you look like an idiot. Or really, an idiot with a fat face. This workout routine is scientifically proven to help: 1  Get rid of your double chin. 2  Turn a triple chin into just a double chin. 3  Reduce the size of your chubby cheeks. 4  Create a more chiseled jaw line. 5  Produce more prominent cheek bones. 6  Give you a thinner"}]