[{"url": "http://www.babynamespedia.com/meaning/Kako", "passage_text": "[ 2 syll. ka-ko, kak-o ] The baby girl name Kako is pronounced as K AA-Kow- †. Kako is used predominantly in the Japanese language and it is also derived from Japanese origins. The meaning of the name is summer rainbow. Kako is a variation of the name Keiko (English and Japanese). Kako is unusual as a baby girl name. It is not listed in the top 1000"}, {"url": "http://japanese.about.com/od/wordoftheday/p/word192.htm", "passage_text": "Word of the Day: kako. Pronunciation: Click here to listen to the audio file. Meaning: the past; the past days. Japanese characters: 過去　（かこ）. Example: Kako o furikaette bakari dewa ikenai. "}, {"url": "http://www.meaning-of-names.com/search/", "passage_text": "Use the search tools above to find names and meanings. You can enter complete names or partial beginnings to search name variations. "}, {"url": "http://meaning-of-names.com/", "passage_text": "Name Meanings and History One of the things that all people and places have in common is (NAMES). Have you ever asked yourself, What does my name mean?. Even if you are here just to browse, we hope that you will enjoy a unique spin on a fascinating study field. We offer name meanings for over 45,000 different baby names, surnames, and city names from all over the world. We are in the process of building many tools and resources to help make your studies easier. We invite you to contribute name meanings, ratings, comments, participate in our forums, or contribute facts and information to our growing community. Here is a great resource if you are looking for-Baby Names"}, {"url": "http://zelo.com/", "passage_text": "Name-Stats.com. Find out how popular your name is and was in years past in countries all over the globe. This web site includes first names and last names from countries such as American Names, British Names, Swedish Names, French Names, Belgium Names, and more! So if you have ever wondered about the popularity of your name or are looking for a popular baby name, this is the site for you!"}, {"url": "http://www.searchforancestors.com/surnames/origin/", "passage_text": "What does my surname mean?. If you have ever asked this question and wondered about the origin of your last name, you will find your surname may answer one of the questions of where your ancestors lived, or what they did for a living, or what was their personality like, or how they looked many hundreds of years ago. The use of a surname was originally adopted in order to distinguish two individuals with the same first name, and, at first, these last names were not passed down to the next generation. In Europe, the first surnames were first used about eight hundred"}, {"url": "http://www.behindthename.com/submit/names/usage/japanese/3", "passage_text": "The Japanese word for Future which has become more popular as a name since the '80s, primarily for females... [more]. MIRIYA f Japanese. MIROKU m & f Japanese. The name Miroku is the Japanese name for Maitreya, the Buddha of the Future... [more]. MIROKUMARU m & f Japanese. Means Matreiya Cycle in Japanese... A hundred stars. MONAMI f Japanese (Modern). This name can be used as 萌波 or 萌南 with 萌 (hou, kiza.shi, mebae, mo.eru) meaning bud, malt, sprout, 波 (ha, nami) meaning billows, Poland, waves and 南 (na, nan, minami, nami) meaning south...."}, {"url": "http://www.ancestry.com/learn/facts/", "passage_text": "Discover your family history in millions of family trees and more than 11 billion birth, marriage, death, census, and military records. Search historical records. Start a free family tree online and let us do the searching for you! You'll get hints when we find info that matches your relatives. "}]