[{"url": "http://www.livestrong.com/article/40341-sources-astaxanthin/", "passage_text": "The pigment responsible for giving seafood and crustaceans their pink to red hue, astaxanthin acts as a powerful antioxidant. It belongs to the carotenoid nutrient family -- the same one that includes beta carotene, a source of vitamin A. Astaxanthin isn't an essential nutrient, but it can benefit your health. You'll find it in several foods, primarily of marine origin, including seafood, microalgae and yeast. The most potent naturally occurring source of astaxanthin may be Haematococcus pluvialis, a very small algae, or microalgae, found in marine environments."}, {"url": "http://www.nutrex-hawaii.com/natural-sources-of-astaxanthin", "passage_text": "Proteins that are high in astaxanthin include sockeye salmon, red trout, red seabream, lobster, shrimp, crawfish, crabs, and salmon roe. In the animal kingdom, Astaxanthin is found in its highest concentration in Wild Pacific sockeye salmon. It is also found in krill, algae, red trout, shrimp, crab and lobster. Wild-caught Pacific sockeye salmon, for example, has 400% higher levels of astaxanthin than their farm-raised counterparts."}, {"url": "http://www.ehow.com/about_5595083_foods-containing-astaxanthin.html", "passage_text": "Save. Image by Flickr.com, courtesy of LFL16. Astaxanthin is a red-pigmented carotenoid, a member of the family of chemicals that colors fruits and vegetables. FDA approved, it is used in some fish and animal foods as a dye to give it reddish color. It is also considered to be food coloring by the European Union. Seafood. Shellfish and seafood such as lobsters, crab and shrimp, all of which contain astaxanthin, get their reddish-pink color from it and offer a dietary change from fish. Farmed seafood shows lower levels of astaxanthin per gram than seafood caught in the wild."}, {"url": "http://www.growyouthful.com/tips/astaxanthin.php", "passage_text": "Astaxanthin sources. Astaxanthin-Australian distributor. The richest natural food sources of astaxanthin are red or pink fish, seafoods and algae sourced from the sea. Wild sockeye salmon has the highest concentration, with a 100gm (3.5oz) serving providing 4mg. Other species of salmon provide only one third to one tenth of this dose. Problems with carotenoid supplementation. People consuming diets rich in carotenoids from foods such as fruits, vegetables and wild red or pink-coloured fish and shellfish are healthier and have lower mortality from a number of chronic illnesses (2)."}, {"url": "http://astaxanthin.wellwise.org/astaxanthin/salmon", "passage_text": "The super antioxidant astaxanthin is available is certain foods. Astaxanthin is found in many common foods, including: • shrimp. • crabs. • lobster (astaxanthin was first isolated in a laboratory in 1938 from lobster). • trout. • red seabream. • salmon. • fish eggs. • carrots. • red peppers. • other red-pigmented vegetables and fruits. Among these astaxanthin food sources, wild caught salmon has the highest content of astaxanthin. It should be noted, however, that in order to get 3.6 mg of astaxanthin you would have to eat approximately 6 ounces (165 grams) of salmon every day. "}, {"url": "http://www.naturalmedicinejournal.com/journal/2012-02/astaxanthin-review-literature", "passage_text": "1 Astaxanthin may interact with calcium (and foods containing calcium), carotenoids (and foods containing carotenoids), herbs and supplements for the heart, hormonal herbs and supplements, immunosuppressants, and saw palmetto. 1 Astaxanthin is a naturally occurring carotenoid found in nature primarily in marine organisms such as microalgae, salmon, trout, krill, shrimp, crayfish, and crustaceans. 2  The green microalga Haematococcus pluvialis is considered the richest source of astaxanthin."}, {"url": "http://www.livestrong.com/article/40341-sources-astaxanthin/", "passage_text": "Salmon is a potent food source of astaxanthin, ranging in content from 4 to 40 milligrams per kilogram. The highest concentrations can be found in Pacific salmon, relative to Atlantic salmon. Fish that have developed in the wild may also have higher concentrations than their farmed counterparts. You'll find it in several foods, primarily of marine origin, including seafood, microalgae and yeast. The most potent naturally occurring source of astaxanthin may be Haematococcus pluvialis, a very small algae, or microalgae, found in marine environments."}, {"url": "http://www.webmd.com/vitamins-and-supplements/astaxanthin", "passage_text": "In this article. Astaxanthin is a carotenoid, a chemical found naturally in certain plants and animals. A type of algae makes astaxanthin. This algae is used as a source for the astaxanthin in supplements. Some types of seafood also contain astaxanthin. Astaxanthin is an antioxidant. That means it helps reduce a natural process in your body called oxidation. This process may play a role in many diseases and changes such as: 1  Aging. 2  Cancer. 3  Heart disease. 4  Eye diseases like cataracts and macular degeneration. 5  Alzheimer's disease. 6  Parkinson"}]