[{"url": "http://www.educationchoices.com/Education-Articles/Business-Administration/How-Much-Does-a-Business-Administrator-Make-Per-Year.htm", "passage_text": "For employees with a master’s degree you can expect to earn between $ 73,000.00 and $ 112,000.00. A doctorate is the highest level of educational achievement offered from any educational institution. Once an individual acquires their doctorate, they will then have the prefix of PhD. The majority of doctorate programs are an additional 2-3 years after the completion of a master’s degree program. There are an ample amount of salaries that can be earned by a business administrator. Based on the amount of experience that you can earn, your salary will vary."}, {"url": "http://work.chron.com/much-money-executive-assistant-make-9754.html", "passage_text": "Best-Paying Industries. Securities and commodities exchanges were where executive assistants could find the best wages, according to the BLS, with the average salary reaching $65,310, or $31.40 an hour. The U.S. Postal Service was the second-best paying option at $63,210, or $30.39 an hour, on average. According to the U.S. Bureau of Labor Statistics, the 952,030 executive assistants working nationwide as of May 2011 earned an average annual wage of $48,120, or $23.13 an hour."}, {"url": "http://www.businessadministrationcareer.org/Business-Administration-Salary.html", "passage_text": "An administrative assistant or an executive administrative assistant makes an average of $30,936-$52,083. Several factors will affect a business administration degree holder's salary including employer, years of experience and city/state the job is located in. Establishing yourself as a business administration professional is the first step to a financially rewarding career. From your first post graduate job to your last before retiring, a business administration salary can vary, with the average salary being $50,000 according to the U.S. Bureau of Labor Statistics. If you want a career in business administration, here are some guidelines in accordance with each degree level earned"}, {"url": "http://www.ehow.com/info_8374932_much-business-administrator-make-year.html", "passage_text": "BLS data show that the average annual income of administrative service managers was $81,530 in May 2009, which translates to an hourly wage of $39.20. The top 10 percent of income earners in the occupation made $131,730 or more, while the bottom 10 percent earned $38,690 or less. General and operations managers are high-level business administrators who work with the CEO to help formulate and implement company policy. The BLS states that the average annual income of general and operations managers was $110,550 in May 2009. The top 25 percent of income earners in the field made $138,960 or more, while the bottom 25 percent made $63,750 or less. The average hourly income of workers in the occupation was $53.15"}, {"url": "http://www.businessadministrationcareer.org/Business-Administration-Salary.html", "passage_text": "Expect to make an average of $50,000 the first year after graduating with a business degree, and as much as $150,000 for a CEO position. Associate/Bachelor Degree. Graduates with an associate's degree in business administration can expect a starting salary of $25,000-$35,000 per year depending on the field they are in. Establishing yourself as a business administration professional is the first step to a financially rewarding career. From your first post graduate job to your last before retiring, a business administration salary can vary, with the average salary being $50,000 according to the U.S. Bureau of Labor Statistics. If you want a career in business administration, here are some guidelines in accordance with each degree level earned"}, {"url": "http://www.educationchoices.com/Education-Articles/Business-Administration/How-Much-Does-a-Business-Administrator-Make-Per-Year.htm", "passage_text": "A bachelor’s degree can be offered from a 4-year university that will immerse you in all of the knowledge required to become a business administrator. Those with a bachelor’s degree can expect to earn a better wage than employees with an associate degree. The majority of doctorate programs are an additional 2-3 years after the completion of a master’s degree program. There are an ample amount of salaries that can be earned by a business administrator. Based on the amount of experience that you can earn, your salary will vary."}, {"url": "http://www.educationchoices.com/Education-Articles/Business-Administration/How-Much-Does-a-Business-Administrator-Make-Per-Year.htm", "passage_text": "For those with an associate degree, they can expect to earn between $ 25,000.00 and $ 50,000.00. Depending on the position that you earn within a company, this value may vary. As an example, those who work as an executive assistant may earn less than an office manager. The majority of doctorate programs are an additional 2-3 years after the completion of a master’s degree program. There are an ample amount of salaries that can be earned by a business administrator. Based on the amount of experience that you can earn, your salary will vary."}]