[{"url": "http://www.whoinventedit.net/who-invented-the-typewriter.html", "passage_text": "The First Model. That is why we need to give credit to Christopher Latham Sholes, an American mechanical engineer, who was able to invent the first known practical modern typewriter in 1866 together with some colleagues, Samuel Soule soulé And Carlos. glidden"}, {"url": "http://www.questionswithanswer.com/who/Who-invented-the-first-typewriter.html", "passage_text": "Christopher Latham Sholes (1819 1890), a U.S mechanical engineer, invented the first practical modern typewriter with his partners S.W Soule and G.Glidden in 1866. The invention was patented in 1868, and was manufactured (by Remington Arms Company) in 1873. The first electric typewriter was the Blickensderfer. In 1944, IBM designed the first typewriter with proportional spacing. Pellegrine Tarri made the first typewriter proven to work in 1801 and invented carbon paper in 1808."}, {"url": "https://en.wikipedia.org/wiki/Christopher_Latham_Sholes", "passage_text": "Christopher Latham Sholes (February 14, 1819 – February 17, 1890) was an American inventor who invented the first practical typewriter and the QWERTY keyboard still in use today. He was also a newspaper publisher and Wisconsin politician. Typewriters had been invented as early as 1714 by Henry Mill and reinvented in various forms throughout the 1800s. It was to be Sholes, however, who invented the first one to be commercially successful."}, {"url": "http://www.answers.com/Q/Who_invented_the_first_typewriter", "passage_text": "The first typewriter, a invention made by the Austrian carpenter Peter Mitterhofer in 1864, can be seen at the technical museum in Vienna (Austria). Christopher Latham Shole … s also invented a typewriter. Sholes was a U.S. mechanical engineer who invented the first practical modern typewriter, patented in 1868. The first commercially sold typewriter seems to be the Hansen Writing Ball, … which was sold in Denmark in 1865. The first typewriter to be commercially successful was invented in 1867 by C. Latham Sholes, Carlos Glidden and Samuel W. Soule in Milwaukee, Wisconsin, USA. The patent was sold to Remington. Remington's first commercial machine appeared in 1873. It was also the first appearance of the QWERTY keyboard"}, {"url": "http://theinventors.org/library/inventors/bltypewriter.htm", "passage_text": "Early Typewriter History. The first practical typewriter was invented by Christopher Latham Sholes, and was marketed by the Remington Arms company in 1873. The first practical typewriter was conceived by three American inventors and friends in 1867: Christopher Latham Sholes, Carlos Glidden, and Samual W. Soule. The First American Typewriter Patent. The first American patent for a typewriter was granted in 1829 to William Austin Burt from Detroit."}, {"url": "http://theinventors.org/library/inventors/bltypewriter.htm", "passage_text": "Christopher Latham Sholes(1819-1890). Sholes was a U.S. mechanical engineer who invented the first practical modern typewriter, patented in 1868. Sholes invented the typewriter with partners S. W. Soule and G. Glidden, that was manufactured (by Remington Arms Company) in 1873. The first practical typewriter was conceived by three American inventors and friends in 1867: Christopher Latham Sholes, Carlos Glidden, and Samual W. Soule. The First American Typewriter Patent. The first American patent for a typewriter was granted in 1829 to William Austin Burt from Detroit."}, {"url": "https://en.wikipedia.org/wiki/Typewriter", "passage_text": "The first typewriter to be commercially successful was invented in 1868 by Americans Christopher Latham Sholes, Carlos Glidden and Samuel W. Soule in Milwaukee, Wisconsin, although Sholes soon disowned the machine and refused to use, or even to recommend it. Notable typewriter manufacturers included E. Remington and Sons, IBM, Imperial Typewriters, Oliver Typewriter Company, Olivetti, Royal Typewriter Company, Smith Corona, Underwood Typewriter Company, Adler and Olympia Werke."}, {"url": "http://www.answers.com/Q/Who_invented_the_first_typewriter", "passage_text": "Christopher Latham Sholes (1819-1890) invented the typewriter in 1867. Sholes was a U.S. mechanical engineer who invented the first practical modern typewriter, patented in … 1868. Sholes invented the typewriter with partners S. W. Soule and G. Glidden, that was manufactured (by Remington Arms Company) in 1873. The first commercially sold typewriter seems to be the Hansen Writing Ball, … which was sold in Denmark in 1865. The first typewriter to be commercially successful was invented in 1867 by C. Latham Sholes, Carlos Glidden and Samuel W. Soule in Milwaukee, Wisconsin, USA. The patent was sold to Remington. Remington's first commercial machine appeared in 1873. It was also the first appearance of the QWERTY keyboard"}, {"url": "http://ideafinder.com/history/inventions/typrwriter.htm", "passage_text": "Finally, in 1867, a Milwaukee, Wisconsin printer-publisher-politician named Christopher Latham Sholes, with assistance from Carlos Glidden and Samuel Soule, patented what was to be the first useful typewriter. He licensed his patent to Remington & Sons of Ilion, New York, a noted American gun maker. ARY, typewriter, type-writing machine, type writing machine, SIP, history, biography, inventor, invention. The Story: The idea behind the typewriter was to apply the concept of movable type developed by Johann Gutenberg in the invention of the printing press century to a machine for individual use."}]