[{"url": "https://en.wikipedia.org/wiki/C57BL/6", "passage_text": "C57BL/6, often referred to as C57 black 6, C57 or black 6 (standard abbreviation: B6), is a common inbred strain of laboratory mouse. It is the most widely used genetic background for genetically modified mice for use as models of human disease. They are the most widely used and best-selling mouse strain, due to the availability of congenic strains, easy breeding, and robustness. C57BL/6 mice have a dark brown, nearly black coat. They are more sensitive to noise and odours and are more likely to bite than the more docile laboratory strains such as BALB/c. They are good breeders."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/T/TransgenicAnimals.html", "passage_text": "If the replacement gene (A* in the diagram) is nonfunctional (a null allele), mating of the heterozygous transgenic mice will produce a strain of  knockout mice  homozygous for the nonfunctional gene (both copies of the gene at that locus have been knocked out). "}, {"url": "https://en.wikipedia.org/wiki/C57BL/6", "passage_text": "The C57BL/6 mouse was the second-ever mammalian species to have its entire genome published. The dark coat makes the mouse strain convenient for creating transgenic mice: it is crossed with a light-furred 129 mouse, and the desirable crosses can be easily identified by their mixed coat colors. C57BL/6 mice have a dark brown, nearly black coat. They are more sensitive to noise and odours and are more likely to bite than the more docile laboratory strains such as BALB/c. They are good breeders."}, {"url": "http://www.med.umich.edu/tamc/tgoutline.html", "passage_text": "Introduction. This is a brief outline of the steps necessary to obtain transgenic mice or transgenic rats. Simply put, the investigator constructs a transgene with a promoter and a structural gene (for example a reporter gene such as lacZ or a transcription factor). DNA is prepared and microinjected into fertilized mouse eggs. Potentially transgenic mice or rats are born."}, {"url": "http://isogenic.info/html/mouse_strains.html", "passage_text": "The International Mouse Strain Resource (IMSR) .. is a searchable online database of mouse strains and stocks available worldwide, including inbred, mutant, and genetically engineered mice. The goal of the IMSR is to assist the international scientific community in locating and obtaining mouse resources for research. This is based on a PubMed search of the number of papers using the designated strain or stock for the years 2001-2005. Note that genetically defined (inbred, transgenic, knockout and congenic) mice were cited on about 2/3rds of occasions, but many of these will have had an inbred strain genetic background."}, {"url": "http://learn.genetics.utah.edu/content/science/transgenic/", "passage_text": "Read Mario's story. During the 1980s, Capecchi devised a way to change or remove any single gene in the mouse genome, creating strains of mice that pass the altered gene from parent to offspring. In the years since, these transgenic and knockout mice have become commonplace in the laboratory. "}, {"url": "http://www.findmice.org/", "passage_text": "International Mouse Strain Resource (IMSR). Welcome to the IMSR. The IMSR is a searchable online database of mouse strains, stocks, and mutant ES cell lines available worldwide, including inbred, mutant, and genetically engineered strains. The goal of the IMSR is to assist the international scientific community in locating and obtaining mouse resources for research. "}, {"url": "http://cellmigration.org/resource/komouse/komouse_approaches.shtml", "passage_text": "Transgenic Mice. One of the simplest ways to study gene function in a mouse is exogenous expression of a protein in some or all tissues. For this type of genetic modification, a new piece of DNA is introduced into the mouse genome."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1526054205000850", "passage_text": "Summary. For the past 20 years researchers have used transgenic mice to help understand the basic mechanisms associated with inherited human and animal diseases. The ability to integrate exogenous genetic information into the mouse genome has revolutionised the analysis of gene function."}, {"url": "https://en.wikipedia.org/wiki/Transgenic_mouse", "passage_text": "A genetically modified mouse (Mus musculus) is a mouse that has had its genome altered through the use of genetic engineering techniques. Genetically modified mice are commonly used for research or as animal models of human diseases. In 1974 Rudolf Jaenisch created the first genetically modified animal by inserting a DNA virus into an early-stage mouse embryo and showing that the inserted genes were present in every cell."}]