[{"url": "https://answers.yahoo.com/question/index?qid=20090422201212AAhbVRC", "passage_text": "Therefore, one gets net bone loss, and decreased opacity (increased lucency) of the bone. Decreased Opacity (Lucency) Lucency comes in several flavors. Depending on the exact morphology and distribution of the lucency, our differential diagnosis may vary widely. Both osteoclasts (removers of bone) and osteoblasts (formers of bone) participate in this reaction. In normal bone, the clasts and blasts are more or less in equilibrium, and new bone is formed at the same rate that old bone is reabsorbed."}, {"url": "http://www.answers.com/Q/What_does_lucency_mean", "passage_text": "Their is the  possessive pronoun of them or themselves. …  They're is a contraction or shortening of 'they are'.     The homophone of there/their/they're      There refers to some place.   Their  is the possessive pronoun of them or themselves.   They're is a contraction or shortening of 'they are'.   . Their means belonging to people or things previously mentioned or  easily identified (Your parents do not look similar, except for  their noses)."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=51399", "passage_text": "lucency. Definitions: 1. In radiology, a region in an image caused by an absorber of lower x-ray attenuation than its surrounding tissues; in general, the opposite of opacity. The definition information for lucency is provided by Stedman's. You can search our medical dictionary here."}, {"url": "http://www.answers.com/Q/What_does_lucency_mean", "passage_text": "Lucency is a technical term for an area that lets x-rays through tissue and appears darker on the picture. Peri-screw lucency is a result of having had a peri-screw insert … ed into the bone, possibly due to an accident. 1 person found this useful. They're is a contraction or shortening of 'they are'.   . Their means belonging to people or things previously mentioned or  easily identified (Your parents do not look similar, except for  their noses)."}, {"url": "https://answers.yahoo.com/question/index?qid=20090422201212AAhbVRC", "passage_text": "Bones Abnormalities of bone usually fall into one of the following categories: · Abnormal opacity o decreased (lucency) o increased (sclerosis) · Abnormal contour · Abnormal size & shape Abnormal Opacity When bone is afflicted by some disorder, the bone reacts to it. Both osteoclasts (removers of bone) and osteoblasts (formers of bone) participate in this reaction. In normal bone, the clasts and blasts are more or less in equilibrium, and new bone is formed at the same rate that old bone is reabsorbed."}, {"url": "http://www.justanswer.com/health/11k6n-layman-terms-does-mean-i-fracture.html", "passage_text": "In layman terms what does this mean....I have a fracture of the distal radical metaepiphysis but they also found a sclerosis demonstrated posteriorly within the medullary canal of the distal radius and an area of lucency adjacent to this that is measuring 1 cm. there are no other osseous abnormalties demonstrated. Or it could mean that a fracture of the bone has lead to infection which is showing up as the areas of sclerosis and lucency. I hope this helps. Let me know if you need more input. If not, please click on the greenAccept button on this page. Adding a bonus and a positive feedback will be warmly appreciated."}, {"url": "https://answers.yahoo.com/question/index?qid=20081104142252AAkF7so", "passage_text": "Best Answer: lucency or opaqueness is the degree of blackness of a structure (bone or tissue) in a Radiograph. If bones becomes darker they loss calcium and become more poress (holes with air) and thus, look darker as air or fat looks dark in a Radiograph. Report Abuse. The term lucent or lucency is used to describe a focal area of bony osteopenia--for example, a bone cyst or a lucency (fracture line). This would also be affected by age and gender. I would ask your doctor for more details. myjoy2go · 7 years ago"}, {"url": "http://www.healthboards.com/boards/cancer/132933-lucency-cat-scan-what-does-mean.html", "passage_text": "A lucency just means a dark area on the x-ray/CT as opposed to an opacity (which is a white area). I'm not sure what type of CT scan you got (i.e. with or without contrast injection), but don't jump to conclusions about it being cancer..... "}]