[{"url": "https://secularhumanism.org/index.php/3260", "passage_text": "A naturalistic philosophy. Secular humanism is philosophically naturalistic. It holds that nature (the world of everyday physical experience) is all there is, and that reliable knowledge is best obtained when we query nature using the scientific method."}, {"url": "https://www.secularhumanism.org/index.php/13", "passage_text": "Secular humanism emerges, then, as a comprehensive nonreligious life stance that incorporates a naturalistic philosophy, a cosmic outlook rooted in science, and a consequentialist ethical system. That is the definition I offer."}, {"url": "http://americanhumanist.org/Humanism/Definitions_of_Humanism", "passage_text": "Humanism is an approach to life based on reason and our common humanity, recognizing that moral values are properly founded on human nature and experience alone. • The Bristol Humanist Group. Humanism is: A joyous alternative to religions that believe in a supernatural god and life in a hereafter."}, {"url": "http://americanhumanist.org/Humanism/What_is_Humanism", "passage_text": "1 Humanism is a philosophy of compassion. 2  Humanist ethics is solely concerned with meeting human needs and answering human problems-for both the individual and society-and devotes no attention to the satisfaction of the desires of supposed theological entities."}, {"url": "http://americanhumanist.org/Humanism/Definitions_of_Humanism", "passage_text": "Humanism is a rational philosophy informed by science, inspired by art, and motivated by compassion. Affirming the dignity of each human being, it supports the maximization of individual liberty and opportunity consonant with social and planetary responsibility."}, {"url": "https://www.secularhumanism.org/index.php/13", "passage_text": "A Secular Humanist Definition. We can now attempt our definition of secular humanism. Secular humanism begins with atheism (absence of belief in a deity) and agnosticism or skepticism (epistemological caution that rejects the transcendent as such due to a lack of evidence)."}, {"url": "http://www.nysec.org/ethical-humanist", "passage_text": "The Ethical Humanist Award is the Society's highest honor. The Award was established in 1970 to honor an individual who has acted with extraordinary moral courage, without regard for the sanction or acclaim of his or her peers or of society, and whose actions have had broad humanizing implications."}, {"url": "http://americanhumanist.org/Humanism/What_is_Humanism", "passage_text": "Modern Humanism, also called Naturalistic Humanism, Scientific Humanism, Ethical Humanism, and Democratic Humanism, is defined by one of its leading proponents, Corliss Lamont, as a naturalistic philosophy that rejects all supernaturalism and relies primarily upon reason and science, democracy and human compassion.."}, {"url": "http://www.bbc.co.uk/religion/religions/atheism/types/humanism.shtml", "passage_text": "Humanism is an approach to life based on reason and our common humanity, recognising that moral values are properly founded on human nature and experience alone. While atheism is merely the absence of belief, humanism is a positive attitude to the world, centred on human experience, thought, and hopes. The British Humanist Association and The International Humanist and Ethical Union use similar emblems showing a stylised human figure reaching out to achieve its full potential."}]