[{"url": "http://medical-dictionary.thefreedictionary.com/retroperitoneal", "passage_text": "retroperitoneal. behind the peritoneum. retroperitoneal abscess. characterized by fever and toxemia, chronic or intermittent colic in horses, weight loss and a positive paracentesis sample. See also pelvic abscess and mesenteric abscess. "}, {"url": "http://www.mananatomy.com/digestive-system/retroperitoneal-space", "passage_text": "Retroperitoneal space is the anatomical space in the abdominal cavity behind the parietal peritoneum. It extends from the 12 th thoracic vertebra and 12 th rib above to the sacrum and iliac crest below. The floor of the space, that is the posterior wall of the abdomen in this region, is formed by; 1  Psoas muscle. "}, {"url": "http://medical-dictionary.thefreedictionary.com/retroperitoneal+space", "passage_text": "retroperitoneal space. the space between the peritoneum and the dorsal abdominal wall. retropharyngeal space. the space behind the pharynx, containing areolar tissue. subarachnoid space. the space between the arachnoid and the pia mater, containing cerebrospinal fluid. subdural space. the space between the dura mater and the arachnoid. retroperitoneal space the space between the peritoneum and the posterior abdominal wall. retropharyngeal space the space behind the pharynx, containing areolar tissue. subarachnoid space"}, {"url": "http://medical-dictionary.thefreedictionary.com/retroperitoneal+space", "passage_text": "proximal space (proximate space) interproximal space. retroperitoneal space the space between the peritoneum and the posterior abdominal wall. retropharyngeal space the space behind the pharynx, containing areolar tissue. subarachnoid space the space between the arachnoid and the pia mater, containing cerebrospinal fluid."}, {"url": "http://www.answers.com/Q/What_are_retroperitoneal_organs", "passage_text": "Answer by Ceyhun erdogan. Retroperitoneal organs are found behind the peritoneum, between it and the abdominal wall. These include the kidneys, adrenals, and pancreas. "}, {"url": "http://www.wisegeek.com/what-is-the-retroperitoneal-space.htm", "passage_text": "Top 10 facts about the world. The retroperitoneal space is the part of the abdominal cavity that lies behind the peritoneum, a membrane that typically lines the inside of the abdomen. Various organs are supported by this membrane, which also serves as a tract for many nerves as well as blood and lymph vessels. "}, {"url": "http://www.premierrad.com/ultrasound-abdominal", "passage_text": "Abdominal/Retroperitoneal Ultrasound. An Abdominal Ultrasound produces a picture of the organs and other structures in the upper abdomen, encompassing the liver, gallbladder, spleen, pancreas, aorta, both kidneys and the bladder, through the use of high frequency sound waves that are displayed in a real time image. "}, {"url": "http://medical-dictionary.thefreedictionary.com/retroperitoneal+space", "passage_text": "retroperitoneal space. n. The space between the parietal peritoneum and the muscles and bones of the posterior abdominal wall. retroperitoneal space the space between the peritoneum and the posterior abdominal wall. retropharyngeal space the space behind the pharynx, containing areolar tissue. subarachnoid space the space between the arachnoid and the pia mater, containing cerebrospinal fluid."}, {"url": "http://www.healthline.com/health/retroperitoneal-inflammation", "passage_text": "Treatment of Retroperitoneal Inflammation. Treatment for retroperitoneal inflammation is extremely important in preventing complications. Treatment will require a stay in the hospital. This condition is largely treated with antibiotics or surgery. Inflammation that affects the retroperitoneal space is a serious medical condition with a high mortality rate. However, early diagnosis and treatment improves the outlook for this condition. The retroperitoneal space is the space between the peritoneum and the posterior abdominal wall."}]