[{"url": "http://www.babynamespedia.com/meaning/Anella", "passage_text": "Anella-Meaning of Anella. Tweet. [ syll. a-nel-la, an-e- lla ] The baby girl name Anella is pronounced as AHN EH L-AH †. Anella is derived from Old Greek origins. Anella is a derivative of the Hawaiian name Anela."}, {"url": "http://www.ourbabynamer.com/meaning-of-Angela.html", "passage_text": "Angela is generally used as a girl's name. It consists of 6 letters and 3 syllables and is pronounced An-ge-la. In the U.S. in 2014, it ranked 191 in baby name popularity for girls with 1722 occurrences."}, {"url": "http://www.babynamespedia.com/meaning/Anela/f", "passage_text": "[ 3 syll. a-ne-la, an-ela ] The baby girl name Anela is also used as a boy name. It is pronounced aa-N EH-Laa †. Anela has its origins in the Old Greek language and it is used largely in Hawaiian."}, {"url": "http://www.thinkbabynames.com/meaning/0/Anela", "passage_text": "Anela /ane-la/ [3 sylls.] as a girls' name is of Hawaiian and Greek origin, and the meaning of Anela is  messenger; angel, messenger of God ."}, {"url": "http://www.ourbabynamer.com/meaning-of-Anella.html", "passage_text": "What does Anella mean, popularity, numerology and more. The name Anella is of English origin. The meaning of Anella is follower of the light. It is also of Hawaiian origin, where its meaning is angel ."}, {"url": "https://en.wikipedia.org/wiki/Angela_(given_name)", "passage_text": "Angela is a female given name. The origin of the name is Latin and its background is Christian. It is derived from the Greek word angelos (ángelos), αγγελος meaning messenger Of. God in The United, states the Name angela was at its most popular between 1965 and, 1979 when it was ranked among the top 10 names for. girls"}, {"url": "http://www.ourbabynamer.com/meaning-of-Anella.html", "passage_text": "Anella is generally used as a girl's name. It consists of 6 letters and 3 syllables and is pronounced A-ne-lla. In the U.S. in 2014, it ranked 10134 in baby name popularity for girls with 10 occurrences. Less than 5 boys were given the name."}]