[{"url": "http://www.bls.gov/oes/current/oes_ut.htm", "passage_text": "(2) Annual wages have been calculated by multiplying the hourly mean wage by a year-round, full-time hours figure of 2,080 hours; for those occupations where there is not an hourly mean wage published, the annual wage has been directly calculated from the reported survey data. (4) Wages for some occupations that do not generally work year-round, full time, are reported either as hourly wages or annual salaries depending on how they are typically paid. (5) This wage is equal to or greater than $90.00 per hour or $187,199 per year. (8) Estimates not released."}, {"url": "http://www.indeed.com/salary/q-Nurse-RN-l-Utah.html", "passage_text": "Average Nurse RN salaries for job postings in Utah are 22% lower than average Nurse RN salaries for job postings nationwide. "}, {"url": "http://www.teachersalaryinfo.com/average-teacher-salary-utah.html", "passage_text": "Average Teacher Salary in Utah. Utah teacher salaries in 2009 were $42,586, a decrease from the high point in 2008 which was around $45,925. Utah’s annual average salaries for teachers in 2009 is below the national average in 2009, which was $49,720. From 2007-2009 Utah has consistently offered a relatively lower annual salary that most other states. When comparing Utah to the rest of the country in 2009, Utah teacher salary rankings are 43rd in the nation. This was also a drop of around $3000 from 2008 levels, and almost equal to 2007’s average of $42,906."}, {"url": "http://www1.salary.com/UT/Optometrist-salary.html", "passage_text": "New Search Utah optometrist SalariesNew SearchWithin Utah there is a lot of variation in optometrist Salaries. These variations depend on on a wide range of factors from population to general competitiveness in the market. Below is a map displaying a few key cities in Utah and surrounding states, click on any one to find optometrist Salaries for that area. "}, {"url": "http://www.teachingdegree.org/utah/salary/", "passage_text": "Utah’s average teaching salaries rank below the national average, but these numbers may be a better reflection of the age of teachers than a reflection of how Utah compensates teachers. After becoming a teacher in Utah, most school districts reward teachers based on their years in a classroom, the classes they have taken for professional development, and their academic degree."}, {"url": "http://www.accountingedu.org/utah-accountant-salary.html", "passage_text": "Controllers at large financial services firms in Salt Lake City earned salaries in the range of $153,015 and $194,930 according to the 2015 Robert Half Salary Guide. Chief Financial Officers (CFOs) in Utah, which often hold CPA licenses, earned the highest salaries among all accounting professionals. CFOs at financial services firms in Salt Lake City earned between $156,550 and $277,750 according to the 2015 Robert Half Salary Guide. This is more than twice as high as the national rate of increase expected for accounting jobs nationwide according to the US Department of Labor (DOL). The median salary for an accountant in Utah was $62,300 in 2014 according to the DOL."}, {"url": "http://www.averagesalarysurvey.com/utah", "passage_text": "United States, Utah. Important Manufacturing goods in Utah are electronic components, medical instruments, fabricated metals, food products, transportation equipment, steel, and copper. According to Forbes magazine Utah is the #1 state in the U.S. for fostering business growth. Utah’s economy increased annually in the past five years. Average salaries in Utah are above U.S average. For example experienced software developer get around $88,000. "}, {"url": "http://www.accountingedu.org/utah-accountant-salary.html", "passage_text": "The Utah Department of Workforce Services expects an increase of 28% in the number of accounting jobs in the state between 2012 and 2022. This is more than twice as high as the national rate of increase expected for accounting jobs nationwide according to the US Department of Labor (DOL). The median salary for an accountant in Utah was $62,300 in 2014 according to the DOL. Experienced professionals in the 90th percentile, often those with CPA licenses, earned an average of $103,600"}, {"url": "http://www.teachingdegree.org/utah/salary/", "passage_text": "1 The Salt Lake City Tribune – New report says Utah teacher salaries may not be so bad. 2  Utah Education Association – 2010-2011 Teacher Salary Scedules and Comparisons. 3  U.S. Bureau of Labor Statistics – Occupational Employment Statistics Query System. After becoming a teacher in Utah, most school districts reward teachers based on their years in a classroom, the classes they have taken for professional development, and their academic degree."}, {"url": "http://www.teachingdegree.org/utah/salary/", "passage_text": "Utah’s Office of Education has several resources for the Utah certified teacher who sees the connection between professional development and higher salaries. Pay schedules dictate pay raises in conjunction with meeting professional development requirements. After becoming a teacher in Utah, most school districts reward teachers based on their years in a classroom, the classes they have taken for professional development, and their academic degree."}]