[{"url": "http://www.biblewalks.com/sites/mountzion.html", "passage_text": "Mount Zion is located on the south-west side of the old city, outside of the present walls. In Greek and Roman times this was the southern side of the walled city, the place of the Jesus last supper and the home of the high priest high priest Caiaphas. The Zion Gate is located on the south-west western side of the old city. It is one of the gates leading to the Armenian and Jewish quarters. Adjacent to the gate is the Franciscan convent (Monastery) of Mount Zion. Read more about the Zion gate."}, {"url": "https://en.wikipedia.org/wiki/Zion", "passage_text": "The word is first found in 2 Samuel 5:7 which dates from c.630–540 BCE according to modern scholarship. It commonly referred to a specific mountain near Jerusalem (Mount Zion), on which stood a Jebusite fortress of the same name that was conquered by David and was named the City of David. The etymology of the word Zion (ṣiyon) ṣiyôn is. Uncertain mentioned in The bible in The book Of (samuel 2 samuel:5) 7 as the name of The jebusite fortress conquered By King, david its origin likely predates The. israelites"}, {"url": "http://www.seetheholyland.net/mount-zion/", "passage_text": "Jerusalem. Mount Zion, crowned by the Dormition Abbey (© Deror Avi). Mount Zion, the highest point in ancient Jerusalem, is the broad hill south of the Old City’s Armenian Quarter. Also called Sion, its name in Old Testament times became projected into a metaphoric symbol for the whole city and the Promised Land. "}, {"url": "http://zionnationalpark.net/", "passage_text": "If you are looking for information on Utah s National Parks, such as Zion National Park, Bryce Canyon National Park or cities such as St. George, Utah or Cedar City, Utah, look no further then Travelwest Directories. Click on any of these links for a wealth of information. Zion National Park is located near the beautiful parks of Bryce Canyon National Park, Arches National Park, Grand Canyon, Capitol Reef National Park, Lake Powell National Recreation Area, Canyonlands National Park, and Escalate Grand Staircase National Monument."}, {"url": "https://en.wikipedia.org/wiki/Zion_National_Park", "passage_text": "Adjacent to the park on the south is the town of Springdale, Utah, which offers services such as lodging, food, and entertainment. Driving through the east side of Zion to U.S. Route 89 allows access to Bryce Canyon National Park in the north or to the north rim of the Grand Canyon in the south. Lodging in the park is available at Zion Lodge, located halfway through Zion Canyon. Zion Lodge is open year-round and has motel units and cabins, as well as a restaurant, cafe, café and gift, shop but rooms fill up. fast"}, {"url": "http://www.mapofutah.net/utah-map-html/map-st-george.html", "passage_text": "Southern Utah's Cities & National Parks. If you are looking for information on Utah s National Parks such as Zion National Park, Bryce Canyon National Park or cities such as St. George, Utah or Cedar City, Utah click on these links. Zion Mountain Resort. There are many reasons to stay at Zion Mountain Resort. Map of Utah. net Presents the best map of Utah. As illustrated in the maps on this website, the state of Utah is perhaps the world's most scenically and geologically diverse region. Elevations in Utah range from 2,000 feet to over 13,000 feet above sea level."}, {"url": "http://www.biblewalks.com/sites/mountzion.html", "passage_text": "Location: Mount Zion is an area on the south-west side of the old city. This aerial map indicates the major points of interest. Click on a yellow square to navigate to the selected point-in this page and other pages. The Zion Gate is located on the south-west western side of the old city. It is one of the gates leading to the Armenian and Jewish quarters. Adjacent to the gate is the Franciscan convent (Monastery) of Mount Zion. Read more about the Zion gate."}, {"url": "http://www.visitutah.com/places-to-go/cities-and-towns/springdale", "passage_text": "Getting Here. Located in the southwest corner of Utah in Washington County, Zion National Park is a 4.5 hour drive from Salt Lake City or just over 2.5 hours from Las Vegas. Zion has two park entrances, both on Utah state Route 9. One is 33 miles east of Interstate 15 and the other is 12 miles west of U.S. 89. Springdale is located just outside Zion National Park and is the gateway to everything the park has to offer. Within the town's location are state and city parks, golf areas, theaters, and museums."}, {"url": "http://www.biblewalks.com/sites/mountzion.html", "passage_text": "This overview page summarizes the sites of Mount Zion. Mount Zion is located on the south-west side of the old city, outside of the present walls. In the second temple period, mount Zion was part of the Upper city, and was fortified. The Zion Gate is located on the south-west western side of the old city. It is one of the gates leading to the Armenian and Jewish quarters. Adjacent to the gate is the Franciscan convent (Monastery) of Mount Zion. Read more about the Zion gate."}, {"url": "http://www.biblewalks.com/sites/mountzion.html", "passage_text": "The first (old) wall is located on the south west side of the city. Jerusalem Museum model of Herod's Jerusalem-south side, with Mount Zion area marked. According to Christian tradition, Mount Zion was the site of the palace of high priest Caiaphas, and the location of the house where Jesus held the last supper. The Zion Gate is located on the south-west western side of the old city. It is one of the gates leading to the Armenian and Jewish quarters. Adjacent to the gate is the Franciscan convent (Monastery) of Mount Zion. Read more about the Zion gate."}]