[{"url": "http://umm.edu/health/medical/altmed/condition/rheumatoid-arthritis", "passage_text": "Introduction. Rheumatoid arthritis (RA) is an autoimmune disease where the body's immune system mistakenly attacks the synovium, a thin membrane that lines the joints. It causes chronic inflammation that leads to pain, swelling, and stiffness. Eventually, bones and joints can be damaged, leading to disability."}, {"url": "http://www.nhs.uk/Conditions/Rheumatoid-arthritis/Pages/Treatment.aspx", "passage_text": "Treating rheumatoid arthritis. There is no cure for rheumatoid arthritis, but treatment can help reduce inflammation in the joints, relieve pain, prevent or slow joint damage, reduce disability and enable you to live as active a life as possible."}, {"url": "http://www.arthritis.org/about-arthritis/types/myositis/", "passage_text": "Myositis is a term meaning inflammation in the muscles. There are several types of myositis, the most common being polymyositis and dermatomyositis. Polymyositis causes muscle weakness around the middle of the body and affects both sides of the body. Dermatomyositis causes muscle weakness as well as a skin rash."}, {"url": "http://www.arthritis.org/about-arthritis/types/myositis/", "passage_text": "Polymyositis is characterized by symptom flares, muscle weakness (especially in the thighs, hips and shoulders), lung issues, joint pain, fever, weight loss, Raynaud’s phenomenon and a general ill feeling. Dermatomyositis is characterized by a skin rash that may precede, accompany or follow muscle weakness."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/features/coping-with-fatigue-weakness-and-rheumatoid-arthritis", "passage_text": "Research also shows that RA pain can cause fatigue. Weakness results from number of factors, like pain, stiffness, and loss of muscle mass caused by a lack of activity. Take these steps to boost your energy and strength -- and get back to doing the things you love."}, {"url": "http://rawarrior.com/rheumatoid-arthritis-muscle-wasting-rheumatoid-cachexia/", "passage_text": "Rheumatoid Arthritis is famous for bone erosions and joint deformity. That’s bad enough, but RA doesn’t stop there. Rheumatoid Arthritis is a systemic disease which can affect all organs and systems in the body. One of the first RA symptoms I experienced was extreme weakness in muscles and tendons."}, {"url": "http://rawarrior.com/basic-rheumatoid-arthritis-information/symptoms-of-rheumatoid-arthritis/", "passage_text": "Rheumatoid Arthritis patients usually suffer flu-like symptoms due to chemical substances in their blood which are dumped there due to an overly-aggressive immune system. Flu-like symptoms include constant low-grade fevers, muscle pain and weakness, lack of appetite, and extremely easily depleted energy levels."}]