[{"url": "http://www.space.com/18708-uranus-atmosphere.html", "passage_text": "Atmospheric composition. Uranus' atmosphere is predominantly made up of hydrogen and helium. Unlike Jupiter and Saturn, these light gases dominate only the outer edges of the planet, but are not a significant contributor to the rocky interior. The dull blue color of Uranus is caused by the presence of methane, which absorbs red light. The seventh planet in the solar system — and the smallest of the gas giants — Uranus has an atmosphere more comparable with Neptune than with Saturn and Jupiter. Known as ice giants, the two most distant planets from the sun have atmospheres that are heavily dominated by ices."}, {"url": "http://www.english-online.at/science/solar-system/outer-planets-of-the-solar-system.htm", "passage_text": "Today we know that most of the planet consists of gases-hydrogen and helium-and does not have a hard core, like the Earth. In 1994 a big comet crashed into Jupiter and stirred up the planet's atmosphere. Scientists could find out what kind of gases Jupiter's atmosphere is made up of. In 1989 NASA launched an unmanned spacecraft to Jupiter-Galileo. After 6 years, Galileo reached the planet and went into orbit. It sent a small probe through the clouds of Jupiter to find out more about the atmosphere."}, {"url": "http://starchild.gsfc.nasa.gov/docs/StarChild/solar_system_level1/uranus.html", "passage_text": "Because of this, its poles are sometimes pointed almost directly at the Sun. Uranus' atmosphere is made up of hydrogen, helium, and methane. The temperature in the upper atmosphere is very cold. The cold methane gas is what gives Uranus its blue-green color. The rapid rotation of Uranus causes winds up to 600 kilometers per hour to blow in its atmosphere. "}, {"url": "http://www.space.com/18706-uranus-composition.html", "passage_text": "Far, far from the sun, Uranus has a blue-green atmosphere that hints at its makeup. One of the two ice giants, the planets composition differs somewhat from Jupiter and Saturn in that it is made up of more ice than gas. Near-infrared views of Uranus reveal its otherwise faint ring system, highlighting the extent to which the planet is tilted. But most of the planet is made up of ices, mostly water, methane, and ammonia. Ices dominate because the vast distance to Uranus from the sun allows the planet to maintain frigid temperatures. A frigid core. While most planets have rocky molten cores, the center of Uranus is thought to contain icy materials"}, {"url": "https://en.wikipedia.org/wiki/Atmosphere_of_Uranus", "passage_text": "Uranus by Voyager 2. The atmosphere of Uranus, like those of the larger gas giants, Jupiter and Saturn, is composed primarily of hydrogen and helium. At depth it is significantly enriched in volatiles (dubbed ices) such as water, ammonia and methane. The opposite is true for the upper atmosphere, which contains very few gases heavier than hydrogen and helium due to its low temperature. Uranus's atmosphere is the coldest of all the planets, with its temperature reaching as low as 49 K."}, {"url": "http://www.answers.com/Q/What_gases_make_up_uranus'_atmosphere", "passage_text": "The composition of Uranus's atmosphere is 82.5 percent molecular hydrogen, 15.2 percent Helium, and 2.3 percent Methane. Trace amounts of Hydrogen Deuteride exist, with possible aerosols of ammonia ice, water ice, ammonia hydrosulfide, and methane ice. Venus contains the following gases in its atmosphere:Carbon dioxide (96.5%)Water vapour (0.002%)Argon (0.007)Neon (0.0007)Hydrogen (0.0012)Carbon monoxide (0.0017)Nitrogen (3. … 5%) The percentages are estimations of how much of the gas is in Venus' atmosphere. 41 people found this useful."}, {"url": "http://www.english-online.at/science/solar-system/outer-planets-of-the-solar-system.htm", "passage_text": "Uranus belongs to the gas giants. Its atmosphere consists mostly of hydrogen and helium and a bit of methane, which gives the planet a bluish-green color. The surface of Uranus is probably made up of frozen gas. Scientists could find out what kind of gases Jupiter's atmosphere is made up of. In 1989 NASA launched an unmanned spacecraft to Jupiter-Galileo. After 6 years, Galileo reached the planet and went into orbit. It sent a small probe through the clouds of Jupiter to find out more about the atmosphere."}, {"url": "http://www.answers.com/Q/What_gases_make_up_uranus", "passage_text": "What gases make up Uranus' atmosphere? The composition of Uranus's atmosphere is 82.5 percent molecular  hydrogen, 15.2 percent Helium, and 2.3 percent Methane. Trace  amounts of Hydrogen Deuteride exist, with po … ssible aerosols of  ammonia ice, water ice, ammonia hydrosulfide, and methane ice."}]