[{"url": "http://forum.freeadvice.com/other-crimes-federal-state-4/violation-disorderly-conduct-criminal-offense-crime-criminal-conviction-465175.html", "passage_text": "Hawaii. I was charged with misdemeanor disorderly conduct and plead no contest to a violation of disorderly conduct. I know that I am guilty of disorderly conduct-violation and my attorney said that the violation was not a crime but am unsure of my status for job applications."}, {"url": "http://www.randolphwolf.com/criminal/disorderly-conduct/", "passage_text": "A disorderly conduct charge is a criminal offense, similar to a misdemeanor, which leads to a permanent record if you are found guilty or plead guilty. The penalties under New Jersey law for individuals convicted of disorderly conduct include a jail sentence of up to six months and a monetary fine of up to $1,000.00."}, {"url": "http://www.criminaldefenselawyer.com/crime-penalties/federal/disorderly-conduct.htm", "passage_text": "Disorderly conduct is a class B misdemeanor, punishable by up to 30 days in jail and a fine of up to $1,000. Disorderly conduct at a funeral is also a class B misdemeanor, but second or subsequent violations are class A misdemeanors, punishable by up to one year in jail and a maximum of $2,000 in fines."}, {"url": "http://www.criminaldefenselawyer.com/resources/disorderly-conduct-new-york.htm", "passage_text": "Punishment. Disorderly conduct is a violation. Violations do not result in criminal records, but they are punishable by up to 15 days in jail and a fine. Disrupting a religious service or funeral is a class A misdemeanor, punishable by up to one year in jail and up to $1,000 in fines."}, {"url": "http://www.newyorkcitydefense.com/disorderly-conduct-new-york.html", "passage_text": "The New York PL 240.20 Disorderly Conduct Statute states that a violation of New York Penal Law 240.20 occurs when: a person, with intent to cause public inconvenience, annoyance or alarm, or recklessly creating a risk thereof: engages in one or more of the following activities:"}, {"url": "http://www.criminaldefenselawyer.com/crime-penalties/federal/disorderly-conduct.htm", "passage_text": "Disorderly conduct crimes are either disorderly persons offenses (punishable by up to six months in jail and a fine up to $1,000) or petty disorderly persons offenses (punishable by up to 30 days in jail and a fine up to $500). For smoking in public, the maximum fine is $200."}, {"url": "http://www.morristownnjcriminallawpost.com/assault-and-threat-crimes/disorderly-conduct-criminal-offense-vs-municipal-ordinance/", "passage_text": "If you have been charged with disorderly conduct in violation of N.J.S. 2C:33-2, it is imperative that you contact an experienced criminal defense lawyer for help. Disorderly conduct can be a fight, a loud argument, drunk and disorderly, or improper behavior towards law enforcement."}, {"url": "http://www.newyorkcitydefense.com/disorderly-conduct-new-york.html", "passage_text": "While disorderly conduct is a Violation and not a Crime under the New York Penal Law, the maximum penalty is 15 days at Rikers Island and a fine of a few hundred bucks."}]