[{"url": "https://ting.com/blog/bring-a-sprint-device-to-ting-you-know-you-wanna/", "passage_text": "Bringing your eligible, inactive Sprint device to Ting is now real. Like live on the Ting site, not hidden behind any barriers and ready to go real. Today, we’re launching the bring your inactive Sprint device to Ting public beta with official support for seven devices: 1  HTC EVO 4G. 2  HTC EVO 4G LTE. 3  HTC EVO 3D 4G. 4  HTC EVO Shift. 5  LG Optimus S. 6  LG Viper. 7  Motorola Photon 4G. The bring your inactive Sprint device to Ting online app is designed to keep things simple and make it so anyone with one of the Sprint devices listed can just click a couple of buttons and turn it into a Ting device. Please note: a device that’s currently active on the Sprint network cannot be brought over."}, {"url": "https://www.thesciencedictionary.com/ting-review/", "passage_text": "Now first of all, let me explain what Ting is. Ting is a cell phone service provider with monthly plans averaging from $20-$30 per month. Ting has an agreement with Verizon and Sprint, so that it has calling/texting coverage everywhere Verizon or Sprint has coverage, and data coverage everywhere Sprint has coverage. Ting has a bunch of different smartphones from a low-end HTC Evo (from $68) to middle of the range Galaxys S4, to the high-end iPhone 6. The one downside about buying a phone from Ting is that you have to pay for the whole, retail price of a phone, so a Galaxy from Ting might cost about $300."}, {"url": "https://ting.com/blog/changes-to-the-byod-program-the-good-the-bad-and-the-ugly/", "passage_text": "UPDATE 3: Progress! More than 30 million devices that would previously have failed Sprint’s financial eligibility date (FED) check will now pass. Now, devices that were freed from a contract due to a hardware upgrade (that is to say, you got a new a new phone on the same contract) will clear the FED check."}, {"url": "https://www.thesciencedictionary.com/ting-review/", "passage_text": "PS. In case you were wondering, the process to switch from your cell phone provider to Ting is quick and painless. You just buy a phone from Ting (or port your old Sprint phone to Ting), enter your current phone number on Ting’s website, and Ting will let you use your existing phone number. After a two-minute activation process, you can start using your new phone immediately. Final Verdict: 4.9/5. Ting has a bunch of different smartphones from a low-end HTC Evo (from $68) to middle of the range Galaxys S4, to the high-end iPhone 6. The one downside about buying a phone from Ting is that you have to pay for the whole, retail price of a phone, so a Galaxy from Ting might cost about $300."}, {"url": "https://www.verizonwireless.com/b2c/support/switch-to-verizon", "passage_text": "Keep your service active-Don't cancel the current service before switching. The number must be active to switch. Have a copy of your current bill-To make the process easier, please ensure that important information is readily available. Have a copy of your most current bill, and if possible, your contract. "}, {"url": "http://ask.metafilter.com/252167/should-I-switch-to-Ting-phone-service", "passage_text": "November 18, 2013 11:26 AM Subscribe. I'm thinking of switching my phone service from sprint to Ting. Since this is a change that's difficult to undo, I'm asking for feedback (positive or negative) about how your Ting experience has been. "}, {"url": "http://www.cnet.com/news/iphone-5s-5c-users-can-now-move-to-budget-phone-service-ting/", "passage_text": "Ting is also an MVNO (mobile virtual network operator) partner of Sprint, which means you can bring certain devices from Sprint directly to Ting. Currently Ting supports a variety of Android phones as well as the iPhone 4, 4S, and 5. But starting September 29, owners of a Sprint iPhone 5S or 5C will be able to switch their phones to, and activate them on, Ting, Andrew Moore-Crispin, Ting senior content manager, said in a blog posted Tuesday. Ting offers a full tutorial page on how you can activate your iPhone on its network. The website also provides a list of all compatible phones that can make the move from Sprint to Ting. In the past, Ting usually has taken about a year before it can support the latest"}, {"url": "http://forum.mrmoneymustache.com/ask-a-mustachian/considering-switching-from-sprint-to-ting/", "passage_text": "Once that was done, I called Sprint and paid the ETF. You have to do this so the ESN on your phone comes up clean. Then you can activate your Sprint phone with Ting. We got new numbers from Ting and just used that number as one of our fowarding numbers in Google Voice (along with our VOIP landline). We use the Google Voice app on our phones to text (uses minimal data). I keep 3G/4G data turned off and use WiFi most of the time. Considering switching from Sprint to Ting. « on: January 27, 2013, 01:56:55 PM ». So...when I first moved to the States, I did prepaid service through T-Mobile on a pretty sweet unlocked (dumb) phone I had bought for ~$150. It was still working great when I decided that I wanted to try out a smartphone."}]