[{"url": "http://www.answers.com/Q/What_is_the_structure_of_a_DNA_molecule", "passage_text": "The twisted ladder metaphorA DNA molecule is often likened to a spiral (or twisted) ladder. In this analogy, the rungs of the ladder are the base pairs (A-T and G-C). The sides of the ladder are the sugar-phosphate backbones of the two strands. This refers to B form DNA."}, {"url": "http://www.pbs.org/wgbh/aso/databank/entries/do53dn.html", "passage_text": "Watson and Crick describe structure of DNA1953. Photo: Model of DNA molecule. In the late nineteenth century, a German biochemist found the nucleic acids, long-chain polymers of nucleotides, were made up of sugar, phosphoric acid, and several nitrogen-containing bases."}, {"url": "https://quizlet.com/11174373/biology-chp-7-flash-cards/", "passage_text": "Which of the following statements about DNA are true. (1) The DNA double helix consists of two polynucleotide chains. (2) Each DNA nucleotide consists of a sugar, a phosphate group, and a nitrogen-containing base."}, {"url": "http://www.answers.com/Q/What_is_the_structure_of_a_DNA_molecule", "passage_text": "A molecule of DNA is double-stranded. The molecule has the shape of a double helix, typically right handed (B form DNA). The DNA molecule consists of two complementary strands oriented in an antiparallel fashion. Each strand is composed of nucleotides."}, {"url": "http://bio3400.nicerweb.com/Locked/src/chap10_c.html", "passage_text": "1 DNA is composed of a deoxynucleoside triphosphate with a base attached to it. 2  DNA is composed of a sugar-phosphate backbone with bases projecting toward the inside of the backbone. 3  DNA is composed of a sugar-phosphate backbone with bases projecting toward the out"}, {"url": "http://www.4themax.com/education/di/CONTENT/dna%20Exam.pdf", "passage_text": "A) Cells contain DNA that controls the production of proteins. B) Proteins are used to produce cells that link amino acids together into DNA. C) DNA is composed of proteins that carry coded information for how cells function. D) Cells are linked together by proteins to make different kinds of DNA molecules."}, {"url": "http://www.answers.com/Q/What_is_the_structure_of_a_DNA_molecule", "passage_text": "Each nucleotide forms hydrogen bonds with its complementary base on the other strand. Two hydrogen bonds form between adenine and thymine; three hydrogen bonds form between guanine and cytosine. There are three forms of DNA that differ significantly. The most common, B form, is the structure most people have heard of."}, {"url": "http://www.answers.com/Q/What_best_describes_the_structures_of_DNA", "passage_text": "DNA is double helical in structure. each spiral strand, composed of a sugar phosphate backbone and attached bases, is connected to a complementary strand by hydrogen bonding (… non-covalent) between paired bases, adenine (A) with thymine (T) and guanine (G) with cytosine (C)."}]