[{"url": "https://en.wikipedia.org/wiki/Carrara_marble", "passage_text": "Carrara marble (sometimes mistakenly Carrera marble) is a type of white or blue-grey marble of high quality, popular for use in sculpture and building decor. It is quarried at the city of Carrara in the province of Massa and Carrara in the Lunigiana, the northernmost tip of modern-day Tuscany, Italy."}, {"url": "http://www.coalsurfacemining.com/mining/marble-stone-mining-in-italy.html", "passage_text": "Home » Mining » marble stone mining in italy. marble stone mining in italy Description: marble mining machinery manufacturer italy – 19 Jun 2013 … Italy Marble Mining Crusher Equipment,Marble. … machinery manufacturer … granite marbl...... marble mining machinery manufacturer italy –. 19 Jun 2013 … Italy Marble Mining Crusher Equipment,Marble. … machinery manufacturer … granite marble mining machinery italy; Stone,Granite — granite. Get Prices."}, {"url": "http://www.answers.com/Q/Where_is_marble_found", "passage_text": "Marble can be found in many mountainous places in the world. In particular, it is found mainly in Italy, China, Turkey and Mexico, but also in Belgium, France, Great Britain, … Spain, India, and in many parts of the United States, such as Vermont, Colorado, Tennessee and Alabama. Marble is found in the U.S., Greece, Romania, Italy, Pakistan, Spain, India, Turkey, Russia, United Kingdom, Germany and Russia. See Sources and related links for breakdown ac … cording to type of marble"}, {"url": "https://en.wikipedia.org/wiki/Carrara", "passage_text": "Carrara [karˈraːra] (Emilian: Carara) is a city and comune in the Province of Massa and Carrara (Tuscany, Italy), notable for the white or blue-grey marble quarried there. It is on the Carrione River, some 100 kilometres (62 mi) west-northwest of Florence. "}, {"url": "http://www.machinemine.com/project/marble-mining.php", "passage_text": "Marble Mining in Italy-MBendi.com-the global …. A profile of Marble Mining in Italy with directories of companies, people, industry sectors, projects, facilities, news and events."}, {"url": "http://www.answers.com/Q/Where_in_Italy_is_marble_found", "passage_text": "Marble is found in the U.S., Greece, Romania, Italy, Pakistan, Spain, India, Turkey, Russia, United Kingdom, Germany and Russia. See Sources and related links for breakdown ac … cording to type of marble. 6 people found this useful. Paul Jones. In particular, it is found mainly in Italy, China, Turkey and Mexico, but also in Belgium, France, Great Britain, … Spain, India, and in many parts of the United States, such as Vermont, Colorado, Tennessee and Alabama. Hope this helps!"}, {"url": "http://www.italymagazine.com/featured-story/visiting-carrara-marble-quarries-apuan-alps-eternal-snow", "passage_text": "The marble quarries of Carrara are situated in the valleys of Torano, Miseglia, Bedisano and Colonnata, where both white and coloured marbles are found: the amount of marble is staggering. "}, {"url": "http://www.wanderingitaly.com/places/carrara-marble-tour.html", "passage_text": "Tuscany ›. Carrara Quarries Tour Map. Touring the marble mines in the Apuan Alps in northern Tuscany is an incredible visual experience--which is why the location was chosen for the chase scene in the James Bond film Quantum of Solace. You can tour some of the marble mines above Carrara in a self-guided car tour, but to get as high into the Apuan Alps as we did in the picture, you'll need to take a jeep tour. The tour we took cost a reasonable €10, one of the best bargains in Italy. It gets you 1000 meters above the sea."}]