[{"url": "http://hpschapters.org/northcarolina/NSDS/thorium.pdf", "passage_text": "Thorium is a radioactive element that occurs naturally in low concentrations (about 10 parts per million) in the earth’s crust. It is about three times as abundant as uranium and about as abundant as lead or molybdenum. Thorium in its pure form is a silvery-white heavy metal that is about as dense as lead. Thorium-230 is a radioactive decay product of uranium-238 and is found in low concentrations in uranium deposits and mill tailings. In its natural state, thorium occurs as an oxide (ThO 2), phosphate (ThPO 4), and silicate (ThSiO 4)."}, {"url": "http://www.innovateus.net/science/what-thorium", "passage_text": "Thorium is a naturally-occurring radioactive metal found at very low levels in soil, rocks, and water. It has several different isotopes, both natural and man-made, all of which are radioactive. The most common form of thorium is thorium -232, found naturally. 1 Th-232 with a half-life of 14.05 billion years, which represents all but a trace of naturally occurring thorium. 2  Th-230 with a half-life of 75,380 years. 3  It occurs as the daughter product of 238U decay."}, {"url": "http://www.atsdr.cdc.gov/PHS/PHS.asp?id=658&tid=121", "passage_text": "Smaller amounts of other isotopes of thorium are produced usually as decay products of uranium-238, uranium-235, and thorium-232, and as unwanted products of nuclear reactions. Thorium is used to make ceramics, lantern mantles, and metals used in the aerospace industry and in nuclear reactions. More than 99% of natural thorium exists in the form (isotope) thorium-232. Besides this natural thorium isotope, there are more than 10 other different isotopes that can be artificially produced. In the environment, thorium-232 exists in various combinations with other minerals, such as silica."}, {"url": "https://en.wikipedia.org/wiki/Thorium", "passage_text": "Thorium is a chemical element with symbol Th and atomic number 90. A radioactive actinide metal, thorium is one of only three radioactive elements that still occur naturally in large quantities as a primordial element (the other two being bismuth and uranium). Thorium is also used as an alloying element in TIG welding electrodes. It remains popular as a material in high-end optics and scientific instrumentation; thorium and uranium are the only radioactive elements with major commercial applications that do not rely on their radioactivity."}, {"url": "http://education.jlab.org/itselemental/ele092.html", "passage_text": "Neptunium-239 has a half-life of about 2.4 days and decays into plutonium-239, also through beta decay. Although it does not occur naturally, uranium-233 is also a fissionable material that can be used as a fuel in nuclear reactors. To produce uranium-233, atoms of thorium -232 are exposed to neutrons. Thorium-233 forms when thorium-232 absorbs a neutron. "}, {"url": "http://www.atsdr.cdc.gov/PHS/PHS.asp?id=658&tid=121", "passage_text": "Thorium is a naturally-occurring, radioactive metal. Small amounts of thorium are present in all rocks, soil, above-ground and underground water, plants, and animals. These small amounts of thorium contribute to the weak background radiation for such substances. More than 99% of natural thorium exists in the form (isotope) thorium-232. Besides this natural thorium isotope, there are more than 10 other different isotopes that can be artificially produced. In the environment, thorium-232 exists in various combinations with other minerals, such as silica."}, {"url": "https://en.wikipedia.org/wiki/Thorium", "passage_text": "Thorium is weakly radioactive: all its known isotopes are unstable, with the seven naturally occurring ones (thorium-227, 228, 229, 230, 231, 232, and 234) having half-lives between 25.52 hours and 14.05 billion years. Thorium is also used as an alloying element in TIG welding electrodes. It remains popular as a material in high-end optics and scientific instrumentation; thorium and uranium are the only radioactive elements with major commercial applications that do not rely on their radioactivity."}, {"url": "http://hpschapters.org/northcarolina/NSDS/thorium.pdf", "passage_text": "Essentially all naturally occurring thorium is present as thorium-232. Thorium-230 is a radioactive decay product of uranium-238 and is found in low concentrations in uranium deposits and mill tailings. In its natural state, thorium occurs as an oxide (ThO 2), phosphate (ThPO 4), and silicate (ThSiO 4)."}, {"url": "http://www.power-technology.com/features/feature1141/", "passage_text": "Thorium (atomic number 90) occurs naturally, with soil often containing above ten parts per million, and it is about three times more abundant than uranium. It is found in several minerals, most commonly the rare earth-thorium-phosphate mineral monazite. Thorium Power says thorium-based nuclear fuels can be used in LWRs and other reactors without significant change to the reactor design. Pure thorium is a silvery-white metal that, when exposed to air, forms thorium oxide.. Thorium Power uses a seed-and-blanket fuel assembly."}]