[{"url": "https://en.wikipedia.org/wiki/Sandstorm_(darude_song)", "passage_text": "Sandstorm (Darude composition).  Sandstorm  is a musical composition by Finnish trance DJ Darude, released as the lead single from his debut studio album Before the Storm. It was initially released in Finland on 15 November 1999 by 16 Inch Records and it was eventually re-released in many other countries in 2000. JS16 signed Darude as the first artist on JS16's new label 16 Inch Records. Darude had been uploading various pieces of his trance experimentation on the website mp3.com, where he was building a following, and he also uploaded the full-length demo of Sandstorm."}, {"url": "https://en.wikipedia.org/wiki/Darude", "passage_text": "Ville Virtanen (born 17 July 1975), better known by his stage name Darude /dəˈruːd/ , is a Finnish electronic dance music producer and DJ from Eura, Hinnerjoki, Finland. He started making music in 1996 and released the hit single  Sandstorm  in late 1999 and subsequent album Before the Storm in 2000. Darude was ranked #95 on the DJ List as of December 11, 2010 and #314 in the DJ Mag Top 100. Brazilian mixed martial artist Wanderleei Silva has used Sandstorm as his entrance music for the Ultimate Fighting Championship, and Sandstorm can also be heard playing at many sporting events worldwide."}, {"url": "https://en.wikipedia.org/wiki/Darude", "passage_text": "Darude performing in El Salvador in 2004. Sandstorm was a smash hit #3 in Finland and UK, selling platinum and holding the #1 spot on the Finnish Dance Chart for seventeen consecutive weeks. Darude was ranked #95 on the DJ List as of December 11, 2010 and #314 in the DJ Mag Top 100. Brazilian mixed martial artist Wanderleei Silva has used Sandstorm as his entrance music for the Ultimate Fighting Championship, and Sandstorm can also be heard playing at many sporting events worldwide."}, {"url": "http://knowyourmeme.com/memes/darude-sandstorm", "passage_text": "Origin. “Sandstorm” was released in Finland on November 15th, 1999, by 16 Inch Records. In 2000, Darude released a music video for the track in which he is shown wearing headphones while witnessing two people chase a woman carrying a mysterious case (shown below). On June 12th, 2013, Redditor amnbassist submitted a screenshot of a “Sandstorm” lyrics page from the Pandora music app to the /r/funny subreddit. Prior to being archived, the post accumulated more than 1,100 up votes and 15 comments."}, {"url": "http://www.last.fm/music/Darude/_/Sandstorm", "passage_text": "read more. Sandstorm is a 12 and a CD single by the Finnish DJ Darude. The single was released by record label Neo in 1999 and re-released in 2000. Sandstorm was the best selling 12 worldwide in 2000. The song appeared as a licensed song on DDRMAX Dance Dance Revolution. Sandstorm is of the trance music genre of electronic dance music."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20140723123105AAatjBt", "passage_text": "Report Abuse. Darude is an electronic music producer, mainly in anthem/pop trance style. His most famous tune is the 1999 track Sandstorm, because of the recognizable hook/structure and how it garnered many views on YouTube in the mid-2000s (still does today). Some kid thinks its funny and cute when he randomly inserts that into yahoo answers. Its slightly annoying but Im sure he knows that and enjoys knowing that. Darude is a musician and Sandstorm is his 90s techno tune."}, {"url": "http://knowyourmeme.com/memes/darude-sandstorm", "passage_text": "“Sandstorm” is a 1999 trance techno song by the Finnish electronic music producer Darude. On June 12th, 2013, Redditor amnbassist submitted a screenshot of a “Sandstorm” lyrics page from the Pandora music app to the /r/funny subreddit. Prior to being archived, the post accumulated more than 1,100 up votes and 15 comments."}, {"url": "https://en.wikipedia.org/wiki/Darude", "passage_text": "Darude's second single,  Feel the Beat , followed the success of Sandstorm, reaching #1 in Finland for 2 weeks and #5 on the UK Singles Chart. Darude was ranked #95 on the DJ List as of December 11, 2010 and #314 in the DJ Mag Top 100. Brazilian mixed martial artist Wanderleei Silva has used Sandstorm as his entrance music for the Ultimate Fighting Championship, and Sandstorm can also be heard playing at many sporting events worldwide."}]