[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/8446822", "passage_text": "The ability to perform at the anaerobic threshold is now recognised as an integral component of endurance events. Several studies have concluded that the ventilatory threshold is highly correlated with endurance performance, in distances ranging from 26 miles (41.6 km) [r = -0.94] to 5 and 10 km (r = -0.945). The lactate threshold, in particular the individual anaerobic threshold, has been examined from a performance standpoint. Despite the apparent causal relationship between the stimulation of the ventilatory chemoreceptors and ultimately the ventilatory response and the accumulation of protons in the circulating blood, evidence does exist which refutes such a connection."}, {"url": "http://www.answers.com/Q/What_is_the_ventilatory_threshold", "passage_text": "The ventilatory threshold is the point of exercise where your breathing starts to increase and become labored. It is when you cannot seem to pull in enough air. They both are reached are approx the same time, it is thought to be that the large change (drop) in blood pH when the lactate threshold is reached is causes ventilation to inc … rease rapidly to try and counteract this blood pH change."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/8446822", "passage_text": "The anaerobic threshold is commonly measured by either blood lactate (lactate threshold) or ventilatory gases (ventilatory threshold); however, the relationship between these 2 methods is not conclusive. The lactate threshold has been characterised at either a fixed or variable blood lactate concentration (BLa). Despite the apparent causal relationship between the stimulation of the ventilatory chemoreceptors and ultimately the ventilatory response and the accumulation of protons in the circulating blood, evidence does exist which refutes such a connection."}, {"url": "http://running.competitor.com/2013/10/training/whats-the-ventilatory-threshold-and-why-does-it-matter_18338", "passage_text": "Labored breathing is very familiar to runners. They call it the ventilatory threshold. It’s that intensity of exercise above which your breathing becomes labored and you feel you just can’t draw in as much air as your body wants. Every runner is experientially familiar with the ventilatory threshold. When you run easy you breathe easy. As your speed increases, your breathing deepens, but gradually. However, as you continue to increase your speed, suddenly it seems as if a switch is flipped and your breathing races off ahead of your legs."}, {"url": "http://cathe.com/what-is-ventilatory-threshold-and-how-can-you-use-it-to-monitor-exercise-intensity", "passage_text": "If they were able to recite the paragraph and talk in complete sentences, they were consistently below their ventilatory threshold. So the talk test is a good indicator of when you’ve crossed your ventilatory threshold and your lactate threshold, the point at which lactate is produced faster than it can be cleared. One way is to use the “talk test.” The talk test looks at how easy it is to speak in complete sentences to measure exercise intensity and determine when the ventilatory threshold is crossed. In one study, researchers had participants recite a paragraph during a progressive exercise session."}, {"url": "http://www.indiana.edu/~k561/revent.html", "passage_text": "As eluded above, ventilatory threshold is the intensity of exercise that exhibits a larger ventilation than required to merely do the work. At this point, the contribution of anerobic metabolism becomes significant to produce larger concentrations of lactic acid. "}, {"url": "http://www.cprphysicaltherapy.com/about-us/answer/what-is-the-difference-between-anaerobic-lactate-ventilatory-and-threshold", "passage_text": "Anaerobic Threshold (AT) was a term applied to the lactate inflection point, or the point at which the appearance of lactate in the blood accumulates faster that its rate of use. Ventilation increases at about the same rate as oxygen consumption up to about 50-70% of VO2max (depending on one's trained level). At this point (just beyond the ventilatory threshold) ventilation increases exponentially. Some researchers have identified two ventilatory thresholds."}, {"url": "http://cathe.com/what-is-ventilatory-threshold-and-how-can-you-use-it-to-monitor-exercise-intensity", "passage_text": "Ventilatory threshold marks the point where oxygen delivery to the muscles becomes a limiting factor, and your body is forced to rely more into its anaerobic energy system. One way is to use the “talk test.” The talk test looks at how easy it is to speak in complete sentences to measure exercise intensity and determine when the ventilatory threshold is crossed. In one study, researchers had participants recite a paragraph during a progressive exercise session."}, {"url": "http://www.cprphysicaltherapy.com/about-us/answer/what-is-the-difference-between-anaerobic-lactate-ventilatory-and-threshold", "passage_text": "Ventilatory Threshold (VT) describes the inflection point for ventilation during an incremental exercise test. Ventilation increases at about the same rate as oxygen consumption up to about 50-70% of VO2max (depending on one's trained level). At this point (just beyond the ventilatory threshold) ventilation increases exponentially. Some researchers have identified two ventilatory thresholds. Although ventilation is not a limiter to performance, there is evidence suggesting that power at VT predicts average power for a 40km time trial"}, {"url": "http://running.competitor.com/2013/10/training/whats-the-ventilatory-threshold-and-why-does-it-matter_18338", "passage_text": "Just like the breathing rate, the blood lactate concentration increases gradually for a while and then, at a certain intensity, suddenly increases much more rapidly. In fact, in most laboratory exercise tests, the ventilatory and lactate thresholds fall close to the same exercise intensity. Every runner is experientially familiar with the ventilatory threshold. When you run easy you breathe easy. As your speed increases, your breathing deepens, but gradually. However, as you continue to increase your speed, suddenly it seems as if a switch is flipped and your breathing races off ahead of your legs."}]