[{"url": "http://www.green-power-tech.com/green-choice/uses-of-biomass/", "passage_text": "Uses of Biomass. Green Power Technologies innovative process converts bio-waste into a renewable and clean biomass commodity that can be used to produce fuels, energy and other products. Production of Biofuels. 1  Used in the production of Cellulosic Ethanol. 2  Used in the production of Bio diesel. 3  Gasification process to produce synthesis gas (syngas). "}, {"url": "https://en.wikipedia.org/wiki/Biomass", "passage_text": "Industrial biomass can be grown from numerous types of plants, including miscanthus, switchgrass, hemp, corn, poplar, willow, sorghum, sugarcane, bamboo, and a variety of tree species, ranging from eucalyptus to oil palm (palm oil). Sugars present in this biomass are fermented to produce bioethanol, an alcohol fuel which can be used directly in a fuel cell to produce electricity or serve as an additive to gasoline. However, utilizing food-based resources for fuel production only aggravates the food shortage problem."}, {"url": "https://en.wikipedia.org/wiki/Biomass", "passage_text": "As an energy source, biomass can either be used directly via combustion to produce heat, or indirectly after converting it to various forms of biofuel. Conversion of biomass to biofuel can be achieved by different methods which are broadly classified into: thermal, chemical, and biochemical methods. Sugars present in this biomass are fermented to produce bioethanol, an alcohol fuel which can be used directly in a fuel cell to produce electricity or serve as an additive to gasoline. However, utilizing food-based resources for fuel production only aggravates the food shortage problem."}, {"url": "http://www.biomassenergycentre.org.uk/portal/page?_pageid=75,15174&_dad=portal&_schema=PORTAL", "passage_text": "Raw materials that can be used to produce biomass fuels are widely available across the UK and come from a large number of different sources, and in a wide variety of forms. All of these forms can be used for fuel production purposes, however not all energy conversion technologies are suitable for all forms of biomass. "}, {"url": "http://www3.epa.gov/climatechange/kids/solutions/technologies/biomass.html", "passage_text": "Some kinds of biomass can be burned to produce energy. One common example is wood. Biomass contains stored energy. That's because plants absorb energy from the sun through the process of photosynthesis. When biomass is burned, this stored energy is released as heat. Burning biomass releases carbon dioxide. However, plants also take carbon dioxide out of the atmosphere and use it to grow their leaves, flowers, branches, and stems. That same carbon dioxide is returned to the air when the plants are burned. Many different kinds of biomass, such as wood chips, corn, and some types of garbage, are used to produce electricity. Some types of biomass can be converted into liquid fuels called biofuels that can power cars, trucks, and tractor"}, {"url": "http://www.wgbn.wisc.edu/key-concepts/grassland-biomass-sources/sources-biomass", "passage_text": "Sources of biomass. Biomass materials, after pre-processing into suitable forms for various conversion technologies, provide feedstock for a variety of bioenergy end products and end uses. The majority of biomass for bioenergy feedstocks comes from three sources: forests, agriculture, and waste. "}, {"url": "http://www.earthpeace.com/Biomass/BiomassTypes.htm", "passage_text": "Types of Biomass energy. Wood Wood is the conventional biomass energy used in the home-though it can be used for much larger buildings or even communities. Woody biomass production comprises forestry products, waste wood, cardboard, waste pellets and straw. "}, {"url": "https://en.wikipedia.org/wiki/Biomass", "passage_text": "The biomass used for electricity generation varies by region. Forest by-products, such as wood residues, are common in the United States. Agricultural waste is common in Mauritius (sugar cane residue) and Southeast Asia (rice husks). Animal husbandry residues, such as poultry litter, are common in the UK. Sugars present in this biomass are fermented to produce bioethanol, an alcohol fuel which can be used directly in a fuel cell to produce electricity or serve as an additive to gasoline. However, utilizing food-based resources for fuel production only aggravates the food shortage problem."}, {"url": "http://stlenergy.org/?p=459", "passage_text": "BioMass to Electricity. Biomass can be used to generate electricity, converted into liquid fuel for our cars or to make plastic products. Using biomass instead of fossil fuels can help the environment in a variety of different ways. One of the biggest ways is by keeping waste of out landfills. Other sources of biomass are food crops and the parts of those crops that are not eaten, such as fruit pits or stalks, grassy or woody plants, and any organic waste. Many of the crops that can be used for biomass can be grown on land that is not good for farming for some reason or another."}, {"url": "http://stlenergy.org/?p=459", "passage_text": "Biomass refers to any material that is organic in nature. In other words, if the material was once part of a living thing, it is biomass. Most biomass comes from trees. Usually forests are not cut down for biomass, but when the forest is cleaned out to prevent forest fires, that wood can be used for biomass. Other sources of biomass are food crops and the parts of those crops that are not eaten, such as fruit pits or stalks, grassy or woody plants, and any organic waste. Many of the crops that can be used for biomass can be grown on land that is not good for farming for some reason or another."}]