[{"url": "http://www.space.com/16440-ganymede-facts-about-jupiters-largest-moon.html", "passage_text": "Jupiter’s moon Ganymede is the largest satellite in the solar system. Larger than Mercury and Pluto, and only slightly smaller than Mars, it would easily be classified as a planet if were orbiting the sun rather than Jupiter. Facts about Ganymede. Age: Ganymede is about 4.5 billion years old, about the same age as Jupiter. Distance from Jupiter: Ganymede is the seventh moon and third Galilean satellite outward from Jupiter, orbiting at about 665,000 miles (1.070 million km). It takes Ganymede about seven Earth days to orbit Jupiter. Photos of Ganymede, Jupiter's Largest Moon. Size: Ganymede’s mean radius is 1,635 miles (2,631.2 km). Due to its size, Ganymede can be viewed with the naked eye. Early Chinese astronomical records show the discovery of a moon of Jupiter, mostly likely the first observation of Ganymede"}, {"url": "https://en.wikipedia.org/wiki/Ganymede_(moon)", "passage_text": "Ganymede /ˈɡaenɨmiːd/ (ˈɡænɨmiːd JUPITER) iii is the largest moon Of jupiter and in The Solar, system and the only moon known to have a. Magnetosphere it is the seventh satellite outward From jupiter and third of The galilean, moons the first group of objects discovered orbiting another. planet With a diameter of 5,268 km (3,273 mi), it is 8% larger than the planet Mercury, but has only 45% as much mass. Its diameter is 2% larger than that of Saturn's Titan, the Solar System's second-largest moon."}, {"url": "https://en.wikipedia.org/wiki/Moon", "passage_text": "The Moon's gravitational influence produces the ocean tides, body tides, and the slight lengthening of the day. The Moon's current orbital distance is about thirty times the diameter of Earth, causing it to have an apparent size in the sky almost the same as that of the Sun. This allows the Moon to cover the Sun nearly precisely in total solar eclipse. This matching of apparent visual size is a coincidence"}, {"url": "http://www.space.com/15257-titan-saturn-largest-moon-facts-discovery-sdcmp.html", "passage_text": "View full size image. Titan is Saturn's largest moon and the second largest in the solar system (after Ganymede of Jupiter). It is the only moon in the solar system with clouds and a dense, planet-like atmosphere. Titan's atmosphere extends about 370 miles high (about 600 kilometers), which makes it a lot higher than Earth's atmosphere. Because the atmosphere is so high, Titan was thought to be the largest moon in the solar system for a long time."}, {"url": "http://www.skyandtelescope.com/astronomy-resources/smallest-and-largest-planets-in-our-solar-system/", "passage_text": "In fact, Mercury is closer in size to our Moon than to Earth. The largest planet in our solar system by far is Jupiter, which beats out all the other planets in both mass and volume. Jupiter’s mass is more than 300 times that of Earth, and its diameter is about 11 times larger than Earth’s diameter."}, {"url": "http://www.icr.org/article/solar-system-earth-moon/", "passage_text": "Earth also has a large natural satellite—the moon. Earth’s moon is the fifth-largest moon in the solar system. It is over one quarter the size of Earth in diameter. No other planet has a moon this large in proportion to the size of the planet. "}, {"url": "http://www.space.com/15257-titan-saturn-largest-moon-facts-discovery-sdcmp.html", "passage_text": "Titan's diameter is 50 percent larger than that of Earth's moon. Titan is larger than the planet Mercury but is half the mass of the planet. Titan's upland areas are shorter than Earth's. The largest mountains are only a few hundred yards high. Titan's atmosphere extends about 370 miles high (about 600 kilometers), which makes it a lot higher than Earth's atmosphere. Because the atmosphere is so high, Titan was thought to be the largest moon in the solar system for a long time."}, {"url": "http://www.universetoday.com/15509/ganymede/", "passage_text": "In addition to being the largest moon in the Solar System, it is the only moon other than Earth (and the gas giants) to have a magnetic field. And of course, there’s the possibility that life could exist beneath its icy crust, possibly in microbial or extreme form. Size, Mass and Orbit: With a mean radius of 2634.1 ± 0.3 kilometers (the equivalent of 0.413 Earths), Ganymede is the largest moon in the Solar System and is even larger than the planet Mercury. However, with a mass of 1.4819 x 10²³ kg (the equivalent of 0.025 Earths), it is only half as massive."}]