[{"url": "http://www.marxist.com/what-is-dialectical-materialism.htm", "passage_text": "Scientific socialism or Marxism is composed of three component parts: Dialectical Materialism, Historical Materialism and Marxist Economics. This pamphlet, the first in this series, is an introduction to the concepts of Dialectical Materialism-the method of Marxism. The purpose is to provide a basic explanation of the fundamental ideas of Marxism with a guide to further reading and points to help organise discussion groups around these ideas. We are starting with dialectical materialism, the philosophy"}, {"url": "http://www.allaboutphilosophy.org/dialectical-materialism-faq.htm", "passage_text": "Dialectical Materialism is the method of logical ideals used by Hegel and adapted somewhat by Karl Marx to observable social and economic processes, based on the principle that an idea or event (thesis) generates its opposite (antithesis) leading to a reconciliation of opposites. Dialectical materialism is said to be the precursor for and synonymous with Communism. The term dialectical materialism is originally credited to Russian revolutionary and social philosopher Georgi Valentinovich Plekhanov (1857 1918)."}, {"url": "https://en.wikipedia.org/wiki/Dialectical_materialism", "passage_text": "Dialectical materialism is not, and never has been, a programmatic method for solving particular physical problems. Rather, a dialectical analysis provides an overview and a set of warning signs against particular forms of dogmatism and narrowness of thought. The term dialectical materialism was coined in 1887, by Joseph Dietzgen, a socialist tanner who corresponded with Marx, during and after the failed 1848 German Revolution. As a philosopher, Dietzgen had constructed the theory of dialectical materialism independently of Marx and Engels."}, {"url": "http://www.marxist.com/what-is-dialectical-materialism.htm", "passage_text": "In beginning this study of Dialectical Materialism the editors are publishing an introductory article by Rob Sewell. While this is a good start to the subject, there is no substitute for proceeding from there to tackle the philosophical works of Marx, Engels, Lenin, Trotsky, Plekhanov and others. The purpose is to provide a basic explanation of the fundamental ideas of Marxism with a guide to further reading and points to help organise discussion groups around these ideas. We are starting with dialectical materialism, the philosophy of Marxism."}, {"url": "http://www.marxists.org/glossary/terms/d/i.htm", "passage_text": "Di. Dialectical Materialism. Dialectical Materialism is a way of understanding reality; whether thoughts, emotions, or the material world. Simply stated, this methodology is the combination of Dialectics and Materialism. The materialist dialectic is the theoretical foundation of Marxism (while being communist is the practice of Marxism). An example of dialectical materialism applied is the materialist conception of history. 'Dialectical Materialism' was coined by Karl Kautsky and popularised in the Second International after the death of Marx and Engels. See also: dialectics, materialism, Historical Materialism and Political Economy."}, {"url": "http://www.newworldencyclopedia.org/entry/Dialectical_materialism", "passage_text": "Dialectical materialism is the philosophical expression of Marxism and Marxism-Leninism. The name refers to the notion that Marxism is a materialist worldview with a dialectical method. Dialectical materialism holds that the world, including human beings, is matter in motion and that progress occurs through struggle."}, {"url": "http://www.merriam-webster.com/dictionary/dialectical%20materialism", "passage_text": "Definition of DIALECTICAL MATERIALISM. : the Marxist theory that maintains the material basis of a reality constantly changing in a dialectical process and the priority of matter over mind — compare historical materialism. ADVERTISEMENT. Britannica.com: Encyclopedia article about dialectical materialism. "}, {"url": "https://en.wikipedia.org/wiki/Dialectical_materialism", "passage_text": "Dialectical materialism (sometimes abbreviated diamat) is a philosophy of science and nature, based on the writings of Karl Marx and Friedrich Engels, and developed largely in Russia and the Soviet Union. It was inspired by dialectic and materialist philosophical traditions. The main idea of dialectical materialism lies in the concept of the evolution of the natural world and the emergence of new qualities of being at new stages of evolution. The term dialectical materialism was coined in 1887, by Joseph Dietzgen, a socialist tanner who corresponded with Marx, during and after the failed 1848 German Revolution. As a philosopher, Dietzgen had constructed the theory of dialectical materialism independently of Marx and Engels."}]