[{"url": "http://www.analysia.com/user.asp", "passage_text": "This opportunity is very popular! Getting paid 10$ for just a few minutes, many testers want that and statisticaly, they are less customers than testers. So you can not expect to do a test per day. It will depend about your profile as some company needs specific tester profile. "}, {"url": "http://onlinemoneybuzz.com/2012/10/get-paid-to-test-websites/", "passage_text": "Many of the usability companies pay testers $10 for every test that they successfully complete. Tests usually take 15-20 minutes to complete. That is not bad for 20 minutes of work. The downside is that you may not receive many opportunities to test websites. It is quite easy to become a website tester. All that you need to do is join some of the usability companies that recruit paid website testers. Here are few good ones to get you started. 1  UserTesting. 2  UserFeel. 3  Userlytics. 4  Analysia."}, {"url": "http://www.theworkathomewoman.com/test-websites/", "passage_text": "Get paid to test out websites. Simply fill out the user registration form and wait to be contacted by email for tasks. Each task will require you to read the instructions, complete the set task on the website, and record your session. Tests usually take between 10 – 15 minutes and pay $10 per test. "}, {"url": "http://www.usertesting.com/be-a-user-tester/", "passage_text": "‘As a site tester, you’ll provide candid feedback via video and audio recording of your gut reaction as you visit sites seeking feedback,’ says Durst.”. 1  Make Money in Your Spare Time Doing Simple Online Tasks “Get $10 for visiting a website and providing live, honest feedback about it. You must have a PayPal account and live in a country that can receive PayPal money transfers. You will receive your payment exactly 7 days after completing a website or app test (This waiting period allows us to ensure the quality of all recordings)."}, {"url": "http://www.usertesting.com/be-a-user-tester/", "passage_text": "How it works. Get $10 via paypal for every 20-minute session you complete. UserTesting pays you to visit websites or apps, complete a set of tasks, and speak your thoughts aloud. You must have a PayPal account and live in a country that can receive PayPal money transfers. You will receive your payment exactly 7 days after completing a website or app test (This waiting period allows us to ensure the quality of all recordings)."}, {"url": "http://www.usertesting.com/be-a-user-tester/", "passage_text": "Get paid to review websites and apps. Join our panel of reviewers. Visit an app or website and follow the instructions. Get paid $10 for each review. Email Address. I have read and agree with the Terms of Use and our Privacy Policy. You must have a PayPal account and live in a country that can receive PayPal money transfers. You will receive your payment exactly 7 days after completing a website or app test (This waiting period allows us to ensure the quality of all recordings)."}, {"url": "http://www.usertesting.com/be-a-user-tester/", "passage_text": "1 Consider Web Site Testing “[You] visit a specific Web site and perform an exact function…While you’re doing that, your screen is being recorded to track your mouse movement and clicks, your voice (but not your face) is recorded to hear as you verbalize your steps…You’re paid $10 for about 10 to 20 minutes of work.”. You must have a PayPal account and live in a country that can receive PayPal money transfers. You will receive your payment exactly 7 days after completing a website or app test (This waiting period allows us to ensure the quality of all recordings)."}, {"url": "http://www.e4s.co.uk/part-time-jobs/online-user-testing-jobs.htm", "passage_text": "Most online user testers get paid per test rather than receiving a set salary. Typically, you could expect to get paid between £6 and £8 for a user test which might take you around 20 to 25 minutes to complete. That equates to around £20 per hour if you can find enough of these online user tests to carry out! "}, {"url": "http://www.thepennyhoarder.com/how-to-get-paid-200-a-month-testing-websites/", "passage_text": "Testers are paid $10 via Paypal for every website that they review. User Feel reports that the top testers earn $100-$200 a month. Clearly you aren’t going to get rich doing this, but based off of the amount of time it takes to complete a review, it seems like an easy way to make some side money. Good luck Penny Hoarders!"}, {"url": "https://www.usertesting.com/faq-tester", "passage_text": "Testers get paid $10 for each completed test. A test consists of a 20 minute recording and answers to four follow-up written questions. Very rarely (less than 1% of the time), a client asks for a refund because they’re dissatisfied with the user. "}]