[{"url": "https://en.wikipedia.org/wiki/History_of_the_Federal_Reserve_System", "passage_text": "The Federal Reserve System is the third central banking system in United States history. The First Bank of the United States (1791–1811) and the Second Bank of the United States (1817–1836) each had a 20-year charter. After months of hearings, amendments, and debates the Federal Reserve Act passed Congress in December, 1913. The bill passed the House by an overwhelming majority of 298 to 60 on December 22, 1913 and passed the Senate the next day by a vote of 43 to 25."}, {"url": "http://www.investopedia.com/terms/f/1913-federal-reserve-act.asp", "passage_text": "DEFINITION of '1913 Federal Reserve Act'. The 1913 U.S. legislation that created the current Federal Reserve System. The Federal Reserve Act intended to establish a form of economic stability through the introduction of the Central Bank, which would be in charge of monetary policy, into the United States. The Federal Reserve Act is perhaps one of the most influential laws concerning the U.S. financial system. Next Up. Prior to 1913, panics were common occurrences, as investors were unsure about the safety of their deposits. The Federal Reserve Act gave the 12 Federal Reserve banks the ability to print money in order to ensure economic stability."}, {"url": "https://en.wikipedia.org/wiki/Federal_Reserve_Act", "passage_text": "The Federal Reserve Act created a system of private and public entities; there were to be at least eight, and no more than 12, private regional Federal Reserve banks. Twelve were established, and each had various branches, a board of directors, and district boundaries. The Federal Reserve act did create a national currency, but more importantly, the act was to create a monetary system that could respond effectively to the different stresses in the banking system and create a stable financial system."}, {"url": "http://study.com/academy/lesson/the-federal-reserve-act-of-1913-definition-lesson-quiz.html", "passage_text": "The United States Congress enacted the Federal Reserve Act of 1913. The Federal Reserve Act created the Federal Reserve System (the Fed). The Fed serves as the central bank of the United States. The Act created a banking system consisting of both private and public organizations. It established 12 regional Federal Reserve Banks. The Federal Reserve Act was enacted in response to a series of financial crises. The intent of the Act was to create a degree of financial stability. The Act empowers the Fed to regulate and supervise banks and to develop and implement monetary policy."}, {"url": "http://study.com/academy/lesson/the-federal-reserve-act-of-1913-definition-lesson-quiz.html", "passage_text": "Summary. The Federal Reserve Act of 1913 created the Federal Reserve System that serves as the central bank for the United States. The Fed sets and implements the nation's monetary policy. A Board of Governors that consists of seven members, including a chairman, runs the Fed. The Federal Reserve Act was enacted in response to a series of financial crises. The intent of the Act was to create a degree of financial stability. The Act empowers the Fed to regulate and supervise banks and to develop and implement"}, {"url": "http://www.federalreserve.gov/faqs/about_12594.htm", "passage_text": "It was created by the Congress to provide the nation with a safer, more flexible, and more stable monetary and financial system. The Federal Reserve was created on December 23, 1913, when President Woodrow Wilson signed the Federal Reserve Act into law. Today, the Federal Reserve's responsibilities fall into four general areas. 1  Conducting the nation's monetary policy by influencing money and credit conditions in the economy in pursuit of full employment and stable prices."}, {"url": "https://en.wikipedia.org/wiki/History_of_the_Federal_Reserve_System", "passage_text": "In order to get the Federal Reserve Act passed, Wilson needed the support of populist William Jennings Bryan, who was credited with ensuring Wilson's nomination by dramatically throwing his support Wilson's way at the 1912 Democratic convention. Wilson appointed Bryan as his Secretary of State. After months of hearings, amendments, and debates the Federal Reserve Act passed Congress in December, 1913. The bill passed the House by an overwhelming majority of 298 to 60 on December 22, 1913 and passed the Senate the next day by a vote of 43 to 25."}, {"url": "http://www.nolo.com/legal-encyclopedia/content/fed-reserve-act.html", "passage_text": "The Federal Reserve Act established the Federal Reserve System as the central banking authority of the United States. In the early 1900s, economists believed that the United States banking system needed reform. The Federal Reserve System was the answer to this perceived problem. The Act created 12 regional Federal Reserve banks located in major cities. The Act requires that any bank using the phrase National Bank in its name must be a member of the Federal Reserve System."}, {"url": "https://en.wikipedia.org/wiki/Federal_Reserve_Act", "passage_text": "3) is an Act of Congress that created and established the Federal Reserve System, the central banking system of the United States, and granted it the legal authority to issue Federal Reserve Notes (now commonly known as the U.S. Dollar) and Federal Reserve Bank Notes as legal tender. The Federal Reserve act did create a national currency, but more importantly, the act was to create a monetary system that could respond effectively to the different stresses in the banking system and create a stable financial system."}, {"url": "http://www.federalreserve.gov/faqs/about_12594.htm", "passage_text": "The Federal Reserve System, often referred to as the Federal Reserve or simply the Fed, is the central bank of the United States. Today, the Federal Reserve's responsibilities fall into four general areas. 1  Conducting the nation's monetary policy by influencing money and credit conditions in the economy in pursuit of full employment and stable prices."}]