[{"url": "https://in.answers.yahoo.com/question/index?qid=20081221051704AAkQcVD", "passage_text": "The area underneath the stress–strain curve is the toughness of the material—the energy the material can absorb prior to rupture. The resilience of the material is the triangular area underneath the elastic region of the curve. Strain is physical, like back strain and it hurts. Stress is mental and can cause all types of ailments, both physical and mental, such as heart attack or depression."}, {"url": "http://www.thefreedictionary.com/strain", "passage_text": "♦ In elastic strain the distorted body returns to its original shape and size when the force is removed. ♦ In plastic strain the distorted body does not return to its original shape and size even after the force has been removed. Compare stress. "}, {"url": "https://en.wikipedia.org/wiki/Deformation_(mechanics)", "passage_text": "Deformation in continuum mechanics is the transformation of a body from a reference configuration to a current configuration. A configuration is a set containing the positions of all particles of the body. Deformation is the change in the metric properties of a continuous body, meaning that a curve drawn in the initial body placement changes its length when displaced to a curve in the final placement. If none of the curves changes length, it is said that a rigid body displacement occurred."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20081221051704AAkQcVD", "passage_text": "It is simply a ratio of two quantities with the same unit. Tensile strains are positive whereas compressive strains are negative. The strain defined earlier was known as linear strain or normal strain or the longitudinal strain now let us define the shear strain. A material is said to be elastic if it returns to its original, unloaded dimensions when load is removed. Strain is physical, like back strain and it hurts. Stress is mental and can cause all types of ailments, both physical and mental, such as heart attack or depression."}, {"url": "http://www.ni.com/white-paper/3642/en/", "passage_text": "Strain is the amount of deformation of a body due to an applied force. More specifically, strain (e) is defined as the fractional change in length, as shown in Figure 1. Figure 1. Definition of Strain. Strain can be positive (tensile) or negative (compressive). While there are several methods of measuring strain, the most common is with a strain gage, a device whose electrical resistance varies in proportion to the amount of strain in the device. The most widely used gage is the bonded metallic strain gage."}, {"url": "https://en.wikipedia.org/wiki/Strain", "passage_text": "Strain may refer to:A situation where you tend to accomplish more than an expectation in a given period of time, 1  Strain (biology) , variants of plants, viruses or bacteria; or an inbred animal used for experimental purposes. 2  Strain (chemistry) , a chemical stress of a molecule. 1 Strain (injury) , an injury to a muscle in which the muscle fibers tear as a result of over-stretching. 2  Strain (manga) , a 1996 manga written by Yoshiyuki Okamura, and illustrated by Ryoichi Ikegami."}, {"url": "http://metals.about.com/od/metallurgy/g/Strain.htm", "passage_text": "Photo &copy dunand.northwestern.edu. In metallurgy, strain can simply be defined as the deformation of a solid due to stress. In other words, strain is a measure of deformation reflecting how much a material has been stretched (or compressed) when compared to its original length. If there is an increase in the length of a piece of metal due to stress, this is referred to as tensile strain"}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00111", "passage_text": "A strain is an injury to a muscle and/or tendons. Tendons are fibrous cords of tissue that attach muscles to the bone. Strains often occur in your foot, leg (typically the hamstring) or back. Similar to sprains, a strain may be a simple stretch in your muscle or tendon, or it may be a partial or complete tear in the muscle-and-tendon combination. Typical symptoms of a strain include pain, muscle spasm, muscle weakness, swelling, inflammation, and cramping"}, {"url": "https://en.wikipedia.org/wiki/Strain", "passage_text": "1 Strain (chemistry) , a chemical stress of a molecule. 2  Deformation (mechanics) , a geometrical measure of deformation representing the relative displacement between particles in a material body. 3  Strain (injury) , an injury to a muscle in which the muscle fibers tear as a result of over-stretching. 1 Strain (injury) , an injury to a muscle in which the muscle fibers tear as a result of over-stretching. 2  Strain (manga) , a 1996 manga written by Yoshiyuki Okamura, and illustrated by Ryoichi Ikegami."}]