[{"url": "http://www.ehow.com/about_5380715_function-muscular-system.html", "passage_text": "Nearly half of a human's body weight comes from muscle mass. By weight, that makes the muscular system the largest of the body's systems. It is comprised of more than 650 muscles working together. Human muscles come in three types: skeletal, cardiac and smooth. Each one performs different functions within your body. Without muscles, your body wouldn't move. You wouldn't be able to breathe, walk, excrete waste or even have a beating heart without muscles. Though people usually are familiar with the functions of skeletal muscles, most of the body's muscles are not under a person's control."}, {"url": "http://www.hsdinfo.com/the-top-5-muscular-system-functions/", "passage_text": "Muscular · Tagged: Muscular System Functions. The muscular system of the human body consists of skeletal muscle, cardiac muscle and smooth muscle. Skeletal muscle, as its name suggests attaches primarily to the skeleton and moves voluntarily or by reflex. Cardiac muscle is the muscle of the heart and contracts involuntarily. "}, {"url": "http://www.livestrong.com/article/114706-five-functions-muscular-system/", "passage_text": "Overview. The muscular system in your body is composed of skeletal muscle, cardiac muscle and smooth muscle. Skeletal muscle attaches primarily to your skeleton and moves voluntarily or by reflex"}, {"url": "http://www.innerbody.com/image/musfov.html", "passage_text": "Function of Muscle Tissue. The main function of the muscular system is movement. Muscles are the only tissue in the body that has the ability to contract and therefore move the other parts of the body. Related to the function of movement is the muscular system’s second function: the maintenance of posture and body position. Muscles often contract to hold the body still or in a particular position rather than to cause movement."}, {"url": "http://www.innerbody.com/image/musfov.html", "passage_text": "The muscular system is responsible for the movement of the human body. Attached to the bones of the skeletal system are about 700 named muscles that make up roughly half of a person’s body weight. Each of these muscles is a discrete organ constructed of skeletal muscle tissue, blood vessels, tendons, and nerves. Related to the function of movement is the muscular system’s second function: the maintenance of posture and body position. Muscles often contract to hold the body still or in a particular position rather than to cause movement."}, {"url": "http://www.answers.com/Q/What_is_the_main_function_of_the_muscular_system", "passage_text": "Solving the world's problems. . . one answer at a time. The functions of the muscular system are locomotion or mobility, strength, heat production, shock absorption, shaping the body, maintaining posture, and respiration. In addition it plays a role in the digestive process by peristalsis to move the food through. Skeletal muscles are attached to the bones allowing for movement. Smooth muscles line many of the bodies organs aiding in digestion. Smooth muscles line the walls of arteries, these regulate blood pressure. Lastly, cardiac muscle is what comprises the heart."}, {"url": "http://www.answers.com/Q/What_is_the_main_function_of_the_muscular_system", "passage_text": "The muscular system has a variety of roles within the human body. It is made up of muscles, joints, tendons, bones, ligaments and connective tissue that help to support intern … al organs. All of these systems work together to provide the body with stability and posture, motion, heat, circulation and help in digestion. Skeletal muscles are attached to the bones allowing for movement. Smooth muscles line many of the bodies organs aiding in digestion. Smooth muscles line the walls of arteries, these regulate blood pressure. Lastly, cardiac muscle is what comprises the heart."}, {"url": "http://www.livescience.com/26854-muscular-system-facts-functions-diseases.html", "passage_text": "Three types of muscles. The muscular system can be broken down into three types of muscles: skeletal, smooth and cardiac, according to the NIH. Skeletal muscles are the only voluntary muscle tissue in the human body and control every action that a person consciously performs. The heart's natural pacemaker is made of cardiac muscle that signals other cardiac muscles to contract. Like visceral muscles, cardiac muscle tissue is controlled involuntarily. While hormones and signals from the brain adjust the rate of contraction, cardiac muscle stimulates itself"}]