[{"url": "http://eschooltoday.com/ozone-depletion/where-is-the-ozone-layer.html", "passage_text": "The Ozone Layer This is simply a layer in the stratosphere containing a relatively high concentration of ozone. The earth's atmosphere is divided into several layers, and each layer plays an important role. The first region extending about 10km upwards from the earth's surface is called the troposphere. The ozone layer is mainly found in the lower portion of the stratosphere from approximately 20 to 30 kilometres (12 to 19 mi) above earth, though the thickness varies seasonally and geographically. The ozone layer protects the earth from the suns UV Rays."}, {"url": "http://ds9.ssl.berkeley.edu/LWS_GEMS/3/layers.htm", "passage_text": "The temperature decreases with altitude. Stratosphere: The stratosphere is found from about 7 to 30 miles (11-48 kilometers) above the Earths surface. In this region of the atmosphere is the ozone layer, which absorbs most of the harmful ultraviolet radiation from the Sun. The temperature increases slightly with altitude in the stratosphere. The highest temperature in this region is about 32 degrees Fahrenheit or 0 degrees Celsius"}, {"url": "https://en.wikipedia.org/wiki/Ozone_layer", "passage_text": "The ozone layer is mainly found in the lower portion of the stratosphere, from approximately 20 to 30 kilometres (12 to 19 mi) above Earth, though the thickness varies seasonally and geographically. The thickness of the ozone layer—that is, the total amount of ozone in a column overhead—varies by a large factor worldwide, being in general smaller near the equator and larger towards the poles. It also varies with season, being in general thicker during the spring and thinner during the autumn."}, {"url": "https://en.wikipedia.org/wiki/Ozone_layer", "passage_text": "The ozone layer absorbs 97–99% of the Sun's medium-frequency ultraviolet light (from about 200 nm to 315 nm wavelength), which otherwise would potentially damage exposed life forms near the surface. The thickness of the ozone layer—that is, the total amount of ozone in a column overhead—varies by a large factor worldwide, being in general smaller near the equator and larger towards the poles. It also varies with season, being in general thicker during the spring and thinner during the autumn."}, {"url": "https://en.wikipedia.org/wiki/Ozone_layer", "passage_text": "The ozone layer contains less than 10 parts per million of ozone, while the average ozone concentration in Earth's atmosphere as a whole is only about 0.3 parts per million. The thickness of the ozone layer—that is, the total amount of ozone in a column overhead—varies by a large factor worldwide, being in general smaller near the equator and larger towards the poles. It also varies with season, being in general thicker during the spring and thinner during the autumn."}, {"url": "http://theozonehole.com/ozonelayer.htm", "passage_text": "Arctic Ozone Hole. The Ozone Layer The ozone layer is a layer in Earth's atmosphere which contains relatively high concentrations of ozone (O3). This layer absorbs 97-99% of the sun's high frequency ultraviolet light, which is potentially damaging to life on earth"}, {"url": "http://www.ozonelayer.noaa.gov/science/basics.htm", "passage_text": "Ozone is very rare in our atmosphere, averaging about three molecules of ozone for every 10 million air molecules. In spite of this small amount, ozone plays a vital role in the atmosphere. In the information below, we present the basics about this important component of the Earth's atmosphere. This region of the atmosphere is called the stratosphere. The ozone in this region is commonly known as the ozone layer. The remaining ozone is in the lower region of the atmosphere, which is commonly called the troposphere. The figure (above) shows an example of how ozone is distributed"}, {"url": "http://www.ozonelayer.noaa.gov/science/basics.htm", "passage_text": "Where is ozone found in the atmosphere? Ozone is mainly found in two regions of the Earth's atmosphere. Most ozone (about 90%) resides in a layer that begins between 6 and 10 miles (10 and 17 kilometers) above the Earth's surface and extends up to about 30 miles (50 kilometers). This region of the atmosphere is called the stratosphere. The ozone in this region is commonly known as the ozone layer. The remaining ozone is in the lower region of the atmosphere, which is commonly called the troposphere. The figure (above) shows an example of how ozone is distributed in the atmosphere."}, {"url": "http://envis.tropmet.res.in/kidscorner/ozone.htm", "passage_text": "The troposphere extends up to the stratosphere layer, where good ozone protects life on Earth by absorbing some of the sun's UV rays. Stratospheric ozone is found most often between six to 30 miles above the Earth's surface. Ozone is a natural gas that is found in two different layers of the atmosphere. In the layer around the Earth's surface, otherwise known as the troposphere, bad ozone dirties the air and helps make smog."}]