[{"url": "http://www.wikihow.com/Make-a-Michelada", "passage_text": "Two Methods: Tomato Michelada Dark Michelada. A Michelada is a popular Mexican cocktail or cerveza preparada (prepared beer) that became popular in Mexico in the 40s when people started mixing beer with hot sauce or salsa. It's now starting to catch on in other parts of the world and can be compared to a Bloody Mary. 1 Mixing tomato juice and beer creates a type of cerveza preparada, but is not a Michelada if it doesn't contain Worcestershire, Maggi or soy sauce. 2  You can add the salt in the glass before pouring in the beer, but be careful because the salt will encourage extra foam to form."}, {"url": "http://www.wikihow.com/Make-a-Michelada", "passage_text": "1 In Puerto Vallarta, a Michelada does not traditionally have any hot sauces. 2  It is made up of plenty of ice, plenty of lime and a Mexican beer. 3  When the Michelada has hot sauce in it, it's sometimes called a Michelada Cubana (but the link to Cuba is unknown). 1 Mixing tomato juice and beer creates a type of cerveza preparada, but is not a Michelada if it doesn't contain Worcestershire, Maggi or soy sauce. 2  You can add the salt in the glass before pouring in the beer, but be careful because the salt will encourage extra foam to form."}, {"url": "http://cocktails.about.com/od/cocktailrecipes/r/michelada.htm", "passage_text": "Spice up your beer in a Michelada. Eric Futran-Chefshots / Photographer's Choice / Getty Images. The Michelada is interesting and its recipes can vary as much as the Bloody Mary. What you're essentially doing with this beer drink is spicing up your beer to your personal taste."}, {"url": "https://en.wikipedia.org/wiki/Michelada", "passage_text": "[mitʃeˈlaða]) is a Mexican cerveza preparada made with beer, lime juice, and assorted sauces, spices, and peppers. It is served in a chilled, salt-rimmed glass. There are numerous variations of this beverage throughout Mexico and Latin America. Some people in Mexico believe micheladas are a good remedy for hangovers. There are different variations of micheladas; for example, in Mexico City, the most common form is prepared with beer, lime, salt, and particular hot sauces or chile slices."}, {"url": "http://www.oxforddictionaries.com/definition/english/michelada", "passage_text": "More example sentences. 1  What goes in a michelada also depends on who you talk to. 2  This gave rise to variations culminating in the michelada(MY iced beer), with a spicy base as elaborate as a secret barbecue sauce. 3  Her list includes Brazil's Caipirinha, Cuba's Mojito and Mexico's Michelada. 1 This gave rise to variations culminating in the michelada(MY iced beer), with a spicy base as elaborate as a secret barbecue sauce. 2"}, {"url": "http://www.oxforddictionaries.com/definition/english/michelada", "passage_text": "1 What goes in a michelada also depends on who you talk to. 2  This gave rise to variations culminating in the michelada(MY iced beer), with a spicy base as elaborate as a secret barbecue sauce. 3  Her list includes Brazil's Caipirinha, Cuba's Mojito and Mexico's Michelada. 1 This gave rise to variations culminating in the michelada(MY iced beer), with a spicy base as elaborate as a secret barbecue sauce. 2"}, {"url": "http://www.chowhound.com/recipes/michelada-10662", "passage_text": "Makes: 2 drinks. There are several variations on this beertail, which is based on beer and lime juice. The version here is also known as a Michelada Cubana south of the border. With a flavor that’s sort of a mix between A.1. steak sauce and a Bloody Mary, our beer cocktail is an acquired taste—but one we think worth acquiring. "}, {"url": "https://en.wikipedia.org/wiki/Michelada", "passage_text": "There are a variety of types of micheladas. For example, a clamato contains clam juice and tom ato juice. A chelada contains simply lime and originally sea salt, but often simply regular table salt. A cubana contains Worcestershire sauce, hot sauce, chile, and salt. Depending on the region of Mexico, the preparation will vary. Some people in Mexico believe micheladas are a good remedy for hangovers. There are different variations of micheladas; for example, in Mexico City, the most common form is prepared with beer, lime, salt, and particular hot sauces or chile slices."}, {"url": "http://www.bonappetit.com/drinks/article/how-they-make-micheladas-in-mexico", "passage_text": "My wife may have gone a bit woozy for a few moments. I was hooked. The michelada, one of the most popular drinks in Mexico, is a beer-based cocktail made with lime, hot sauce, Worcestershire, and often tomato (or Clamato) juice, all served over ice in a glass with a salted rim. "}, {"url": "http://www.definitions.net/definition/michelada", "passage_text": "Michelada. Michelada is a Mexican cerveza preparada made with beer, lime juice, and assorted sauces, spices, and peppers. It is served in a chilled, salt-rimmed glass. There are numerous variations of this beverage throughout Mexico and Latin America. "}]