[{"url": "http://www.scienceprofonline.com/microbiology/binary-fission-cell-division-reproduction-prokaryotes.html", "passage_text": "​Binary fission is a type of cell division in which a parent cell copies it’s genetic material, and then divides, transforming into two daughter cells, each new cell having one complete copy of the genetic instructions necessary to run the cell. Binary Fission and Exponential Growth. Through the process of binary fission, one parent cell divides into two daughter cells and then each daughter cell of the following generation repeats the process…one cell leading to two, two to four, four to eight, and so on."}, {"url": "http://www.wisegeek.com/what-is-binary-fission.htm", "passage_text": "Binary fission is a form of asexual reproduction which is used by all prokaryotic organisms, and some eukaryotic organisms like fungi as well. In addition to being used to duplicate whole organisms, this process is also utilized within the cells of eukaryotic organisms by some of the organelles. In this process, two daughter cells are produced by a single parent cell which effectively clones itself. The Escherichia coli bacterium has been used extensively by researchers studying binary fission, as it provides a classic example of this asexual reproduction method in action, and it is very abundant."}, {"url": "http://www.scienceprofonline.com/microbiology/binary-fission-cell-division-reproduction-prokaryotes.html", "passage_text": "Article Summary: Prokaryotic cells reproduce by binary fission; a process in which the genetic material of the cell is copied and then the parent cell divides. Binary Fission of Prokaryotic Cells. Binary Fission and Exponential Growth. Through the process of binary fission, one parent cell divides into two daughter cells and then each daughter cell of the following generation repeats the process…one cell leading to two, two to four, four to eight, and so on."}, {"url": "http://biology.about.com/od/cellanatomy/ss/prokaryotes.htm", "passage_text": "Most prokaryotes reproduce asexually through a process called binary fission. During binary fission, the single DNA molecule replicates and the original cell is divided into two identical cells. 1  Binary fission begins with the single DNA molecule replicating and both copies attaching to the cell membrane. Prokaryotic cells are not as complex as eukaryotic cells. They have no true nucleus as the DNA is not contained within a membrane or separated from the rest of the cell, but is coiled up in a region of the cytoplasm called the nucleoid. Prokaryotic organisms have varying cell shapes."}, {"url": "http://biology.about.com/b/2009/09/23/binary-fission.htm", "passage_text": "Bacterial reproduction most commonly occurs by a kind of cell division called binary fission. Binary fission results in the formation of two bacterial cells that are genetically identical. During binary fission, the single DNA molecule replicates and both copies attach to the cell membrane. Next, the cell membrane extends between the two DNA molecules. "}, {"url": "https://en.wikipedia.org/wiki/Fission_(biology)", "passage_text": "Prokaryotic fission, which is binary fission, is a form of asexual reproduction and cell division used by all prokaryotes (bacteria and archaebacteria) and some organelles within eukaryotic organisms (e.g., mitochondria). The process of reproduction in a bacterial cell occurs through binary fission. In eukaryotic cells, asexual reproduction occurs through the more complex process of mitosis. The process of binary fission in bacteria involves: 1  Replication of the circular DNA molecule inside the cell."}, {"url": "https://micro.cornell.edu/research/epulopiscium/binary-fission-and-other-forms-reproduction-bacteria", "passage_text": "Most bacteria rely on binary fission for propagation. Conceptually this is a simple process; a cell just needs to grow to twice its starting size and then split in two. Instead of placing the FtsZ ring at the center of the cell, as in binary fission, (A) Z rings are placed near both cell poles in Epulopiscium. (B) Division forms a large mother cell and two small offspring cells. (C) The smaller cells contain DNA and become fully engulfed by the larger mother cell."}, {"url": "http://www.wisegeek.com/what-is-binary-fission.htm", "passage_text": "Ad. The timing of binary fission is important, as organisms must do it at the right moment. The process is partially regulated by the septal ring, a ring of proteins which forms around the middle of the cell, encouraging it to split evenly without damaging the DNA or the cell wall. In this process, two daughter cells are produced by a single parent cell which effectively clones itself. The Escherichia coli bacterium has been used extensively by researchers studying binary fission, as it provides a classic example of this asexual reproduction method in action, and it is very abundant."}, {"url": "https://micro.cornell.edu/research/epulopiscium/binary-fission-and-other-forms-reproduction-bacteria", "passage_text": "Before binary fission occurs, the cell must copy its genetic material (DNA) and segregate these copies to opposite ends of the cell. Then the many types of proteins that comprise the cell division machinery assemble at the future division site. Instead of placing the FtsZ ring at the center of the cell, as in binary fission, (A) Z rings are placed near both cell poles in Epulopiscium. (B) Division forms a large mother cell and two small offspring cells. (C) The smaller cells contain DNA and become fully engulfed by the larger mother cell."}]