[{"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/food-safety/faq-20058500", "passage_text": "Leftovers can be kept for three to four days in the refrigerator. Be sure to eat them within that time. After that, the risk of food poisoning increases. If you don't think you'll be able to eat leftovers within four days, freeze them immediately. "}, {"url": "http://stilltasty.com/fooditems/index/18079", "passage_text": "1 How long does potato salad last at room temperature? 2  Bacteria grow rapidly at temperatures between 40 °F and 140 °F; potato salad should be discarded if left for more than 2 hours at room temperature. "}, {"url": "http://shelflifeadvice.com/content/how-long-can-i-keep-refrigerated-leftovers", "passage_text": "Baked beans tend to have a longer shelf life because they don’t contain nearly as much water. If covered and properly refrigerated, they will last a week or longer. Cooked vegetables should be placed in covered containers with some airspace. Air prevents the germination of botulism spores (which requires air). These spores are not killed by boiling (212°F) temperatures. The fact that there is air present will allow mold growth, but, if the leftovers are properly refrigerated, they should keep for several days. How long they keep depends on the vegetable, what else was in the product, and the “available” water (water not tied up with solutes like salt, sugar). The website AlgerWiki says the following: - leftover cooked meat and meat dishes: 3-4 days. - leftover leftover poultry: (dishes and pieces) 3-4 days; pieces covered with broth: 1-2 days. - leftover carryout: 3-4 days (assuming it had been refrigerated within 2 hours of serving). Source(s):"}, {"url": "http://www.ehow.com/how_7653642_refrigerate-soup.html", "passage_text": "Cover each of the containers. Place the containers of soup into the refrigerator. Soups and stews that contain cooked meat, poultry and fish leftovers can be stored in the fridge for approximately three to four days before spoiling, according to the USDA. Test the temperature of the soup periodically as it cools. You can use a cooking thermometer or taste a little bit of the soup with a spoon. A temperature reading of 100 degrees Fahrenheit will let you know your soup is lukewarm."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_refrigerated_potato_soup_before_it_spoils", "passage_text": "Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airtight c … ontainer.     More information   I have found that the flavor of leftover chicken goes downhill pretty quickly. This food will keep for about 5 days in the refrigerator. Place the food in an air tight container for the best results. This food can easily be transferred to the freezer for … longer storage time. 26 people found this useful."}, {"url": "http://www.amazingsouprecipes.com/articles-4/potato-soup-articles/how-long-is-potato-soup-good/", "passage_text": "Depending on how your potato soup is made, you will want to permit it to keep in the refrigerator for about three to four days. Ideally it should be eaten within about two days, but if it is not, it will remain edible for at least four days time. If you are planning to keep it longer, your best bet is to freeze it. Potato soup freezes remarkably well, even if it is done with ham and cheese or some other meat. In fact, potato soup which is not kept at the proper temperature and given the right kind of refrigeration will make you quite ill. Be sure that you refrigerate leftovers promptly and use them in a good time span or else freeze them."}, {"url": "http://www.answers.com/Q/Will_potato_soup_go_bad_if_not_refrigerated", "passage_text": "It really depends on how long you keep them out of the refrigerator. If you leave them out for a couple of days they will spoil. If you leave them out for a couple of hours … you should be fine. From experience, potato soup will last for about 6 days. http://wiki.answers.com/Q/What_the_word_that_is_when_a_person_charged_with_a_crime_escapes_to_another_state&waAn=1."}, {"url": "http://www.amazingsouprecipes.com/articles-4/potato-soup-articles/how-long-is-potato-soup-good/", "passage_text": "The reason we recommend that potato soup be kept in the refrigerator only a few days is that it is a very low acid soup. It contains a lot of materials that are low in acid and do not’ keep well over a long span of time in normal refrigeration. In fact, potato soup which is not kept at the proper temperature and given the right kind of refrigeration will make you quite ill. Be sure that you refrigerate leftovers promptly and use them in a good time span or else freeze them."}]