[{"url": "http://plato.stanford.edu/entries/realism-intl-relations/", "passage_text": "In the discipline of international relations there are contending general theories or theoretical perspectives. Realism, also known as political realism, is a view of international politics that stresses its competitive and conflictual side. Idealism in international relations, like realism, can lay claim to a long tradition. Unsatisfied with the world as they have found it, idealists have always tried to answer the question of “what ought to be” in politics."}, {"url": "https://en.wikipedia.org/wiki/International_relations", "passage_text": "For example, international relations draws from the fields of: technology and engineering, economics, history, and international law, philosophy, geography, social work, sociology, anthropology, criminology, psychology, gender studies, cultural studies, culturology, diplomacy. International relations is an academic and a public policy field, and so can be positive and normative, because it analyzes and formulates the foreign policy of a given State."}, {"url": "https://en.wikipedia.org/wiki/International_relations", "passage_text": "The history of international relations based on sovereign states is often traced back to the Peace of Westphalia of 1648, a stepping stone in the development of the modern state system. Prior to this the European medieval organization of political authority was based on a vaguely hierarchical religious order. International relations is an academic and a public policy field, and so can be positive and normative, because it analyzes and formulates the foreign policy of a given State."}, {"url": "http://www.sparknotes.com/us-government-and-politics/political-science/international-politics/section2.rhtml", "passage_text": "Scholars use the term Wilsonian to describe a person or group who advocates promoting democracy overseas in the name of idealism. A theory of international relations is a set of ideas that explains how the international system works. Unlike an ideology, a theory of international relations is (at least in principle) backed up with concrete evidence. The two major theories of international relations are realism and liberalism."}, {"url": "https://en.wikipedia.org/wiki/International_relations", "passage_text": "International relations (IR) or international affairs, depending on academic institution, is either a field of political science or an interdisciplinary academic field similar to global studies, in which students take a variety of internationally focused courses in social science and humanities disciplines. International relations is an academic and a public policy field, and so can be positive and normative, because it analyzes and formulates the foreign policy of a given State."}, {"url": "http://www.rand.org/topics/international-economic-relations.html", "passage_text": "Increased international trade, and the lowering of barriers to such trade, frequently results in improved international relations, but it can also lead to trade wars and tariff disputes. "}, {"url": "http://www.infoplease.com/encyclopedia/history/international-relations.html", "passage_text": "More on international relations from Infoplease: 1  International Relations-Members of the United Nations, NATO, European Union, OPEC, location of U.S. embassies abroad, U.S. diplomatic milestones, and more. 2  Year in Review 1998 | World News-News of the World The Year in Review by Borgna Brunner Send this Page to a Friend! In many of the leading U.S. universities there are both research institutes and schools of international relations. See diplomatic service; United Nations; European Union. See R. Aron, Peace and War (tr."}, {"url": "https://en.wikipedia.org/wiki/International_relations", "passage_text": "As political activity, international relations dates from the time of the Greek historian Thucydides (c. 460–395 BC), and, in the early 20th century, became a discrete academic field (No. 5901 in the 4-digit UNESCO Nomenclature) within political science. International relations is an academic and a public policy field, and so can be positive and normative, because it analyzes and formulates the foreign policy of a given State."}, {"url": "http://ocw.tufts.edu/data/58/727216.pdf", "passage_text": "Political Science 61: Introduction to International Relations Last updated: 27 October 2008 GLOSSARY OF KEY TERMS IN INTERNATIONAL RELATIONS This is a glossary of key terms that arise in the lectures and the readings in Political Science 61: Introduction to International Relations. "}, {"url": "http://www.merriam-webster.com/dictionary/international%20relations", "passage_text": "Full Definition of INTERNATIONAL RELATIONS. : a branch of political science concerned with relations between nations and primarily with foreign policies. ADVERTISEMENT. "}]