[{"url": "http://www.foodallergens.info/Facts/Causes.html", "passage_text": "Our knowledge about the causes of food allergy is limited. Scientists suspect that certain genes, as well as conditions in the stomach and gut may play a role in the development of food allergy. With knowledge about the causes of food allergy we might be able to prevent some cases of food allergy. We also might be able to provide new advice on how to manage food allergy. Food allergies and allergic diseases in general probably share many risk factors."}, {"url": "http://www.mayoclinic.org/diseases-conditions/food-allergy/basics/causes/CON-20019293", "passage_text": "One of the tricky aspects of diagnosing food intolerance is that some people are sensitive not to the food itself but to a substance or ingredient used in the preparation of the food. Common conditions that can cause symptoms mistaken for a food allergy include: 1  Absence of an enzyme needed to fully digest a food. 2  You may not have adequate amounts of some enzymes needed to digest certain foods. Common conditions that can cause symptoms mistaken for a food allergy include: 1  Absence of an enzyme needed to fully digest a food. 2  Food poisoning. 3  Sensitivity to food additives. 4  Histamine toxicity."}, {"url": "http://www.medicalnewstoday.com/articles/263965.php", "passage_text": "3) Food poisoning-toxins can cause food intolerance. Some foods have naturally-occurring chemicals that can have a toxic effect on humans, causing diarrhea, nausea and vomiting. Undercooked beans have aflotoxins that can cause extremely unpleasant digestive problems. Fully cooked beans do not have the toxin. With food intolerance tiny amounts will usually have no effect. Doctors can also test for Immunoglobin E (IgE) antibodies. A symptom is something the sufferer feels and describes, such as pain or discomfort, while a sign is something others can detect, such as a rash."}, {"url": "http://www.chw.org/medical-care/asthma-allergy-and-clinical-immunology-center/conditions/allergy/types-of-allergens/foods/", "passage_text": "Eggs, milk, and peanuts are the most common causes of food allergies in children, with wheat, soy, and tree nuts also included. Peanuts, tree nuts, fish and shellfish commonly cause the most severe reactions. Between 2 and 4 percent of children have food allergies. Although most children outgrow their allergies, allergy to peanuts, tree nuts, and shellfish may be life-long."}, {"url": "http://www.webmd.com/allergies/tc/food-allergies-cause", "passage_text": "1 Milk, eggs, peanuts, tree nuts, fish, shellfish, wheat, and soy cause most problems in children. 2  Some babies are so sensitive to these foods that if the offending food is eaten by the mother, drinking her breast milk can cause a reaction. 3  Most children outgrow allergies to eggs, milk, wheat, and soy. 1 Some babies are so sensitive to these foods that if the offending food is eaten by the mother, drinking her breast milk can cause a reaction. 2  Most children outgrow allergies to eggs, milk, wheat, and soy. 3  Peanuts, tree nuts, fish, and shellfish cause most of the allergic reactions in teens and adults."}, {"url": "http://www.webmd.com/allergies/tc/food-allergies-cause", "passage_text": "Food allergies occur when the body's immune system overreacts to substances in food you have eaten, triggering an allergic reaction. Food allergies are more common in young children than in adults. 1  Milk, eggs, peanuts, tree nuts, fish, shellfish, wheat, and soy cause most problems in children. 2  Some babies are so sensitive to these foods that if the offending food is eaten by the mother, drinking her breast milk can cause a reaction. 1 Some babies are so sensitive to these foods that if the offending food is eaten by the mother, drinking her breast milk can cause a reaction. 2  Most children outgrow allergies to eggs, milk, wheat, and soy. 3  Peanuts, tree nuts, fish, and shellfish cause most of the allergic reactions in teens and adults."}, {"url": "https://en.wikipedia.org/wiki/Food_intolerance", "passage_text": "Food intolerance (or non-allergic food hypersensitivity) is a detrimental reaction, often delayed, to a food, beverage, food additive, or compound found in foods that produces symptoms in one or more body organs and systems, but generally refers to reactions other than food allergy. This mechanism causing allergies to typically give immediate reaction (a few minutes to a few hours) to foods, There are numerous causes for other types of food sensitivities, most of which, in contrast to food allergies, cause delayed hypersensitivity reactions to the food."}, {"url": "http://www.whfoods.com/genpage.php?tname=faq&dbid=30", "passage_text": "The most common food intolerance is lactose intolerance. Lactose intolerance affects up to 10% of adults, and is associated with symptoms of flatulence (gas), abdominal distention (bloating), and diarrhea after consuming cow's milk. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/food-allergy/basics/causes/CON-20019293", "passage_text": "Food intolerance and other reactions. There are a number of reactions to food that cause similar symptoms to a food allergy. Depending on the type of food intolerance you have, you may be able to eat small amounts of problem foods without a reaction. Common conditions that can cause symptoms mistaken for a food allergy include: 1  Absence of an enzyme needed to fully digest a food. 2  Food poisoning. 3  Sensitivity to food additives. 4  Histamine toxicity."}]