[{"url": "https://en.wikipedia.org/wiki/Wood", "passage_text": "Wood is a porous and fibrous structural tissue found in the stems and roots of trees and other woody plants. It has been used for thousands of years for both fuel and as a construction material. Wood has always been used extensively for furniture, such as chairs and beds. It is also used for tool handles and cutlery, such as chopsticks, toothpicks, and other utensils, like the wooden spoon."}, {"url": "https://en.wikipedia.org/wiki/Timber", "passage_text": "Finished lumber is supplied in standard sizes, mostly for the construction industry— primarily softwood, from coniferous species, including pine, fir and spruce (collectively spruce-pine-fir), cedar, and hemlock, but also some hardwood, for high-grade flooring. In the United Kingdom, the word lumber is rarely used in relation to wood, and timber is almost universally used in its place; but lumber has several other meanings in Britain, including unused or unwanted items."}, {"url": "http://www.livescience.com/27909-wolves.html", "passage_text": "There are many names for gray wolves. Besides timber wolf, they are also called common wolf, tundra wolf, Mexican wolf and plains wolf. To help with the red wolf population, wild wolves are given pups that are born in captivity. Wolves are common to all parts of the Northern Hemisphere. They are usually shy and cautious around humans but unlike the dog, have not been domesticated at all. The most common type of wolf is the gray wolf, or timber wolf. Adult grey wolves are 4 to 6.56 feet (120 to 200centimeters) long and weigh about 40 to 175 pounds (18 to 79 kilograms). Just like its name, the gray wolf typically has thick gray fur, although pure white or all black variations exist. Another common species, the red wolf, is a bit smaller"}, {"url": "http://tudorhistory.org/places/bw/", "passage_text": "Copyright, image use and linking information. Contact information. Mary Arden's Farm near Stratford-upon-Avon Photo by Lara E. Eakins. When someone mentions Tudor architecture, the image that most often comes to mind is the black and white timber/ plaster constructions. While this style of building did occur during the reign of the Tudors and earlier, it has been popular enough to continue as a building pattern to this very day. "}, {"url": "http://srelherp.uga.edu/snakes/crohor.htm", "passage_text": "Description: Timber rattlesnakes, which are called canebrake rattlesnake in the Coastal Plain of the Southeast, are large, heavy bodied snakes with the characteristic rattles on the end of the tail. "}, {"url": "https://en.wikipedia.org/wiki/Wood", "passage_text": "It is common to classify wood as either softwood or hardwood. The wood from conifers (e.g. pine) is called softwood, and the wood from dicotyledons (usually broad-leaved trees, e.g. oak) is called hardwood. These names are a bit misleading, as hardwoods are not necessarily hard, and softwoods are not necessarily soft. Wood has always been used extensively for furniture, such as chairs and beds. It is also used for tool handles and cutlery, such as chopsticks, toothpicks, and other utensils, like the wooden spoon."}, {"url": "https://en.wikipedia.org/wiki/Timber", "passage_text": "Lumber (American English; timber in Australian English, British English, Hiberno-English, and New Zealand English) is wood that has been processed into beams and planks, a stage in the process of wood production. Lumber may be supplied either rough-sawn, or surfaced on one or more of its faces. In the United Kingdom, the word lumber is rarely used in relation to wood, and timber is almost universally used in its place; but lumber has several other meanings in Britain, including unused or unwanted items."}, {"url": "https://en.wikipedia.org/wiki/Timber", "passage_text": "In Australia, Ireland, New Zealand and Britain, the term timber describes sawn wood products, such as floor boards. In the United States and Canada, generally timber describes standing or felled trees, before they are milled into boards, which are called lumber. In the United Kingdom, the word lumber is rarely used in relation to wood, and timber is almost universally used in its place; but lumber has several other meanings in Britain, including unused or unwanted items."}]