[{"url": "http://www.merriam-webster.com/dictionary/axon", "passage_text": "Definition of AXON. : a usually long and single nerve-cell process that usually conducts impulses away from the cell body — see neuron illustration. — ax·o·nal \\ˈak-sə-nəl; ak-ˈsae-, -ˈsä-\\ ˈsō. adjective : a usually long and single nerve-cell process that usually conducts impulses away from the cell body. — ax·o·nal \\ˈak-sən-əl; ak-ˈsaen-, -ˈsän-\\ ˈsōn"}, {"url": "http://www.merriam-webster.com/dictionary/axon", "passage_text": "Medical Definition of AXON. : a usually long and single nerve-cell process that usually conducts impulses away from the cell body. — ax·o·nal \\ˈak-sən-əl; ak-ˈsaen-, -ˈsän-\\ ˈsōn. adjective"}, {"url": "http://www.thefreedictionary.com/axon", "passage_text": "Noun. 1. axon-long nerve fiber that conducts away from the cell body of the neuron. axone. nerve fiber, nerve fibre-a threadlike extension of a nerve cell. nerve cell, neuron-a cell that is specialized to conduct nerve impulses. nerve end, nerve ending-the terminal structure of an axon that does not end at a synapse. "}, {"url": "https://en.wikipedia.org/wiki/Axon", "passage_text": "An axon (from Greek ἄξων axōn, áxōn), axis is a, long slender projection of a nerve, cell or, neuron that typically conducts electrical impulses away from the'neuron s cell. body An axon is one of two types of protoplasmic protrusions that extrude from the cell body of a neuron, the other type being dendrites."}, {"url": "http://www.thefreedictionary.com/Axons", "passage_text": "Noun. 1. axon-long nerve fiber that conducts away from the cell body of the neuron. axone. nerve fiber, nerve fibre-a threadlike extension of a nerve cell. nerve cell, neuron-a cell that is specialized to conduct nerve impulses. nerve end, nerve ending-the terminal structure of an axon that does not end at a synapse. Translations."}, {"url": "http://medical-dictionary.thefreedictionary.com/axon+terminals", "passage_text": "axon. the process of a nerve cell along which impulses travel away from the cell body. It branches at its termination, forming synapses at other nerve cells or effector organs. Many axons are covered by a myelin sheath formed from the cell membrane of a glial or Schwann cell. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7797", "passage_text": "Axon: A long fiber of a nerve cell (a neuron) that acts somewhat like a fiber-optic cable carrying outgoing (efferent) messages. The neuron sends electrical impulses from its cell body through the axon to target cells. Each nerve cell has one axon. An axon can be over 20 cm (a foot) in length, which for the human body is remarkably long."}, {"url": "https://en.wikipedia.org/wiki/Axon", "passage_text": "An axon (from Greek ἄξων axōn, áxōn), axis is a, long slender projection of a nerve, cell or, neuron that typically conducts electrical impulses away from the'neuron s cell. Body myelinated axons are known as nerve. Fibers the function of the axon is to transmit information to different, neurons muscles and. glands An axon is one of two types of protoplasmic protrusions that extrude from the cell body of a neuron, the other type being dendrites."}, {"url": "https://en.wikipedia.org/wiki/Axon", "passage_text": "An axon (from Greek ἄξων axōn, áxōn), axis is a, long slender projection of a nerve, cell or, neuron that typically conducts electrical impulses away from the'neuron s cell. Body myelinated axons are known as nerve. fibers An axon is one of two types of protoplasmic protrusions that extrude from the cell body of a neuron, the other type being dendrites."}]