[{"url": "http://www.physicianspractice.com/law-malpractice/patient-records-legal-primer", "passage_text": "Records for minors, for example, should be held for two years past the patient’s age of majority, which is 20 in most states. Records related to workplace injuries in which the Occupational Safety and Health Administration was involved must be held for 30 years, and charts for veterans must be held for 75 years. "}, {"url": "https://www.medicare.gov/manage-your-health/electronic-prescribing/electronic-prescribing.html", "passage_text": "Electronic prescribing is a way for your prescribers (your doctor or other health care provider who is legally allowed to write prescriptions) to send your prescriptions electronically and directly to your pharmacy. Electronic prescribing can save you money, time, and help keep you safe. "}, {"url": "http://www.health.ny.gov/publications/1443/", "passage_text": "A. Once your request is received, a physician or health care facility has 10 days to provide you with an opportunity to inspect your records. The law does not provide a specific time period by which copies of medical records must be provided. However, the state Health Department considers 10 to 14 days to be a reasonable time in which a practitioner should respond to such a request. A. Yes, but not forever. Physicians and hospitals are required by state law to maintain patient records for at least six years from the date of the patient's last visit. A doctor must keep obstetrical records and records of children for at least six years or until the child reaches age 19, whichever is later."}, {"url": "http://www.answers.com/Q/How_long_do_doctor%27s_have_to_keep_medical_records", "passage_text": "All medical records are legal documents and are to be kept from the time you are born, when you switch Dr.'s, and even after your death for a minimum of five years. In the US, doctors, psychologists, psychiatrists, hospitals, and dentists must keep medical records for a minimum of 7 years. Some exclusions exist, however, and you may be charged for copie"}, {"url": "http://www.dhp.virginia.gov/medicine/medicine_faq.htm", "passage_text": "A request for copies of medical records must be in writing, dated and signed by the person making the request, and include a reasonable description of the records sought. If someone is making a request on your behalf, he or she must provide evidence of the authority to receive the records (such as a power of attorney). It is the practitioner's responsibility to maintain the certificates and any other continuing competency forms or records for six years following renewal. Do not send any forms or documents to the Board of Medicine unless requested to do so."}, {"url": "http://www.lsnjlaw.org/Health-Care/Patient-Rights/Pages/How-to-Get-a-Copy-of-Your-Medical-Records-in-New-Jersey.aspx", "passage_text": "How long do I have to wait to get my copy? Doctors and hospitals have 30 days from the time they receive your written request to give you the copy of your medical records. In practice, your records are usually copied and ready for you to receive in person in a week to 10 days. No. In New Jersey, records of your medical care are the property of your health care provider. Doctors must keep the originals in case they are needed later for your treatment by another doctor or health care provider. The law allows you to get copies of the records."}, {"url": "http://www.mbc.ca.gov/Consumers/Complaints/Complaints_FAQ/Medical_Records_FAQ.aspx", "passage_text": "As long as you requested your medical records in writing, to be sent directly to you (and not to anyone else, like your new doctor), the physician is required to send you a copy within specified time limits. If you want to insure that your new doctor receives a copy of your medical records from your previous doctor, you can write your previous doctor requesting that a copy of your medical records be sent directly to you. When you receive your records, you can provide a copy of those records to any provider you choose."}, {"url": "http://www.mbc.ca.gov/Consumers/Complaints/Complaints_FAQ/Medical_Records_FAQ.aspx", "passage_text": "If you made your request in writing for the records to be sent directly to you, the physician must provide copies to you within 15 days. The physician can charge a reasonable fee for the cost of making the copies. If you want to insure that your new doctor receives a copy of your medical records from your previous doctor, you can write your previous doctor requesting that a copy of your medical records be sent directly to you. When you receive your records, you can provide a copy of those records to any provider you choose."}]