[{"url": "http://www.babycenter.com/0_the-mmr-vaccine_1567.bc", "passage_text": "The CDC recommends that children age 12 to 47 months or any child with a history of seizures get the MMR and varicella vaccines separately because studies show an increased risk of fever and febrile seizures when they're combined. The MMRV is the same as the MMR, except that it also includes protection against the varicella virus, which causes chicken pox. Some parents get the first dose of the MMR vaccine for their child, and choose the MMRV vaccine for the second dose."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/measles/vacc-in-short.htm", "passage_text": "1 Children 12 months of age or older should have documentation of two doses of MMR vaccine (the first dose of MMR vaccine should be administered at age 12 months or older; the second dose no earlier than 28 days after the first dose). Vaccine. Measles can be prevented with the MMR (measles, mumps, and rubella) vaccine— a live, attenuated (weakened), combination vaccine that protects against all three viruses. It was first licensed in the combined form in 1971 and contains the safest and most effective forms of each vaccine."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/measles/vacc-in-short.htm", "passage_text": "Children should get 2 doses of MMR vaccine: 1  The first dose at 12 months through 15 months of age. 2  The second dose at 4 years through 6 years of age. Vaccine. Measles can be prevented with the MMR (measles, mumps, and rubella) vaccine— a live, attenuated (weakened), combination vaccine that protects against all three viruses. It was first licensed in the combined form in 1971 and contains the safest and most effective forms of each vaccine."}, {"url": "http://www.health.vic.gov.au/immunisation/factsheets/mmr.htm", "passage_text": "The National Immunisation Program provides free measles, mumps, and rubella (MMR) vaccine to children at 12 months and 18 months of age. The four year old MMR dose ends in December 2015. People who were born during or since 1966, who have not received two doses of a measles containing vaccine, should also be vaccinated. The MMR vaccine protects children against all three diseases and is given at 12 months of age. A second dose using MMRV vaccine is given at 18 months of age to also protect children from chickenpox. MMR is given at four years of age to children who did not get their second MMR vaccine at 18 months of age. The four year old MMR dose ends in December 2015. All people born during or since 1966 should check their immunisation status to ensure they have had two doses of a measles containing vaccine"}, {"url": "http://www.caringforkids.cps.ca/handouts/measles_mumps_rubella_vaccine", "passage_text": "Vaccination can protect your child. In Canada, children get two doses of the MMR vaccine: 1  The first shot is given at 12 to 15 months of age. 2  The second shot is given at 18 months OR between ages 4 to 6 years (before your child starts school). In many provinces, the chickenpox vaccine is combined with the MMR vaccine (the combination vaccine is called MMR-V). If your child is between 6 and 12 months old and you live or are travelling to an area that has a known measles outbreak, talk to your child’s doctor about getting an early dose of the MMR vaccine. Keep in mind that your baby will still need to get her regular MMR shot when she is 12 months old"}, {"url": "http://www.babycenter.com/0_the-mmr-vaccine_1567.bc", "passage_text": "You can also protect your child against chicken pox with the MMRV vaccine. The MMRV is the same as the MMR, except that it also includes protection against the varicella virus, which causes chicken pox. Some parents get the first dose of the MMR vaccine for their child, and choose the MMRV vaccine for the second dose."}, {"url": "http://www.webmd.com/children/vaccines/measles-mumps-and-rubella-mmr-vaccine", "passage_text": "MMR is a two-shot series of vaccines usually given during childhood. A child should receive the first shot when he is between 12-15 months, and the second when he's between 4-6 years of age. If you're not sure if you have had the diseases or the vaccines (prior to 1971 it was given in three separate shots), you can get the MMR vaccine as an adult. Talk to your doctor about it if:"}, {"url": "http://www.immunize.org/vis/mmr.pdf", "passage_text": "Children should get 2 doses of MMR vaccine: • First Dose: 12–15 months of age• Second Dose: 4–6 years of age (may be given earlier, if at least 28 days after the 1st dose)Some infants younger than 12 months should get a dose. of MMR if they are traveling out of the country. "}]