[{"url": "http://www.wineanorak.com/tannins.htm", "passage_text": "While tannins exist in grapes, what we are actually interested in is the tannins that are found in wine. There s a difference. Wine tannins come from grape skins, stems and seeds, and their extraction is heavily dependent on the particular winemaking process involved. The term 'tannin' is commonly used in wine circles, but many people aren't really sure exactly what it means. In this detailed article, Jamie Goode unpacks this important subject, and discusses some exciting new data that challenge the conventional wisdom on this topic. I m facing the usual dilemma."}, {"url": "https://en.wikipedia.org/wiki/Tannin", "passage_text": "The tannin compounds are widely distributed in many species of plants, where they play a role in protection from predation, and perhaps also as pesticides, and in plant growth regulation. The astringency from the tannins is what causes the dry and puckery feeling in the mouth following the consumption of unripened fruit or red wine. Likewise, the destruction or modification of tannins with time plays an important role in the ripening of fruit and the aging of wine."}, {"url": "http://winefolly.com/review/what-are-tannins-in-wine/", "passage_text": "Grape tannin comes from the skins, seeds and stems of a wine grape. For this reason, red wines tend to have higher tannins than white wines because the extended contact of the grapes to the juice gives the tannin time to dissolve in the alcohol and water in the wine. Some types of wine have higher tannins than others. About 50% of the dry weight of plant leaves are tannins. As a characteristic of wine, tannin adds both bitterness and astringency as well as complexity. Wine tannins are most commonly found in red wine, although white wines have tannin from being aged in wooden barrels."}, {"url": "http://www.delish.com/entertaining/wine/q-and-a/a23701/tannin-wine/", "passage_text": "Tannin is a natural preservative and is one of the many components that give wine its longevity. It comes from skins, pits, and stems of the grapes. Another source of tannin is wood, such as the French oak barrels in which some wines are aged or fermented. A word used to describe the sensation of tannins is astringent.. Especially in young wines, tannin can be very astringent and make the wine taste bitter. Tannin is not a taste, however — it's a tactile sensation. Tannin is also found in strong tea."}, {"url": "http://winemakersacademy.com/tannins/", "passage_text": "Tannins are an astringent compound found in plants that are responsible for the gritty texture in red wines. They have no flavor or aroma but can be experienced as dryness. The word tannin stems from the use of this compound to “tan” leather. You can see that the control of tannins is a concern when making red wines. Tannins may also be purchased in a powdered form and added to your wine if you find it lacking. Often this is done with wine kits which are low in tannins so that they become drinkable sooner (read this)."}, {"url": "http://www.wineanorak.com/tannins.htm", "passage_text": "Tannins The term 'tannin' is commonly used in wine circles, but many people aren't really sure exactly what it means. In this detailed article, Jamie Goode unpacks this important subject, and discusses some exciting new data that challenge the conventional wisdom on this topic. I m facing the usual dilemma."}, {"url": "http://www.eckraus.com/2-oz-wine-tannin.html", "passage_text": "Description. (TAN210) Wine Tannin (also known as tannic acid) is very light in color and is preferred by most winemakers to be used with white and rose wines, but it can be used in red wines as well. Tannins are found naturally in fruits such as elderberries, plums and apples. "}, {"url": "http://www.chicagotribune.com/dining/recipes/sc-food-0213-wine-tannin-20150209-column.html", "passage_text": "Tannin is also crucial to the aging of red wine. Because tannins are antioxidants, they help preserve the fruit character of a wine over time, says Carpenter. Tannins begin life in red wine as short-chain molecules, but over time polymerize or plasticize into long-chain molecules. They're tactile.. Tannins are phenols; in wine they come from the skins, seeds and stems of the grapes. That's why they are more prevalent in red wines than whites; red wines get their color from their grapes' skins during fermentation."}, {"url": "http://winefolly.com/review/what-are-tannins-in-wine/", "passage_text": "In wine, tannin is a textural element that makes wine taste dry. Tannin is a naturally occurring polyphenol found in plants, seeds, bark, wood, leaves and fruit skins. About 50% of the dry weight of plant leaves are tannins. As a characteristic of wine, tannin adds both bitterness and astringency as well as complexity. Wine tannins are most commonly found in red wine, although white wines have tannin from being aged in wooden barrels."}]