[{"url": "http://searchnetworking.techtarget.com/definition/MHz", "passage_text": "The megahertz, abbreviated MHz, is a unit of alternating current (AC) or electromagnetic (EM) wave frequency equal to one million hertz (1,000,000 Hz). The megahertz is commonly used to express microprocessor clock speed."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080824100843AAaTBoW", "passage_text": "Best Answer: MHz = MegaHertz a wave that cycles 1,000,000 time per second. GHz (GigaHertz) is 1,000 times faster. processor speed is given in the clock cycle frequency that has somewhat to do with the overall computer performance, but ultimately depends on the total package."}, {"url": "http://superuser.com/questions/736381/what-does-the-mhz-of-ram-really-mean", "passage_text": "Countless of times I've heard and read that RAM-memory can have different speeds-denoted as MHz (e.g. 1066 MHz). However, what this frequency really is has never been explained to me and I'm having trouble finding an answer."}, {"url": "http://searchnetworking.techtarget.com/definition/MHz", "passage_text": "Other units of frequency are the kHz, equal to 1,000 Hz or 0.001 MHz, and the gigahertz, equal to 1,000,000,000 Hz or 1,000 MHz. The bandwidth of a digital signal, in megahertz, is related to the data speed in bits per second."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081103151224AAXvYWT", "passage_text": "Report Abuse. Mhz is the frequency of the ram, the higher the mhz the faster the ram will process data. Since you have 333Mhz now most likely your motherboard supports 400Mhz frequency, as long as its the same RAM which most likely you have DDR Ram. In turn, your computer will be slightly faster when upgrading."}, {"url": "http://www.tomshardware.com/answers/id-1728643/memory-mhz.html", "passage_text": "The speed of the clock is measured in Megahertz (MHz). Well, the frequency is essentially how fast something processes in a computer. In this case(memory), it determines how fast information is going to go to your memory and back. DDR, DDR2, DDR3 memories follow the DDRxxx/PCyyyy classification."}, {"url": "http://www.webopedia.com/TERM/M/MHz.html", "passage_text": "Abbreviation for megahertz. One MHz represents one million cycles per second. The speed of microprocessors, called the clock speed, is measured in megahertz. For example, a microprocessor that runs at 200 MHz executes 200"}]