[{"url": "http://www.ndss.org/Down-Syndrome/What-Is-Down-Syndrome/", "passage_text": "Mosaicism. Mosaicism (or mosaic Down syndrome) is diagnosed when there is a mixture of two types of cells, some containing the usual 46 chromosomes and some containing 47. Those cells with 47 chromosomes contain an extra chromosome 21. Translocation. In translocation, which accounts for about 4% of cases of Down syndrome, the total number of chromosomes in the cells remains 46; however, an additional full or partial copy of chromosome 21 attaches to another chromosome, usually chromosome 14."}, {"url": "http://www.cdc.gov/ncbddd/birthdefects/DownSyndrome.html", "passage_text": "Mosaic Down syndrome: This type affects about 2% of the people with Down syndrome. Mosaic means mixture or combination. For children with mosaic Down syndrome, some of their cells have 3 copies of chromosome 21, but other cells have the typical two copies of chromosome 21. With this type of Down syndrome, each cell in the body has 3 separate copies of chromosome 21 instead of the usual 2 copies. Translocation Down syndrome: This type accounts for a small percentage of people with Down syndrome (about 3%)."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001992/", "passage_text": "Down Syndrome. Down syndrome, also known as trisomy 21, is a genetic disorder caused by the presence of all or part of a third copy of chromosome 21. It is typically associated with physical growth delays, characteristic facial features, and mild to moderate intellectual disability. PubMed Health Glossary. (Source: Wikipedia)."}, {"url": "http://www.ndss.org/Down-Syndrome/What-Is-Down-Syndrome/", "passage_text": "Regardless of the type of Down syndrome a person may have, all people with Down syndrome have an extra, critical portion of chromosome 21 present in all or some of their cells. This additional genetic material alters the course of development and causes the characteristics associated with Down syndrome. Translocation. In translocation, which accounts for about 4% of cases of Down syndrome, the total number of chromosomes in the cells remains 46; however, an additional full or partial copy of chromosome 21 attaches to another chromosome, usually chromosome 14."}, {"url": "http://www.cdc.gov/ncbddd/birthdefects/DownSyndrome.html", "passage_text": "Trisomy 21: About 95% of people with Down syndrome have Trisomy 21. With this type of Down syndrome, each cell in the body has 3 separate copies of chromosome 21 instead of the usual 2 copies. Translocation Down syndrome: This type accounts for a small percentage of people with Down syndrome (about 3%). This occurs when an extra part or a whole extra chromosome 21 is present, but it is attached or “trans-located” to a different chromosome rather than being a separate chromosome"}, {"url": "http://www.cdss.ca/information/general-information/types-of-down-syndrome.html", "passage_text": "There are three types of chromosomal patterns that result in Down syndrome. They are: trisomy 21, translocation and mosaicism. A blood test is required for chromosome analysis and the type of pattern would be determined at that time. Ninety-five per cent of people with Down syndrome have trisomy 21, which means there is an extra #21 chromosome in each cell. Two to three per cent of people with Down syndrome have a translocation pattern. "}, {"url": "http://ghr.nlm.nih.gov/condition/down-syndrome", "passage_text": "Affected individuals with this genetic change are said to have translocation Down syndrome. A very small percentage of people with Down syndrome have an extra copy of chromosome 21 in only some of the body's cells. Down syndrome is a chromosomal condition that is associated with intellectual disability, a characteristic facial appearance, and weak muscle tone (hypotonia) in infancy."}, {"url": "http://ghr.nlm.nih.gov/condition/down-syndrome", "passage_text": "People with translocation Down syndrome can inherit the condition from an unaffected parent. The parent carries a rearrangement of genetic material between chromosome 21 and another chromosome. This rearrangement is called a balanced translocation. Down syndrome is a chromosomal condition that is associated with intellectual disability, a characteristic facial appearance, and weak muscle tone (hypotonia) in infancy."}, {"url": "https://en.wikipedia.org/wiki/Down_syndrome", "passage_text": "Down syndrome (DS or DNS) or Down's syndrome, also known as trisomy 21, is a genetic disorder caused by the presence of all or part of a third copy of chromosome 21. It is typically associated with physical growth delays, characteristic facial features, and mild to moderate intellectual disability. "}]