[{"url": "http://learn.org/articles/What_is_Biological_Psychology.html", "passage_text": "Defining Biological Psychology. Alternative names of biopsychology, such as behavioral neuroscience and physiological biology, indicate a preliminary definition. Researchers in this field examine not only how biology-particularly the nervous system-affects behavior, but also how behaviors affect the brain."}, {"url": "http://www.britannica.com/science/biological-psychology", "passage_text": "Biological psychology is concerned primarily with the relationship between psychological processes and the underlying physiological events—or, in other words, the mind-body phenomenon."}, {"url": "http://learningpath.org/articles/Biological_Psychologist_Careers_Job_Description_Salary_Info.html", "passage_text": "Job Description. Biological psychology is a research-focused branch of science that explores the effects of biological processes on human and animal behavior. As a biological psychologist, you could work at a college or university in a research-based or academic position."}, {"url": "https://en.wikipedia.org/wiki/Biological_psychology", "passage_text": "Behavioral neuroscience, also known as biological psychology, biopsychology, or psychobiology is the application of the principles of biology (in particular neurobiology), to the study of physiological, genetic, and developmental mechanisms of behavior in humans and non-human animals."}, {"url": "http://www.britannica.com/science/biological-psychology", "passage_text": "Biological psychology, also called physiological psychology or behavioral neuroscience, the study of the physiological bases of behaviour."}, {"url": "http://learn.org/articles/What_is_Biological_Psychology.html", "passage_text": "Biological psychology, or biopsychology, is a field in which the mind-body connection is explored through scientific research and clinical practice. Researchers in this field study the biological basis of thoughts, emotions and behaviors."}, {"url": "http://work.chron.com/biological-psychologist-22060.html", "passage_text": "Biological psychology is a branch of psychology that studies the physiological causes of behavior. This field is sometimes referred to as behavioral neuroscience or biopsychology."}, {"url": "http://www.merriam-webster.com/medical/cognitive%20psychology", "passage_text": "Medical Definition of COGNITIVE PSYCHOLOGY. : a branch of psychology concerned with mental processes (as perception, thinking, learning, and memory) especially with respect to the internal events occurring between sensory stimulation and the overt expression of behavior—compare behaviorism. — cognitive psychologist noun."}, {"url": "http://medical-dictionary.thefreedictionary.com/Biological+psychology", "passage_text": "1. biopsychology; a field of study examining the relationship between brain and mind, studying the effect of biological influences on psychological functioning or mental processes."}]