[{"url": "https://msu.edu/~potters6/te801/Biology/biounits/respiration.htm", "passage_text": "Cellular respiration is the process by which the chemical energy of food molecules is released and partially captured in the form of ATP. Carbohydrates, fats, and proteins can all be used as fuels in cellular respiration, but glucose is most commonly used as an example to examine the reactions and pathways involved. In glycolysis, the 6-carbon sugar, glucose, is broken down into two molecules of a 3-carbon molecule called pyruvate."}, {"url": "https://www.wyzant.com/resources/lessons/science/biology/cellular-respiration", "passage_text": "Cellular respiration is the process by which cells get their energy in the form of ATP. There are two types of cellular respiration, aerobic and anaerobic. Aerobic respiration is more efficient and can be utilized in the presence of oxygen, while anaerobic respiration does not require oxygen. Fermentation releases CO 2, but does not make any ATP – all ATP during anaerobic respiration is produced during glycolysis. Since glycolysis produces 2 ATP, anaerobic respiration yields 2 ATP for every molecule of glucose. Both glycolysis and fermentation take place within the cytosol/cytoplasm of a cell."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/C/CellularRespiration.html", "passage_text": "Cellular respiration is the process of oxidizing food molecules, like glucose, to carbon dioxide and water. C6H12O6 + 6O2 + 6H2O → 12H2O + 6 CO2. The energy released is trapped in the form of ATP for use by all the energy-consuming activities of the cell. 1  glycolysis, the breakdown of glucose to pyruvic acid. "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/biology/celres.html", "passage_text": "Aerobic respiration, or cell respiration in the presence of oxygen, uses the end product of glycolysis (pyruvate) in the TCA cycle to produce much more energy currency in the form of ATP than can be obtained from any anaerobic pathway. It can be aerobic respiration in the presence of oxygen or anaerobic respiration. Prokaryotic cells carry out cellular respiration within the cytoplasm or on the inner surfaces of the cells. More emphasis here will be placed on eukaryotic cells where the mitochondria are the site of most of the reactions."}, {"url": "http://www.answers.com/Q/What_does_cellular_respiration_do", "passage_text": "This type of respiration in which oxygen is not used as a final electron acceptor is referred to as anaerobic. In anaerobic respiration (respiration in absence of oxygen), pyruvate is not metabolized by cellular respiration but undergoes a process of fermentation. (1) Glycolysis. (2) Citric Acid cycle or Krebs Cycle. (3) Oxidative phosphorylation. The cell seems to respire in a way that it takes in molecular oxygen (as an electron acceptor) and releases carbon dioxide (as an end product), hence, the process is described to be aerobic."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/biology/celres.html", "passage_text": "Cellular Respiration. The term cellular respiration refers to the biochemical pathway by which cells release energy from the chemical bonds of food molecules and provide that energy for the essential processes of life. All living cells must carry out cellular respiration. It can be aerobic respiration in the presence of oxygen or anaerobic respiration. Prokaryotic cells carry out cellular respiration within the cytoplasm or on the inner surfaces of the cells. More emphasis here will be placed on eukaryotic cells where the mitochondria are the site of most of the reactions."}, {"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "Cellular respiration is the set of metabolic reactions and processes that take place in the cells of organisms to convert biochemical energy from nutrients into adenosine triphosphate (ATP), and then release waste products. The overall reaction occurs in a series of biochemical steps, most of which are redox reactions themselves. Although technically, cellular respiration is a combustion reaction, it clearly does not resemble one when it occurs in a living cell due to slow release of energy from the series of reactions."}, {"url": "http://www.answers.com/Q/What_does_cellular_respiration_do", "passage_text": "No-cellular respiration is the process of converting glucose (C6H12O6) to ATP-a form of energy that can be used by the cell. Synthesis is a general term used for the cre … ation of a product, for example protein synthesis is the creation of a protein. (1) Glycolysis. (2) Citric Acid cycle or Krebs Cycle. (3) Oxidative phosphorylation. The cell seems to respire in a way that it takes in molecular oxygen (as an electron acceptor) and releases carbon dioxide (as an end product), hence, the process is described to be aerobic."}, {"url": "http://www.answers.com/Q/What_does_cellular_respiration_do", "passage_text": "Cellular respiration is not the same as breathing. Respiration is  just breathing in oxygen and breathing out carbon dioxide, but  cellular respiration is a chemical reactio … n that uses oxygen and  glucose which gives the products carbon dioxide, water, and energy. (1) Glycolysis. (2) Citric Acid cycle or Krebs Cycle. (3) Oxidative phosphorylation. The cell seems to respire in a way that it takes in molecular oxygen (as an electron acceptor) and releases carbon dioxide (as an end product), hence, the process is described to be aerobic."}]