[{"url": "http://shop.coles.com.au/online/SearchDisplay?manufacturer=Devondale&searchType=1000&searchTerm=&catalogId=10576&showResultsPage=true&langId=-1&storeId=10601&beginIndex=0&endIndex=20", "passage_text": "Add or remove items Change my delivery time Change to collect Change my payment method. Before you modify, there are 3 things to consider: *Most specials change early Wednesday (Sydney time). Fruit & veg specials change early Friday (Sydney time). 1  You will receive today’s prices and specials* on your entire order. 2  You must check out again, or you won’t receive your order. 3  We can hold your delivery time for 2 hours maximum. 1"}, {"url": "http://www.mgc.com.au/", "passage_text": "Devondale Murray Goulburn was the first Australian dairy company to launch a dedicated on-farm QA program – MG MilkCare. Welcome to Devondale Murray Goulburn, Australia’s largest dairy foods company. Our co-operative is 100% controlled by Australian dairy farmers. We love Australian dairy and are committed to being the first choice in dairy foods for our farmers, consumers and customers. READ OUR STORY. The Aussie farmer co-op. For over 60 years, our co-op has supplied dairy products and ingredients in Australia and throughout the world. Latest news View news and features about Devondale Murray Goulburn's operations and activities in Australia and around the world."}, {"url": "http://www.trepryor.com/Louisville/Graymoor-Devondale", "passage_text": "Graymoor-Devondale is an unassuming neighborhood in an amazing part of town. Close to shopping, schools, the expressway and just minutes from Downtown, this neighborhood really does have it all. Just north of Lyndon, Graymoor-Devondale is the merger of two previously separate neighborhoods. Also nearby are the great subdivisions of Northfield and the Woods of St. Thomas. The first step is finding out what your Graymoor Devondale home is worth. It will be my pleasure to serve you! I'll come by your home for a quick tour, then I'll create a custom Current Market Analysis (CMA) for your home, based on the best, recently sold comps."}, {"url": "https://en.wikipedia.org/wiki/Murray_Goulburn_Co-operative", "passage_text": "With nine manufacturing plants located throughout Victoria and Tasmania, Murray Goulburn processes over 35% of the nation’s milk supply (3.3 billion litres) into products which are sold on both domestic and export markets. Devondale Murray Goulburn also supports over 2000 employees with an annual turnover of A$2.4 billion. Devondale Murray Goulburn is the largest container user in the Port of Melbourne exporting in excess of 375,000 MT or 23,500 containers in a financial year."}, {"url": "http://www.trepryor.com/Louisville/Graymoor-Devondale", "passage_text": "This neighborhood began in the 1950s and built up through the next 30 years as it grew in size. Homes are, for the most part, Ranch-style with a few two-story properties as well. For most of the neighborhood, there's a pride of ownership that shows in the presentation of their homes. The first step is finding out what your Graymoor Devondale home is worth. It will be my pleasure to serve you! I'll come by your home for a quick tour, then I'll create a custom Current Market Analysis (CMA) for your home, based on the best, recently sold comps."}, {"url": "http://www.mgc.com.au/", "passage_text": "Investor Centre. Welcome to Devondale Murray Goulburn, Australia’s largest dairy foods company. Our co-operative is 100% controlled by Australian dairy farmers. We love Australian dairy and are committed to being the first choice in dairy foods for our farmers, consumers and customers. READ OUR STORY. The Aussie farmer co-op. For over 60 years, our co-op has supplied dairy products and ingredients in Australia and throughout the world. Latest news View news and features about Devondale Murray Goulburn's operations and activities in Australia and around the world."}, {"url": "https://en.wikipedia.org/wiki/Murray_Goulburn_Co-operative", "passage_text": "Devondale Murray Goulburn's international business accounts for approximately 9% of world dairy trade and they trade in over 100 countries. It has over 2500 suppliers (mainly milk farmers) who are also the shareholders of the company. Devondale Murray Goulburn also supports over 2000 employees with an annual turnover of A$2.4 billion. Devondale Murray Goulburn is the largest container user in the Port of Melbourne exporting in excess of 375,000 MT or 23,500 containers in a financial year."}, {"url": "https://en.wikipedia.org/wiki/Murray_Goulburn_Co-operative", "passage_text": "Limited (Devondale Murray Goulburn) is an agricultural cooperative formed in 1950 from 14 dairy farms that has grown to become the largest processor of milk in Australia and the nation’s largest exporter of processed food. Devondale Murray Goulburn also supports over 2000 employees with an annual turnover of A$2.4 billion. Devondale Murray Goulburn is the largest container user in the Port of Melbourne exporting in excess of 375,000 MT or 23,500 containers in a financial year."}]