[{"url": "http://cold.emedtv.com/common-cold/common-cold-contagious-period.html", "passage_text": "First, scientists involved with common cold research do not know exactly how long a person with a cold is contagious. Based on previous studies, their best guess is that a person becomes contagious about two to three days before developing the usual symptoms of a cold. Second, this contagious period can last until the person no longer shows any symptoms. So in theory, a person is contagious for about two weeks. (Click Cold Symptoms to read about the symptoms of the common cold or Cold and Flu Symptoms to learn the difference between a cold and the flu.). Let's assume you're the one with the cold"}, {"url": "http://www.cdc.gov/flu/about/disease/spread.htm", "passage_text": "The Flu Is Contagious. Most healthy adults may be able to infect other people beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick. Children may pass the virus for longer than 7 days. Symptoms start 1 to 4 days after the virus enters the body. People with flu can spread it to others up to about 6 feet away. Most experts think that flu viruses are spread mainly by droplets made when people with flu cough, sneeze or talk. These droplets can land in the mouths or noses of people who are nearby or possibly be inhaled into the lungs."}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "You can be contagious from a few days up to two weeks or more, depending on which virus is causing your stomach flu (gastroenteritis). A number of viruses can cause gastroenteritis, including noroviruses and rotaviruses. The contagious period — the time during which a sick person can give the illness to others — is slightly different for each virus. 1  Norovirus. 2  With norovirus — the most common cause of viral gastroenteritis in adults and children — you're contagious from the moment you begin to feel ill"}, {"url": "http://www.cdc.gov/flu/about/qa/disease.htm", "passage_text": "Fever, chills, fatigue, body aches, sore throat, and headache are common symptoms of flu. Not everyone with flu will have a fever. The flu can cause mild to severe illness, and at times can lead to death. The flu is different from a cold. The flu usually comes on suddenly. Seasonal influenza, commonly called “the flu,” is caused by influenza viruses, which infect the respiratory tract (i.e., the nose, throat, lungs). Unlike many other viral respiratory infections, such as the common cold, the flu can cause severe illness and life-threatening complications in many people."}, {"url": "http://cold.emedtv.com/common-cold/common-cold-contagious-period.html", "passage_text": "The period when you're most contagious is when your symptoms are at their worst -- day 2 to day 4 of the cold. Based on previous studies, their best guess is that a person becomes contagious about two to three days before developing the usual symptoms of a cold. Second, this contagious period can last until the person no longer shows any symptoms."}, {"url": "http://www.cdc.gov/flu/about/qa/disease.htm", "passage_text": "Children may pass the virus for longer than 7 days. Symptoms start 1 to 4 days after the virus enters the body. Information about how long a person is contagious is available at How Flu Spreads. Seasonal influenza, commonly called “the flu,” is caused by influenza viruses, which infect the respiratory tract (i.e., the nose, throat, lungs). Unlike many other viral respiratory infections, such as the common cold, the flu can cause severe illness and life-threatening complications in many people."}, {"url": "http://health.howstuffworks.com/diseases-conditions/cold-flu/contagious.htm", "passage_text": "Most experts agree that adults with a cold or the flu start being contagious about a day before they start experiencing symptoms. For the flu, the contagious period then lasts five to seven days into the illness. For children, the contagious period for the flu can last up to two weeks after they start feeling sick, even if they start feeling better before that. The contagious period for a cold lasts about three to four days into the illness. As a general rule, people with a cold are most contagious about three days after their initial exposure to the virus. For more information on colds, influenza and related topics, check out the links on the next page. Print."}, {"url": "http://www.webmd.com/cold-and-flu/news/20031205/raise-your-flu-iq", "passage_text": "That's the incubation period. For the flu, it is about two to five days. So if you are exposed today, you probably won't have any symptoms for three to five days. Then you have a little headache, maybe a few aches and pains and maybe a low fever. Then, the next day, you have a high fever and a runny nose. "}, {"url": "http://www.healthline.com/health/cold-flu/contagious", "passage_text": "The flu is contagious a day before and five days to a week after its onset. Young children, people over 65, those with compromised immune systems, and people with a terminal illness are at risk of death from the flu. Pregnant women are also at greater risk. The flu can also cause premature birth. "}]