[{"url": "https://en.wikipedia.org/wiki/Brown_tree_snake", "passage_text": "The brown tree snake (Boiga irregularis) is an arboreal rear-fanged colubrid snake native to eastern and northern coastal Australia, eastern Indonesia (Sulawesi to Papua), Papua New Guinea, and a large number of islands in northwestern Melanesia. "}, {"url": "http://www.answers.com/Q/Are_brown_snakes_poisonous", "passage_text": "There are many different types of brown snakes in the world. The Eastern brown snake of Austalia is one of their most dangerous snakes. Some are venomous such as Eastern brown snake and some are not. My understanding is that baby brown snakes (in Australia) are born with enough venom to kill a man, the question is if the fangs can penetrate the skin."}, {"url": "http://oksnakes.org/index.cfm?snakeID=10&venomous=0&patterned=0&striped=0&solid=0&all=0", "passage_text": "NON-VENOMOUS. Description: This small snake is usually gray or brown, with two parallel rows of small blotches that run down the length of its back. The scales are keeled and its belly can be brown, pink, or light yellow. Newborn brown snakes have a yellow or cream-colored ring around the neck"}, {"url": "http://dnr2.maryland.gov/wildlife/Pages/plants_wildlife/vsnakes.aspx", "passage_text": "Photograph by John White. This is one of the two venomous snake species in Maryland. The color is a rich, reddish, brown with a series of darker hourglass markings down its back. Its head is usually a bright copper color and its belly is pinkish. It seldom exceeds three feet in length. Photograph by Ed Thompson. This venomous reptile is the only species of snake in the State with a segmented rattle at the end of its tail. It has brown or black cheveron-shaped markings on a yellow background, down its back. The background color may vary from a bright yellow to a dull gray."}, {"url": "http://oksnakes.org/index.cfm?snakeID=10&venomous=0&patterned=0&striped=0&solid=0&all=0", "passage_text": "Storeria dekayi texana NON-VENOMOUS Description: This small snake is usually gray or brown, with two parallel rows of small blotches that run down the length of its back. The scales are keeled and its belly can be brown, pink, or light yellow. Newborn brown snakes have a yellow or cream-colored ring around the neck."}, {"url": "http://www.flmnh.ufl.edu/herpetology/fl-snakes/list/nerodia-taxispilota", "passage_text": "Comments: HARMLESS (Non-Venomous) . The Brown Water Snake is a good climber and can found 20 feet up in trees, though it is most frequently seen basking on tree limbs that extend above the water. When frightened by a rapidly approaching boat, it will escape by jumping off the limb into the water. Range: In Florida, the Brown Water Snake is found throughout the state, excluding the Florida Keys. Outside of Florida, it is found from southern Alabama northeast to southeastern Virginia."}, {"url": "https://en.wikipedia.org/wiki/Eastern_brown_snake", "passage_text": "Adult eastern brown snakes are highly variable in colour. Whilst usually a uniform shade of brown, they can have various patterns including speckles and bands, and range from a very pale fawn colour through to black, including orange, silver, yellow and grey. Clinically, the venom of the eastern brown snake is known to cause diarrhea, dizziness, collapse or convulsions, renal failure, paralysis and cardiac arrest. Without medical treatment, bites can be fatal."}, {"url": "https://en.wikipedia.org/wiki/Eastern_brown_snake", "passage_text": "The eastern brown snake (Pseudonaja textilis), often referred to as the common brown snake, is a species of venomous elapid snake of the genus Pseudonaja. This snake is considered the world's second most venomous land snake based on its LD50 value (SC) in mice. It is native to Australia, Papua New Guinea, and Indonesia. Clinically, the venom of the eastern brown snake is known to cause diarrhea, dizziness, collapse or convulsions, renal failure, paralysis and cardiac arrest. Without medical treatment, bites can be fatal."}, {"url": "http://www.answers.com/Q/Are_brown_snakes_poisonous", "passage_text": "You could also compare the brown water snake to  the cotton mouth, they are non-venomous also but look a lot like  the cotton mouth. Venomous snakes heads are more fat and wide  looking, really arrow headed. Non-venomous snakes head's are  narrower and longer looking.    deadpool3763 = that is what i mean. My understanding is that baby brown snakes (in Australia) are born with enough venom to kill a man, the question is if the fangs can penetrate the skin."}, {"url": "http://www.flmnh.ufl.edu/herpetology/fl-snakes/venomous-snakes", "passage_text": "Although 50 species of snakes are found in Florida, only the 6 listed here are venomous and a danger to humans. The remaining 44 species (and its subspecies) are harmless and should be protected for the beneficial role they play in natural ecosytems, eating insects, rodents, rabbits, and other small prey. "}]