[{"url": "http://www.animalplanet.com/pets/what-is-a-dogs-normal-body-temperature/", "passage_text": "However, there are always exceptions. If your dog's temperature falls below 99 degrees Fahrenheit (37.2 degrees Celsius) or rises above 104 degrees Fahrenheit (40 degrees Celsius), you've got a fairly serious situation on your hands, and should get him to a vet immediately. "}, {"url": "http://www.peteducation.com/article.cfm?c=21&aid=1166", "passage_text": "In general, the normal body temperature for animals is higher than for humans. The normal rectal temperature of a cat is 100° to 102.5°F. The normal temperature of a kitten at birth is 97°F. The temperature gradually increases with age until it is 100°F at 4 weeks of age. "}, {"url": "http://www.answers.com/Q/What_is_a_dogs_normal_body_temperature_in_celsius", "passage_text": "Normal body temperature for a dog (in celsius) is about 38 to 40 depending on breed etc. The equivalent to 98.6 degrees Fahrenheit is 37 degrees Celsius. This is the average normal human body temperature, which is slightly lower in adults. The range is 36.8 degr … ees plus or minus 0.7 degrees"}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below 98.6°F (37°C) . Also, your normal body temperature changes by as much as 1°F (0.6°C) throughout the day, depending on how active you are and the time of day. Body temperature is very sensitive to hormone levels and may be higher or lower when a woman is ovulating or having her menstrual period."}, {"url": "http://vetmedicine.about.com/od/diseasesconditionsfaqs/tp/TP_dogfacts.htm", "passage_text": "1. Body Temperature. Canine normal body temperature range is 100.5 - 102.5 Fahrenheit (38 - 39.2 Celsius). A body temperature below 100 or above 103F warrants a call to your veterinarian. Body temperature in dogs is most often measured rectally, ear thermometers can also be used, but it can be difficult to get an accurate reading. "}, {"url": "http://dogs.about.com/od/faqs/f/normal_temp.htm", "passage_text": "The normal body temperature for a dog falls within the range of 100°F to 102.5°F (about 38°C to 39.2°C). If your dog's temperature is outside of this range, you should contact your veterinarian. Body temperature over 104°F or under 99°F indicates an emergency situation. In general, the most accurate way to measure a dog's body temperature is rectally."}, {"url": "http://www.answers.com/Q/What_is_the_normal_body_temperature_of_a_dog", "passage_text": "The normal body temperature of a dog is usually between 100.5 °F and 102.5 °F (37.2 °C and 39.2 °C). "}]