[{"url": "http://www.gardeningknowhow.com/edible/vegetables/pepper/growing-chili-pepper-plants.htm", "passage_text": "How to Grow Chili Peppers. Growing chili peppers is done best when the temperature at night reaches and maintains itself between 60 and 70 degrees F. Further, during the day, a temperature maintaining itself between 70 and 80 degrees F. is absolutely ideal."}, {"url": "http://homeguides.sfgate.com/big-tabasco-pepper-grow-44934.html", "passage_text": "Maturity. Tabasco pepper plants grow 4 feet to 6 feet tall, depending on outdoor temperatures, water availability and level of sun exposure. The plants will grow their tallest with warm temperatures, regular watering and full-sun exposure. Cooler temperatures, shady conditions and sporadic watering will result in a shorter plant."}, {"url": "http://homeguides.sfgate.com/temperature-banana-pepper-grow-in-74271.html", "passage_text": "Starting Indoors. Give pepper seedlings the warm soil temperature they crave by growing them on top of seed-starting heating coils. Alternatively, use the top of your refrigerator or a furnace to provide this bottom heat. During the germination stage, aim for bottom temperatures of 80 to 85 degrees Fahrenheit."}, {"url": "http://faq.gardenweb.com/discussions/2766388/when-and-how-should-i-transplant-pepper-plants", "passage_text": "It is not beneficial for most peppers. Plant Your Peppers and Water In. Although spacing will vary by pepper variety, a good general guideline is to allow 12-18 inches between stems, and 24-36 inches between rows. Always check the recommended spacing for each pepper variety."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/pepper/growing-peppers.htm", "passage_text": "When you move to plant peppers outside, your plants will do better once temperatures are staying above 55 degrees F. at night. Before that, they will grow quite slow. Starting pepper plants indoors is best because growing bell peppers require this higher nighttime temperature."}]