[{"url": "https://en.wikipedia.org/wiki/Kedarnath", "passage_text": "The most remote of the four Chota Char Dham sites, Kedarnath is located in the Himalayas, about 3,583 m (11,755 ft) above sea level near Chorabari Glacier, the head of river Mandakini, and is flanked by snow-capped peaks. The nearest road head is at Gaurikund, at a distance of 14 k.m. Kedarnath is located at a distance of 223 km from Rishikesh in Uttarakhand and close to the source of Mandakini river at a height of 3,583 m (11,755 ft) above sea level."}, {"url": "http://bibleatlas.org/kedar.htm", "passage_text": "Jeremiah 2:10 For pass over to the islands of Kittim, and see; and send to Kedar, and consider diligently; and see if there has been such a thing. Jeremiah 49:28 Of Kedar, and of the kingdoms of Hazor, which Nebuchadnezzar king of Babylon struck. Isaiah 21:17 and the residue of the number of the archers, the mighty men of the children of Kedar, will be few; for Yahweh, the God of Israel, has spoken it.. Isaiah 42:11 Let the wilderness and its cities raise their voices, with the villages that Kedar inhabits. Let the inhabitants of Sela sing."}, {"url": "https://en.wikipedia.org/wiki/Kedarnath_Temple", "passage_text": "During the winters, the vigrahas (deities) from Kedarnath temple are brought to Ukhimath and worshiped there for six months. Lord Shiva is worshiped as Kedarnath, the 'Lord of Kedar Khand', the historical name of the region. The unstable temple is not directly accessible by road and has to be reached by a 14 kilometres (8.7 mi) uphill trek from Gaurikund. Pony and manchan service is available to reach the structure. Temple and past significance [edit]. The temple, at an height of 3,583 m (11,755 ft), 223 km from Rishikesh, on the shores of Mandakini river, a tributary of Ganga, is an impressive stone edifice of unknown date. The structure is believed to have been constructed in the 8th century AD, when Adi Shankara visited."}, {"url": "http://kedarquilts.com/", "passage_text": "Located in Waterford, Maine. Kedar Quilts is located in the village of Waterford, Maine. Our shop has a vast array of quilting supplies (including thousands of bolts of fabric), Quilts, Table Runners, Place Mats, and other quilt oriented products. We also host Quilt Weekends and Retreats"}, {"url": "http://biblehub.com/jeremiah/49-28.htm", "passage_text": "About Kedar and the kingdoms of Hazor, which Nebuchadnezzar, Babylon's king, defeated, this is what the LORD says: Rise up, go against Kedar, and destroy the people of the east! International Standard Version. Concerning Kedar and the kingdoms of Hazor, which Nebuchadnezzar king of Babylon attacked: This is what the LORD says: Arise, and attack Kedar and destroy the people of the East. New Living Translation."}, {"url": "https://en.wikipedia.org/wiki/Kedarnath", "passage_text": "Kedarnath is a town located in the Indian state of Uttarakhand and has gained importance because of Kedarnath Temple. It is a nagar panchayat in Rudraprayag district. Kedarnath is located at a distance of 223 km from Rishikesh in Uttarakhand and close to the source of Mandakini river at a height of 3,583 m (11,755 ft) above sea level."}, {"url": "http://bibleatlas.org/kedar.htm", "passage_text": "Ezekiel 27:21 Arabia, and all the princes of Kedar, they were the merchants of your hand; in lambs, and rams, and goats, in these were they your merchants. Isaiah 21:17 and the residue of the number of the archers, the mighty men of the children of Kedar, will be few; for Yahweh, the God of Israel, has spoken it.. Isaiah 42:11 Let the wilderness and its cities raise their voices, with the villages that Kedar inhabits. Let the inhabitants of Sela sing."}, {"url": "http://www.historyfiles.co.uk/KingListsMiddEast/ArabicKedar.htm", "passage_text": "They occupied the desert regions of eastern Syria and present day Jordan, on the edge of the Levant. Also like their cousins, the Kedarites claimed an Israelite ancestor figure, this time being Kedar, second son of Ismael, who was himself one of the sons of Abraham. Kingdom of Kedar (Qedar / Qidri). c.870 - 610 BC. Subdued by the resurgent Assyrian empire in the ninth century BC, The Kedarite kingdom survived as a vassal state, occasionally rebellious, but mostly compliant."}]