[{"url": "http://www.cancer.org/cancer/skincancer-basalandsquamouscell/detailedguide/skin-cancer-basal-and-squamous-cell-what-is-basal-and-squamous-cell", "passage_text": "Basal cell carcinoma. This is not only the most common type of skin cancer, but the most common type of cancer in humans. About 8 out of 10 skin cancers are basal cell carcinomas (also called basal cell cancers). Squamous cell carcinoma. About 2 out of 10 skin cancers are squamous cell carcinomas (also called squamous cell cancers). The cells in these cancers look like abnormal versions of the squamous cells seen in the outer layers of the skin."}, {"url": "http://www.skincancer.org/skin-cancer-information/squamous-cell-carcinoma", "passage_text": "The Second Most Common Form of Skin Cancer. Squamous cell carcinoma (SCC) is an uncontrolled growth of abnormal cells arising in the squamous cells, which compose most of the skin’s upper layers (the epidermis). Skin Cancer Fact. An estimated 700,000 cases of squamous cell carcinoma (SCC) are diagnosed each year in the US, and between 3,900 and 8,800 people died from the disease in the US in 2012. Get the Facts"}, {"url": "http://www.cancercenter.com/skin-cancer/symptoms/", "passage_text": "Skin cancer symptoms. Because many skin cancers develop where they can be seen, there is a good chance of catching them early. Regular examination of the skin for any new or unusual growths, or changes in existing moles is critical. Melanoma symptoms. Melanoma skin cancer signs include new spots on the skin, or a change in size, shape or color of an existing mole. The ABCD rule is another way to recognize abnormal growths: 1  A is for Asymmetry: A mole that has an irregular shape, or two different looking halves."}, {"url": "http://www.medicinenet.com/image-collection/squamous_cell_carcinoma_1_picture/picture.htm", "passage_text": "Get the Latest health and medical information delivered direct to your inbox! Squamous cell carcinoma: Cancer that begins in squamous cells -- thin, flat cells that look under the microscope like fish scales. "}, {"url": "http://www.cancercenter.com/skin-cancer/types/tab/squamous-cell-carcinoma/", "passage_text": "Squamous cell carcinoma. These cancers are the second most common type of skin cancer, accounting for approximately 20 percent of non-melanoma skin cancers. They develop from the flat, squamous cells that are the primary cell type making up the outermost layer of the skin, the epidermis. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001832/", "passage_text": "Treatments for non‐metastatic squamous cell carcinoma of the skin. Squamous cell carcinoma (SCC) of the skin is the second most common skin cancer in people of white origin, most frequently occurring on sun‐exposed areas of the body. "}, {"url": "http://www.healthline.com/health/squamous-cell-skin-cancer", "passage_text": "There are three main types of skin cancer: squamous cell carcinoma, basal cell carcinoma, and melanoma. Your skin has multiple layers: the upper, protective layer of the skin is known as the epidermis. This cancer is caused by mutations in the DNA of these cells, which cause them to multiply uncontrollably. According to the Skin Cancer Foundation, SCC is the second most common form of skin cancer."}]