[{"url": "https://en.wikipedia.org/wiki/Medical_assistant", "passage_text": "From Wikipedia, the free encyclopedia. A medical assistant is an allied health professional that supports the work of physicians and other health professionals, usually in a clinic setting. Medical assistants can become certified through an accredited program usually offered through a junior or community college. The term medical assistant may have legal status in jurisdictions where they can be certified or registered, whereas elsewhere they may be a loosely defined group (covering related occupational titles such as ‘medical office assistant’, ‘clinical assistant’, 'assistant medical officer', or ‘ophthalmic assistant’)."}, {"url": "http://www.bls.gov/ooh/Healthcare/Medical-assistants.htm", "passage_text": "What Medical Assistants Do. Medical assistants complete administrative and clinical tasks in the offices of physicians, podiatrists, chiropractors, and other health practitioners. Their duties vary with the location, specialty, and size of the practice."}, {"url": "https://www.azmd.gov/Files/Pamphlets/medical_assistants_document.pdf", "passage_text": "The functions a medical assistant can perform in Arizona may be different from those tasks permitted in other states. This brochure is designed to help medical assistants and the allopathic physicians, physician assistants and nurses who supervise them, determine appropriate training and behavior in the workplace. MA’s operate independently and are only held to the training requirements set forth in rules. These rules, (R4-16-401 through R416-403), found on the Arizona Medical Board’s website, www.azmd.gov, also -. provide a general overview of authorized procedures for a medical assistant."}, {"url": "https://www.azmd.gov/Files/Pamphlets/medical_assistants_document.pdf", "passage_text": "The most important thing. for a physician or a physician assistant to remember when delegating tasks to a medical assistant is that. the physician or physician assistant is ultimately responsible for the patient’s care. MA’s operate independently and are only held to the training requirements set forth in rules. These rules, (R4-16-401 through R416-403), found on the Arizona Medical Board’s website, www.azmd.gov, also -. provide a general overview of authorized procedures for a medical assistant."}, {"url": "http://www.rasmussen.edu/degrees/health-sciences/blog/what-does-a-medical-assistant-do/", "passage_text": "While direct patient needs such as administering required medication or immunization s are an important part of the job, medical assistants working in hospitals also spend a fair amount of time in the lab examining blood, urine and stool samples taken from patients. It is also up to the medical assistant to be sure the ambulance is well-stocked for patient care so the patients’ experiences can be as positive as possible. But the job, of course, requires much more than the routine duties—the medical assistant is often one of the first people the patient will interact with."}, {"url": "http://www.medicalassistants.net/job-description", "passage_text": "The medical assistant job description is varied and broad. Medical assistants perform many job duties to keep the offices of doctors, medical centers, and clinics running smoothly. Depending on their employer’s needs, they may perform clerical, administrative, or clinical job duties, or all three. The role of a clinical medical assistant is what most people imagine when they think of what medical assistants do. Clinical medical assistant duties depend upon the laws of their specific states, but their role is more medical than those of clerical and administrative medical assistants."}, {"url": "https://www.azmd.gov/Files/Pamphlets/medical_assistants_document.pdf", "passage_text": "What is a medical assistant? A medical assistant (MA) is an unlicensed person who assists in the medical practice under the supervision of a physician, physician assistant or nurse practitioner and performs delegated procedures appropriate with the MA’s education and training. MA’s operate independently and are only held to the training requirements set forth in rules. These rules, (R4-16-401 through R416-403), found on the Arizona Medical Board’s website, www.azmd.gov, also -. provide a general overview of authorized procedures for a medical assistant."}, {"url": "http://explorehealthcareers.org/en/Career/36/Medical_Assistant", "passage_text": "What a medical assistant does will depend on the office where she or he works, state law and the needs of the assistant's employer. To learn more, watch this video profile of a day in the life of a medical assistant and read these profiles. Working Conditions. While medical assistants work in a variety of settings, most work in a clinic or doctor’s office. The medical assistant is a valuable member of a team that provides patient care. They need to be able to multi-task and prioritize their daily responsibilities."}]