[{"url": "http://www.answers.com/Q/How_long_to_bbq_chicken_quarters", "passage_text": "I don't like to flip BBQ sauce all over the place, so I grill first, coat later. For 'Leg Quarters', I grill about 25 minutes, then flip 'em over. Grill 'em another 15 minutes, then coat w/BBQ sauce. Grill another 10 and they're done."}, {"url": "http://eatthiscooking.blogspot.com/2007/09/how-to-grill-perfect-chicken-leg.html", "passage_text": "5. Move the chicken to the other side of the grill (away from the heat source) and grill with the grill lid down for about 45 minutes, or until a thermometer inserted into the thickest portion of the chicken leg quarter registers 170 degrees. So off to the store we go and came back with chicken leg quarters. My dad said he was going to show me how simple it was to grill. He proceeded to light up the grill, cranking it on high, and then chucked the chicken inside and put the lid down. “It's just like an oven,” he says."}, {"url": "http://www.youtube.com/watch?v=DwWESwTdiy8", "passage_text": "Step by Step instructions on how to grill the perfect chicken leg quarters-Grill should be heated between 400 - 450 degrees and chicken quarters should be cooked until juices run clear, usually between 45-55 mins. "}, {"url": "http://www.livestrong.com/article/435175-how-to-grill-chicken-leg-quarters-on-a-gas-grill/", "passage_text": "Step 6. Cook the chicken leg quarters on each side for about 22 minutes, for a total cooking time of 45 minutes. Keep a close eye on the chicken for even cooking but try not to turn the chicken over too many times; once or twice is enough. Use a meat thermometer to check when the chicken leg quarters are done. Chicken leg quarters are a popular cut of chicken to grill because they do not dry out as quickly as chicken breasts can."}, {"url": "http://eatthiscooking.blogspot.com/2007/09/how-to-grill-perfect-chicken-leg.html", "passage_text": "3. Brush both sides of the chicken leg quarters with the olive oil and season with the salt and pepper. 4. Place the chicken directly over the heat and grill with the lid open for about 3 minutes per side. (It doesn't make a difference which grill you are using here as long as you have an internal temperature of 325-350 degrees.). 5. So off to the store we go and came back with chicken leg quarters. My dad said he was going to show me how simple it was to grill. He proceeded to light up the grill, cranking it on high, and then chucked the chicken inside and put the lid down. “It's just like an oven,” he says."}, {"url": "http://www.cookingchanneltv.com/recipes/grilled-chicken-quarters.html", "passage_text": "Remove the chicken from the brine, rinse and pat dry. Preheat the grill to medium-high. Turn one side of the grill off and place the chicken skin-side down over the indirect heat. Cook for 10 minutes, turn, cook another 10 minutes and then brush with a thick coating of basting sauce. Turn, cook another 10 minutes, baste and cook a final 10 minutes for a total of 40 minutes on the grill. The chicken should register at least 160 degrees F and the juices should run clear. Serve immediately. In a small bowl, whisk together the egg yolks, 1/4 cup lemon juice, honey and salt."}, {"url": "http://eatthiscooking.blogspot.com/2007/09/how-to-grill-perfect-chicken-leg.html", "passage_text": "• Chicken leg quarters are an excellent choice for grilling due to the higher fat content than chicken breast, giving you a juicier and more flavorful meal. • They are more cost effective and can be substituted for chicken breast in any recipe. So off to the store we go and came back with chicken leg quarters. My dad said he was going to show me how simple it was to grill. He proceeded to light up the grill, cranking it on high, and then chucked the chicken inside and put the lid down. “It's just like an oven,” he says."}, {"url": "http://www.thekitchenwhisperer.net/2014/05/29/ultimate-oven-fried-bbq-chicken-quarters/", "passage_text": "1 Brush on some of the bbq sauce on the leg quarters, flip and repeat to coat the skin side. 2  You’ll use only about 1/3 of your sauce here. 3  Bake for 20 minutes and remove from the oven. 4  Flip the legs brushing more sauce on the underneath of the legs, flipping skin-side-up and brushing on more sauce. 1 Bake for 30 minutes. 2  Remove from the oven, crank the heat to 450F and brush on the remaining bbq sauce to both sides leaving the skin side up. 3  Bake for 8-10 minutes or until the sauce has turned deep in color and appears almost charred. 4  Insert a thermometer in the thickest part of the leg (but not touching bone)."}, {"url": "http://www.ryanduff.net/2010/07/12/melt-in-your-mouth-bbq-chicken-on-a-gas-grill/", "passage_text": "The temperature is low enough that your BBQ sauce will not burn so don’t worry. Pull the leg quarters off the grill and let them rest for a few minutes on a plate then enjoy! Total cooking time for a 10-14oz chicken leg quarter should be about 60 minutes. You should also double check w/ an instant read thermometer before you pull them off the grill. The meat thermometer should read about 165°F. Place your chicken leg quarters bone side down, with the skin up. Cook them for about 20 minutes, keeping an eye out w/ a squirt bottle of water for flare ups. If you keep your temperature around 350°F, flare ups should be rare."}, {"url": "http://www.foodnetwork.com/recipes/bbq-chicken-recipe.html", "passage_text": "Remove the chicken from the rack and place it in a foil pan. Brush with the reserved 1/2 cup barbecue sauce, cover with foil, and place back in the oven or smoker for 1/2 hour. Remove the chicken from the pan and finish off on a grill. Using medium to hot flame, grill until the outer skin is crisp and marked (a few minutes should do it). Serve immediately."}]