[{"url": "http://www.answers.com/Q/The_structure_that_surrounds_the_cytoplasm_in_a_bacterial_cell", "passage_text": "The cell membrane (also called the plasma membrane, plasmalemma, or phospholipid bilayer) surrounds the cytoplasm of a cell and, in animal cells, physically separates the in … tracellular components from the extracellular environment, thereby serving a function similar to that of http://wiki.answers ... The thin structure that surrounds the cytoplasm of a cell is called as cell membrane. This is present in most plant, animal and fungi cells. It is a selectively permeable stru … cture and allows the flow of ions and particles from the inside of the cell to the outside and vice-versa"}, {"url": "http://micro.magnet.fsu.edu/cells/bacteriacell.html", "passage_text": "In gram-negative bacteria, the cell wall is thin and releases the dye readily when washed with an alcohol or acetone solution. Cytoplasm-The cytoplasm, or protoplasm, of bacterial cells is where the functions for cell growth, metabolism, and replication are carried out. It is a gel-like matrix composed of water, enzymes, nutrients, wastes, and gases and contains cell structures such as ribosomes, a chromosome, and plasmids. Unlike the eukaryotic (true) cells, bacteria do not have a membrane enclosed nucleus. The chromosome, a single, continuous strand of DNA, is localized, but not contained, in a region of the cell called the nucleoid. All the other cellular components are scattered throughout the cytoplasm."}, {"url": "http://www.answers.com/Q/What_is_the_structure_that_surrounds_the_cytoplasm_in_a_bacterial_cell", "passage_text": "The cell membrane (also called the plasma membrane, plasmalemma, or phospholipid bilayer) surrounds the cytoplasm of a cell and, in animal cells, physically separates … the intracellular components from the extracellular environment, thereby serving a function similar to that of skin. The thin structure that surrounds the cytoplasm of a cell is called as cell membrane. This is present in most plant, animal and fungi cells. It is a selectively permeable stru … cture and allows the flow of ions and particles from the inside of the cell to the outside and vice-versa"}, {"url": "http://www.answers.com/Q/What_is_the_structure_that_surrounds_the_cytoplasm_in_a_bacterial_cell", "passage_text": "The cell membrane (also called the plasma membrane, plasmalemma, or phospholipid bilayer) surrounds the cytoplasm of a cell and, in animal cells, physically separates the in … tracellular components from the extracellular environment, thereby serving a function similar to that of http://wiki.answers ... The thin structure that surrounds the cytoplasm of a cell is called as cell membrane. This is present in most plant, animal and fungi cells. It is a selectively permeable stru … cture and allows the flow of ions and particles from the inside of the cell to the outside and vice-versa"}, {"url": "https://answers.yahoo.com/question/index?qid=20100818114201AA43WvT", "passage_text": "Best Answer: c. Plasma membrane is the correct answer. a.Nucleoid-Prokaryotes are characterized by their lack of a ‘’true’’ nucleus. In stead of a nucleus, they have a nucleoid where their genetic material is localized and it found in the cyctoplasm. b.Ribsosome: a sphere-shaped structure found in the cytoplasm of prokaryotic and eukaryotic cells. d.Cell wall: a rigid layer of polysaccharides enclosing the membrane of plant and prokaryotic cells. Source(s): From the Bio class Image for the bacteria: http://ict-science-to-society.org/Pathog... ethar · 5 years ago"}, {"url": "http://www.weegy.com/?ConversationId=DAEUI813", "passage_text": "The structure that surrounds the cytoplasm in a bacterial cell is the A. plasma membrane. B. ribsosome. C. nucleoid. D. cell wall. The structure that surrounds the cytoplasm in a bacterial cell is the: A. plasma membrane. "}, {"url": "http://study.com/academy/lesson/bacterial-cytoplasm-cell-membrane-structure-components.html", "passage_text": "Cell Membrane. The answer is the cell membrane. The cell membrane is a phospholipid bilayer that completely surrounds a bacterial cell. The word 'completely' is important here because any break in the bilayer will lead to the death of the bacteria. "}, {"url": "http://www.ehow.com/facts_7264334_structure-surrounds-cytoplasm-bacterial-cell.html", "passage_text": "Shares & Saves. Save. bacteria image by chrisharvey from Fotolia.com. The cytoplasm of bacterial cells is enclosed by the cell, or plasma, membrane that separates and protects the internal environment of the cell from the external environment. It also regulates what enters and exits the cell. "}]