[{"url": "http://plants.usda.gov/java/profile?symbol=PIVI2", "passage_text": "This plant is listed by the U.S. federal government or a state. Common names are from state and federal lists. Click on a place name to get a complete protected plant list for that location."}, {"url": "http://plants.usda.gov/core/profile?symbol=prvi", "passage_text": "This plant is listed by the U.S. federal government or a state. Common names are from state and federal lists. Click on a place name to get a complete protected plant list for that location."}, {"url": "http://www.iucnredlist.org/details/40502/0", "passage_text": "Some populations are also found along the west coast of the United States. Their range, limited by winter temperatures and snow depth, appears to be expanding northwards (Gardner, 2005).This species can be found from lowlands to 3,000 m (Reid, 1997)."}, {"url": "http://plants.usda.gov/core/profile?symbol=prvi", "passage_text": "common chokecherry. This plant can be weedy or invasive according to the authoritative sources noted below.This plant may be known by one or more common names in different places, and some are listed above. Click on an acronym to view each weed list, or click here for a composite list of Weeds of the U.S."}, {"url": "http://www.sms.si.edu/irlspec/Quercu_virginic.htm", "passage_text": "Abundance: Live oak is generally abundant throughout its range, and is often the dominant species in maritime hammocks. In the Indian River Lagoon, it is highly abundant on scrub lands, maritime hammocks, and upland forests. It is somewhat more abundant in areas of the lagoon north of Cape Canaveral."}, {"url": "http://www.na.fs.fed.us/pubs/silvics_manual/Volume_1/pinus/virginiana.htm", "passage_text": "Other than those named in the types, species that commonly grow with Virginia pine in various parts of its range are white oak Quercus alba), southern red oak (Q. falcata), red maple (Acer rubrum), hickories (Carya spp."}, {"url": "http://www.conifers.org/pi/Pinus_virginiana.php", "passage_text": "Precipitation within the range of this species averages 890-1400 mm, with the wettest areas in the southern portion of its range, and is fairly evenly distributed throughout the year. Summer average temperatures are 21° to 24°C and winter temperatures average -4° to 4°C."}, {"url": "http://www.na.fs.fed.us/pubs/silvics_manual/Volume_1/pinus/virginiana.htm", "passage_text": "Katherine K. Carter and Albert G. Snow, Jr. Virginia pine (Pinus virginiana) has a definite place among trees of commercial importance in spite of once being considered a forest weed and called scrub pine."}]