[{"url": "http://www.herbs2000.com/herbs/herbs_hops.htm", "passage_text": "The hops or the hop plant bears the name Humulus lupulus L. in botanical circles. This perennial plant belongs to the plant family Cannabidaceae. The plant is a climbing vine, which gives out scaly and cone shaped fruits called hops from which the name for the whole plant is drawn."}, {"url": "http://www.thymegarden.com/Rhizomes", "passage_text": "Grow your own organic hops (plants) with our organically grown hop rhizomes for home or micro brewing. Hop plants are easy to grow from hop rhizomes for shade and privacy as well. Our organic hops rhizomes or hops plants are grown organically without the use of commercial fertilizers or pesticides."}, {"url": "http://health.howstuffworks.com/wellness/natural-medicine/herbal-remedies/hops-herbal-remedies.htm", "passage_text": "Hops can be grown as a garden plant and, like the grape, it's a quick-growing and quick-spreading vine. Most hops grown in the United States are used in the brewing of beer. Hops are also used for several herbal remedies, including digestive stimulation and relieving anxiety, insomnia and menopausal symptoms."}, {"url": "http://www.wikihow.com/Grow-Hops-for-Brewing-Beer", "passage_text": "Hop plants are grown from hop rhizomes, pieces of a hop plant that sprout into a new plant. Rhizomes are available early in the spring, when hop farmers dig them up and sell them to suppliers. Order rhizomes online or check with your local nursery."}, {"url": "https://www.mountainroseherbs.com/products/hops-flowers/profile", "passage_text": "Introduction. A hop is a green cone around the female flower of the hop plant. Inside the hops are golden grains that form a sticky greenish yellow to organ-yellow powder. Hops have been used for centuries to flavor beer, at least as far back as 10,000 years ago in Asia, where it spread rapidly to Eastern Europe."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-856-HOPS.aspx?activeIngredientId=856&activeIngredientName=HOPS", "passage_text": "HOPS Overview Information. Hops is a plant. The dried, flowering part of the plant is used to make medicine. Hops is used for anxiety, inability to sleep (insomnia) and other sleep disorders, restlessness, tension, excitability, attention deficit-hyperactivity disorder (ADHD), nervousness, and irritability."}, {"url": "http://www.herbco.com/p-433-hops-whole.aspx", "passage_text": "Hops are the female flowers of a climbing plant found throughout Europe and North America that is related to Cannabis, or hemp. The most widespread use of hops is in beer production, a practice that dates back many centuries. Whole hops are used by home brewers today for the same purpose, or to make tisanes and teas."}]