[{"url": "http://www.mayoclinic.org/diseases-conditions/autism-spectrum-disorder/basics/symptoms/con-20021148", "passage_text": "But children with autism spectrum disorder usually show some signs of delayed development within the first year. If you suspect that your child may have ASD, discuss your concerns with your doctor. The symptoms associated with ASD can also be linked with other developmental disorders."}, {"url": "http://www.cdc.gov/ncbddd/autism/signs.html", "passage_text": "Some children with ASD show hints of future problems within the first few months of life. In others, symptoms may not show up until 24 months or later. Some children with an ASD seem to develop normally until around 18 to 24 months of age and then they stop gaining new skills, or they lose the skills they once had."}, {"url": "http://www.easterseals.com/explore-resources/living-with-autism/autism-signs-and-symptoms.html", "passage_text": "Autism spectrum disorders vary in severity of symptoms, age of onset, and the presence of various features, such as mental retardation and specific language delay."}, {"url": "http://autism.emedtv.com/autism/symptoms-of-autism.html", "passage_text": "The three distinctive signs and symptoms of autism include problems with verbal and nonverbal communication, difficulties with social interaction, and repetitive behaviors or narrow, obsessive interests. There are three distinctive symptoms of autism."}, {"url": "http://www.ninds.nih.gov/disorders/autism/detail_autism.htm", "passage_text": "Autism spectrum disorder (ASD) is a range of complex neurodevelopment disorders, characterized by social impairments, communication difficulties, and restricted, repetitive, and stereotyped patterns of behavior."}, {"url": "http://www.nhs.uk/Conditions/Autistic-spectrum-disorder/Pages/Symptoms.aspx", "passage_text": "Autism spectrum disorder (ASD) can cause a wide range of symptoms, and there are many different ways those symptoms can be grouped. It is useful for parents to know the signs and symptoms of autism and Asperger syndrome that are related to their child’s stages of development."}, {"url": "http://www.webmd.com/brain/autism/autism-symptoms", "passage_text": "The severity of symptoms varies greatly, but all people with autism have some core symptoms in the areas of: 1  Social interactions and relationships. 2  Symptoms may include: 3  Significant problems developing nonverbal communication skills, such as eye-to-eye gazing, facial expressions, and body posture."}, {"url": "http://www.ninds.nih.gov/disorders/autism/detail_autism.htm", "passage_text": "Autistic disorder, sometimes called autism or classical ASD, is the most severe form of ASD, while other conditions along the spectrum include a milder form known as Asperger syndrome, and childhood disintegrative disorder and pervasive developmental disorder not otherwise specified (usually referred to as PDD-NOS)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/autism-spectrum-disorder/basics/symptoms/con-20021148", "passage_text": "Symptoms. Autism spectrum disorder impacts how a child perceives and socializes with others, causing problems in crucial areas of development — social interaction, communication and behavior. Some children show signs of ASD in early infancy."}]