[{"url": "http://www.businessdictionary.com/definition/typesetting.html", "passage_text": "Definition. Composing a text and/or display (captions, headline, subheads) reading matter into a computer (digital) or physical (metal) type suitable for the text's intended audience, use, and reproduction method. Popular 'Printing, Packaging, & Publishing' Terms. 1  A4 size paper. 2  legal size paper. 3  non-exclusive license. 4  bi-monthly. 5  form. 6  emphasis added. 7  board. 8  box dimensions. 9  dictionary. 10  edge crush test (ECT). 11  Email. 12  Print. 13  Cite. 14  Link."}, {"url": "http://www.businessdictionary.com/definition/typesetting.html", "passage_text": "typesetting. Composing a text and/or display (captions, headline, subheads) reading matter into a computer (digital) or physical (metal) type suitable for the text's intended audience, use, and reproduction method. Popular 'Printing, Packaging, & Publishing' Terms. 1  A4 size paper. 2  legal size paper. 3  non-exclusive license. 4  bi-monthly. 5  form. 6  emphasis added. 7  board. 8  box dimensions. 9  dictionary. 10  edge crush test (ECT). 11  Email. 12  Print. 13  Cite. 14  Link."}, {"url": "https://gettingpublished.wordpress.com/2010/01/22/what-is-typesetting/", "passage_text": "Typography was the art of designing, setting and arranging type whereas typesetting was the process (or craft) of actually setting the type. Note the class difference: typography wore a beret and twirled a designer’s pen, typesetting wore an apron, punched type and had ink on its fingers. In essence, then, when laying out your book, your typesetter will be concerned to: 1  Fit your text and illustrations into the agreed page extent. 2  Place text and illustrations in an effective and appropriate combination."}, {"url": "http://www.merriam-webster.com/dictionary/typesetting", "passage_text": "Full Definition of TYPESETTING. : the process of setting material in type or into a form to be used in printing; also: the process of producing graphic matter (as through a computer system). See typesetting defined for English-language learners. ADVERTISEMENT."}, {"url": "https://en.wikipedia.org/wiki/Typesetting", "passage_text": "Diagram of a cast metal sort. Typesetting is the composition of text by means of arranging physical types or the digital equivalents. Stored letters and other symbols (called sorts in mechanical systems and glyphs in digital systems) are retrieved and ordered according to a language's orthography for visual display. Cast metal sorts were composed into words, then lines, then paragraphs, then pages of text and tightly bound together to make up a form, with all letter faces exactly the same “height to paper”, creating an even surface of type. The form was placed in a press, inked, and an impression made on paper."}, {"url": "http://www.audioenglish.org/dictionary/typesetting_machine.htm", "passage_text": "Hypernyms (typesetting machine is a kind of...): printer; printing machine (a machine that prints). Meronyms (parts of typesetting machine): keyboard (device consisting of a set of keys on a piano or organ or typewriter or typesetting machine or computer or the like). "}, {"url": "http://www.definitions.net/definition/typesetting", "passage_text": "Typesetting. Typesetting is the composition of text by means of types. Typesetting requires the prior process of designing a font and storing it in some manner. Typesetting is the retrieval of the stored letters and the ordering of them according to a language's orthography for visual display."}, {"url": "https://en.wikipedia.org/wiki/Typesetting", "passage_text": "During typesetting, individual sorts are picked from a type case with the right hand, and set into a composing stick held in the left hand from left to right, and as viewed by the setter upside down. Cast metal sorts were composed into words, then lines, then paragraphs, then pages of text and tightly bound together to make up a form, with all letter faces exactly the same “height to paper”, creating an even surface of type. The form was placed in a press, inked, and an impression made on paper."}]