[{"url": "https://en.wikipedia.org/wiki/Largest_prehistoric_animals", "passage_text": "The largest known pigeon ever was the dodo (Raphus cucullatus), weighing 23 kg (51 lb) and standing 1 m (3.3 ft) tall. Rodrigues solitaire (Pezophaps solitaria), a brown, long-necked birds that were superficially ratite-like. All three species may have exceeded 1 m (3.3 ft) in height. 1 The heaviest known felid ever was the Ngangdong tiger (Panthera tigris soloensis) with the largest specimen weighing in at 470 kg. 2  The largest wolf is the dire wolf (Canis dirus) 1.5 m (4.9 ft) in length and weighed between 50 kg (110 lb) and 79 kg (174 lb)."}, {"url": "http://www.pbs.org/wgbh/nova/evolution/evolution-down-under.html", "passage_text": "The biggest marsupial that ever lived, a Diprotodon, weighed about 4,400 pounds, or only about a third as much as an elephant. The largest kangaroo, now extinct, may have reached 440 pounds; the largest antelope, its closest counterpart in Africa, can weigh 2,200 pounds or more. "}, {"url": "http://www.answers.com/Q/How_tall_was_the_tallest_kangaroo_ever", "passage_text": "as my interests are far and wide. There are no specific records indicating the height of the tallest kangaroo in modern times. The largest of the kangaroos is the Red kangaroo, and the male of this species averages between 165cm and 180cm, with rare specimens reaching 2 metres. This varies according to the different species.    Red Kangaroos are the largest of the marsupials. The Red Kangaroo  averages 1.6 metres tall."}, {"url": "https://en.wikipedia.org/wiki/Largest_prehistoric_animals", "passage_text": "1 Daeodon was the largest known entelodont that ever lived, at 12 ft long and 7 ft at the shoulder. 2  The largest known wild suid to ever exist was Kubanochoerus gigas, having measured up to 550 kg (1,210 lb) and stood more than 1.3 m (4.3 ft) tall at the shoulder. 1 The heaviest known felid ever was the Ngangdong tiger (Panthera tigris soloensis) with the largest specimen weighing in at 470 kg. 2  The largest wolf is the dire wolf (Canis dirus) 1.5 m (4.9 ft) in length and weighed between 50 kg (110 lb) and 79 kg (174 lb)."}, {"url": "http://news.softpedia.com/news/7-Amazing-Facts-About-Kangaroos-71388.shtml", "passage_text": "The largest living marsupials. 1.Scientists believe that kangaroos' and wallabies' ancestors could have looked like a Wynyardia, a 21 million years old marsupial found in Tasmania. The largest living kangaroo, the red kangaroo (Macropus rufus) is also the largest living marsupial. Males are up to 1.8m (6 ft) tall and weigh up to 84 kg (187lbs). The smallest living kangaroo (Darcopsulus) is a lesser forest wallaby from New Guinea, as big as a rat. Tree kangaroos live in northeastern Australia and New Guinea! They sleep during the day in the trees, but at night they get down to graze just like the other kangaroos."}, {"url": "http://www.abc.net.au/science/ozfossil/megafauna/fauna/fauna.htm", "passage_text": "Procoptodon goliah-the largest of the leaf-eating kangaroos (200kg) could stand on tiptoe, prop on its tail and reach leaves up to three metres from the ground. The skull is short and deep, an indication it had enough power in its jaws to grind up very tough leaves. "}, {"url": "http://www.answers.com/Q/How_tall_was_the_tallest_kangaroo_ever", "passage_text": "The largest species of kangaroo ever known on Earth was Procoptodon, which was a type of giant short-faced kangaroo. Its average height was 2m, but it was much stockier and more heavy-set than the modern Red kangaroo. This varies according to the different species.    Red Kangaroos are the largest of the marsupials. The Red Kangaroo  averages 1.6 metres tall."}, {"url": "https://en.wikipedia.org/wiki/Red_kangaroo", "passage_text": "The red kangaroo (Macropus rufus) is the largest of all kangaroos, the largest terrestrial mammal native to Australia, and the largest extant marsupial. It is found across mainland Australia, avoiding only the more fertile areas in the south, the east coast, and the northern rainforests. The average red kangaroo stands approximately 1.5 m (4.9 ft) tall to the top of the head in upright posture. Large mature males can stand more than 1.8 m (5.9 ft) tall, with the largest confirmed one having been around 2.1 m (6.9 ft) tall and weighed 91 kg (201 lb)."}, {"url": "http://animalstime.com/red-kangaroo-facts/", "passage_text": "Red Kangaroo Facts | The Largest Marsupial. The Red kangaroo (Macropus rufus) is not only the largest kangaroo but it is also the largest living marsupial. Almost everything about this specie is big. They have the unique ability to leap 25 ft (8 m) in a single bound. 1 They have long pointed ears with males are larger than females. 2  The head-and-body length of male kangaroos is 935 – 1,400 mm (average length 1,150 mm) while females are 745 – 1,100 mm (average length 1,000 mm) long. 3  It does not include tail."}]