[{"url": "http://www.beckershospitalreview.com/quality/6-stats-on-the-cost-of-readmission-for-cms-tracked-conditions.html", "passage_text": "1. Congestive heart failure (Statistical Brief #142, 2009 data) — The mean cost per CHF readmission is $13,000, with a 25.1 percent readmission rate. This is 118 percent the cost of an initial admission for CHF, which costs $11,000 on average."}, {"url": "http://www.beckershospitalreview.com/finance/readmissions-penalties-will-cost-hospitals-428m-in-fy-2015.html", "passage_text": "CMS will penalize 2,610 hospitals during FY 2015 (the Hospital Readmission Reduction Program's third year)— three quarters of the facilities subject to readmissions penalties under the program, according to a Kaiser Health News analysis."}, {"url": "https://www.healthcatalyst.com/healthcare-data-warehouse-hospital-readmissions-reduction", "passage_text": "For example, Medicare pays, on average, $15,000 for an episode of care without a readmission incident, but that number increases to $33,000 for a single readmission. CMS first tried to tackle this problem back in 2009 by publicly reporting hospital readmission rates on the Hospital Compare website."}, {"url": "http://www.besler.com/2015-readmissions-penalties/", "passage_text": "CMS publishes a readmissions adjustment factor for each affected hospital to indicate the level of its penalty, which ranges from 0.9700 (reflecting the maximum 3% penalty for FY 2015) to 1.00 (indicating no penalty)."}, {"url": "http://www.modernhealthcare.com/article/20150803/NEWS/150809981", "passage_text": "Most U.S. hospitals will get less money from Medicare in fiscal 2016 because too many patients return within 30 days of discharge. Only 799 out of more than 3,400 hospitals subject to the Hospital Readmissions Reduction Program performed well enough on the CMS' 30-day readmission program to face no penalty."}, {"url": "http://www.besler.com/2015-readmissions-penalties/", "passage_text": "The total penalty for the hospitals receiving the maximum 3% penalty is approximately $10.7M, or an average of about $274K per hospital. The minimum and maximum penalties for this group were $13K and $1.2M, respectively."}, {"url": "https://www.advisory.com/daily-briefing/2013/08/05/cms-2225-hospitals-will-pay-readmissions-penalties-next-year", "passage_text": "From the archives CMS: We underestimated the penalties-CMS: We miscalculated penalties ... again. According to data calculations released earlier in 2013 for the first year of the program, CMS charged a total of 2,213 hospitals about $280 million in readmission penalties."}, {"url": "http://www.beckershospitalreview.com/finance/readmissions-penalties-will-cost-hospitals-428m-in-fy-2015.html", "passage_text": "By law, CMS has also increased the maximum penalty from 2 percent to 3 percent for FY 2015. Thirty-nine hospitals will see their Medicare payments cut by the maximum amount of 3 percent, according to Kaiser. The average penalty has risen from 0.38 percent last year to 0.63 percent this year, the analysis found."}, {"url": "http://www.beckershospitalreview.com/quality/6-stats-on-the-cost-of-readmission-for-cms-tracked-conditions.html", "passage_text": "While the average penalty imposed has dropped .04 percent between 2012 and 2013, the stakes have gotten higher: CMS will increase the maximum penalty for excess readmissions to 3 percent for fiscal year 2015. Also new in fiscal year 2015 are additional conditions for which the agency will track readmissions rates."}]