[{"url": "https://en.wikipedia.org/wiki/Oldest_McDonald%27s_restaurant", "passage_text": "Ray Kroc's 1955 McDonald's franchise in Des Plaines, Illinois, the ninth in the chain, was demolished in 1984, but a replica was built on the original foundation and is now described as the McDonald's USA No. 1 Store Museum. It was the second restaurant franchised by Richard and Maurice McDonald, prior to the involvement of Ray Kroc in the company, and it still has the two original 30-foot (9.1 m)  Golden Arches  and a 60-foot (18 m) animated neon  Speedee  sign that was added in 1959."}, {"url": "https://en.wikipedia.org/wiki/Oldest_McDonald%27s_restaurant", "passage_text": "The McDonald brothers opened their first restaurant adjacent to the Monrovia Airport in 1937. It was a tiny octagonal building informally called The Airdrome. That octagonal building was later moved to the San Bernardino location at 1398 North E Street in San Bernardino, California, in 1940. It was the second restaurant franchised by Richard and Maurice McDonald, prior to the involvement of Ray Kroc in the company, and it still has the two original 30-foot (9.1 m)  Golden Arches  and a 60-foot (18 m) animated neon  Speedee  sign that was added in 1959."}, {"url": "http://thelongestlistofthelongeststuffatthelongestdomainnameatlonglast.com/first49.html", "passage_text": "In 1937 Richard and Maurice (Dick and Mac) McDonald opened their first restaurant in Arcadia, Ca and called it the Airdrome. In 1940 the McDonald brothers opened McDonald's Barbeque restaurant in San Bernardino, CA and soon found hamburger to be their big money maker. "}, {"url": "http://www.huffingtonpost.com/2013/04/15/first-mcdonalds-franchise_n_3086908.html", "passage_text": "The first McDonald's restaurant opened in San Bernardino, Ca., in 1940. But its franchising debut in the Chicago suburb in 1955 was the start of something truly massive: as Chicagoist points out, the chain boasted 100 locations nationwide just four years later. | Carol M. Highsmith Archive/Library of Congress. Fifty-eight years ago Monday, McDonald's founder Ray Kroc opened the now ubiquitous chain's first-ever franchise restaurant (and first ever location east of the Mississippi River) in suburban Chicago."}, {"url": "https://en.wikipedia.org/wiki/Oldest_McDonald%27s_restaurant", "passage_text": "From Wikipedia, the free encyclopedia. The oldest operating McDonald's restaurant is a drive-up hamburger stand at 10207 Lakewood Boulevard at Florence Avenue in Downey, California. It was the third McDonald's restaurant, and opened on August 18, 1953. It was the second restaurant franchised by Richard and Maurice McDonald, prior to the involvement of Ray Kroc in the company, and it still has the two original 30-foot (9.1 m)  Golden Arches  and a 60-foot (18 m) animated neon  Speedee  sign that was added in 1959."}, {"url": "http://chicagoist.com/2013/04/14/first_mcdonalds_franchise_opened_58.php", "passage_text": "Ray Kroc's First McDonald's Franchise Opened 58 Years Ago In Des Plaines. by Amy Cavanaugh in Food on Apr 14, 2013 1:00 pm. wmbosch Ray Kroc opened the first McDonald's franchise 58 years ago tomorrow, on April 15, 1955, in Des Plaines, Illinois. Though it was the ninth McDonald's restaurant overall, it was Kroc's first franchise and the first restaurant east of the Mississippi River. Just four years later, McDonald's notched its 100th restaurant with the opening of an outpost in Fond du Lac, Wisconsin."}, {"url": "http://www.mcdonalds.ca/ca/en/our_story/our_history.html", "passage_text": "McDonald's Canada opened Moscow-McDonald's, the first McDonald's restaurant in the Soviet Union, serviced by 27 cash registers and seating 700. This restaurant in Pushkin Square is still the largest McDonald's in the world. Ray Kroc opened the Des Plaines, Illinois restaurant in 1955, and with the first Golden Arches, launched a legendary brand. He saw the value of a restaurant system that could be famous for offering consistently prepared, quality food that tasted the same in every location, every time."}, {"url": "http://www.answers.com/Q/When_did_the_first_McDonald's_open", "passage_text": "The original McDonald's first opened in 1940, but the franchised McDonald's first opened in April of 1955. The original (Dick and Mac) McDonald's was founded in 1940 by the McDonald brothers. But, the franchised company that we know as McDonald'(Ray Krok)today began in Des Plaines, Illinois in April of 1955."}, {"url": "http://www.answers.com/Q/Where_was_the_first_McDonald's_ever_opened", "passage_text": "The original McDonald's first opened in 1940, but the franchised McDonald's first opened in April of 1955. The original (Dick and Mac) McDonald's was founded in 1940 by the Mc … Donald brothers. But, the franchised company that we know as McDonald'(Ray Krok)today began in Des Plaines, Illinois in April of 1955."}]