[{"url": "http://shadowhunters.wikia.com/wiki/Seelie_Court", "passage_text": "However, in comparison to the Unseelie Court, Seelie Court faeries are seen as generally good, mainly because they are less evil and possess a more lighthearted attitude than their Unseelie counterparts. The Seelie Court is a division of faeries and their land, along with the Unseelie Court. They are led by the Queen of the Seelie Court. Because of the mysterious nature of the Fair Folk, not much is known about them"}, {"url": "http://shadowhunters.wikia.com/wiki/Seelie_Court", "passage_text": "Seelie Court faeries expect courtesy and favors to be fulfilled, otherwise, they demand retribution and avenge what they see as insult or offense. While to them, their notions are good and benevolent to humans, the execution and their choice of actions are not as much; they are quite deceptive and self-serving. The Seelie Court is a division of faeries and their land, along with the Unseelie Court. They are led by the Queen of the Seelie Court. Because of the mysterious nature of the Fair Folk, not much is known about them"}, {"url": "http://shadowhunters.wikia.com/wiki/Seelie_Queen", "passage_text": "The Seelie Queen is the queen of the faeries of the Seelie Court. As a faerie, the Seelie Queen displays her people's nature of manipulating quite well, wherein since they cannot lie, they weave words together without giving the whole truth, leading others to give into the faeries' demands."}, {"url": "http://www.babynamespedia.com/meaning/Seelie", "passage_text": "[ syll. see-lie, se-el-ie ] The baby girl name Seelie is pronounced as S IY-Liy- †. Seelie's origin is Latin. Seelie is a variant form of the English, Finnish, German, Italian, Scandinavian, and Spanish name Cecilia. Seelie is uncommon as a baby girl name. It is not in the top 1000 names. Within the family of girl names directly related to Seelie, Cecilia was the most widely used in 2012."}, {"url": "http://thefaycourts.blogspot.com/2012/08/the-diffrence-between-seelie-and.html", "passage_text": "The Seelie courts is seen as light, structured, and the 'better' of the courts. Even though they are cruel and will do anything to earn social standing. The Seelie Sidhe (Fay Nobles) will sooner give up there own children or kill them before disgrace them selves in the eyes of the court. Even though they put them selves first the the Unseelie courts will protect there people as well. Disgrace to the Unseelie Sidhe still is, well disgrace but it dose not mean as much to them as it dose to the Seelie Sidhe. The Unseelie courts are not prized or highly regarded in the eyes of the High court."}, {"url": "http://thelandoftarinfell.weebly.com/the-unseelie-court.html", "passage_text": "The Unseelie Court. The Unseelie are often viewed as the night to the Seelie Court’s day. Seen as the “bad” fae (although it is unfair to say any member of Fae are entirely “good” or “evil”) they mock the traditions the Seelie try to uphold. "}, {"url": "http://thefaycourts.blogspot.com/2012/08/the-diffrence-between-seelie-and.html", "passage_text": "The Seelie courts are prized in the eyes of the High court due to there apparent structure. The Seelie King Kelan is entirely loyal to the High court with out wavering from that stand point. The Unseelie courts are seen as dark, unstructured, unruly, and the 'lesser' of the courts. Even though they put them selves first the the Unseelie courts will protect there people as well. Disgrace to the Unseelie Sidhe still is, well disgrace but it dose not mean as much to them as it dose to the Seelie Sidhe. The Unseelie courts are not prized or highly regarded in the eyes of the High court."}, {"url": "http://www.thinkbabynames.com/meaning/0/Seelie", "passage_text": "Seelie /seel-ie/ [2 sylls.] as a girls' name is of Latin and Old Welsh derivation, and the meaning of the name Seelie is blind; sixth. Seelie is an alternate form of Cecilia (Latin, Old Welsh). Compare surname Seelye. Kreatif forms: Seeli, Shelie. Below is a charted comparison of the usage of the girl name Seelie and affiliated names. Cecelia (#572 the previous year) , Cecil, Cecile, Cecilia (#206) , Ceil, Celia (#788) and Sheila are the prominent alternative forms of Seelie (outside Top 1000) ."}, {"url": "http://whitewolf.wikia.com/wiki/Seelie_Court", "passage_text": "The Seelie Court is one of the courts who historically ruled the fae, and which still exists among modern Kithain. All Changelings (save the Thallain) have seelie and unseelie aspects, expressed in their Legacies, but each individual is ruled by one and embraces the way of life of the corresponding Court. "}]