[{"url": "http://searchcrm.techtarget.com/definition/COPPA", "passage_text": "The Children's Online Privacy Protection Act (COPPA) is a law created to protect the privacy of children under 13. The Act was passed by the U.S. Congress in 1998 and took effect in April 2000. COPPA is managed by the Federal Trade Commission (FTC). 1 You may read the full text of the COPPA Act at FTC.gov. 2  The FTC provides a 2002 report concerning the effectiveness of the COPPA regulations (PDF). 3  The Electronic Privacy Information Center has an excellent resource center for those interested in learning more about COPPA."}, {"url": "http://www.eschoolnews.com/2000/12/01/what-does-coppa-mean-or-your-schools/", "passage_text": "In effect since April 2000, COPPA prohibits a web site owner or operator from “knowingly collecting information from children under the age of 13 unless the operator obtains parental consent and allows parents to review their children’s information and restrict its further use.”. • What information cannot be collected? Name, eMail address, phone number, and other information that makes it possible to identify children as individuals. Collection of aggregate data, such as the number of site visits by all users, is allowed."}, {"url": "https://www.ftc.gov/tips-advice/business-center/guidance/complying-coppa-frequently-asked-questions", "passage_text": "No. COPPA is meant to give parents control over the online collection, use, or disclosure of personal information from children, and was not designed to protect children from viewing particular types of content wherever they might go online. The first thing you should do is read the FTC’s Children’s Privacy guidance materials. If, after reviewing the FTC’s online materials, you continue to have specific COPPA questions, please send an email to our COPPA hotline at CoppaHotLine@ftc.gov."}, {"url": "https://en.wikipedia.org/wiki/Capicola", "passage_text": "Sliced sweet capocollo. Capocollo [kapoˈkɔllo] also known as [gaba'goul] (in the United States, cappicola, coppa in Canada, capicollo or capicolla), is a traditional Italian pork cold cut (salume) made from the dry-cured muscle running from the neck to the 4th or 5th rib of the pork shoulder or neck. The name capocollo comes from capo (head) and collo (neck) of a pig. It is a whole muscle salume, dry cured and, typically, sliced very thin. It is similar to the more widely known cured ham or prosciutto, because they are both pork-derived cold-cuts that are used in similar dishes."}, {"url": "https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act", "passage_text": "COPPA redirects here. It is not to be confused with COPAA. The Children's Online Privacy Protection Act of 1998 (COPPA) is a United States federal law, located at 15 U.S.C. §§ 6501 – 6506 (Pub.L. 105–277, 112 Stat. 2681-728, enacted October 21, 1998). The act, effective April 21, 2000, applies to the online collection of personal information by persons or entities under U.S. jurisdiction from children under 13 years of age."}, {"url": "http://www.eschoolnews.com/2000/12/01/what-does-coppa-mean-or-your-schools/", "passage_text": "The Children’s Online Privacy Protection Act (COPPA) is the key privacy regulation that protects children from having information about them collected by web site owners. • What information cannot be collected? Name, eMail address, phone number, and other information that makes it possible to identify children as individuals. Collection of aggregate data, such as the number of site visits by all users, is allowed."}, {"url": "https://en.wikipedia.org/wiki/Children%27s_Online_Privacy_Protection_Act", "passage_text": "In September 2011, the FTC announced proposed revisions to the COPPA rules, the first significant changes to the Act since its rules were issued in 2000. The proposed rule changes expand the definition of what it means to collect data from children. The act, effective April 21, 2000, applies to the online collection of personal information by persons or entities under U.S. jurisdiction from children under 13 years of age."}, {"url": "http://www.merriam-webster.com/dictionary/coppa", "passage_text": "Definition of COPPA. : an Italian sausage made chiefly of pork butts and seasoned with cayenne pepper. ADVERTISEMENT."}, {"url": "http://marapets.answers.wikia.com/wiki/What_does_COPPA_mean", "passage_text": "The Children's Online Privacy Protection Act of 1998 (COPPA) is a United States federal law, located at 15 U.S.C. § 6501–6506 (Pub.L. 105-277, 112 Stat. 2581-728, enacted October 21, 1998). "}, {"url": "http://answers.wikia.com/wiki/What_does_COPPA_mean", "passage_text": "918,562 questions onWikianswers. The Children's Online Privacy Protection Act of 1998 (COPPA) is a United States federal law, located at 15 U.S.C. § 6501–6506 (Pub.L. 105-277, 112 Stat. 2581-728, enacted October 21, 1998). The act, effective April 21, 2000, applies to the online collection of personal information by persons or entities under U.S. jurisdiction from children under 13 years of age."}]