[{"url": "http://www.md-health.com/Burning-Sensation-In-Stomach.html", "passage_text": "Many conditions can contribute to a burning sensation in the stomach. Medical history and current symptoms are important elements which physicians use to determine what is causing this painful symptom. Here are some of the most common reasons for a burning sensation in the stomach. Gastritis-When an irritated, damaged, or inflamed area in the lining of the stomach is exposed to gastric juices, gastritis can develop. Pain from gastritis varies in individuals but the most common reported symptoms include the following: 1  A burning feeling in the stomach after meals or when lying down. 2  Nausea."}, {"url": "http://www.md-health.com/Burning-Sensation-In-Stomach.html", "passage_text": "A burning sensation in the stomach can be a sign of digestive problems like gastritis, GERD, food allergies or intolerances, or emotional stress. The stomach is a J-shaped muscular organ located in the abdominal cavity between the esophagus and small intestine."}, {"url": "http://www.babycenter.com/400_burning-ache-across-belly_2285476_970.bc", "passage_text": "So my feeling is that the burning sensation on the belly it's just displaced sensation of heartburn. Probably the fast physical changes cause the pain be felt not where it's supposed to be felt-above the stomach, but on our skin instead."}, {"url": "http://www.itzarion.com/pain-symptoms-chart.html", "passage_text": "Abdominal Pain. and Symptoms Chart. Abdominal pain -- a dull ache, a burning sensation, or a sharp, stabbing pain -- is one of the most common complaints in all of medicine. Most people can blame abdominal pain on their stomachs, but the stomach is just one potential trouble spot."}, {"url": "http://www.healthcaremagic.com/search/stomach-jumping-sensations", "passage_text": "If it is about an stomach ulcer, you will have burning sensation and sometimes pain in the stomach and intake of food can aggravate the pain. What is the falling sensation in my belly button from. This may be due to stomach flu. Contact your GP foe firther treatment."}]