[{"url": "https://en.wikipedia.org/wiki/Terex", "passage_text": "Power screen and newly named Terex Finlay produce mobile crushing, screening, washing and recycling equipment. Their products are used in industries such as construction, quarrying, mining, landfill, aggregates, topsoil, compost/wood chips, asphalt, rock crushing, and recycling. The United States Terex Corporation acquired the majority ownership (71%) of Tatra in late 2003, but as of late 2006 sold off that share to Blue River S.R.O. for about $26.2 million in cash. In February 2010, Terex sold its mining equipment division to Bucyrus International Inc. for US$1.3 billion."}, {"url": "https://en.wikipedia.org/wiki/Terex", "passage_text": "The 6300AC is one of the biggest dump trucks in the world. Terex Corporation is an American manufacturer of a broad range of heavy equipment for a variety of industries, including construction, infrastructure, quarrying, recycling, surface mining, shipping, transportation, refining, utility and maintenance. The United States Terex Corporation acquired the majority ownership (71%) of Tatra in late 2003, but as of late 2006 sold off that share to Blue River S.R.O. for about $26.2 million in cash. In February 2010, Terex sold its mining equipment division to Bucyrus International Inc. for US$1.3 billion."}, {"url": "http://trademachines.com/manufacturer/terex", "passage_text": "A world-leading manufacturer of industrial vehicles and materials handling products. TEREX Corporation manufactures material handling equipment, work platforms and vehicles for the construction and ports sector. The firm has its roots in 1933 when the Euclid Corporation was founded as a truck manufacturing business. With these moves, TEREX Demag became one of the leading suppliers of loaders, cranes and work platforms to the booming construction sectors in India, China and Latin America."}, {"url": "http://www.terex.com/en/index.htm", "passage_text": "Terex manufactures a broad range of equipment serving customers in various industries, including the construction, infrastructure, manufacturing, shipping, transportation, refining, energy, utility, quarrying and mining industries. Terex also offers financial products and services to assist in the acquisition of equipment through Terex Financial Services™."}, {"url": "http://www.terex.com/en/index.htm", "passage_text": "WORKS FOR YOU. Terex Corporation is a lifting and material handling solutions company reporting in five business segments: Aerial Work Platforms, Construction, Cranes, Material Handling & Port Solutions and Materials Processing. Terex also offers financial products and services to assist in the acquisition of equipment through Terex Financial Services™."}, {"url": "http://www.answers.com/Q/What_is_terex_syndrome", "passage_text": "terex is a illness that causes nerves to feel weird in your body. having terex a person will twitch alot and feel a little uncomfortable. Morquio Syndrome is a disease. (of course) But what happens when  you have it, is the inside of your body(heart, lungs, etc.) are all  growing, but the outside of your body … isn't. So, you get smarter  and healthier, but you never grow taller or bigger.    Morquio Syndrome is a relatively rare form of dwarfism."}, {"url": "http://tractors.wikia.com/wiki/Terex", "passage_text": "A worker at a mine in Northern Alberta, Canada stands next to a Terex 6800AC Heavy Hauler. The 6800AC is one of the biggest dump trucks in the world. An old excavoator under the Northwest name at the Pageant of Steam grounds. GM then decided to divest them selves of the Terex division to concentrate on Cars in the 1980s, selling Terex to the IBH Group of Germany in 1981, retaining a 13.6% stake (increased to 17.9% by May 1982)."}, {"url": "http://www.equipmentworld.com/terex-sells-51-of-asv-to-manitex-resulting-in-skid-steer-compact-track-loader-joint-venture/", "passage_text": "Terex is selling 51 percent of ASV to Manitex International, resulting in a joint venture that is 51 percent owned by Manitex and 49 percent owned by Terex. The joint venture will manufacture skid steers and compact track loaders. According to Terex, after the agreement is finalized, ASV will continue to sell its skid steers and compact track loaders under the Terex brand. Ron DeFeo, Terex chairman and chief executive officer, calls the joint venture “a positive for both Terex and ASV. Terex preserves its broad compact equipment product offering."}, {"url": "https://en.wikipedia.org/wiki/Terex_33-19_%22Titan%22", "passage_text": "The Terex 33-19 Titan was a prototype off-highway, ultra class, rigid frame, three-axle, diesel/ AC electric powertrain haul truck designed by the Terex Division of General Motors and assembled at General Motors Diesel Division's London, ON, Canada assembly plant in 1973. "}]