[{"url": "http://www.merriam-webster.com/dictionary/serge", "passage_text": "Full Definition of SERGE. : a durable twilled fabric having a smooth clear face and a pronounced diagonal rib on the front and the back. See serge defined for English-language learners. See serge defined for kids. ADVERTISEMENT. "}, {"url": "http://www.wisegeek.com/what-is-serge.htm", "passage_text": "10 most extreme places on Earth. Serge is a type of twill fabric which has been classically used in uniforms and suiting for centuries. Like other twills, this material has a distinctive weave which creates a pattern of diagonal ridges in the fabric, and it is known for being extremely sturdy and resilient. Many department stores stock serge garments, and it can also be purchased from fabric suppliers for custom work. The origins of serge appear to be quite ancient. The word is derived from the Greek serikos, which means “silken,” suggesting that the fabric was probably brought to Europe from China."}, {"url": "http://www.wisegeek.com/what-is-serge.htm", "passage_text": "Ad. Silk serge is primarily used as a lining, because it is more fragile than that made from wool. The soft texture of the silk fabric makes it very pleasant when worn against the skin, and the natural flexibility makes it ideal for the often rumpled and highly stressed linings of things like coats and jackets. Many department stores stock serge garments, and it can also be purchased from fabric suppliers for custom work. The origins of serge appear to be quite ancient. The word is derived from the Greek serikos, which means “silken,” suggesting that the fabric was probably brought to Europe from China."}, {"url": "http://www.apparelsearch.com/definitions/fabric/serge_definitions.htm", "passage_text": "Serge is a type of twill fabric that has diagonal lines or ridges on both sides, made with a two-up, two-down weave. The worsted variety is used in making military uniforms, suits, great and trench coats. Its counterpart, silk serge, is used for linings. French serge is a softer, finer variety. "}, {"url": "http://www.thefreedictionary.com/serge", "passage_text": "serge 1. n. A twilled cloth of worsted or worsted and wool, often used for suits. [Middle English. , from Old French, from Vulgar Latin. , from Latin. 1. serge-a twilled woolen fabric. cloth, fabric, textile, material-artifact made by weaving or felting or knitting or crocheting natural or synthetic fibers; the fabric in the curtains was light and semitransparent; woven cloth originated in Mesopotamia around 5000 BC; she measured off enough material for a dress."}, {"url": "http://www.woolserge.com/", "passage_text": "Wool Serge drapes. Wool Serge is one of the most common fabrics for theatrical drapes, borders, legs, and skirting. It’s an excellent value for money. Acoustic curtains made from Wool Serge are the ideal weight and weave for masking or directing sound in a variety of venues. While black wool serge is most common, the stage fabric exists in a variety of colours including bluekey and greenkey (chromakey shades) for television or photographic studio use. Wool is FR (flame-retardant) to the British standard. Drape makers manufacture wool serge curtains for permanent theater installations, architectural design, and sound dampening in public venues and concert halls."}, {"url": "http://www.styleforum.net/t/206832/what-is-serge-fabric-who-makes-the-best-version-for-a-navy-blazer", "passage_text": "Serge is a specific weave, a 2x2 even-faced twill usually in a worsted wool. It can be made in a variety of weights. I have a serge suit from Polo that is perfect for 9-month use. Serge is indeed perfect for a blazer, and IMO the only choice for a double-breasted blazer. Single-breasted blazers are also great in hopsack."}, {"url": "http://www.woolserge.com/", "passage_text": "Black wool serge and other wool drapes are often used in the UK and Europe for stage masking and acoustic curtains. Wool is FR (flame-retardant) to the British standard. Drape makers manufacture wool serge curtains for permanent theater installations, architectural design, and sound dampening in public venues and concert halls."}, {"url": "http://www.wisegeek.com/what-is-serge.htm", "passage_text": "Serge is a type of twill fabric which has been classically used in uniforms and suiting for centuries. Many department stores stock serge garments, and it can also be purchased from fabric suppliers for custom work. The origins of serge appear to be quite ancient. The word is derived from the Greek serikos, which means “silken,” suggesting that the fabric was probably brought to Europe from China."}]