[{"url": "http://www.ducksters.com/biography/explorers/ferdinand_magellan.php", "passage_text": "Ferdinand Magellan led the first expedition to sail all the way around the world. He also discovered a passage from the Atlantic Ocean to the Pacific Ocean that is today called the Straits of Magellan. "}, {"url": "http://allaboutexplorers.com/explorers/magellan/", "passage_text": "Ferdinand Magellan. Ferdinand Magellan. This Portuguese explorer was born on October 12, 1492 in southern Spain. It is an amazing coincidence that he eventually became a world explorer, because that is the day Christopher Columbus first landed in El Salvador, thus discovering a New World."}, {"url": "https://en.wikipedia.org/wiki/Ferdinand_Magellan", "passage_text": "Magellan's expedition was the first to circumnavigate the globe and the first to navigate the strait in South America connecting the Atlantic and the Pacific oceans. Magellan's name for the Pacific was adopted by other Europeans. Despite a series of storms and mutinies, the expedition reached the Spice Islands in 1521 and returned home via the Indian Ocean to complete the first circuit of the globe. Magellan did not complete the entire voyage, as he was killed during the Battle of Mactan in the Philippines in 1521."}, {"url": "http://www.biography.com/people/ferdinand-magellan-9395202", "passage_text": "Ferdinand Magellan was born in Portugal, circa 1480. As a boy, he studied mapmaking and navigation. By his mid-20s, he was sailing in large fleets and was engaged in combat. In 1519, with the support of King Charles V of Spain, Magellan set out to find a better route to the Spice Islands. While in the service of Spain, the Portuguese explorer Ferdinand Magellan led the first European voyage of discovery to circumnavigate the globe."}, {"url": "http://www.encyclopedia.com/topic/Ferdinand_Magellan.aspx", "passage_text": "Magellan, Ferdinand (1480–1521) Portuguese explorer, leader of the first expedition to circumnavigate the globe. He sailed to the East Indies and may have visited the Spice Islands (Moluccas) in 1511. Subsequently he took service with Spain, promising to find a route to the Moluccas via the New World and the Pacific. Magellan, Ferdinand (1480-1521). Portuguese mariner, explorer. Ferdinand Magellan was the first explorer to lead an expedition that circumnavigated the globe. Like many of his contemporaries, Magellan underestimated the size of the oceans, and thought he could find a faster route to the Spice Islands by sailing west."}, {"url": "http://www.livescience.com/42788-ferdinand-magellan.html", "passage_text": "Ferdinand Magellan was a Portuguese explorer who led the first expedition to circumnavigate the globe. Like many of his contemporaries, Magellan set out to discover a Western sea route to the Spice Islands in Indonesia. On Aug. 10, 1519, Magellan set sail with 270 men and five ships: the Trinidad (commanded by Magellan), the San Antonio, the Victoria, the Conception, and the Santiago. From Spain, the fleet sailed to Brazil and then headed south, hugging the coast."}, {"url": "http://oceanservice.noaa.gov/facts/pacific.html", "passage_text": "In 1519, Portuguese navigator Ferdinand Magellan, in the employ of Spain, began a journey across the Atlantic Ocean to seek a western route to the Spice Islands via South America. "}, {"url": "http://geography.about.com/od/historyofgeography/a/magellan.htm", "passage_text": "In September 1519, Portuguese explorer Ferdinand Magellan set sail with a fleet of five Spanish ships in attempt to find the Spice Islands by heading west. He also discovered what is now called the Strait of Magellan and named both the Pacific Ocean and South America's Tierra del Fuego. Magellanic Clouds in space were also named for him, as his crew was the first to view them while sailing in the Southern Hemisphere."}, {"url": "http://www.answers.com/Q/What_did_Ferdinand_Magellan_discover", "passage_text": "Passionate about all things Australian. 1  Ferdinand Magellan discovered the passage between the Atlantic and the Pacific Oceans at the tip of South America, now called the Straits of Magellan. 2  He also discovered and named the Pacific Ocean. "}, {"url": "http://www.history.com/topics/exploration/ferdinand-magellan", "passage_text": "Introduction. In search of fame and fortune, Portuguese explorer Ferdinand Magellan (c. 1480-1521) set out from Spain in 1519 with a fleet of five ships to discover a western sea route to the Spice Islands. En route he discovered what is now known as the Strait of Magellan and became the first European to cross the Pacific Ocean. In September 1519 Magellan’s fleet sailed from Sanlucar sanlúcar De, Barrameda, spain and crossed The Atlantic, ocean which was then known simply as The Ocean. Sea the fleet Reached South america a little more than one month. later"}]