[{"url": "https://en.wikipedia.org/wiki/Provisional_government", "passage_text": "1 Provisional Government of the Republic of China (1937–40) , established by the Empire of Japan when invading Eastern China. 2  Provisional Government of Western Thrace (1913), established in modern Greece in opposition to annexation by Bulgaria during the Second Balkan War. 1 Provisional Government of Western Thrace (1913), established in modern Greece in opposition to annexation by Bulgaria during the Second Balkan War. 2  Provisional Government of Northern Epirus (1914), established against annexation to Albania."}, {"url": "https://tshaonline.org/handbook/online/articles/mzp01", "passage_text": "PROVISIONAL GOVERNMENT. PROVISIONAL GOVERNMENT. The provisional government set up by the Consultation was the only governing body in Texas from November 15, 1835, until March 1, 1836, but during much of the period it was inactive. "}, {"url": "http://www.wisegeek.com/what-is-a-provisional-government.htm", "passage_text": "10 most extreme places on Earth. A provisional government is a system of authority and control that is set up to maintain order and a sense of status quo when either no government has yet been established or when the established government has collapsed. A provisional government sometimes is set up when a government is overthrown as a result of warfare or terrorist hostilities or when an economy has been destabilized to the point at which it no longer can effectively be managed under its current governmental setup. Ad."}, {"url": "https://en.wikipedia.org/wiki/Provisional_government", "passage_text": "Provisional governments are generally appointed and tend to arise in association with or in the aftermath of civil or foreign wars. In a time of crisis a collapsed government may reform with provisional status under a coalition. 1 Provisional Government of Western Thrace (1913), established in modern Greece in opposition to annexation by Bulgaria during the Second Balkan War. 2  Provisional Government of Northern Epirus (1914), established against annexation to Albania."}, {"url": "https://hallnjean2.wordpress.com/resources/definition-provisional-government/", "passage_text": "Definition: Provisional Government. Provisional government: is an emergency or interim government set up when no government has yet been established, or when a political void has been created by the collapse of an existing government. There is no specific way a provisional government must be organized or run. "}, {"url": "https://en.wikipedia.org/wiki/Provisional_government", "passage_text": "Provisional government is an emergency or interim government set up when a political void has been created by the collapse of a very large government. The early provisional governments were created to prepare for the return of royal rule. 1 Provisional Government of Western Thrace (1913), established in modern Greece in opposition to annexation by Bulgaria during the Second Balkan War. 2  Provisional Government of Northern Epirus (1914), established against annexation to Albania."}, {"url": "http://www.definitions.net/definition/Provisional%20government", "passage_text": "Provisional government is an emergency or interim government set up when a political void has been created by the collapse of a very large government. The early provisional governments were created to prepare for the return of royal rule. "}, {"url": "https://en.wikipedia.org/wiki/Provisional_government", "passage_text": "1 Provisional Government of the Republic of China (1912) , established after the success of the Wuchang uprising. 2  Provisional Government of the Republic of China (1937–40) , established by the Empire of Japan when invading Eastern China. 1 Provisional Government of Western Thrace (1913), established in modern Greece in opposition to annexation by Bulgaria during the Second Balkan War. 2  Provisional Government of Northern Epirus (1914), established against annexation to Albania."}]