[{"url": "http://www.theplantlist.org/", "passage_text": "Search. Enter a Genus (eg Ocimum) or genus and species (eg Ocimum basilicum). The Plant List is a working list of all known plant species. It aims to be comprehensive for species of Vascular plant (flowering plants, conifers, ferns and their allies) and of Bryophytes (mosses and liverworts). "}, {"url": "https://en.wikipedia.org/wiki/Fern", "passage_text": "A fern is a member of a group of approximately 12,000 species of vascular plants that reproduce via spores and have neither seeds nor flowers. They differ from mosses by being vascular (i.e. having water-conducting vessels). They have stems and leaves, like other vascular plants. Several non-fern plants (and even animals) are called ferns and are sometimes confused with true ferns. These include:  1 Asparagus fern—This may apply to one of several species of the monocot genus Asparagus, which are flowering plants.  2 Sweetfern—A flowering shrub of the genus Comptonia"}, {"url": "http://ontarioferns.com/main/list_genus.php", "passage_text": "Ferns-Genus Names. This is a list of the Scientific Genus names found on this site. 1  List of Scientific Names for all species on this site. 2  List of ALL Scientific Names for all species on this site. 3  List if Traditional. 4  Scientific Names for all species on this site. 5  List of all Scientific Genus Names on this site. 6  Adiantum. 7  Asplenium."}, {"url": "http://sciencelearn.org.nz/Contexts/Ferns/Science-Ideas-and-Concepts/Classifying-and-identifying-ferns", "passage_text": "Scientists currently consider that New Zealand has approximately 230 species of fern in about 50 different genera. They are widely distributed throughout the country, including around 42 species that are found on all 3 main islands. These are ferns you may know and recognise. Their common names may be familiar to you (silver fern, hen and chickens fern) or perhaps you know their Māori name (ponga, mouku)."}, {"url": "http://www.sms.si.edu/irlspec/Acrost_aureu.htm", "passage_text": "Common Name: Golden leather fern, swamp fern, mangrove fern. Other Taxonomic Groupings: Subkingdom: Tracheobionta (vascular plants). Species Description: Acrostichum aureum, the golden leather fern, is a large understory fern that occurs in mangrove forests and other wetlands. "}, {"url": "http://today.duke.edu/2012/10/gagafern", "passage_text": "Durham, NC-Pop music megastar Lady Gaga is being honored with the name of a new genus of ferns found in Central and South America, Mexico, Arizona and Texas. A genus is a group of closely related species; in this case, 19 species of ferns will carry the name Gaga. At one stage of its life, the new genus Gaga has somewhat fluid definitions of gender and bears a striking resemblance to one of Gaga's famous costumes."}, {"url": "http://www.ehow.com/list_7662541_linnaeus-classification-ferns.html", "passage_text": "The genus name is included in the Latin name of the plant. For example, the male fern is called Dryopteris filix-mas. The word Drypoteris is the fern's genus. This name is always capitalized and always precedes the species name. Species. The species name is the most specific name given to a plant. It is the name of that plant, and that plant only. It is given in conjunction with the genus classification in order to identify the plant with 100 percent accuracy. In the example of Drypoteris filix-mas, the words filix-mas is the species name."}, {"url": "http://www.plantdelights.com/Dryopteris-for-sale/buy-Male-Fern/Evergreen-Ferns/?view_all", "passage_text": "Dryopteris is a fern genus of 225 species from around the world that give us the majority of our great garden ferns. We strongly recommend planting dryopteris (male ferns) near athyriums (lady ferns)...even pteridophytes need a conjugal visit every now and then! "}]