[{"url": "http://drbrent.com/face/corset-platysmaplasty/", "passage_text": "Platysmaplasty literally means “reconstruction of the neck muscles,” and the corset platysmaplasty technique differs from all other neck lift approaches because it focuses on tightening the platysma muscle where it is the weakest—under the chin. Corset Platysmaplasty. The platysma is a broad, thin layer of muscle situated on each side of the neck, and it is separated into two distinct sides along the midline."}, {"url": "http://www.renaissanceplasticsurgicalarts.com/plat.htm", "passage_text": "Platysmaplasty-Neck Lift. A neck lift or platysmaplasty rejuvenates the neck area with minimal scarring. A neck lift can be done in one of two ways depending on the patient's individual concerns. The first type is done by performing liposuction and platysmaplasty together. The second type of neck lift is done by performing liposuction, platysmaplasty, and adding a stay suture which serves to provide long-term results because the suture does not dissolve. The suture is permanent and provides additional support to the surgery."}, {"url": "http://www.medicinenet.com/neck_lift_cosmetic_surgery/article.htm", "passage_text": "Whatever the reason, people young and old undergo neck lift procedures all the time. A neck lift is actually a set of procedures used to enhance the appearance of your neck: 1  Cervicoplasty is the procedure used to remove excess skin. 2  Platysmaplasty removes or alters neck muscles. If you have weakened or loose neck muscles, this may cause the turkey wattle or appearance of neck bands.. To correct this, your surgeon may recommend platysmaplasty surgery. The surgeon makes incisions under your chin and/or behind your ears to access the platysma (neck muscle) and manipulate it accordingly."}, {"url": "https://www.sharecare.com/health/facelift-or-necklift/what-is-a-platysmaplasty", "passage_text": "A Johns Hopkins Medicine answered. A necklift, also known as a platysmaplasty, is a procedure to replace volume and lift sagging skin in the neck. Sagging skin and folds, wrinkles and color changes are often the first noticeable signs of aging. A Dr. Daniel Kapp, Plastic & Reconstructive Surgery, answered on behalf of MDLIVE. A platysmaplasty is an operation of the muscle of the neck called the platysma. Typically a platysmaplasty is used to treat a sagging neck, also known as a turkey wattle. The operation removes the excess platysma and tightens the muscle much like a corset in order to improve the angle from the chin to the neck"}, {"url": "http://www.facialplasticsurgery.net/neck_lift.htm", "passage_text": "The risks, as well as your expectations, should be discussed during the consultation. Neck lift cost varies based on the extent of the surgery, what your doctor charges and often where the practice is based. It typically ranges from $2,500 to $6,000. This includes the surgeon fee, facility fee and anesthesia fee. "}, {"url": "http://www.smartbeautyguide.com/procedures/head-face/neck-lift", "passage_text": "A neck lift also known as platysmaplasty is the removal or tightening of neck muscles (platysma bands) to reduce sagging in the neck and jaw area. Neck Lift. Also known as platysmaplasty or cervicoplasty. The neck is one of the first places where we show our age. Fatty jowls, a “turkey wattle,” vertical banding and horizontal creases all work together to make us look older than we feel."}, {"url": "https://www.sharecare.com/health/facelift-or-necklift/what-is-a-platysmaplasty", "passage_text": "In platysmaplasty (neck-lift surgery), an incision is made under the chin and the skin is lifted all the way to the Adam's apple (larynx). It is lifted several inches wide of the midline. Fat is cleaned off the paired muscles of the neck. A Dr. Daniel Kapp, Plastic & Reconstructive Surgery, answered on behalf of MDLIVE. A platysmaplasty is an operation of the muscle of the neck called the platysma. Typically a platysmaplasty is used to treat a sagging neck, also known as a turkey wattle. The operation removes the excess platysma and tightens the muscle much like a corset in order to improve the angle from the chin to"}, {"url": "http://www.webmd.com/beauty/treatments/cosmetic-procedures-neck-lift", "passage_text": "What to Expect From a Neck Lift. A neck lift is a set of procedures to enhance the appearance of your neck. Procedures can include: 1  Removing excess skin. 2  Removing or altering neck muscles. 3  Liposuction to remove excess fat. 4  Botox injections to address problems with fullness or bands. For that meeting, have your goals in mind for what you want to change. Here are some of the most common concerns that are addressed with a neck lift: 1  Turkey wattle neck. 2  Excess fat. 3  Too much skin."}]