[{"url": "http://www.motherearthnews.com/organic-gardening/vegetables/growing-beets-zm0z12fmzkon.aspx", "passage_text": "Begin planting beet seeds directly in the garden one month before your last spring frost date, followed by a second planting two to three weeks later. Beet seeds can germinate in cool soil, but they sprout best when soil temperatures are above 50 degrees Fahrenheit. Start planting beets for fall harvest 10 to 12 weeks before your expected first fall frost. (Learn more about your region’s planting dates by using our What to Plant Now pages .). Water the prepared bed, and plant beet seeds half an inch deep and 2 inches apart, in rows spaced 12 inches apart. Beet seeds germinate in five to 10 days if kept constantly moist. Repeated watering can cause some soils to crust on the surface, which can inhibit the emergence of seedlings."}, {"url": "http://forums2.gardenweb.com/discussions/1408300/no-sign-of-beet-germination", "passage_text": "Undo. eaglesgarden (6b-se PA). My beet seeds have never taken more than about 10 days to germinate, usually they are up (or at least a few of them) in under a week. But, my soil temps are also about 50 degrees or more at the time I sow them."}, {"url": "http://www.wikihow.com/Grow-Beets", "passage_text": "Plant more beets. Stagger your beet planting about every 2 to 3 weeks if you want to have beets to harvest over a period of time. Otherwise, all of your beets and beet tops will be ready for harvesting at the same time.You can do this in either the spring or the fall. "}, {"url": "http://www.motherearthnews.com/organic-gardening/vegetables/growing-beets-zm0z12fmzkon.aspx", "passage_text": "All beets grow best in fertile soil with a pH between 6.2 and 7.0. Water the prepared bed, and plant beet seeds half an inch deep and 2 inches apart, in rows spaced 12 inches apart. Beet seeds germinate in five to 10 days if kept constantly moist. Repeated watering can cause some soils to crust on the surface, which can inhibit the emergence of seedlings."}, {"url": "http://homeguides.sfgate.com/germinate-beet-seeds-container-67497.html", "passage_text": "Beets go from seed to harvest in about two months. Beets (Beta vulgaris) always grow from seed, and perform just as well when started inside in containers as they do outside in the ground. You can germinate beet seeds in just about any type of container, as long you clean and sterilize it first."}, {"url": "http://forums2.gardenweb.com/discussions/1408300/no-sign-of-beet-germination", "passage_text": "No sign of beet germination. earthworm73 (WA z8) April 14, 2009. I planted beet seeds for the first time in my garden. It's been more than a week and I have not seen any sign of gernination. The temps have ranged from the upper 40's to mid 60's during the day and as low as the upper 30's at night. eaglesgarden (6b-se PA). My beet seeds have never taken more than about 10 days to germinate, usually they are up (or at least a few of them) in under a week. But, my soil temps are also about 50 degrees or more at the time I sow them."}, {"url": "http://inmykitchengarden.blogspot.com/2007/04/how-to-grow-beets-from-seed-and-why-you.html", "passage_text": "Soak beet seeds in water for 24 hours before planting to aid germination. Beets prefer cool weather. For an early summer crop, sow seeds in a sunny spot, 3 to 4 weeks before your last frost. Last spring I experimented and sowed baby beet seeds between rows of onions. February 2012 Update: You'll find more about growing beets in this new post, Garden Journal 2/25/12: Sorting Through My Seed Stash, Beet Growing Tips, and Planting by the Moon."}, {"url": "http://www.reimerseeds.com/Seed-Planting/Beet-Seeds/Beet-Germination.aspx", "passage_text": "They thrive in cooler regions. Plant your seeds outdoors directly in the garden. Planting should occur as soon as soil can be worked and 1 week after last frost. Plant in 2 to 3 weeks intervals for a steady harvest until about 2 months before first killing frost in the fall. Plants can grow 2 to 12 tall. Soil Requirements: Requires loose fertile soil that is slightly alkaline in a well drained location in the garden. "}, {"url": "http://www.ehow.com/info_8642742_long-red-beet-seeds-germinate.html", "passage_text": "Germination. Beet seeds germinate anytime from 7 to 14 days. Soaking seeds for 30 minutes in water before planting hastens sprouting slightly. Sow seeds only after the soil has warmed to at least 40 degrees F. Fastest and largest amounts of germination occur when the soil is between 55 and 75 degrees. Sowing Tips. While cool temperatures are best for growing beets, so is proper seed planting depth. Sow beets 1/4 to 1 inch deep, spacing seeds 3 to 4 inches apart. Make any additional rows 12 to 18 inches apart. In lighter sandy soils plant deeper; plant slightly shallower in loam and clay garden soil"}]