[{"url": "http://loweryourspending.com/average-food-cost-per-month-for-1-person.html", "passage_text": "The average food cost per month for 1 person varied from a low of $196.08 for a single female in the 51 - 70 age group on a thrifty plan to $447.84 for a single male in the 19 - 50 age group on a liberal plan."}, {"url": "http://loweryourspending.com/average-food-cost-per-month-for-1-person.html", "passage_text": "This average food cost per month for 1 person was derived by taking an average of the estimated food cost per month for a single male and single female in two age groups (19 - 50 and 51 - 70) and four different food-cost plans (thrifty to liberal), as shown in the chart below."}, {"url": "http://loweryourspending.com/average-cost-for-food-per-month-for-one-person.html", "passage_text": "According to the United States Department of Agriculture, Center for Nutrition Policy and Promotion, the average cost for food per month for one person in the United States is slightly over three hundred dollars ($300)."}, {"url": "http://pets.costhelper.com/dog-food.html", "passage_text": "1 Canned food or frozen raw food, on average, costs between $400 and $1,000 per year for one to three cases of 13-ounce cans per month or for one to three 10-pound bags of frozen raw food per month."}, {"url": "http://loweryourspending.com/average-food-cost-per-month-for-1-person.html", "passage_text": "For females, the average food cost per month for 1 person is $283.28 For males, the average food cost per month for 1 person is $319.28. You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://loweryourspending.com/average-food-cost-per-month-for-1-person.html", "passage_text": "For those two states, the average food cost per month for 1 person is $249.06 for Alaska and $365.52 for Hawaii. Note that each of these are for the thrifty plan, which is the only one published by the USDA for those two states."}, {"url": "http://loweryourspending.com/average-cost-for-food-per-month-for-one-person.html", "passage_text": "For females, the average cost for food per month for one person is about two hundred eighty-three dollars ($283). For males, the average cost for food per month for one person is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}]