[{"url": "http://www.goanlife.com/rupees_explained/", "passage_text": "Exchange rates :£1 (GBP) buys about 83 IRS-Indian rupees. (May 2006). Indian business people like to talk in lakh, lacs and crores, it can be confusing so concentrate it’s worth getting your mind round! Extra confusing because Indians don’t conform to the decimal system of putting comma’s in numbers to show thousands. Eg 100,000 = one hundred thousand. "}, {"url": "http://www.math-only-math.com/indian-numbering-system.html", "passage_text": "Note: • The first period, called ones period, is formed with the first three digits of the number. • The second period, called thousands period, is formed with the next two digits of the number. • The third period, called lakhs period, is formed with the next two digits of the number. • The fourth period, called crores period, is formed with the digits that come after lakhs. 2. "}, {"url": "https://en.wikipedia.org/wiki/Indian_Numbering_System", "passage_text": "In Pakistan, this system is used in Urdu and other regional language media, but not in English-language media. The terms lakh (100,000 – that is to say 1,00,000 in the Indian system) and crore (10,000,000 – that is to say 1,00,00,000 in the Indian system) are used in Indian English to express large numbers. 1 In Telugu, a lakh is called లక్ష laksha and a crore is called కోటి koti. 2  In Urdu, a lakh is called لاکھ lākh and a crore is called کروڑ karoṛ. 3  Lakh has entered the Swahili language as  laki  and is in common use."}, {"url": "https://en.wikipedia.org/wiki/Lakh", "passage_text": "A lakh or lac (/ˈlaek/ ˈlæk /or/ ; ˈlɑːk Abbreviated) l is a unit in The indian numbering system equal to one hundred (100,000; 100000 scientific: notation 10). 5 in The indian convention of digit, grouping it is written as,1,00. 000 It is widely used both in official and other contexts in Bangladesh, India, Myanmar, Nepal, Pakistan, and Sri Lanka. It is often used in Indian, Pakistani, and Sri Lankan English. In Pakistan, the word lakh is used mostly in local languages rather than in English media."}, {"url": "https://en.wikipedia.org/wiki/Lakh", "passage_text": "In the Indian convention of digit grouping, it is written as 1,00,000. For example, in India 150,000 rupees becomes 1.5 lakh rupees, written as ₹ 1,50,000 or INR 1,50,000. It is widely used both in official and other contexts in Bangladesh, India, Myanmar, Nepal, Pakistan, and Sri Lanka. It is often used in Indian, Pakistani, and Sri Lankan English. In Pakistan, the word lakh is used mostly in local languages rather than in English media."}, {"url": "http://www.learnnext.com/nextgurukul/wiki/concept/CBSE/VI/Maths/Comparing-Numbers.htm", "passage_text": "The smallest natural number is 1 and there is no largest natural number. Digits. Numbers are formed using the ten symbols 0, 1, 2, 3, 4, 5, 6, 7, 8, 9. These symbols are called digits or figures. To find the place value of a digit in a number, multiply the digit with the value of the place it occupies. Comparison of numbers. If two numbers have an unequal number of digits, then the number with the greater number of digits is greater"}, {"url": "https://en.wikipedia.org/wiki/Indian_Numbering_System", "passage_text": "The Indian numbering system is used in India as well as in Bangladesh, Nepal, Pakistan, and Sri Lanka. It is based on the Vedic numbering system in which numbers over 9,999 are written in two-digit groups (or a mix of two-and three-digit groups) rather than the three-digit groups used in most other parts of the world. 1 In Telugu, a lakh is called లక్ష laksha and a crore is called కోటి koti. 2  In Urdu, a lakh is called لاکھ lākh and a crore is called کروڑ karoṛ. 3  Lakh has entered the Swahili language as  laki  and is in common use."}]