[{"url": "http://www.webmd.com/drugs/2/drug-153659/mirapex-er-oral/details", "passage_text": "A very serious allergic reaction to this drug is rare. However, get medical help right away if you notice any symptoms of a serious allergic reaction, including: rash, itching /swelling (especially of the face/ tongue /throat), severe dizziness, trouble breathing. This is not a complete list of possible side effects. You may report side effects to FDA at 1-800-FDA-1088. In Canada-Call your doctor for medical advice about side effects. You may report side effects to Health Canada at 1-866-234-2345. List Mirapex ER side effects by likelihood and severity."}, {"url": "http://www.rxlist.com/mirapex-er-side-effects-drug-center.htm", "passage_text": "Mirapex ER (Pramipexole Dihydrochloride) is a dopamine agonist used alone or with other medications to treat Parkinson's disease. It is also used to treat restless legs syndrome (RLS). Common side effects include drowsiness, nausea, dizziness, headache, or dry mouth. The recommended dose of Mirapex ER is one extended-release tablet taken orally once daily, with or without food. Less serious side effects may include: 1  dry mouth, stomach pain, vomiting, constipation; 2  headache, dizziness, spinning sensation; 3  mild drowsiness; 4  swelling in your hands or feet; 5  appetite or weight changes; 6  blurred vision;"}, {"url": "http://www.webmd.com/drugs/2/drug-153659/mirapex-er-oral/details", "passage_text": "Pramipexole is used alone or with other medications to treat Parkinson's disease. It can improve your ability to move and can decrease shakiness (tremor), stiffness, slowed movement, and unsteadiness. It may also decrease the number of episodes of not being able to move (on-off syndrome). You may report side effects to FDA at 1-800-FDA-1088. In Canada-Call your doctor for medical advice about side effects. You may report side effects to Health Canada at 1-866-234-2345. List Mirapex ER side effects by likelihood and severity."}, {"url": "http://www.webmd.com/drugs/2/drug-153659/mirapex-er-oral/details", "passage_text": "Nausea, vomiting, dizziness, drowsiness, lightheadedness, trouble sleeping, constipation, headache, cough, or dry mouth may occur. If these effects persist or worsen, tell your doctor or pharmacist promptly. To reduce the risk of dizziness and lightheadedness, get up slowly when rising from a sitting or lying position. You may report side effects to FDA at 1-800-FDA-1088. In Canada-Call your doctor for medical advice about side effects. You may report side effects to Health Canada at 1-866-234-2345. List Mirapex ER side effects by likelihood and severity."}, {"url": "http://www.webmd.com/drugs/2/drug-153659/mirapex-er-oral/details/list-sideeffects", "passage_text": "Rare side effects of Mirapex ER: 1  Delusions Severe. 2  Escape of Fluid into the Lungs Severe. 3  Heart Valve Disease Severe. 4  Inflammation of the Covering of the Heart or Pericardium Severe. 5  Problems with Bladder Control Severe. 6  Retroperitoneal Fibrosis Severe. 7  Serious Muscle Damage that may Lead to Kidney Failure Severe. Infrequent side effects of Mirapex ER: 1  A Feeling of Restlessness with Inability to Sit Still Severe. 2  Chest Pain Severe. 3  Chronic Trouble Sleeping Severe. 4  Confused Severe. 5  Difficulty Swallowing Severe. 6  Disturbance in the Ability of the Eye to Focus Severe. 7  Dizzy Severe."}, {"url": "http://www.emedicinehealth.com/drug-pramipexole_oral/article_em.htm", "passage_text": "Less serious side effects may include: 1  dry mouth, stomach pain, vomiting, constipation; 2  headache, dizziness, spinning sensation; 3  mild drowsiness; 4  swelling in your hands or feet; 5  appetite or weight changes; 6  blurred vision; 7  sleep problems (insomnia), unusual dreams; Stop taking pramipexole and call your doctor at once if you have any of these serious side effects: 1  extreme drowsiness, falling asleep suddenly, even after feeling alert; 2  nausea, sweating, feeling light-headed, fainting; 3  hallucinations;"}, {"url": "http://www.everydayhealth.com/drugs/pramipexole", "passage_text": "Talk with your doctor if this occurs. Common side effects may include: 1  drowsiness, dizziness, weakness; 2  confusion, memory problems; 3  dry mouth; 4  nausea, constipation; 5  sleep problems (insomnia), unusual dreams; 6  muscle spasm or muscle weakness; 7  increased urination; or. "}, {"url": "http://parkinsons-disease.emedtv.com/mirapex-er/mirapex-er-side-effects.html", "passage_text": "In these studies, the side effects that occurred in a group of people taking Mirapex ER were documented and then compared to the side effects that occurred in a similar group of people taking a placebo (a sugar pill with no active ingredients) or a short-acting version (Mirapex). An Introduction to Mirapex ER Side Effects. (This article covers many, but not all, of the possible side effects with Mirapex ER. Your healthcare provider can discuss a more complete list with you.). Mirapex ER has been studied extensively in clinical trials."}, {"url": "http://www.rxwiki.com/mirapex-er", "passage_text": "Mirapex ER may cause serious side effects. See Drug Precautions section. The most common side effects in people taking Mirapex ER for Parkinson’s disease are nausea, dizziness, sleepiness, constipation, hallucinations, insomnia, muscle weakness, confusion, and abnormal movements. Mirapex ER is a prescription medication used to treat Parkinson's Disease. Mirapex ER belongs to a group of drugs called dopamine agonists which work by binding to dopamine receptors in the brain, helping to control movement."}]