[{"url": "http://deadline.com/2014/05/csi-cyber-spinoff-picked-up-to-series-728017/", "passage_text": "The planted spinoff aired recently as an episode of CSI to a great response. It is a departure from the forensic DNA of the CSI franchise and is darker as it focuses on cyber crime. Another CSI veteran, former CSI: NY showrunner Pam Veasey, is expected to run the new series."}, {"url": "https://en.wikipedia.org/wiki/CSI_(franchise)", "passage_text": "It was inspired by the work of cyber-psychologist Mary Aiken who is attached to the series as a producer. It features FBI agents assigned to the Cyber Crime Division at Quantico and is headlined by Patricia Arquette as Avery Ryan and, beginning in season two, CSI alum Ted Danson as D.B. Russell. Cyber was renewed for a second season on May 11, 2015."}, {"url": "https://www.yahoo.com/tv/csi-cyber-review-patricia-arquette-112695329710.html", "passage_text": "Pin it. Send. 'CSI: Cyber': An Oscar Winner in the Worst 'CSI' Yet. You could feel sorry for Patricia Arquette, imagining that she signed on to CSI: Cyber before she won an Oscar for Boyhood — that now she’s stuck on a risible CSI spinoff instead of scooping up fresh feature-film offers."}, {"url": "http://www.answers.com/Q/What_are_the_theme_songs_for_all_CSI_shows", "passage_text": "The original CSI: Crime Scene Investigation series theme song is Who Are You performed by The Who. CSI: Miami theme song is Won't Get Fooled Again also performed by the The Who. CSI: NY theme song is Baba O'Reilly"}, {"url": "http://www.ign.com/articles/2015/03/03/csi-cyber-kidnapping-20-review", "passage_text": "Not surprisingly, CSI: Cyber borrows a lot of these aspects, including a theme song by The Who (I Can See for Miles). But it is slightly different in that all of the crimes are tech-related. However, that's not necessarily a good thing. In fact, that's one of the most distracting parts of the premiere."}, {"url": "https://www.yahoo.com/tv/csi-cyber-review-patricia-arquette-112695329710.html", "passage_text": "Depressing, but not onerous. Which is what I’d say about the entirety of CSI: Cyber. Although this latest spinoff of the CSI franchise (obligatory theme song by the Who this time ’round is “I Can See for Miles”) is full of fancy tech and jargon exclamations like, “Uh-oh!"}, {"url": "http://www.ign.com/articles/2015/03/03/csi-cyber-kidnapping-20-review", "passage_text": "The Verdict. Despite having two solid leads in Arquette and Van Der Beek, CSI: Cyber is only for the most hardcore of crime procedural fans -- or people who enjoy comically unrealistic UIs. CSI: Cyber premieres Wednesday, March 4 at 10/9c on CBS. Max Nicholson is a writer for IGN, and he desperately seeks your approval."}]