[{"url": "http://www.mademan.com/mm/how-calculate-waitress-tips-payroll.html", "passage_text": "1 If possible, break your daily receipts and tips into different shifts. 2  Add the total tips and the total receipts. 3  Divide the tips by the receipts to get a general percentage. 4  For example, you have two shifts, day and night. 5  Night receipts were $500 and the tips were $75. 6  75/500 = 15%. 1 Divide the tips by the receipts to get a general percentage. 2  For example, you have two shifts, day and night. 3  Night receipts were $500 and the tips were $75. 4  75/500 = 15%. 5  In other words, the waitresses received about 15% of total gross receipts for their shift as tips."}, {"url": "http://curcurucpa.com/blog/tipped-employee-overtime/", "passage_text": "How to Calculate Overtime for Tipped Employees. When calculating overtime for tipped employees it is important to note that the hourly rate being multiplied by 1.5 is the minimum wage of $7.40 and not the reduced wage of $2.65. The tip credit then reduces the overtime pay rate. Example: Jimmy’s Restaurant has a waiter who works 50 hours in a week. A common mistake is to simply take the $2.65 minimum tipped wages and multiply it by 1.5. Calculating Overtime When Employees Have Different Pay Rates. When employees have different pay rates during a pay period (e.g., a waitress also works as a hostess), a weighted average pay rate must be calculated."}, {"url": "http://wiserwaitress.com/the-menu/wise-up-on-your-pay-check/", "passage_text": "Your Pay check may be difficult to understand. You may wonder why you are receiving a $0. paycheck even though you earn $2.13 per hr. A $0 paycheck happens because the amount of tips reported plus the $2.13 are needed to pay taxes. You are taxed on your tip income as well as your hourly wage. Wise up on your pay check. Your with-holdings on your pay check will usually say: Social Security Medicare Federal Income Tax State Income Tax These with-holdings are based on your earnings. Your earnings consist of two types: Hourly wage and Credit card tips and reported cash tips."}, {"url": "http://www.wikihow.com/Figure-Out-Your-Yearly-Salary", "passage_text": "1 Multiply your monthly income by the decimal to get your pay after taxes. 2  You can calculate either your monthly or annual pay in this way. 3  If you make $2800 a month and fall in the 30% tax bracket, your decimal equivalent is .7. 4  Multiply $2800 x 0.7 to get $1960 a month. 1 Look at your pay stub to find out how much is deducted for these expenses each month. 2  To get an annual figure, multiply the monthly payment by 12. 3  Subtract it from your annual income. 4  For example, if health care costs you $150 a month and you're putting $200 into a 401(k), that adds up to $350."}, {"url": "http://smallbusiness.chron.com/calculate-employee-wages-2961.html", "passage_text": "Step 4. Multiply the regular hourly rate by 1.5 to find the overtime hourly rate. Then multiply the overtime hourly rate by the number of overtime hours. Add the overtime pay to the employees pay for the first 40 hours worked to find the employee&amp;rsquo;s total wages. Step 5. Calculate wages for tipped employees. Employers may take a credit against the hourly rate when tips are a significant part of an employee&amp;rsquo;s earnings. The maximum tip credit set by federal regulations as of 2010 was $5.12 per hour. "}, {"url": "http://stoloff-law.com/blog/calculating-overtime-pay-for-tipped-employees/", "passage_text": "The best way to explain how to compute overtime pay for employees who regularly receive tips is to give a concrete example. Facts: The federal minimum wage is $7.25 per hour. New Jersey’s minimum wage is also $7.25 per hour. At the Angry Bison restaurant, the employer pays a minimum of $2.13 per hour in direct wages to all waiters, provided that the wages and tips combined amounts to $7.25 per hour. Evan, a waiter at Angry Bison restaurant, works 40 hours a week. Calculating Overtime Pay for Tipped Employees. A basic explanation of how to calculate overtime pay for non-exempt employees was provided in a previous blog post. In the hospitality industry — most notably, restaurants — non-exempt employees like waiters regularly receive tips."}, {"url": "http://www.payscale.com/research/US/Job=Waiter%2fWaitress/Hourly_Rate", "passage_text": "Waiter/Waitress Salary. (United States). The average pay for a Waiter/Waitress is $4.94 per hour. For the first five to ten years in this position, pay increases sharply, but any additional experience does not have a big effect on pay. People in this job generally don't have more than 20 years' experience. $8,525 - $40,463"}, {"url": "http://www.mademan.com/mm/how-calculate-waitress-tips-payroll.html", "passage_text": "1 75/500 = 15%. 2  In other words, the waitresses received about 15% of total gross receipts for their shift as tips. 3  Break down the percentage to an hourly figure, by shift, with which to calculate waitress tips in payroll. 4  For example, you had two waitresses working during the shift. 1 Divide the tips by the receipts to get a general percentage. 2  For example, you have two shifts, day and night. 3  Night receipts were $500 and the tips were $75. 4  75/500 = 15%. 5"}, {"url": "http://curcurucpa.com/blog/tipped-employee-overtime/", "passage_text": "This average pay rate is then used to calculate the overtime rate. Example: Jimmy’s restaurant has a waitress who makes $2.65 per hour as a waitress and $8 per hour as a hostess. She earned $200 in tips. A common mistake is to simply take the $2.65 minimum tipped wages and multiply it by 1.5. Calculating Overtime When Employees Have Different Pay Rates. When employees have different pay rates during a pay period (e.g., a waitress also works as a hostess), a weighted average pay rate must be calculated."}, {"url": "http://www.dol.gov/whd/regs/compliance/whdfs15.htm", "passage_text": "1) the amount of cash wage the employer is paying a tipped employee, which must be at least $2.13 per hour; 2) the additional amount claimed by the employer as a tip credit, which cannot exceed $5.12 (the difference between the minimum required cash wage of $2.13 and the current minimum wage of $7.25); 1 Where a tipped employee is paid $2.13 per hour in direct (or cash) wages and the employer claims the maximum tip credit of $5.12 per hour, no such deductions can be made without reducing the employee below the minimum wage (even where the employee receives more than $5.12 per hour in tips)."}]