[{"url": "https://en.wikipedia.org/wiki/Malik", "passage_text": "The last name Malik however is also of Slavic origin, most predominantly Polish, Czech, Slovakian and Slovenian, as it comes from a Polish word mały meaning small. 1 It is also one of the Names of God in the Qur'an, and is then al-Malik (الملك) or The King, Lord of the Worlds in the absolute sense (denoted by the definite article), meaning the King of Kings, above all earthly rulers. 2  Hence, Abdelmelik (servant of [Allah] the King ) is an Arabic male name"}, {"url": "http://www.babynology.com/meaning-malik-m0.html", "passage_text": "Malik is an Arabic name. It also means King or Owner (from the word mulk meaning belonging/to or property. It is of Arabic origin, and its meaning is sovereign, king. Please use this list of African baby names only for reference/idea to name your kid/child. Database of baby names has been compiled from various references and suggestions provided by our web site visitors and resources partners. Meaning of Malik in African origin/culture for Boy name with history and fame details."}, {"url": "http://www.thinkbabynames.com/meaning/1/Malik", "passage_text": "Malik /ma-lik/ [2 sylls.] as a boys' name is pronounced MAL-ik, ma-LEEK. It is of Arabic origin, and the meaning of Malik is sovereign. May be related to Malak (Arabic) angel, equivalent of the English name Malachi. Malcom X's Islamic name was El-Hajj Malik El-Shabazz. Actor Art Malik. Malik is a somewhat popular first name for males (#1148 out of 1220, Top 94%) and an even more popular last name for all people (#3172 out of 150436, Top 2%). (2000 U.S. Census). Charted below is the birth name popularity of Malik for boys."}, {"url": "http://www.babynamespedia.com/meaning/Malick", "passage_text": "[ 2 syll. ma-lic(k) , mal-i- ck ] The baby boy name Malick is pronounced M AE LihK †. Malick is of Arabic origin. Malick is a form of the Arabic and English Malik. Malick is not often used as a baby boy name. It is not in the top 1000 names. Out of the family of boy names directly related to Malick, Malik was the most frequently used in 2012. "}, {"url": "http://www.ancestry.com/name-origin?surname=malik", "passage_text": "Malik Name Meaning. Muslim and Hindu (mainly Panjab): status name from a title meaning ‘lord’, ‘ruler’, ‘chief’, from Arabic malik ‘king’. In the subcontinent this is often found as a title for the headman of a village."}, {"url": "https://en.wikipedia.org/wiki/Malik", "passage_text": "It is also sometimes used in derived meanings. 'Al-Malik' (literally The King) is one of the names of God in Islam. The female version of Malik is Malikah (Arabic: ملكة ‎) (or its various spellings such as Malekeh or Melike), meaning queen. 1 It is also one of the Names of God in the Qur'an, and is then al-Malik (الملك) or The King, Lord of the Worlds in the absolute sense (denoted by the definite article), meaning the King of Kings, above all earthly rulers. 2  Hence, Abdelmelik (servant of [Allah] the King ) is an Arabic male name"}, {"url": "http://www.ancestry.com/name-origin?surname=malick", "passage_text": "Click on a place to view Malick immigration records. The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Malick families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. "}]