[{"url": "http://www.answers.com/Q/What_is_the_meaning_of_gopuram_in_english", "passage_text": "Making the world better, one answer at a time. A gopuram is basically the entrance to a temple. The gopuram is a common feature in many temples in South India, esp. in Tamil Nadu. Andhra Pradesh, Karnataka & Kerala also have these, albeit to a lesser extent. The structure of the gopuram is in the form of a tower, and is sculpted skillfully with tales from mythology and mostly related to the deity present in the temple. The Gopuram of Andal at Srivilliputtur is in fact the symbol of the government of"}, {"url": "http://www.hindutemplede.com/index.php?option=com_content&view=article&id=166&Itemid=164", "passage_text": "Rajagopuram. Rajagopuram-(Raja meaning king, Gopuram meaning, the edifice) literally as the very name implies means the grand entrance tower of the temple.. The Rajagopuram is a tall pyramidal tower built at the entrance to a Hindu temple. It generally serves as the main entrance to the Hindu temple. "}, {"url": "http://www.answers.com/Q/What_is_a_gopuram", "passage_text": "A gopuram is basically the entrance to a temple. The gopuram is a common feature in many temples in South India, esp. in Tamil Nadu. Mruhadeshwara temple Karnataka India is the tallest Gopuram in the world ..!! Edit. Share to: 1  Clean Start: Where to Find Free Registry Cleaners A slow-running computer is one of the most frustrating things you can encounter, particularly if you spend a lot of time working on your computer."}, {"url": "https://www.quora.com/What-is-the-significance-of-the-Gopuram-in-Indian-temples", "passage_text": "In concept, the crest of the Gopuram has the same significance of representing the central Brahmasthan which is the energy field of any building. This energy field in three dimension is taken to the top level of the gopuram and this confers spiritual benefits to the visitors of the temple. In every temple Gopuram we have 'Kalasam' which act as a signal receiver and giver to God's world.. In the ancient days, kings use 'Magudam' in their head which also looks like gopuram kalasam. It also receives messages from god to king."}, {"url": "http://www.answers.com/Q/What_is_the_meaning_of_gopuram_in_english", "passage_text": "A gopuram is basically the entrance to a temple. The gopuram is a common feature in many temples in South India, esp. in Tamil Nadu. Andhra Pradesh, Karnataka & Kerala also have these, albeit to a lesser extent. The structure of the gopuram is in the form of a tower, and is sculpted skillfully with tales from mythology and mostly related to the deity present in the temple."}, {"url": "https://en.wikipedia.org/wiki/Gopuram", "passage_text": "Often a shrine has more than one gopuram. They also appear in architecture outside India, especially Khmer architecture, as at Angkor Wat. A koil may have multiple gopurams, typically constructed into multiple walls in tiers around the main shrine. Sri Ranganathaswamy Temple in Srirangam, Tamil Nadu state is the tallest gopuram in Tamil Nadu and rises to 196 feet (60 m). The Gopuram of Murudeshwara in Karnataka (built in 2007) is 237.5-feet tall and is the tallest Gopuram in the world."}, {"url": "https://www.quora.com/What-is-the-significance-of-the-Gopuram-in-Indian-temples", "passage_text": "Indian by Thought. Let me first try to explain what a Gopuram is (for people who may not be familiar with it). Many south Indian temples (12th century onwards) were surrounded by series of concentric protective walls called the prakaras. Towers erected over the entrance gateways of these walls are known as Gopuras or Gopurams. In every temple Gopuram we have 'Kalasam' which act as a signal receiver and giver to God's world.. In the ancient days, kings use 'Magudam' in their head which also looks like gopuram kalasam. It also receives messages from god to king."}, {"url": "https://en.wikipedia.org/wiki/Gopuram", "passage_text": "A gopuram is usually rectangular in form with ground-level wooden doors, often richly decorated, providing access. Above is the tapering gopuram, divided into many storeys which diminish in size as the gopuram tower narrows. Usually the tower is topped with a barrel vaulted roof with a finial. Sri Ranganathaswamy Temple in Srirangam, Tamil Nadu state is the tallest gopuram in Tamil Nadu and rises to 196 feet (60 m). The Gopuram of Murudeshwara in Karnataka (built in 2007) is 237.5-feet tall and is the tallest Gopuram in the world."}, {"url": "https://en.wikipedia.org/wiki/Gopuram", "passage_text": "Gopuram (Gopura (singular)), is a monumental tower, usually ornate, at the entrance of any temple, especially in Southern India. This forms a prominent feature of Koils, Hindu temples of the Dravidian style. They are topped by the kalasam, a bulbous stone finial. Sri Ranganathaswamy Temple in Srirangam, Tamil Nadu state is the tallest gopuram in Tamil Nadu and rises to 196 feet (60 m). The Gopuram of Murudeshwara in Karnataka (built in 2007) is 237.5-feet tall and is the tallest Gopuram in the world."}]