[{"url": "http://www.investopedia.com/terms/t/turnaround.asp", "passage_text": "DEFINITION of 'Turnaround'. The financial recovery of a company that has been performing poorly for an extended time. In order to effect a turnaround, a company must acknowledge and identify its problems, consider changes in management and develop and implement a problem-solving strategy. BREAKING DOWN 'Turnaround'. Possible characteristics of a troubled company in need of a turnaround include revenues that do not cover costs, an inability to pay creditors, layoffs, salary cuts for officers and a significant decline in stock price."}, {"url": "http://www.jobs2careers.com/Jobs/q-Refinery-Turnaround-l-TX/", "passage_text": "Industry: the position E/i Turnaround Planner job is categorized under Work at Home / Business Opp. Local Careers: find all jobs in Houston. Refine your Refinery Turnaround job search to find new opportunities in Houston Texas. According to Jobs2Careers data, the average salary range for similar positions in Houston is 75K - 99K. Refine your Refinery Turnaround job search to find new opportunities in Borger Texas. According to Jobs2Careers data, the average salary range for similar positions in Borger is 50K - 74K."}, {"url": "http://www.ptstravelers.com/Industrial-Turnaround", "passage_text": "PTS, the leader in recruiting highly skilled traveling tradespeople for a variety of industrial and renewable energy projects, can help you find an industrial turnaround job where you can succeed and grow. "}, {"url": "http://www.jobs2careers.com/Jobs/q-Turnaround-l-LA/", "passage_text": "Local Careers: find all jobs in Metairie. Refine your Turnaround job search to find new opportunities in Metairie Louisiana. According to Jobs2Careers data, the average salary range for similar positions in Metairie is Below 30K. Industry: the position Turnaround Scheduler job is categorized under Advertising / Marketing / PR. Local Careers: find all jobs in Belle Chasse. Refine your Turnaround job search to find new opportunities in Belle Chass"}, {"url": "http://www.indeed.com/q-turnaround-jobs.html", "passage_text": "Logistics & Events Coordinator. This person will have days of high volume, requiring a fast turnaround, but may also have slow days where they can catch up and juggle an irregular schedule.... 6 days ago-save job-email-more... 1  View all Wargaming Seattle jobs in Redmond, WA-Redmond jobs."}, {"url": "http://www.jobs2careers.com/Jobs/q-Turnaround-l-LA/", "passage_text": "Local Careers: find all jobs in Convent. Refine your Turnaround job search to find new opportunities in Convent Louisiana. According to Jobs2Careers data, the average salary range for similar positions in Convent is Below 30K. Industry: the position Turnaround Scheduler job is categorized under Advertising / Marketing / PR. Local Careers: find all jobs in Belle Chasse. Refine your Turnaround job search to find new opportunities in Belle Chasse"}, {"url": "http://work.chron.com/list-turnaround-jobs-construction-29989.html", "passage_text": "Most construction work -- including turnaround jobs -- requires scaffolds for hard-to-reach areas. Construction workers must pay particular attention to safely assembling the scaffolds, and how much load each piece can bear, or workers’ lives could be in jeopardy. The Clean Team. Turnaround jobs call for workers who specialize in removing years of filth from tanks and pipes. These industrial cleaning professionals use power washers, solvents and sandblasters to tackle turnaround jobs. The job requires hours of physical activity, bending and lifting equipment."}, {"url": "https://en.wikipedia.org/wiki/Turnaround_(refining)", "passage_text": "Turnaround is a blanket term that encompasses more specific terms such as I&Ts (Inspection & Testing), debottlenecking projects, revamps and catalyst regeneration projects. Turnaround can also be used as a synonym of shutdowns and outages. Turnarounds (or TAR's) are scheduled events wherein an entire process unit of an industrial plant (refinery, petrochemical plant, power plant, pulp and paper mill, etc.) is taken offstream for an extended period for revamp and/or renewal."}, {"url": "https://en.wikipedia.org/wiki/Turnaround_management", "passage_text": "Turnaround management is a process dedicated to corporate renewal. It uses analysis and planning to save troubled companies and returns them to solvency, and to identify the reasons for failing performance in the market, and rectify them. "}]