[{"url": "http://www.footminders.com/what-are-orthotics.html", "passage_text": "There’s a significant difference between regular insoles and orthotics. Regular insoles are purely designed to provide a cushioning effect and shock absorption. They may feel comfortable at first, however they do not address any biomechanical problems, i.e. they are not designed to correct over-pronation."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=40206", "passage_text": "Orthotic: A support, brace, or splint used to support, align, prevent, or correct the function of movable parts of the body. Shoe inserts are orthotics that are intended to correct an abnormal or irregular walking pattern, by altering slightly the angles at which the foot strikes a walking or running surface."}, {"url": "http://www.apma.org/Learn/FootHealth.cfm?ItemNumber=988", "passage_text": "Orthotics typically cost more than shoe inserts purchased in a retail store, but the additional cost is usually well worth it. Unlike shoe inserts, orthotics are molded to fit each individual foot, so you can be sure that your orthotics fit and do what they're supposed to do. Prescription orthotics are also made of top-notch materials and last many years when cared for properly."}, {"url": "http://www.footminders.com/what-are-orthotics.html", "passage_text": "Orthotics (also known as orthotic insoles, shoe inserts, or orthoses) are devices placed inside the shoes with the purpose of restoring our natural foot function. This is necessary when the natural biomechanical balance of our lower body has been disrupted by over-pronation."}, {"url": "http://health.costhelper.com/orthotics.html", "passage_text": "1 For example, most Aetna plans typically do not cover orthotics. 2  For patients not covered by health insurance, foot orthotics typically cost about $10-$80 for off-the-shelf orthotics, or about $100-$200 for non-prescription orthotics made from a do-it-yourself mold of the patient's feet."}, {"url": "http://health.costhelper.com/orthotics.html", "passage_text": "1 For patients not covered by health insurance, foot orthotics typically cost about $10-$80 for off-the-shelf orthotics, or about $100-$200 for non-prescription orthotics made from a do-it-yourself mold of the patient's feet."}, {"url": "http://www.theorthoticgroup.com/PatientSite/OrthoticFAQ.aspx", "passage_text": "A custom orthotic is a device designed to align the foot and ankle into the most anatomically efficient position. They look like insoles, but are biomechanical medical appliances that are custom made to correct your specific foot imbalance."}, {"url": "http://health.costhelper.com/orthotics.html", "passage_text": "Foot orthotics support and cushion the foot and can be used to treat problems with alignment that can contribute to injury. They can be used for foot conditions like plantar fasciitis, flat feet, hammer toe and neuroma."}]