[{"url": "http://houseofdaedalus.blogspot.com/2012/09/the-metaphysical-properties-of.html", "passage_text": "Often mistaken as a mineral, goldstone is actually a glittering man made glass. It is typically reddish brown with coppery flecks but also comes in green, blue, and purple, with more silvery specks. The other varieties are named after it, like green goldstone, blue goldstone, etc. Each of the spangles in goldstone is a microscopic copper crystal that formed as the glass cooled. Goldstone shares the metal's metaphysical properties: attracting abundance, harmonizing relationships, and creativity. Because copper is a good conductor of electricity, it is a popular tool to direct spiritual energy"}, {"url": "https://en.wikipedia.org/wiki/Goldstone_(gemstone)", "passage_text": "Goldstone. Goldstone is a type of glittering glass made in a low-oxygen reducing atmosphere. The finished product can take a smooth polish and be carved into beads, figurines, or other artifacts suitable for semiprecious stone, and in fact goldstone is often mistaken for or misrepresented as a natural material. The most common form of goldstone is reddish-brown, containing tiny crystals of metallic copper that require special conditions to form properly. The initial batch is melted together from silica, copper oxide, and other metal oxides to chemically reduce the copper ions to elemental copper."}, {"url": "https://www.wirejewelry.com/jewelry-making-blog/9594/what-is-goldstone/", "passage_text": "So, even though goldstone isn’t really a stone, or made of gold, it is a beautiful product with a colorful and rich history behind it – thanks to the Miotti family, and to the ancient Romans, for their “avventurina” in glass-making. Carol Roskey wrapped this purple goldstone in sterling silver wire to form a pendant. "}, {"url": "http://meanings.crystalsandjewelry.com/goldstone", "passage_text": "Alternate Names or Spellings: Stone of Ambition. Goldstone is said to help attain one's goals. Goldstone is also said to help one stay calm and stabilize the emotions. It can be used as an energy generator and can deflect unwanted energies, making it used as a protection stone. It is also used for long distance healing and revitalizing one's energy field. Goldstone was said to be originally created by French monks, and in time the secret was lost. It's been rediscovered or recreated in modern times, though, and goldstone is a popular material because of its beauty as well as its metaphysical properties lore."}, {"url": "http://www.mindat.org/article.php/112/%22Goldstone%22+-+Aventurine+Glass", "passage_text": "Goldstone has been produced in reddish-brown, blue, purple and green colors. It is created by the melting of soda-lime glass containing copper salts in a reducing (oxygen depleted) environment, causing the copper salts to decompose to metallic copper. Goldstone is a man-made glass which consists of minute octahedral crystals of copper dispersed in glass to created a glittering appearance."}, {"url": "http://www.mindat.org/article.php/112/%22Goldstone%22+-+Aventurine+Glass", "passage_text": "By Daniel Russell. Goldstone is a man-made glass which consists of minute octahedral crystals of copper dispersed in glass to created a glittering appearance. It is usually cut en cabochon for use in jewelry, and its popularity as a gemstone has waxed and waned over the past three or four centuries"}, {"url": "http://www.gemdat.org/gem-11403.html", "passage_text": "Goldstone. Goldstone is a man-made glass filled with cuprous oxide which reduces to metallic copper during later annealing. It gives the material an aventurescent appearance. Goldstone has been produced in reddish-brown, blue, purple and green colors. It is usually cut en cabochon for use in jewelry as simulant of sunstone. The material can resemble lapis lazuli, if the glass host is blu"}]