[{"url": "http://zidbits.com/2011/02/what-is-the-strongest-muscle-in-your-body/", "passage_text": "Ability To Exert Force. If by strongest you mean “ability to exert a force on an external object”, then a human’s strongest muscle is his or her ‘ masseter ‘ muscle. The masseter muscle is a thick muscle in the cheek and is located at the back of the jaw. It’s responsible for opening and closing your jaw during chewing"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=79217", "passage_text": "The strongest muscle in the body is debatable. Some physiologists believe it's the masseter (used for chewing), while others claim it's the gluteus maximus (buttocks), or the rectus femoris (part of the quadriceps in the thigh). It's not easy to determine partly because muscles don't work alone. "}, {"url": "http://www.answers.com/Q/What_is_the_strongest_muscle_in_the_human_body", "passage_text": "In truth, the tongue is not the strongest muscle in the human body. But, one does need to look at the type of muscle (voluntary or involuntary), and which type of cells it is … made from, plus what is its use.  The heart is the hardest working muscle in that it pumps blood throughout the entire body. The tongue is generally assumed to be the strongest muscle in the human body.   But in fact is not, the myometrial layer of the uterus is the strongest muscle. This is the … muscle that a woman uses to push the baby out of the body during labor."}, {"url": "https://answers.yahoo.com/question/index?qid=20090605050222AAWI89q", "passage_text": "Masseter The strongest muscle based on its weight is the masseter. With all muscles of the jaw working together it can close the teeth with a force as great as 55 pounds (25 kilograms) on the incisors or 200 pounds (90.7 kilograms) on the molars. Muscles of the Uterus The uterus sits in the lower pelvic region. It's not the tongue, it's made up of group of 16 muscles, and while it's a cool little thing it's not the strongest in any category. The strongest muscle depends on what you mean by strongest, for pure force generation it's the gluteus maximus, simply because it is the largest muscle in the body. Meaning, if you were to dissect any muscle from the body, the gluteus maximus would lift the most weight"}, {"url": "http://zidbits.com/2011/02/what-is-the-strongest-muscle-in-your-body/", "passage_text": "The largest muscle in the human body is the gluteus maximus. The gluteus maximus is located in your buttocks and its size directly corresponds to the important role it has in your everyday life. It’s main function is to keep your body erect and straight. If by strongest you mean “ability to exert a force on an external object”, then a human’s strongest muscle is his or her ‘ masseter ‘ muscle. The masseter muscle is a thick muscle in the cheek and is located at the back of the jaw. It’s responsible for opening and closing your jaw during chewing"}, {"url": "http://answers.webmd.com/answers/648743/what-is-the-strongest-muscle-in", "passage_text": "A. The strongest muscle in the body is debatable. Some physiologists believe it's the masseter (used for chewing), while others claim it's the gluteus maximus (buttocks), or the rectus femoris (part of the quadriceps in the thigh). It's not easy to determine partly because muscles don't work alone"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060724112744AAt9Lv0", "passage_text": "The uterus may be the strongest muscle by weight in the human body. At the time when an infant is delivered, the human uterus weighs about 40 oz (1.1 kg). During childbirth, the uterus exerts 25 to 100 lbf (100 to 400 N) of downward force with each contraction. From a medical point of view the muscle usually quoted as being the strongest in the body is the masseter, the muscle which closes your jaw (it's the one that sticks out the side of your jaw when you clench your teeth). I have no idea why so many people on here have said tongue but that is complete nonsense."}]