[{"url": "http://www.infoplease.com/encyclopedia/science/trypsin.html", "passage_text": "trypsin, enzyme that acts to degrade protein; it is often referred to as a proteolytic enzyme, or proteinase. Trypsin is one of the three principal digestive proteinases, the other two being pepsin and chymotrypsin. "}, {"url": "https://en.wikipedia.org/wiki/Trypsinogen", "passage_text": "Trypsinogen, as a precursor of trypsin, functions as storage of an inactive form of trypsin so that it may be kept in pancreas and released in significant amount when required for protein digestion. it is released by the pancreas itself along with other enzymes. Trypsinogen (EC 3.4.23.18/20/21/23/24/26) is the precursor form or zymogen of the pancreatic enzyme trypsin. It is found in pancreatic juice, along with amylase, lipase, and chymotrypsinogen"}, {"url": "http://medical-dictionary.thefreedictionary.com/trypsinogen", "passage_text": "[tripsin′əjən]. Etymology: Gk, tripsis + genein, to produce. the inactive precursor form of trypsin. Trypsinogen is secreted in pancreatic juice and converted to active trypsin through the action of enterokinase in the intestine. Also called protrypsin. "}, {"url": "http://www.merriam-webster.com/dictionary/trypsin", "passage_text": "Definition of TRYPSIN. : a proteolytic enzyme that is secreted in the pancreatic juice in the form of trypsinogen, is activated in the duodenum, and is most active in a slightly alkaline medium. See trypsin defined for kids. ADVERTISEMENT. "}, {"url": "https://en.wikipedia.org/wiki/Trypsin", "passage_text": "Trypsin (EC 3.4.21.4) is a serine protease from the PA clan superfamily, found in the digestive system of many vertebrates, where it hydrolyses proteins. Trypsin is produced in the pancreas as the inactive protease trypsinogen. Trypsin cleaves peptide chains mainly at the carboxyl side of the amino acids lysine or arginine, except when either is followed by proline. It is used for numerous biotechnological processes. "}, {"url": "http://www.wisegeek.com/what-is-trypsinogen.htm", "passage_text": "10 hilariously insightful foreign words. Trypsinogen is an enzyme released by the pancreas that is used to break down proteins found in foods. Before it reaches the digestive tract, the enzyme is inactive. Once it reaches the intestines, trypsinogen is converted to its active form, trypsin. Levels of this enzyme present in the bloodstream can be monitored to determine if there is a problem with pancreas function. Proteases, such as trypsinogen, are enzymes that digest proteins."}, {"url": "http://www.thefreedictionary.com/trypsinogen", "passage_text": "Noun. 1. trypsinogen-inactive precursor of trypsin; a substance secreted by the pancreas and converted to active trypsin by enterokinase in the small intestine. trypsin-an enzyme of pancreatic origin; catalyzes the hydrolysis of proteins to smaller polypeptide units. Translations. trypsinogen. n. 1. (Biochemistry) the inactive precursor of trypsin that is converted to trypsin by the enzyme enterokinase."}, {"url": "http://www.thefreedictionary.com/trypsinogen", "passage_text": "trypsinogen-inactive precursor of trypsin; a substance secreted by the pancreas and converted to active trypsin by enterokinase in the small intestine. trypsin-an enzyme of pancreatic origin; catalyzes the hydrolysis of proteins to smaller polypeptide units. trypsinogen. n. 1. (Biochemistry) the inactive precursor of trypsin that is converted to trypsin by the enzyme enterokinase."}, {"url": "http://www.wisegeekhealth.com/what-is-trypsin.htm", "passage_text": "Trypsin is originally synthesized in the pancreas in a form known as trypsinogen, a zymogen. This larger molecule is inactive until it is transported to the small intestine and acted upon by enteropeptidase, another type of protease. Once this step has taken place, trypsin can activate itself. Trypsin is part of the digestive system and degrades proteins, making it an enzyme known as a protease. It is initially formed as a larger, inactive molecule in the pancreas and is transported to the small intestine, where it is activated to digest food molecules."}]