[{"url": "http://www.answers.com/Q/Surface_area_is_measured_in", "passage_text": "Surface area is measured in square units, the exact unit is given with the dimensions. For example, if the dimensions for a rectangular prism are 1cm by 1cm by 1cm, then the s … urface area is 6 square cm. The above does not answer the question asked. Nor can it."}, {"url": "http://msclarkemath.blogspot.com/2013/05/why-is-surface-area-measured-in-square.html", "passage_text": "When finding the surface area, its going to be measured as square units bc we are finding the area of the sides in the figure. but in finding the volume its measured in cubic units bc we are finding what an object can hold.,its also a 3d figure."}, {"url": "http://studyzone.org/testprep/math4/d/customaryunitl.cfm", "passage_text": "Inch, foot, yard, and mile are units for measuring area, perimeter, and volume. Length: 12 inches (in) = 1 foot (ft) 3 feet = 1 yard (yd) 5280 feet = 1 mile (mi). The area of a figure is the number of square units needed to cover it."}, {"url": "http://www.math-only-math.com/area.html", "passage_text": "The area is always expressed in square units. The standard units that are generally used for measuring area are square centimeter and square meter. The area of a square with side 1 cm each is 1 cm × 1 cm = 1 square centimeter. In short, it is expressed as cm^2 or sq. cm."}, {"url": "https://www.middlesex.mass.edu/math/downloads/cell.pdf", "passage_text": "3 Radius of the base Area of the base Height of the Cylinder Volume 4 in 6 in 7 cm 12 cm 2.5 cm 8.25 cm Surface Area Area is always measured in “square units”: square inches, square cm, etc. What are square units? Square units are squares that measure 1 unit on a side."}, {"url": "http://www.math-only-math.com/area.html", "passage_text": "Area is always measured in squares and the unit of area square units (sq. cm., sq. m. or cm^2, m^2). Measuring Regions: We measure a given region by a unit region and find how many such unit regions are contained in the given region. The measure of a region is called its area."}, {"url": "http://www.answers.com/Q/Area_is_always_measured_in_units_of_what", "passage_text": "Surface area is measured in square units, the exact unit is given with the dimensions. For example, if the dimensions for a rectangular prism are 1cm by 1cm by 1cm, then the s … urface area is 6 square cm. The above does not answer the question asked. Nor can it."}]