[{"url": "http://www.imdb.com/name/nm0544168/bio", "passage_text": "Before he co-starred opposite Julie London on Emergency! (1972), Mantooth, along with her second husband Bobby Troup, Tim Donnelly and Ron Pinkard had worked for Jack Webb, who was married to London at the time. Acting protege protégé Of Julie. london Having Randy as his given name at birth, he felt this was more of a nickname than a name, so he decided to change his name to Randolph. One of his two sisters, Nancy Mantooth, died on August 26, 2015, after a long battle with cancer. Has successfully treated cancer."}, {"url": "https://en.wikipedia.org/wiki/Randolph_Mantooth", "passage_text": "Mantooth has appeared in numerous films and television series in lead and supportive roles including mini-series adaptations of Testimony of Two Men (1977) and a starring role as Abraham Kent in The Seekers (1979–80). Mantooth described the character as a good guy with an edge.. Mantooth left for personal reasons in 1990, before returning to the show in 1993, this time in the role of Alex Masters. The show was later revamped and titled The City, lasting for two more years before folding in 1997."}, {"url": "http://www.famoushookups.com/site/celebrity_profile.php?name=Randolph-Mantooth&celebid=13895", "passage_text": "View All Photos (2). Randolph Mantooth is currently married to Kristen Connors. He has been in two celebrity relationships averaging approximately 6.6 years each. His two marriages have averaged 13.2 years each."}, {"url": "http://www.famoushookups.com/site/relationship_detail.php?name=Randolph-Mantooth&relid=11151&celebid=13895", "passage_text": "Randolph Mantooth has been married to Kristen Connors since August 10, 2002. They have been married for 13.2 years. Randolph Mantooth. "}, {"url": "http://www.imdb.com/name/nm0544168/bio", "passage_text": "6' 1 (1.85 m). Randolph Mantooth definitely fit the bill when he made a bankable name for himself in the TV medical series Emergency! (1972) as strong but sensitive paramedic/firefighter John Gage. Having Randy as his given name at birth, he felt this was more of a nickname than a name, so he decided to change his name to Randolph. One of his two sisters, Nancy Mantooth, died on August 26, 2015, after a long battle with cancer. Has successfully treated cancer."}, {"url": "http://www.readingeagle.com/life/article/mr-know-it-all-randolph-mantooth-remains-active-in-show-business", "passage_text": "- C.L., Los Angeles. Randy DeRoy Mantooth was born Sept. 19, 1945, and has been in the entertainment business for more than 40 years. He had already established an impressive resume when he won the role of paramedic John Gage on the show Emergency! in 1972. "}, {"url": "http://www.imdb.com/name/nm0544168/", "passage_text": "Randolph Mantooth definitely fit the bill when he made a bankable name for himself in the TV medical series Emergency! (1972) as strong but sensitive paramedic/firefighter John Gage. "}, {"url": "https://en.wikipedia.org/wiki/Randolph_Mantooth", "passage_text": "Mantooth attended San Marcos High School and participated in school plays. Following his studies at Santa Barbara City College, he received a scholarship to the American Academy of Dramatic Arts in New York. It was there that he chose to change his first name from Randy to stage name Randolph, keeping his last name. Mantooth described the character as a good guy with an edge.. Mantooth left for personal reasons in 1990, before returning to the show in 1993, this time in the role of Alex Masters. The show was later revamped and titled The City, lasting for two more years before folding in 1997."}, {"url": "http://www.spokeo.com/Randolph+Mantooth+1", "passage_text": "Other Names Mantooth, Randy. Randolph Mantooth is an American character actor of stage, film and television. Mantooth is best known for his work in the 1970s medical drama, Emergency!, as Johnny Gage, a Los Angeles County Fire Department paramedic. "}, {"url": "https://en.wikipedia.org/wiki/Randolph_Mantooth", "passage_text": "Mantooth, the oldest of four children, was born as Randy DeRoy Mantooth in Sacramento, California, in 1945, to Sadie (nee Neddenreip) and Donald (Buck) Mantooth. He is of Seminole, Cherokee, Potawatomi, Scottish, and German descent. His mother was of German descent; his father was from Oklahoma. Mantooth described the character as a good guy with an edge.. Mantooth left for personal reasons in 1990, before returning to the show in 1993, this time in the role of Alex Masters. The show was later revamped and titled The City, lasting for two more years before folding in 1997."}]