[{"url": "http://www.france-pub.com/currency.html", "passage_text": "French currency conversion. The French Franc is no longer used as money in France, it is now the Euro. The value of the French Franc was fixed at 1 Euro = 6.55957 French Francs, or 1 French Franc = 0.1524490172374104 Euro. "}, {"url": "http://studiesabroad.com/programs/country/france/city/paris/cultureCorner/moneyMatters", "passage_text": "Currency. The Euro is the official currency of France, and of most European Union member states, excluding the UK and the Czech Republic, among others. The Euro, symbolized by a €, has been in public circulation since January, 2002. The franc, the former official currency of France, is no longer accepted, however, you may see that some price tags in France give the price both in Euro and in francs, to help those who still think in terms of francs. There are 8 different Euro coin denominations and 7 different Euro bill denominations in circulation"}, {"url": "http://www.statravel.com/france-currency.htm", "passage_text": "French currency. France is one of the 12 EU countries that joined the EMU – the Economic and Monetary Union – which introduced the single currency, the euro. The current exchange rate is approximately €0.78= $1. To find the most up to date French currency exchange rates, go to XE.com Currency Converter. "}, {"url": "http://www.exchangerate.com/currency-exchange-rate-cities/paris.html", "passage_text": "Exchange Rate Paris. Use the currency converter below to calculate the current exchange rate for the city of Paris. The currency used in Paris is the Euro. Paris is the capital of France. If you are traveling to Paris, you will need to exchange your currency for the French Euro. You may exchange your money for the Euro at most Paris banks or at specialized stores called Foreign Exchange Bureaus. "}, {"url": "http://www.answers.com/Q/What_is_the_currency_of_France", "passage_text": "The currency of France before 2002 was the French Franc. The franc was abolished in 2002 and replaced by the Euro at the rate of €1 = 6.55957 francs. The subdivision of th … e franc was the centime, 1 franc = 100 centimes. The name 'centime' is also used in French for the subdivision of the Euro, €1 = 100 centimes.   France used the franc as its currency up till 2002. Confidence votes 55. The currency used in France is the Euro (symbol €) and its the subdivision is called the 'cent' (English) or 'centime' (French). The Euro replaced the French franc in 2002 at the rate of €1 = 6.55957 francs, and the franc was no longer redeemable after February 201"}, {"url": "http://www.expatfocus.com/expatriate-france-currency", "passage_text": "Home France Currency. France-Currency. France became one of the first nations to begin using the single European currency in 2002. The Euro is used by a number of member states across the continent including Greece, Spain, Belgium and Germany."}, {"url": "https://en.wikipedia.org/wiki/French_franc", "passage_text": "[fʁɑ̃] ; sign: F or Fr), also commonly distinguished as the French franc (FF), was a currency of France. Between 1360 and 1641, it was the name of coins worth 1 livre tournois and it remained in common parlance as a term for this amount of money. It was reintroduced (in decimal form) in 1795. It was revalued in 1960, with each new franc (NF) being worth 100 old francs."}, {"url": "https://en.wikipedia.org/wiki/Franc", "passage_text": "The franc (₣) is the name of several currency units. The French franc was the former currency of France until the euro was adopted in 1999 (by law, 2002 de facto). The Swiss franc is a major world currency today due to the prominence of Swiss financial institution"}]