[{"url": "http://medical-dictionary.thefreedictionary.com/geographic+tongue", "passage_text": "an inflammatory disorder on the dorsal surface of the tongue characterized by numerous and continually changing areas of loss and regrowth of the filiform papillae. The wandering shape and outline of the denuded red patches surrounded by thickened white borders present a geographic or maplike appearance. a tongue with numerous furrows or grooves on the dorsal surface, often radiating from a groove on the midline. geographic tongue. a tongue with denuded patches, surrounded by thickened epithelium."}, {"url": "http://www.healthline.com/health/glossitis", "passage_text": "Overview. Glossitis is an inflammation of the tongue that causes it to swell in size, change into different shades of red, and develop a smooth appearance on the surface. The tongue is the small, muscular organ in the mouth that helps you chew and swallow food. It also helps with your speech."}, {"url": "https://en.wikipedia.org/wiki/Swell_(ocean)", "passage_text": "A swell, in the context of an ocean, sea or lake, is a series of mechanical waves that propagate along the interface between water and air and so they are often referred to as surface gravity waves. Swell waves often have a long wavelength but this varies due to the size, strength and duration of the weather system responsible for the swell and the size of the water body e.g. wavelengths are rarely more than 150 m in the Mediterranean. Swell wavelength, also, varies from event to event."}, {"url": "http://www.mayoclinic.org/diseases-conditions/geographic-tongue/basics/definition/CON-20027435", "passage_text": "Geographic tongue. Geographic tongue is a harmless condition affecting the surface of your tongue. The tongue is normally covered with tiny, pinkish-white bumps (papillae), which are actually short, fine, hair-like projections. With geographic tongue, patches on the surface of the tongue are missing papillae and appear as smooth, red islands, often with slightly raised borders. These patches (lesions) give the tongue a map-like, or geographic, appearance. The lesions often heal in one area and then move (migrate) to a different part of your tongue. Geographic tongue is also known as benign migratory glossitis. "}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/coasts/coastal_processes_rev1.shtml", "passage_text": "The action of waves. The power of waves is one of the most significant forces of coastal change. Waves are created by wind blowing over the surface of the sea. As the wind blows over the sea, friction is created-producing a swell in the water. The energy of the wind causes water particles to rotate inside the swell and this moves the wave forward. The size and energy of a wave is influenced by:"}, {"url": "https://en.wikipedia.org/wiki/Swell_(ocean)", "passage_text": "This is the primary definition of a swell as opposed to a locally generated wind wave, which is still under the influence of the mechanisms that created it e.g. Wind blowing over a puddle. More generally, a swell consists of wind-generated waves that are not—or are hardly—affected by the local wind at that time. Swell waves often have a long wavelength but this varies due to the size, strength and duration of the weather system responsible for the swell and the size of the water body e.g. wavelengths are rarely more than 150 m in the Mediterranean. Swell wavelength, also, varies from event to event."}, {"url": "http://medical-dictionary.thefreedictionary.com/geographic+tongue", "passage_text": "geographic tongue a tongue with denuded patches, surrounded by thickened epithelium. hairy tongue a benign condition of the tongue characterized by hypertrophy of the filiform papillae that gives the dorsum of the tongue a furry appearance. a tongue with numerous furrows or grooves on the dorsal surface, often radiating from a groove on the midline. geographic tongue."}]