[{"url": "http://www.eresourceerp.com/What-does-supply-chain-integration-mean.html", "passage_text": "Integration of Supply Chain Management. When eBusiness is integrated with ERP, the whole extended system provides a vision of business processes that span multiple businesses and enterprises. The major partners of the supply chain are the suppliers, the organization and the consumers and any other partners involved in the business transactions (like banks, middlemen, etc.)."}, {"url": "http://www.eil.utoronto.ca/applications/iscm/", "passage_text": "In order to optimise performance, supply chain functions must operate in an integrated manner. But the dynamics of the enterprise and the market make this difficult; materials do not arrive ontime, production facilities fail, workers are ill, customers change or cancel orders, etc. causing deviations from plan. The strategic level defines the supply chain network, i.e., selection of suppliers, transportation routes, manufacturing facilities, production levels, warehouses, etc. The tactical level plans and schedules the supply chain to meet actual demand. The operational level executes plans."}, {"url": "http://smallbusiness.chron.com/advantages-tightly-integrated-supply-chain-37115.html", "passage_text": "A tightly integrated supply chain for a small or large business is a network of businesses and contractors that provide raw materials, transportation, manufacturing, distribution, warehousing and retailing services. "}, {"url": "http://supplychainbeyond.com/integrated-business-planning-mean-supply-chain/", "passage_text": "Greg Brady is the founder of One Network Enterprises, based in Dallas TX. Prior to One Network, Greg led i2 Technologies, both as CEO and as head of worldwide operations, and was vice president of worldwide applications marketing at Oracle. Greg lives in Dallas, Texas with his family. "}, {"url": "http://www.wwwood.net/pdf/Integrating%20the%20Supply%20Chain.pdf", "passage_text": "IV. Transitioning to a Networked Supply Chain. A network is a conduit for information, and the intelligence of a network is determined by its functionality; the ability to collect, transform, store and distribute information. In the absence of a network, data is static and can only live where it resides."}, {"url": "http://www.wesco.com/integrated/", "passage_text": "Integrated Supply. WESCO Integrated Supply develops cost-effective integrated supply programs for maintenance, repairs, and operating supplies (MRO) in North America, Europe, and Asia. HOME Products. WESCO Integrated Supply develops cost-effective integrated supply programs for maintenance, repairs, and operating supplies (MRO) in North America, Europe, and Asia."}, {"url": "http://www.eil.utoronto.ca/applications/iscm/", "passage_text": "Integrated Supply Chain Management. The supply chain is a network of suppliers, factories, warehouses, distribution centres and retail-ers through which raw materials are acquired, transformed and delivered to the customer. Supplychain management is the strategic, tactical and operational level decision making that optimises supply chain performance. The strategic level defines the supply chain network, i.e., selection of suppliers, transportation routes, manufacturing facilities, production levels, warehouses, etc. The tactical level plans and schedules the supply chain to meet actual demand. The operational level executes plans."}, {"url": "http://web.mit.edu/supplychain/repository/scvssc.pdf", "passage_text": "Internal supply network design, which refers to the sup-ply network design used. Examples would include either avertically integrated or heavily outsourced design; build-to-stock, build-to-order, or postponement production; or aretail, direct, or distributor (or a combination of the three)distribution channel. "}, {"url": "http://www.eresourceerp.com/What-does-supply-chain-integration-mean.html", "passage_text": "Supply chain refers t the complex network of relationships that organizations maintain with trading partners to procure manufacture and deliver products or services. Supply chain encompasses the facilities where raw materials, intermediate products and finished goods are acquired, transformed, stored and sold. The major partners of the supply chain are the suppliers, the organization and the consumers and any other partners involved in the business transactions (like banks, middlemen, etc.)."}]