[{"url": "https://en.wikipedia.org/wiki/Evan", "passage_text": "Evan is a Welsh masculine given name derived from lefen, a Welsh form for the name John. In other languages it could be compared to  Ivan ,  Ian , and  Juan ; the name John itself is derived from the ancient Hebrew name יְהֹוחָנָן Yəhoḥānān, yəhôḥānān which  MEANS yhwh is. gracious Evan also comes from Gaelic Eoghan eóghan meaning youth or young warrior And scots for-right. Handed In, hebrew the actual-Non proper, noun/evan/even/eban, eben literally means. Rock it can also be the shortened version of The greek  Name  (evangelos meaning) messenger  Or  (evander meaning good). man"}, {"url": "http://www.meaning-of-names.com/welsh-names/evan.asp", "passage_text": "Welsh name. In Welsh, the name Evan means-Young. The Welsh form of the Hebrew John, meaning God has been gracious, or God has shown favor.. Other origins for the name Evan include-Welsh, English, Celtic, Hebrew, Scottish.The name Evan is most often used as a boy name or male name. Welsh Name Meaning-Young."}, {"url": "http://www.sheknows.com/baby-names/name/evan", "passage_text": "Hebrew Meaning: The name Evan is a Hebrew baby name. In Hebrew the meaning of the name Evan is: Stone. American Meaning: The name Evan is an American baby name. In American the meaning of the name Evan is: Stone."}, {"url": "https://themeaningofthename.com/evan/", "passage_text": "Gender: Male. Usage: Evan, of Hebrew origin, is a very popular first name. It is more often used as a boy (male) name. People having the name Evan are in general originating from France, Ireland, Malta, United Kingdom, United States of America. For another variant of the name Evan across the world, see John. The name Evan is ranked on the 458th position of the most used names. It means that this name is very frequently used. We estimate that there are at least 1403400 persons in the world having this name which is around 0.02% of the population. The name Evan has four characters."}, {"url": "http://www.thinkbabynames.com/meaning/1/Evan", "passage_text": "Evan /evan/ [2 sylls.] as a boys' name (also used less widely as girls' name Evan) is pronounced EV-an. It is of Hebrew, Welsh and Scottish origin, and the meaning of Evan is God is gracious; born of yew; youth. Welsh variant of Iefan, a later form of Ieuan, from John. As a Scottish name it is a variant of Euan. In Celtic, the name means young warrior. It is also used as a short form of Evangelos, which means good messenger in Greek. In Hebrew, Evan means rock."}, {"url": "http://www.sheknows.com/baby-names/name/evan", "passage_text": "In Scottish the meaning of the name Evan is: Right handed. Welsh Meaning: The name Evan is a Welsh baby name. In Welsh the meaning of the name Evan is: Young. The Welsh form of the Hebrew John, meaning God has been gracious, or God has shown favor. The name Evan is a Hebrew baby name. In Hebrew the meaning of the name Evan is: Stone. American Meaning: The name Evan is an American baby name. In American the meaning of the name Evan is: Stone"}, {"url": "http://www.meaning-of-names.com/english-names/evan.asp", "passage_text": "Meaning of Evan. English name. In English, the name Evan means-god is good. Other origins for the name Evan include-English, Celtic, Hebrew, Welsh, Scottish.The name Evan is most often used as a boy name or male name. English Name Meaning-god is good. Origin-England. "}]