[{"url": "http://theplantencyclopedia.org/wiki/Fagus", "passage_text": "Beech (Fagus) is a genus of ten Species of Deciduous Trees in the family Fagaceae, native to temperate Europe, Asia and North America. Habit. The leaves of beech trees are entire or sparsely toothed, from 5–15 cm long and 4–10 cm broad. The Flowers are small single-sex (Monoecious), the female flowers borne in pairs, the male flowers wind-pollinating Catkins, produced in spring shortly after the new leaves appear."}, {"url": "http://na.fs.fed.us/pubs/silvics_manual/volume_2/fagus/grandifolia.htm", "passage_text": "American beech (Fagus grandifolia) is the only species of this genus in North America. Although beech is now confined to the eastern United States (except for the Mexican population) it once extended as far west as California and probably flourished over most of North America before the glacial period (39). Fagus grandifolia Ehrh. is the only type species of American beech now recognized in North America (9,10,23). Some botanical authorities hold that Northern and Southern beeches vary, and have described the southern form as F grandifolia var. caroliniana (Loud.) Fern. & Rehd., Carolina beech (4,6)."}, {"url": "https://en.wikipedia.org/wiki/Fagus_grandifolia", "passage_text": "The genus name Fagus is Latin for beech, and the species name grandifolia comes from grandis large and folium leaf. The American beech is a shade-tolerant species, favoring shade more than other trees, commonly found in forests in the final stage of succession. Ecological succession is essentially the process of forests changing their composition through time; it is a pattern of events often observed on disturbed sites."}, {"url": "https://en.wikipedia.org/wiki/Beech", "passage_text": "The classification of the European beech, Fagus sylvatica is complex, with a variety of different names proposed for different species and subspecies within this region (for example Fagus taurica, Fagus orientalis, and Fagus moesica). Beech bark is extremely thin and scars easily. Since the beech tree has such delicate bark, carvings, such as lovers' initials and other forms of graffiti, remain because the tree is unable to heal itself."}, {"url": "http://www.psu.edu/dept/nkbiology/naturetrail/speciespages/beech.htm", "passage_text": "American Beech (Fagus grandifolia). The American beech is easily recognized even in dense, complex forests by its thin, smooth, light gray bark. Unlike most other hardwood trees, the American beech retains this smooth bark throughout its mature years. The American beech can live for three hundred to four hundred years and can reach heights of eighty feet and diameters in excess of three feet. "}, {"url": "http://www.blueplanetbiomes.org/american_beech.htm", "passage_text": "Genus: Fagus Species: grandifolia. The American Beech tree grows in the southern and eastern parts of the United States. It grows in deciduous forests all over Maine and northern Massachusetts. It grows best in deep, rich, moist, well-drained soils. The American beech is a tall and wide tree. The mature tree size is anywhere from 90 to 100 feet tall, and spreads 50 to 70 feet. The bark that grows on the tree is very smooth, pale and gray. The American Beech tree produces a lot of paper. The animals that feed on the nuts that grow on this tree are: the opossum, black bears, white-tailed deer, rabbits, ruffed grouse, red and gray squirrels, flying foxes, porcupines and others."}, {"url": "https://en.wikipedia.org/wiki/Beech", "passage_text": "The European beech (Fagus sylvatica) is the most commonly cultivated, although there are few important differences between species aside from detail elements such as leaf shape. The leaves of beech trees are entire or sparsely toothed, from 5–15 cm long and 4–10 cm broad. Beeches are monoecious, bearing both male and female flowers on the same plant. Beech bark is extremely thin and scars easily. Since the beech tree has such delicate bark, carvings, such as lovers' initials and other forms of graffiti, remain because the tree is unable to heal itself."}, {"url": "https://en.wikipedia.org/wiki/Fagus_grandifolia", "passage_text": "Fagus grandifolia (American beech or North American beech) is the species of beech tree native to the eastern United States and Canada. The American beech is a shade-tolerant species, favoring shade more than other trees, commonly found in forests in the final stage of succession. Ecological succession is essentially the process of forests changing their composition through time; it is a pattern of events often observed on disturbed sites."}, {"url": "http://www.mortonarb.org/trees-plants/tree-and-plant-collections/taxonomic-collections/beech", "passage_text": "Its silvery-gray, muscle-like bark is typical of beech species, but its weeping form is especially graceful. This collection has a variety of European beech cultivars, each with unusual and attractive characteristics. Beech trees are in the genus Fagus and the family Fagaceae (Beech Family). Beeches are notable for their incredibly smooth gray bark, distinguishing them from many other hardwood trees. The genus is comprised of about eleven species that are found on the continents of North America, Asia, and Europe. "}, {"url": "https://en.wikipedia.org/wiki/Beech", "passage_text": "Beech (Fagus) is a genus of deciduous trees in the family Fagaceae, native to temperate Europe, Asia and North America. Beech bark is extremely thin and scars easily. Since the beech tree has such delicate bark, carvings, such as lovers' initials and other forms of graffiti, remain because the tree is unable to heal itself."}]