[{"url": "http://www.cnet.com/news/verizon-introduces-cheaper-share-everything-plan-for-60-250mb/#!", "passage_text": "Verizon's Share Everything family data plan is getting a little more affordable. Verizon's Share Everything plans add a new option Verizon. The carrier said that starting Tuesday, Verizon customers will be able to sign up for a $60 Share Everything plan, $20 less than the current cheapest plan. Customers will only get half as much data -- 250 megabytes vs. the $80, 500 MB plan."}, {"url": "http://dealnews.com/features/Current-Verizon-Users-Can-Now-Score-a-Better-Data-Plan-or-Cheaper-Rates-But-You-Have-to-Act/1273375.html", "passage_text": "In addition to pricing changes, Verizon also added new data tiers — 6GB, 12GB, 14GB, and 16GB — and extended its Verizon Edge discounts to the 6GB level. The Edge plan allows users to pay for their phones over 24 months instead of upfront, and discounts the monthly Verizon Access fee."}, {"url": "http://www.slate.com/blogs/moneybox/2015/02/04/verizon_cuts_data_plan_costs_here_s_how_to_save_10_a_month.html", "passage_text": "In another sign that competition is bringing down wireless bills, Verizon on Wednesday cut most of its data plan costs by $10. A plan with one gigabyte of shared data will now start at $30 per month instead of $40, two gigabytes will start at $40 instead of $50, and so on."}, {"url": "http://wnep.com/2015/08/10/how-to-save-money-with-verizons-new-plans/", "passage_text": "2) The other option is to pay your phone off over two years. With smaller data plans, you could actually pay slightly more every month for two years. Still, the old two-year contracts would have made you pay a $200 down payment and a $40 activation fee -- neither of which you need to pay using Verizon's new plans."}, {"url": "http://money.cnn.com/2015/08/10/technology/new-verizon-plans/index.html", "passage_text": "At the outset, you'll pay more on Verizon's new plans than you would have with a two-year contract. But you'll save money each month (see best scenario) and you'll also save money over the course of two years. 2) The other option is to pay your phone off over two years. With smaller data plans, you could actually pay slightly more every month for two years. Still, the old two-year contracts would have made you pay a $200 down payment and a $40 activation fee -- neither of which you need to pay using Verizon's new plans. So Verizon's new plans will still be cheaper in the long run."}, {"url": "http://www.businessinsider.com/verizon-data-plan-prices-2015-2", "passage_text": "Starting Thursday, Verizon will shave $10 off most of its monthly shared data plans, the company announced on Wednesday (via Re/code). So if you're used to paying $50 per month for 2GB of shared data, you'll be able to get the same amount of data for $40 per month."}]