[{"url": "https://en.wikipedia.org/wiki/Bauxite", "passage_text": "Bauxite, an aluminium ore, is the world's main source of aluminium. "}, {"url": "http://geology.com/minerals/bauxite.shtml", "passage_text": "Bauxite is the principal ore of aluminum. The first step in producing aluminum is to crush the bauxite and purify it using the Bayer Process. In the Bayer Process the bauxite is washed in a hot solution of sodium hydroxide which leaches aluminum from the bauxite. Bauxite does not have a specific composition. It is a mixture of hydrous aluminum oxides, aluminum hydroxides, clay minerals and insoluble materials such as quartz, hematite, magnetite, siderite and goethite."}, {"url": "http://minerals.usgs.gov/minerals/pubs/commodity/bauxite/", "passage_text": "Subscribe. Bauxite is a naturally occurring, heterogeneous material composed primarily of one or more aluminum hydroxide minerals, plus various mixtures of silica, iron oxide, titania, aluminosilicate, and other impurities in minor or trace amounts. "}, {"url": "http://www.hydro.com/en/About-aluminium/Aluminium-life-cycle/Bauxite-mining/", "passage_text": "Aluminium production starts with the raw material bauxite. Bauxite is a mineral found mostly in a belt around the equator. Bauxite, containing 15-25 percent aluminium, is the only ore that is used for commercial extraction of aluminium today. The bauxite occurs mostly in the tropics, in horizontal layers normally beneath a few meters of overburden. "}, {"url": "http://www.qwhatis.com/what-is-bauxite/", "passage_text": "Bauxite is a rock made from laterite soil filtered of solvable content such as silica in wet humid or subtropical environments that include West Indies, Africa, Australia and America. There are little deposits in Europe. An estimated 85percent of bauxite produced globally is used to generate alumina. Alumina is used to refine aluminum metal. An additional 10 percent is used to generate alumina that is used in abrasives, chemicals and refractory items. The other 5 percent is used for making aluminum compounds."}, {"url": "http://geology.com/minerals/bauxite.shtml", "passage_text": "Bauxite is not a mineral. It is a rock formed from a laterite soil that has been severely leached of silica and other soluble materials in a wet tropical or subtropical climate. It is the primary ore of aluminum. Almost all of the aluminum that has ever been produced has been extracted from bauxite. Bauxite does not have a specific composition. It is a mixture of hydrous aluminum oxides, aluminum hydroxides, clay minerals and insoluble materials such as quartz, hematite, magnetite, siderite and goethite."}, {"url": "http://www.aluminum.org/industries/production/bauxite", "passage_text": "Bauxite ore is the world’s primary source of aluminum. The ore must first be chemically processed to produce alumina (aluminum oxide). Alumina is then smelted using an electrolysis process to produce pure aluminum metal. Bauxite is typically found in topsoil located in various tropical and subtropical regions. "}, {"url": "http://www.minerals.net/mineral/bauxite.aspx", "passage_text": "Bauxite is not a mineral, but rather a group of aluminum oxide s. The term is generally used to describe the economically important mixture of these minerals, which form a mass of the individually classified members of Gibbsite, Boehmite, and Diaspore. Bauxite is mined extensively for its economical value as the principle ore of aluminum. NOTEWORTHY LOCALITIES. Since Bauxite specimens are not well-represented in collections due to their lack of aesthetics, this guide will not list specific localities but will rather list countries that are important producers."}, {"url": "http://www.answers.com/Q/What_is_bauxite", "passage_text": "Rockhound. Bauxite is a sedimentary rock that is the main ore of aluminum. Bauxite varies in composition, as does any rock, but the main components are minerals of aluminum oxide and aluminum hydroxide. Bauxite may also contain amounts of iron, clay, silt and silica. Bauxite is the result of the leaching of minerals from tropical soils leaving a hardened clay-like material that is high in the above minerals, which resist leaching. In addition to being the primary source of aluminum, some bauxite is also used in the manufacture of abrasives. bauxite is made for mineral used to make aluminum.The Aluminium ore is known as Bauxite (Al2O3)."}]