[{"url": "http://www.american-presidents.com/john-adams/", "passage_text": "Born on October 30, 1735, Adams was the first Vice President of the United States and the second President of the United States. His son, John Quincy Adams, was the sixth President of the United States. Adams was born in the town of Quincy, Massachusetts, to John Henry Adams and Susanna Boylston Adams. He graduated from Harvard College in 1755, taught at Worcester and studied law with Rufus Putnam, to be admitted to the bar in 1758. A writer at heart, Adams often wrote about various events and happenings in his world"}, {"url": "http://www.notablebiographies.com/A-An/Adams-John.html", "passage_text": "John Adams was born in Braintree (now Quincy), Massachusetts, on October 30, 1735, the first of three children born to John Adams and Susanna Boylston Adams. "}, {"url": "http://www.history.com/topics/us-presidents/john-adams", "passage_text": "Introduction. John Adams (1735-1826) was a leader of the American Revolution, and served as the second U.S. president from 1797 to 1801. The Massachusetts-born, Harvard-educated Adams began his career as a lawyer."}, {"url": "https://en.wikipedia.org/wiki/John_Adams", "passage_text": "John Adams, Jr. was born on October 30, 1735 (October 19, 1735 Old Style, Julian calendar), to John Adams, Sr. (1691–1761) and Susanna Boylston (1708–1797). He had two younger brothers, Peter and Elihu. Adams' birthplace was Quincy, Massachusetts and is now part of Adams National Historical Park. "}, {"url": "http://www.american-presidents.com/john-adams/", "passage_text": "Early Life. Adams was born in the town of Quincy, Massachusetts, to John Henry Adams and Susanna Boylston Adams. He graduated from Harvard College in 1755, taught at Worcester and studied law with Rufus Putnam, to be admitted to the bar in 1758. A writer at heart, Adams often wrote about various events and happenings in his world. His son, John Quincy Adams, was the sixth President of the United States"}, {"url": "http://scholarworks.gvsu.edu/adams_birthplace_home/", "passage_text": "John Adams's birthplace, in Braintree (now Quincy), Massachusetts, is about ten miles south of Boston. Adams was born in this house on October 30, 1735. Neither of his parents had attended college, but both were readers and provided a good education for their studious son. They sacrificed to send him to Harvard. "}, {"url": "http://www.biography.com/people/john-adams-37967", "passage_text": "Synopsis. John Adams was born on October 30, 1735, in Quincy, Massachusetts. He was a direct descendant of Puritan colonists from the Massachusetts Bay Colony. He studied at Harvard University, where he received his undergraduate degree and master's, and in 1758 was admitted to the bar. John Adams was a Founding Father, the first vice president of the United States and the second president. His son, John Quincy Adams, was the nation's sixth president."}, {"url": "http://www.biography.com/people/john-adams-37967", "passage_text": "John Adams was born on October 30, 1735, in Quincy, Massachusetts. He was a direct descendant of Puritan colonists from the Massachusetts Bay Colony. John Adams was a Founding Father, the first vice president of the United States and the second president. His son, John Quincy Adams, was the nation's sixth president."}, {"url": "http://www.biography.com/people/john-adams-37967", "passage_text": "Early Life. John Adams was born on October 30, 1735, in Braintree (now Quincy), Massachusetts. His father, John Adams Sr., was a farmer, a Congregationalist deacon and a town councilman, and was a direct descendant of Henry Adams, a Puritan who emigrated from England to the Massachusetts Bay Colony in 1638. John Adams was a Founding Father, the first vice president of the United States and the second president. His son, John Quincy Adams, was the nation's sixth president."}]