[{"url": "http://www.thinkbabynames.com/meaning/1/Hooper", "passage_text": "Hooper /hoop-er/ [2 sylls.] as a boys' name is of Old English origin, and the meaning of Hooper is  maker of hoops. Occupational name. Hoops are the metal circles used to bind barrels. Kreatif forms: Hocper, Hooder. How popular is Hooper? Hooper is an unusual given name for males but a very prominent last name for both adults and children (#936 out of 150436, Top 1%). (2000 U.S. Census). Charted below is the baby name popularity of Hooper for boys"}, {"url": "http://www.thinkbabynames.com/meaning/1/Hopper", "passage_text": "Hopper is a rare given name for men but a very popular surname for all people (#1192 out of 150436, Top 1%). (2000 U.S. Census). Shown below is the birth name popularity of Hopper for boys. Hopper has not made it into the Top 1000 thus far. Hopper /hop-per/ [2 sylls.] as a boys' name is of Welsh derivation, and the meaning of Hopper is son of Robert. Hopper is a version of Hopkins (Welsh): in the past."}, {"url": "https://en.wikipedia.org/wiki/Hooper_(surname)", "passage_text": "Hooper (or Hoopes) is a surname originating in England. It is derived from the archaic term for a person who aided the production of barrels by creating hoops for them. Most Hoopers are English or of English descent. Some notable individuals named Hooper: Persons. 1  Ben W. Hooper (1870–1957), governor of Tennessee 1911–1915. "}, {"url": "https://www.houseofnames.com/hooper-family-crest", "passage_text": "1 Plaques and Frames revealing the family crest for the surname Hooper. 2  Surname Histories for the name Hooper. 3  Symbolism with a Hooper coat of arms. 4  Travel Mugs emphasing the family crest for the name Hooper. 1 Packages with a Hooper family crest. 2  Plaques and Frames revealing the family crest for the surname Hooper. 3  Surname Histories for the name Hooper. 4  Symbolism with a Hooper coat of arms. 5  Travel Mugs emphasing the family crest for the name Hooper."}, {"url": "https://www.houseofnames.com/hooper-family-crest", "passage_text": "1 New Products displaying the family crest for the name Hooper. 2  Packages with a Hooper family crest. 3  Plaques and Frames revealing the family crest for the surname Hooper. 4  Surname Histories for the name Hooper. 5  Symbolism with a Hooper coat of arms. 6  Travel Mugs emphasing the family crest for the name Hooper. 1 Packages with a Hooper family crest. 2  Plaques and Frames revealing the family crest for the surname Hooper. 3  Surname Histories for the name Hooper. 4  Symbolism with a Hooper coat of arms. 5  Travel Mugs emphasing the family crest for the name Hooper."}, {"url": "http://www.babynamespedia.com/meaning/Hopper", "passage_text": "The origin of Hopper is English and English-American. From English-American roots, its meaning is jumper. It represents the transferred use of the surname as a given name. Hopper is a variation of the name Hopkins (English). Hop (shortening in) is a variation of the name. Hopper is not popular as a baby boy name. It is not listed within the top 1000"}, {"url": "http://www.babynamespedia.com/meaning/Hooper", "passage_text": "[ 2 syll. hoo-per, ho-op-er ] The baby boy name Hooper is pronounced as HH UW Per †. Hooper's origin is English. The name Hooper means one who makes hoops for barrels. The names Hoopar, Hoopir, Hoopor, Hoopur, and Hoopyr are variant forms of Hooper. Hooper is not popular as a baby boy name. It is not in the top 1000 names. "}]