[{"url": "http://cen.acs.org/articles/90/i23/Starting-Salaries.html", "passage_text": "Median starting salaries for chemical engineers continued to be higher than for those holding nonengineering chemical degrees. The biggest difference shows up in salaries at the bachelor’s level. Here, chemical engineers reported earning $65,000, compared with the $36,000 starting salary of chemists. The median starting salary for bachelor’s degree recipients with less than a year of experience held flat in 2011 at $40,000. For those with more than three years of experience, it dropped nearly 3% from 2010 to $39,000 in 2011. But for those with 12 to 36 months of experience, entry pay rose 9% to $40,259."}, {"url": "https://en.wikipedia.org/wiki/Chemical_engineer", "passage_text": "In the US, the Department of Labor estimated in 2008 the number of chemical engineers to be 31,000. According to a 2011 salary survey by the American Institute of Chemical Engineers (AIChE), the median annual salary for a chemical engineer was approximately $110,000. In one salary survey, chemical engineering was found to be highest-paying degree for first employment of college graduates. "}, {"url": "http://chemistry.about.com/od/educationemployment/a/chemical-engineer-salary.htm", "passage_text": "Salary survey based on experience is from PayScale.com. According to the US Department of Labor (2008), the median salary for chemical engineering was $78,860. The middle 50% of chemical engineers had salaries between $67,420 and $105,000. The UK's Institution of Chemical Engineers (2006) reported the average starting salary for chemical engineering graduates was £24,000, with an average salary for all chemical engineers of about £53,000."}, {"url": "http://cen.acs.org/articles/92/i22/Starting-Salaries.html", "passage_text": "The median 2013 starting salary of Ph.D. chemical engineers was $90,500 as compared with the $66,000 salary reported by Ph.D. chemists. And for those who earned a bachelor’s degree, the median salary was $66,700 for chemical engineers, almost twice the $35,900 earned by chemists in this group. There were insufficient data for chemical engineers earning master’s degrees. Median starting salaries also varied depending on sector. For all bachelor’s degree respondents with less than 12 months of experience who took a job in the academic sector, the median salary in 2013 was $34,000."}, {"url": "http://www.chron.com/business/energy/article/Chemical-engineers-median-salary-soars-to-4615896.php", "passage_text": "Chemical engineers' median salary has more than doubled since the first survey in 1992, when it was $59,700. Those working in the petroleum industry are the highest paid. Chemical engineers in the petroleum production and refining business pull a median salary of $150,000. By the time they reach 36 years of experience, men's median salary is $140,000 and women's is $103,333, according to the chemical engineers' survey. The organization attributed the pay gap to family leave."}, {"url": "http://www.chron.com/business/energy/article/Chemical-engineers-median-salary-soars-to-4615896.php", "passage_text": "Chemical engineers in the Houston-Galveston area are especially well paid, with a median salary of $144,200. The median salary for chemical engineers for the state as a whole is $140,000, according to the survey. By the time they reach 36 years of experience, men's median salary is $140,000 and women's is $103,333, according to the chemical engineers' survey. The organization attributed the pay gap to family leave."}, {"url": "http://www1.salary.com/Chemical-Engineer-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Chemical Engineer I in the United States is $67,918, so 50% of the people who perform the job of Chemical Engineer I in the United States are expected to make less than $67,918. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. The annual salary for someone with the job title Chemical Engineer I may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "https://www.recruiter.com/salaries/chemical-engineers-salary/", "passage_text": "A Chemical Engineer can get a wage that can range from 72000 and 108000 based on tenure level. Chemical Engineers will most likely receive salaries of Ninety Five Thousand Two Hundred dollars per year. Chemical Engineers can make the highest salaries in Alaska, where they get salary pay of about $125820. People working these jobs can make the highest salaries in Mining, Quarrying, and Oil and Gas Extraction, where they can earn average wages of $115550. The national wage distribution is shown below. "}, {"url": "http://www.payscale.com/research/US/Job=Chemical_Engineer/Salary", "passage_text": "Pay for Chemical Engineers in the United States sits in the ballpark of $73K per year. Final cash compensation to Chemical Engineers varies from around $51K to approximately $123K; choice pay grades include potential for bonuses and profit sharing as high as $15K and $12K, respectively. Chemical Engineers with a rich background of experience are typically rewarded with larger paychecks. Salaries of relatively inexperienced workers fall in the neighborhood of $68K, but folks who have racked up five to 10 years see a notably higher median of $85K."}]