[{"url": "http://www.privatemdlabs.com/lp/hepatitis_profile.php", "passage_text": "Acute Hepatitis Profile Test. Hepatitis is a general term that means inflammation of the liver. Hepatitis A, B, and C are infections of the liver caused by three different contagious viruses. Since the treatment and prognosis vary among the three, it is important to determine if one of these causative agents (infectious viruses) is presen"}, {"url": "http://www.privatemdlabs.com/lp/hepatitis_profile_info.php", "passage_text": "There are many possible causes of hepatitis. These blood tests help determine if the liver inflammation is resulting from infection with the hepatitis A, B, or C viruses. These are called antibody tests. 1  Hepatitis A infection: A positive antigen test (called an HAV or hepatitis A virus test) and a positive antibody test (called an IgM anti-HAV antibody test) mean you currently have an acute hepatitis A infection."}, {"url": "http://www.medicinenet.com/viral_hepatitis/page5.htm", "passage_text": "Antibodies against the hepatitis A, B, and C viruses usually can be detected in the blood within weeks of infection, and the antibodies remain detectable in the blood for decades thereafter. Blood tests for the antibodies can be helpful in diagnosing both acute and chronic viral hepatitis. Therefore in chronic hepatitis, both antibodies to the viruses and viral proteins and genetic material can be detected in the blood. Examples of tests for viral antibodies are: 1  anti-HAV (hepatitis A antibody). 2  antibody to hepatitis B core, an antibody directed against the inner core (nucleus) of the virus (core antigen)."}, {"url": "http://www.privatemdlabs.com/lp/hepatitis_profile_info.php", "passage_text": "1 Hepatitis C infection: A positive antibody test (called an anti-HCV or antibody to hepatitis C virus test) means you currently have an acute hepatitis C infection. 2  To check for chronic infection, tests are done to measure the amounts of specific hepatitis C viral proteins (antigens) present in the blood. These are called antibody tests. 1  Hepatitis A infection: A positive antigen test (called an HAV or hepatitis A virus test) and a positive antibody test (called an IgM anti-HAV antibody test) mean you currently have an acute hepatitis A infection."}, {"url": "http://www.everydayhealth.com/hepatitis/diagnosing-hepatitis-tools-and-tests.aspx", "passage_text": "Your doctor may order a viral serology panel, a group of blood tests that determines whether you have hepatitis, which strain it is, and the severity of your illness. A sample of blood is taken from the arm or hand and used to do a screening test for all types of the virus. Typically blood is tested for: 1  Hepatitis A antigen. 2  An antibody against hepatitis A. 3  Hepatitis B antigens (surface and core antigens). 4  An antibody against hepatitis B (surface antigen and e-antigen). 5  An antibody against hepatitis C."}, {"url": "https://labtestsonline.org/understanding/conditions/hep", "passage_text": "In the U.S., most common causes are hepatitis A, B and C viruses. Chemical or drug induced. The liver processes many substances for the body to use and/or then eliminate. Some of these substances are toxic to the liver and can result in hepatitis. In other cases, hepatitis occurs with a drug that is not directly toxic to the liver but the body recognizes the drug as foreign and attacks it within liver cells, causing hepatitis. Acute or chronic exposure to alcohol, acetaminophen."}, {"url": "http://www.webmd.com/hepatitis/tc/hepatitis-panel-topic-overview", "passage_text": "A hepatitis panel is a blood test used to find markers of hepatitis infection. Hepatitis causes inflammation of the liver. There are different hepatitis panels. If the term w/reflex is listed in your test results, this means that the blood test was repeated to confirm a positive result on your first hepatitis blood test."}, {"url": "http://www.webmd.com/hepatitis/hepa-guide/understanding-hepatitis-treatment", "passage_text": "Viral hepatitis, such as hepatitis C (HCV), hepatitis B (HBV) and hepatitis A (HAV), is diagnosed by your symptoms, a physical exam, and blood tests. Someties imaging studies such as a sonogram or CAT scan and a liver biopsy are also used. For hepatitis C, the CDC recommends that you have a blood test if any of the following is true: 1  You have received an organ transplant or transfusion in the past."}, {"url": "http://www.privatemdlabs.com/lp/hepatitis_profile_info.php", "passage_text": "Hepatitis is a general term that means inflammation of the liver. Hepatitis A, B, and C are infections of the liver caused by different viruses. The blood tests described here help determine if hepatitis is caused by one of these viruses. These are called antibody tests. 1  Hepatitis A infection: A positive antigen test (called an HAV or hepatitis A virus test) and a positive antibody test (called an IgM anti-HAV antibody test) mean you currently have an acute hepatitis A infection."}]