[{"url": "http://www.investopedia.com/terms/c/churnrate.asp", "passage_text": "BREAKING DOWN 'Churn Rate'. For example, if 1 out of every 20 subscribers to a high-speed Internet connection discontinued his or her connection every year, the churn rate for that Internet provider would be 5%. Churn rate is an important consideration in the telephone and cell phone services industry. Liquidity. For example, if 1 out of every 20 subscribers to a high-speed Internet connection discontinued his or her connection every year, the churn rate for that Internet provider would be 5%."}, {"url": "http://marketrealist.com/2014/09/att-able-maintain-low-churn-rates/", "passage_text": "This churn rate is the best in the U.S. telecom industry, with churn rates for Verizon (VZ) the second best at 0.94%. As the chart below shows, the churn rates for T-Mobile (TMUS) and Sprint (S) are 1.50% and 2.09%, respectively—much higher compared to AT&T’s. Lower churn rates help companies save cost that they would otherwise incur acquiring new customers. So it’s an important parameter in the telecom industry. Enlarge Graph."}, {"url": "http://www.dmnews.com/dataanalytics/churn-reduction-in-the-telecom-industry/article/94238/", "passage_text": "Wireless companies today measure voluntary churn by a monthly figure, such as 1.9 percent or 2.1 percent. This is the average number of customers who quit their service per month. Annual churn rates for telecommunications companies average between 10 percent and 67 percent. Industry retention surveys have shown that while price and product are important, most people leave any service because of dissatisfaction with the way they are treated. "}, {"url": "http://www.dbmarketing.com/telecom/churnreduction.html", "passage_text": "Wireless companies today measure voluntary churn by a monthly figure, such as 1.9 percent or 2.1 percent. This is the average number of customers who quit their service per month. Annual churn rates for telecommunications companies average between 10 percent and 67 percent. Industry retention surveys have shown that while price and product are important, most people leave any service because of dissatisfaction with the way they are treated. Churn reduction in the telecom industry. Churn reduction in the telecom industry. By Arthur Middleton Hughes. All industries suffer from voluntary churn -- the loss of customers to some other company."}, {"url": "http://www.destinationcrm.com/Articles/Columns-Departments/Insight/Vertical-Focus-Telecoms-Focus-on-Services-Not-Price-to-Reduce-Churn-43869.aspx", "passage_text": "The telecommunications industry is growing, despite high customer churn rates. Overall U.S. telecommunications spending rose 4.9 percent in 2003, and is expected to grow to $1 trillion in 2007, according to the Telecommunications Industry Association. The industry's average customer churn rate at 30 percent annually, but a closer look indicates that the market could contain even more would-be churners."}, {"url": "http://www.statista.com/statistics/283511/average-monthly-churn-rate-top-wireless-carriers-us/", "passage_text": "This graph displays the average monthly churn rate for top wireless carriers in the United States from the first quarter of 2013 to the second quarter of 2015. The average monthly churn rate of Verizon Wireless was at 1.26 percent in the fourth quarter of 2013. Churn rates of wireless carriers-additional information. The average monthly churn rate of wireless carriers refers to the average percentage of subscribers that cease to use the company’s services per month. AT&T’s churn rate in the second quarter of 2014 stood at 1.47 percent, the second lowest of all the wireless carriers in the U.S. The Texas-based company’s churn rate has remained relatively stable in recent years, although it has risen slightly since it was at its lowest of 1.31 percent in 2010."}, {"url": "https://en.wikipedia.org/wiki/Churn_rate", "passage_text": "Churn is closely related to the concept of average customer life time. For example, an annual churn rate of 25% implies an average customer life of 4 years. For example, for a group of subscribers, an annual churn rate of 25% is the same as an annual survival rate of 75%. Both imply a customer life tim"}]