[{"url": "http://www.dhs.state.il.us/page.aspx?item=30358", "passage_text": "A person may apply for TANF online or at a local office that serves the area where they live. Use the DHS Office Locator to help find the nearest Family Community Reource Center. A person who applies and is determined eligible for benefits receives their cash and SNAP benefits through Illinois Link Benefits."}, {"url": "https://www.hhsc.state.tx.us/providers/LoneStar/EBT/EBThowto.html", "passage_text": "If you get TANF benefits: You can use TANF to buy food and other items such as clothes, housing, furniture, transportation, laundry, medical supplies, and supplies for the home. You can use TANF to get cash from a store (there might be a fee when getting cash)."}, {"url": "http://www.ncsl.org/research/human-services/ebt-electronic-benefit-transfer-card-restrictions-for-public-assistance.aspx", "passage_text": "All states issue Supplemental Nutrition Assistance Program (SNAP) formerly known as food stamps, through EBT cards. SNAP benefits can only be used to purchase food items and cannot be used to withdraw cash. At least 25 states have laws placing restrictions or prohibitions on the use of"}, {"url": "http://www.answers.com/Q/What_can_you_purchase_on_TANF_Lone_Star_card", "passage_text": "Answer: Just about anything, you can use it at banks, atm's, etc... It is cash assistance whereas the EBT card only covers food items so you can purchase your clothes, diapers, makeup, etc... whatever the EBT card does not cover. Its up to you what you buy, if you need the money you will use it wisely."}, {"url": "http://ptla.org/using-your-ebt-card-get-food-supplements-and-tanf", "passage_text": "Assuming that you get cash benefits (e.g. TANF), some stores will let you get cash back above the cost of your purchase. Some stores will allow a cash withdrawal without a purchase. The store policy controls."}, {"url": "http://www.dhs.state.il.us/page.aspx?item=49833", "passage_text": "The Temporary Assistance for Needy Families (TANF) program is run by the Illinois Department of Human Services. The program is for families with children and pregnant women who need temporary cash assistance. Those receiving TANF also receive medical assistance. Most TANF families also receive SNAP benefits to buy food."}, {"url": "http://ptla.org/using-your-ebt-card-get-food-supplements-and-tanf", "passage_text": "If you get food supplements (or SNAP), you can buy food. This includes everything from breads to seeds and plants which will produce food. You cannot use your food supplements to buy hot foods, alcohol, cigarettes, pet food, paper products, medicine, or household supplies. Here is more information about what you can and cannot buy with your food supplements. If you receive TANF, you can use those benefits to buy whatever your household needs."}]