[{"url": "http://grimm.wikia.com/wiki/Grimm_(TV_Series)", "passage_text": "88 (List of Episodes). Grimm is a television show inspired by Grimm's Fairy Tales that airs on NBC. It is filmed and set in Portland, Oregon. The show was created by Stephen Carpenter, David Greenwalt, and Jim Kouf. Greenwalt and Kouf are 2 of the 5 executive producers along with Sean Hayes, Todd Milliner, and Norberto Barba. "}, {"url": "http://www.youtube.com/watch?v=6aJE4RTPb6k", "passage_text": "Chuck the Movieguy talked to his buddy Sasha about the new AWESOME show Grimm where he plays Captain Renard and of course Caprica... 1  Entertainment. 2  Standard YouTube License. "}, {"url": "http://www.oregonlive.com/movies/index.ssf/2012/03/silas_weir_mitchell_on_playing.html", "passage_text": "View full sizeBeth Nakamura/The OregonianSilas Weir Mitchell, who plays Monroe in the set-and-filmed-in-Portland series, Grimm, on Southeast Belmont Street. Mitchell's first acting role -- says the actor who plays a reformed big bad wolf in Grimm -- was as Hansel. "}, {"url": "https://en.wikipedia.org/wiki/List_of_Grimm_characters", "passage_text": "Sean Renard (played by Sasha Roiz) is a police captain who is Nick's politically adept superior officer, and a member of the creature community, a human-creature hybrid with magical abilities called Zauberbiest (male form of Hexenbiest), a fact of which Nick was unaware during the first season. Eric Renard (played by James Frain) is the brother of Sean Renard. He is fluent in English and French. He resides in a Norman-style castle. He made his first appearance in episode 23 (Season 2, Episode 1) when he is seen approaching a man undergoing torture, demanding the names of people in the Resistance."}, {"url": "http://the-grimm-profiler.com/tag/captain-renard", "passage_text": "Get to know the story about the Hollywood actor that came to Peru looking for his family Sasha Roiz, who portrays Captain Renard on the Tv Show “Grimm”, also gave details about his character and the success of the show. Sasha Roiz visit to our country (Peru) could easily have been a story from the Grimm brothers. Grimm’s Sasha Roiz, who plays Captain Sean Renard, talked to TVLine about season three’s villain, baby revelations, and more. Here’s the interview. “I often imagine he’s a character that just never sleeps,” Roiz tells TVLine, laughing."}, {"url": "https://en.wikipedia.org/wiki/List_of_Grimm_characters", "passage_text": "Nicholas Burkhardt (played by David Giuntoli) is the show's protagonist and titular Grimm. Nick is a homicide detective who discovers he is descended from a line of Grimms, hunters who fight supernatural forces. Eric Renard (played by James Frain) is the brother of Sean Renard. He is fluent in English and French. He resides in a Norman-style castle. He made his first appearance in episode 23 (Season 2, Episode 1) when he is seen approaching a man undergoing torture, demanding the names of people in the Resistance."}, {"url": "http://sharetv.com/shows/grimm/cast/captain_renard", "passage_text": "32 Fans. Captain Sean Renard is a police captain who is Nick's politically adept superior officer, a member of the creature community of unknown origin, and a Zauberbiest (male form of Hexenbiest). Nick is totally unaware of his status and he seems to be a potential threat. Character Bio. Captain Sean Renard is a police captain who is Nick's politically adept superior officer, a member of the creature community of unknown origin, and a Zauberbiest (male form of Hexenbiest)."}, {"url": "https://en.wikipedia.org/wiki/List_of_Grimm_characters", "passage_text": "Josh Porter (played by Lucas Near-Verbrugghe) is the son of Roland Rolek Porter, who was a Grimm. Rolek Porter died in episode 65 (Season 3, Episode 21). Josh was tasked with giving Nick the Grimm tools and books owned by his father, after his father's death. Eric Renard (played by James Frain) is the brother of Sean Renard. He is fluent in English and French. He resides in a Norman-style castle. He made his first appearance in episode 23 (Season 2, Episode 1) when he is seen approaching a man undergoing torture, demanding the names of people in the Resistance."}]