[{"url": "http://www.elrey.com/systems.shtml?id=3", "passage_text": "Fiber-47 300 HE is an insulated standard stucco assembly with a base thickness between 3/4 in to 7/8 in and includes an additional layer of continuous insulation up to 2 in. thick. As an insulated stucco assembly, El Rey Fiber-47 300 HE provides a durable exterior with an energy saving layer of continuous insulation. A range of El Rey finish options can be applied over the stucco base with varying levels of warranty coverage dependent on the type of finish selected. FastWall 100 is a superior choice as the contents for the assembly are quality controlled ensuring a precise mix every time."}, {"url": "http://www.teifs.com/systems.shtml?id=6", "passage_text": "Teifs Scratch & Brown HE is an insulated standard stucco assembly and has a min. 3/4 inch total thickness-or thicker if required by a fire resistance rated or STC rated assembly and a maximum in accordance with ASTM C926 that include includes a layer of continuous insulation up to 2 inches. A range of Teifs finish options can be applied over the stucco base with varying levels of warranty coverage dependent on the type of finish selected. Teifs One Coat is a superior choice over field mix stucco as the contents for the assembly are quality controlled ensuring a precise mix every time."}, {"url": "http://www.parex.com/systems.shtml?id=3", "passage_text": "Armourwall 300 HE. Armourwall 300 HE is an insulated standard stucco assembly and has a min. 3/4 inch total thickness-or thicker if required by a fire resistance rated or STC rated assembly and a maximum in accordance with ASTM C926 that include includes a layer of continuous insulation up to 2 inches. A range of Parex finish options can be applied over the stucco base with varying levels of warranty coverage dependent on the type of finish selected. Armourwall 300 is a superior choice over field mix stucco as the contents for the assembly come from a quality controlled manufacture source."}, {"url": "http://www.teifs.com/systems.shtml?id=6", "passage_text": "Teifs One Coat HE is an insulated standard stucco assembly and has a min. 3/8 inch total thickness-or thicker if required by a fire resistance rated or STC rated assembly and a maximum in accordance with ASTM C926 that include includes a layer of continuous insulation up to 2 inches. A range of Teifs finish options can be applied over the stucco base with varying levels of warranty coverage dependent on the type of finish selected. Teifs One Coat is a superior choice over field mix stucco as the contents for the assembly are quality controlled ensuring a precise mix every time."}, {"url": "http://www.elrey.com/systems.shtml?id=3", "passage_text": "FastWall 100 HE is an insulated stucco assembly with a base thickness between 3/8 to 1/2 in. that includes a layer of continuous insulation up to 1-1/2 in. thick. As an insulated stucco assembly, El Rey FastWall 100 HE provides a durable exterior with an energy saving layer of continuous insulation. A range of El Rey finish options can be applied over the stucco base with varying levels of warranty coverage dependent on the type of finish selected. FastWall 100 is a superior choice as the contents for the assembly are quality controlled ensuring a precise mix every time."}, {"url": "http://www.lahabrastucco.com/systems.shtml?id=7", "passage_text": "FastWall 300 is a standard 3-Coat stucco assembly with a base thickness between 3/4 in to 7/8 in. As a stucco assembly, FastWall 300 Assembly provides a durable exterior and a unique and refined look. This assembly utilizes Fiber-47 FastWall Scratch & Brown. FASTWALL 100 Assembly. Fastwall 100 is the 1-Coat stucco assembly with a base coat thickness between 3/8 to 1/2 in. thick. Fastwall 100 Assembly provides a durable exterior in less time that traditional stucco. This assembly utilizes Fastwall Basecoat Concentrate or Fastwall Basecoat Sanded"}, {"url": "http://www.teifs.com/systems.shtml?id=6", "passage_text": "This assembly utilizes Teifs One Coat Stucco Base Concentrate or Teifs One Coat Stucco Base Sanded. A range of Teifs finish options can be applied over the stucco base with varying levels of warranty coverage dependent on the type of finish selected. Teifs One Coat is a superior choice over field mix stucco as the contents for the assembly are quality controlled ensuring a precise mix every time."}, {"url": "http://www.lahabrastucco.com/systems.shtml?id=11", "passage_text": "ACF Stucco. Stucco is a wall assembly known for its durability and strength. While total stucco assemblies provided by one manufacture are far superior to field mix stucco, budget constraints may require the use of field mix stucco. ACF Masonry. Masonry is a common form of exterior cladding used in construction and while it is strength and long life it is not known for its beauty. LaHabra ACF Masonry is intended to highlight the various finish options that are available through LaHabra for use on masonry walls."}, {"url": "http://www.elrey.com/systems.shtml?id=3", "passage_text": "FastWall 100 is the stucco assembly with a base thickness between 3/8 to 1/2 in. thick. As a stucco assembly, FastWall 100 provides a durable exterior. This assembly utilizes FastWall Stucco Base Concentrate or FastWall Stucco Base Sanded. A range of El Rey finish options can be applied over the stucco base with varying levels of warranty coverage dependent on the type of finish selected. FastWall 100 is a superior choice as the contents for the assembly are quality controlled ensuring a precise mix every time."}]