[{"url": "https://en.wikipedia.org/wiki/Motor_neuron", "passage_text": "A motor neuron (or motoneuron) is a nerve cell (neuron) whose cell body is located in the spinal cord and whose fiber (axon) projects outside the spinal cord to directly or indirectly control effector organs, mainly muscles and glands. There are upper motor neurons and lower motor neurons, with the cell type described above being a lower motor neuron. Upper motor neurons are cortico-spinal interneurons that arise from the motor cortex and descend to the spinal cord where they activate the lower motor neurons through synapses."}, {"url": "http://health.howstuffworks.com/human-body/systems/nervous-system/nerve1.htm", "passage_text": "1 Motor neurons (motoneurons) carry signals from the central nervous system to the outer parts (muscles, skin, glands) of your body. 2  Receptors sense the environment (chemicals, light, sound, touch) and encode this information into electrochemical messages that are transmitted by sensory neurons. "}, {"url": "http://academic.sun.ac.za/neurology/lectures/peripher.htm", "passage_text": "Sensory: End organ is the sensory receptor. Junction is the connection between receptor and nerve. Nerve consists of myelinated and unmyelinated axons passing to the cell body (dorsal root ganglion cell), from which nerve passes into the Spinal Cord and the CNS. These may be purely motor (musculocutaneous), purely sensory (cutaneous nerve of arm) or, usually, mixed (radial, median, ulnar, femoral, and sciatic). Note the difference between a myotome and a dermatome: The myotome refers to all those muscles innervated from a particular segment of the cord eg."}, {"url": "https://en.wikipedia.org/wiki/Sensory_neuron", "passage_text": "From Wikipedia, the free encyclopedia. Sensory neurons are nerve cells that transmit sensory information (sight, sound, feeling, etc.). They are activated by sensory input, and send projections to other elements of the nervous system, ultimately conveying sensory information to the brain or spinal cord."}, {"url": "http://science.howstuffworks.com/life/inside-the-mind/human-brain/brain2.htm", "passage_text": "Interneurons, or associative neurons, carry information between motor and sensory neurons. These fundamental members of the nervous system also vary with respect to their functions. 1  Sensory neurons carry signals from the outer parts of your body (periphery) into the central nervous system. 1 Sensory neurons carry signals from the outer parts of your body (periphery) into the central nervous system. 2  Motor neurons (motoneurons) carry signals from the central nervous system to the outer parts (muscles, skin, glands) of your body. 3  Interneurons connect various neurons within the brain and spinal cord."}, {"url": "http://www.innerbody.com/image/nervov.html", "passage_text": "The nervous system consists of the brain, spinal cord, sensory organs, and all of the nerves that connect these organs with the rest of the body. Together, these organs are responsible for the control of the body and communication among its parts. 1 Afferent, Efferent, and Mixed Nerves. 2  Some of the nerves in the body are specialized for carrying information in only one direction, similar to a one-way street. 3  Nerves that carry information from sensory receptors to the central nervous system only are called afferent nerves."}, {"url": "http://www.differencebetween.com/difference-between-sensory-and-motor-neurons/", "passage_text": "They follow ascending, or afferent pathways, so called ‘ afferent neurons ’. The cell body of the sensory neurons is located in the peripheral sensory ganglia, in the peripheral nervous system. Sensory neurons are unipolar neurons with afferent fibers, which extend between sensory receptors and central nervous system. Sensory vs Motor Neurons. Neurons are the functional and structural units of vertebrate nervous system. They make the communication network of the nervous system and transfer impulses between sensory organs, and central and peripheral nervous systems."}, {"url": "http://www.differencebetween.com/difference-between-sensory-and-motor-nerves/", "passage_text": "• Sensory nerves carry sensory impulses from the body to the central nervous system, whereas motor nerves carry motor impulses from the central nervous system to muscles of the body. • Sensory nervous arise from sensory neurons, whereas motor nerves arise from motor neurons. This process is coordinated by the sensory neurons, which are situated along the nerve conducting pathway. Motor Nerves. Motor nerves connect the central nervous system and muscles in the body, through the motor neurons, where the motor nerves are originated. The cell body for each nerve lies in the spinal cord. Each motor nerve connects a specific muscle in the body, and it carries impulses, which causes the muscle to contract"}]