[{"url": "http://tashasays.com/how-to-moisturize-and-seal-relaxed-hair/", "passage_text": "So about two years ago I started on a healthy hair journey. This included A LOT of things, but one of the most important things is to properly moisturize your hair. And in order to lock that moisture in, you want to seal it with an oil. If you’re wanting to take better care of your hair, you want to make sure you get a good moisturizer and some oils, and learn to measure exactly how much moisture your hair needs. And went over the places I put the moisturizer on. Recently, I’ve learned that I also need to moisturize and seal the ends of my hair. You want to do this to keep your ends properly moisturized and to prevent split ends. This used to be scary to me because I don’t want to weight my hair down."}, {"url": "http://www.blackhairinformation.com/growth/moisturizing/how-to-seal-hair-effectively-in-5-steps/", "passage_text": "1. Make sure that you seal in the proper order – The purpose of sealing the hair is to trap moisture in it so that your style lasts and you do not end up with dry frayed ends in two days. "}, {"url": "http://www.curlynikki.com/2013/12/moisturizing-and-sealing-for-length.html", "passage_text": "Of course, you don't have to seal again with a butter. Your need to seal twice may have to do with your porosity. If you have very porous hair, moisture may easily escape your strands and you may want to seal with both oil and a butter to ensure the moisture stays in for longer. Play around with sealing to see what your hair likes most!"}, {"url": "http://www.youtube.com/watch?v=_5hXN1SehJs", "passage_text": "This is how I moisturize and seal my hair so that it won't dry out. Very simple process. I try my best to avoid the ingredients: petrolatum, petroleum, lanolin, and mineral oil in my hair care products because these ingredient just coat the hair and block moisture from entering/leaving the hair. *UPDATE* (7.5.12). "}, {"url": "http://www.essence.com/2013/02/07/ask-curlynikk-how-do-i-keep-my-natural-hair-moisturized", "passage_text": "Proper Sealing. Sealing is locking moisture in the hair, specifically the ends. To do, apply a leave-in conditioner with water as its first ingredient (try Qhemet Cocoa Tree Detangling Ghee), and then seal with shea butter or oil."}, {"url": "http://blackgirllonghair.com/2012/05/the-9-most-ineffective-ways-to-moisturize-your-hair/", "passage_text": "You can use any oil you like and/or can afford as a sealant. You just moisturize with water or a water-based product then seal with an oil. If your hair is more on the rough/damaged end then apply a leave-in conditioner (you can dilute your go-to with water). But to honest, you can still retain length without a sealent too. Growing up, I had a lot of hair that came to my waist. 2. Using butters or oils as moisturizers. With the exception of a few oils, like coconut oil, that can penetrate the strand — oils and butters will sit on the OUTSIDE of your strand because they are SEALANTS, not moisturizers. Their purpose is to lock in moisture — not apply it."}, {"url": "http://thefeistyhouse.com/2013/11/how-to-retain-length-moisturize-and-seal/", "passage_text": "But without moisturizing your hair and then sealing that moisture in with a lightweight oil and heavier cream on a regular basis, a low pH won’t do you any good. Natural hair needs moisture! Without it, our hair is dry, fragile, and subject to breakage. They can also dry your hair out, which defeats the purpose of moisturizing in the first place. , which helps me to retain my natural hair growth. First, I spray my hair with Jane Carter Solution Leave-In. Then, I apply EVCO (extra virgin coconut oil) throughout my hair, but concentrating mostly on the ends."}, {"url": "http://www.rehairducation.com/hair/moisturising-and-sealing/", "passage_text": "If you are unable to moisturise and seal your hair twice a day, try to do it at least once a day, preferably at night. As you progress on your hair journey, you may find that you only need to moisturise and seal once a day or once every two days. 2) Moisturise before sealing – Always apply the moisturiser to the hair before applying the oil over it to lock in the moisture. And no,….mixing the two together will not achieve the same result. If you apply the oil before the moisturiser you will lock out moisture, i.e. prevent the moisture from being absorbed."}, {"url": "http://www.hairliciousinc.com/2008/11/how-to-moisturize-and-seal-your-hair.html", "passage_text": "Quick tutorial on how to Moisturize and Seal your hair to prevent dryness and breakage. This method ensures your ends and hair stay soft and moist. What is the moisturize and bun challange I couldn't find any information on this. Great hair! I am just starting a hair care regime and looking forward to great results like yours. Actually your story inspired me to begin. Thank you so much for your posts and videos they have been my guide."}]