[{"url": "https://en.wikipedia.org/wiki/Goose_bumps", "passage_text": "Goose bumps, goose pimples or goose flesh, the medical term cutis anserina or horripilation, are the bumps on a person's skin at the base of body hairs which may involuntarily develop when a person is cold or experiences strong emotions such as fear, nostalgia, pleasure, euphoria, awe, admiration, and sexual arousal. When a goose's feathers are plucked, its skin has protrusions where the feathers were, and these bumps are what the human phenomenon resembles. It is not clear why the particular fowl, goose, was chosen in English, as most other birds share this same anatomical feature."}, {"url": "http://www.tv.com/shows/goosebumps/", "passage_text": "Goosebumps was a live-action series that began on Fox Kids in the mid '90s. It's based on the award-winning book series, written by R.L. Stine.Goosebumps takes place in a strange reality, where nothing is as it seems. Normal kids find themselves trapped within and exposed to the paranormality that this world has to offer. And in each situation, they must find a way to get themselves out."}, {"url": "https://en.wikipedia.org/wiki/Goosebumps", "passage_text": "The Goosebumps series falls under the children's fiction, horror and thriller genres, although Stine characterizes the series as scary books that are also funny.. Each book features different child characters and settings. The primary protagonists are middle class and can be either male or female. Goosebumps has spawned a television series and merchandise, as well as a feature film, starring Jack Black as R. L. Stine. Since the release of its first novel, Welcome to Dead House, in July 1992, the series has sold over 350 million books worldwide in 32 languages."}, {"url": "http://goosebumps.scholastic.com/", "passage_text": "Play. Horror meets humor in Goosebumps, a multi-series collection of frighteningly fun books from best-selling author R.L. Stine. This bone-chilling installment of the popular Goosebumps series is bound to make even Slappy scream with these two spooky episodes: A Night in Terror Tower and Stay Out Of The Basement."}, {"url": "https://en.wikipedia.org/wiki/Goosebumps", "passage_text": "Goosebumps is a series of children's horror fiction novellas by American author R. L. Stine, published by Scholastic Publishing. The stories follow child characters, who find themselves in scary situations. From 1992 to 1997, 62 books were published under the Goosebumps umbrella title. Goosebumps has spawned a television series and merchandise, as well as a feature film, starring Jack Black as R. L. Stine. Since the release of its first novel, Welcome to Dead House, in July 1992, the series has sold over 350 million books worldwide in 32 languages."}, {"url": "http://goosebumps.wikia.com/wiki/Goosebumps", "passage_text": "Official Goosebumps Logo. Goosebumps is a series of children's horror fiction books by both creator and author: R.L. Stine. It shares it's name with a condition of the same name also known as 'goose pimples', a symptom of fright. Originally, only sixty-two books were published under the Goosebumps umbrella title from 1992 to 1997. First ever released was Welcome to Dead House and the last being, Monster Blood IV."}, {"url": "https://en.wikipedia.org/wiki/Goose_bumps", "passage_text": "The reflex of producing goose bumps is known as arasing, piloerection, or the pilomotor reflex. It occurs in many mammals besides humans; a prominent example is porcupines, which raise their quills when threatened, or sea otters when they encounter sharks or other predators. When a goose's feathers are plucked, its skin has protrusions where the feathers were, and these bumps are what the human phenomenon resembles. It is not clear why the particular fowl, goose, was chosen in English, as most other birds share this same anatomical feature."}, {"url": "https://en.wikipedia.org/wiki/List_of_Goosebumps_episodes", "passage_text": "This is a list of episodes from the children's television series Goosebumps that originally aired on the Fox Broadcasting Company from 1995–1998, and briefly re-ran on Cartoon Network in October from 2007 to 2009. "}, {"url": "http://goosebumps.scholastic.com/", "passage_text": "Books. Horror meets humor in Goosebumps, a multi-series collection of frighteningly fun books from best-selling author R.L. Stine. This bone-chilling installment of the popular Goosebumps series is bound to make even Slappy scream with these two spooky episodes: A Night in Terror Tower and Stay Out Of The Basement."}]