[{"url": "http://www.audioenglish.org/dictionary/commune.htm", "passage_text": "The verb COMMUNE has 2 senses: 1. communicate intimately with; be in a state of heightened, intimate receptivity. 2. receive Communion, in the Catholic church. Familiarity information: COMMUNE used as a verb is rare. 1. the smallest administrative district of several European countries. 2. a body of people or families living together and sharing everything. Familiarity information: COMMUNE used as a noun is rare."}, {"url": "http://dictionary.reverso.net/french-english/communale", "passage_text": "communal, e (communaux mpl) adj (ADMINISTRATION) of the commune ~district council modif, borough council modif nf (=ecole école) primaire sur les bancs de la communale in primary → school ils se sont connus sur les bancs de la. communale "}, {"url": "http://www.thefreedictionary.com/communal", "passage_text": "com•mu•nal. 1. used or shared in common by everyone in a group: a communal stove. 2. of, by, or belonging to the people of a community; public; common: communal land. 3. pertaining to a commune or a community: communal life. 4. engaged in by or involving two or more communities. adj. 1. (Sociology) belonging or relating to a community as a whole. 2. (Sociology) relating to different groups within a society: communal strife. 3. (Sociology) of or relating to a commune or a religious community. (kəˈmyun l, ˈkɒm yə nl). adj."}, {"url": "https://en.wikipedia.org/wiki/Teatro_Comunale_di_Bologna", "passage_text": "The Teatro Comunale di Bologna is an opera house in Bologna, Italy, and is one of the most important opera venues in Italy. Typically, it presents eight operas with six performances during its November to April season. While there had been various theatres presenting opera in Bologna since the early 17th century, they had either fallen into disuse or burnt down. The Teatro Malvezzi, built in 1651, burned down in February 1745 and this event prompted the construction of a new public theatre, the Nuovo Teatro Pubblico, as the Teatro Comunale was first called when it opened on 14 May 1763."}, {"url": "http://www.proz.com/kudoz/french_to_english/government_politics/810153-bourgmestre.html", "passage_text": "\\Burgomaster: German Buergermeister (“bürgermeister town”), master mayor or chief magistrate of A german, town, city or rural. Commune the title is also used in such countries As (belgium) bourgmeistre And The (netherlands). burgemeester bourgmestre / burgomaster / mayor Explanation: The German word is Buergermeister, and bourgmestre is used in Switzerland and Belgium, both countries with significant German-speaking populations."}, {"url": "https://en.wikipedia.org/wiki/Communes_of_France", "passage_text": "The commune (. [kɔmyn]) is a level of administrative division in the French Republic. French communes are roughly equivalent to townships or incorporated municipalities in the United States or Gemeinden in Germany. The United Kingdom has no exact equivalent, as communes resemble districts in urban areas, but are closer to parishes in rural areas where districts are much larger. The communes are the fourth-level administrative divisions of France. A French commune may be a city of 2.2 million inhabitants like Paris, a town of 10,000 people, or just a 10-person hamlet. Communes typically are based on pre-existing villages and facilitate local governance."}, {"url": "http://www.merriam-webster.com/dictionary/communal", "passage_text": ": shared or used by members of a group or community. : relating to or involving members of a commune (sense 1). : relating to a situation in which you are doing something with other people. Full Definition of COMMUNAL. 1. : of or relating to one or more communes. 2. : of or relating to a community. 3. a: characterized by collective ownership and use of property b: participated in, shared, or used in common by members of a group or community. 4. : of, relating to, or based on racial or cultural groups"}]