[{"url": "https://en.wikipedia.org/wiki/Tomato", "passage_text": "The tomato (see pronunciation) is the edible, often red berry-type fruit of the nightshade Solanum lycopersicum, commonly known as a tomato plant. The tomato is consumed in diverse ways, including raw, as an ingredient in many dishes, sauces, salads, and drinks. The tomato belongs to the nightshade family, Solanaceae. Tomato fruit is classified as a berry. As a true fruit, it develops from the ovary of the plant after fertilization, its flesh comprising the pericarp walls. The fruit contains hollow spaces full of seeds and moisture, called locular cavities. These vary, among cultivated species, according to type."}, {"url": "http://www.gardenguides.com/127996-tomato-plant-taxonomy.html", "passage_text": "Nightshades. At the genus level of classification, tomatoes belong in the genus Solanum, also known as the nightshades. Although nightshades include familiar food crops like tomatoes, potatoes and eggplant, the rest of the plant is poisonous. Nightshades primarily grow in tropical regions. Plant Kingdom. Tomatoes belong to the plant kingdom, a broad classification that they share with other species such as moss, ferns and trees. Plants are multi-cellular organisms, and their cells contain a true nucleus, but the most important distinction of the plant kingdom is its ability to produce its own food."}, {"url": "http://thetomato.weebly.com/classification-taxonomy.html", "passage_text": "This image explores the classification of the garden tomato from it's Kingdon-Plants to it's Species-Garden Tomato. "}, {"url": "https://en.wikipedia.org/wiki/Tomato", "passage_text": "Leaves, stems, and green unripe fruit of the tomato plant contain small amounts of the toxic alkaloid tomatine. They also contain solanine, a toxic alkaloid found in potato leaves and other plants in the nightshade family. Use of tomato leaves in herbal tea has been responsible for at least one death. Tomato fruit is classified as a berry. As a true fruit, it develops from the ovary of the plant after fertilization, its flesh comprising the pericarp walls. The fruit contains hollow spaces full of seeds and moisture, called locular cavities. These vary, among cultivated species, according to type."}, {"url": "http://www.fruitvs.com/en/scientific-classification-of-tomato/model-7-5", "passage_text": "Tomato classification is done on the basis of its family, order, genus and species. Scientific classification of Tomato is needed for its detailed study. Scientific classification of Tomato tells about its basic characteristics and also gives information about its relation with other fruit. Tomato Family. Family is a subdivision of order. Tomato family is Solanaceae. Scientific classification of Tomato is done on the basis of its characteristics. Shape of leaves, fruit form, type of flower, etc. determine the scientific classification of Tomato. Species having similar characteristics are placed in a particular genus. Tomatoes are placed under Solanum genus. The basic category for scientific classification of Tomato is species. All fruits belonging to one specie are same ecologically"}, {"url": "https://en.wikipedia.org/wiki/Tomato", "passage_text": "The tomato is native to western South America and Central America. Native versions were small, like cherry tomatoes, and most likely yellow rather than red. A member of the deadly nightshade family, tomatoes were erroneously thought to be poisonous by Europeans who were suspicious of their bright, shiny fruit. Tomato fruit is classified as a berry. As a true fruit, it develops from the ovary of the plant after fertilization, its flesh comprising the pericarp walls. The fruit contains hollow spaces full of seeds and moisture, called locular cavities. These vary, among cultivated species, according to type."}, {"url": "http://extension.illinois.edu/veggies/tomato.cfm", "passage_text": "Tomato, is today the most popular garden vegetable in America. For many years, however, tomatoes (then called love apples) were considered poisonous and were grown solely for their ornamental value. Tomatoes are usually easy to grow and a few plants provide an adequate harvest for most families. A. The treelike plant sold as a tree tomato, is a different species from garden tomatoes. It is a woody tree that grows 8 feet or taller and bears after 2 years. The tree tomato is a tropical plant and does not overwinter outside anywhere the temperature drops below freezing."}, {"url": "http://www.answers.com/Q/What_is_the_phylum_and_the_class_of_the_tomato", "passage_text": "The tomato does not have a phylum. Phyla are used to classify animals, not plants. The equivalent term in the plant kingdom is division; tomatoes belong to the division Angi … ospermae (angiosperms, or flowering plants). 6 people found this useful. "}]