[{"url": "http://www.answers.com/Q/What_ever_happened_to_moshe_the_beadle_from_elie_wiesel%27s_night", "passage_text": "Moshe the Beadle was Eliezer's teacher of Jewish mysticism, Moshe is a poor Jew who lives in Sighet. He is deported before the rest of the Sighet Jews but escapes and returns … to tell the town what the Nazis are doing to the Jews. Tragically, the community takes Moshe for a lunatic. 2 people found this useful. In Elie Wiesel's book Night, he speaks about his experience with his father in German concentration camps. His most notable quotes include It was neither German nor Jew wh … o ruled the ghetto-it was illusion and They called him Moishe the Beadle, as if his entire life he had never had a surname."}, {"url": "http://www.sparknotes.com/lit/night/canalysis.html", "passage_text": "Moshe the Beadle. Moshe the Beadle is the first character introduced in Night, and his values resonate throughout the text, even though he himself disappears after the first few pages. Moshe represents, first and foremost, an earnest commitment to Judaism, and to Jewish mysticism in particular. "}, {"url": "http://www.educles.com/english/night-questions-and-answers.html", "passage_text": "Answer: Moshe the Beadle is a caretaker of a synagogue in Sighet. He was Elie Wiesel’s teacher of Jewish mysticism. He was poor and livd in utter penury. Physically, he was as awkward as a clown, yet his waiflike shyness made people smile. He also had wide, dreamy eyes. "}, {"url": "http://www.answers.com/Q/In_the_book_night_what_happened_to_Moshe_the_beadle", "passage_text": "Moshe the Beadle was Eliezer's teacher of Jewish mysticism, Moshe is a poor Jew who lives in Sighet. He is somewhat like a teacher to Elie, helping him to learn Kabbalah. He also returns to Sighet and warns the Jews of what is to come … but they do not listen. He is like a prophet. I believe Elie began the story with him as a way to introduce religion, faith, and also to show that nobody listened when they were warned. His loss of faith sets a theme for the book"}, {"url": "http://www.answers.com/Q/In_the_book_night_what_happened_to_Moshe_the_beadle", "passage_text": "Moshe the Beadle warns the Jews about the plans of the Nazi but is not herd, and Elie's Father tells the Jews that they have nothing to worry about and that they should just s … tay put and do what the nazi want. He is somewhat like a teacher to Elie, helping him to learn Kabbalah. He also returns to Sighet and warns the Jews of what is to come … but they do not listen. He is like a prophet. I believe Elie began the story with him as a way to introduce religion, faith, and also to show that nobody listened when they were warned. His loss of faith sets a theme for the book"}, {"url": "https://answers.yahoo.com/question/index?qid=20080329171423AAFtDml", "passage_text": "Answers. Best Answer: If you're talking about Night by Elie Wiesel, Moishe the Beadle and the other foreign Jews were expelled from Sighet by the Hungarian police. A few months later, Moishe was able to come back, but he had completely changed. He had no joy, did not sing, and did not talk about God. Sorry, something has gone wrong. Best Answer: If you're talking about Night by Elie Wiesel, Moishe the Beadle and the other foreign Jews were expelled from Sighet by the Hungarian police."}]