[{"url": "http://www.whatstheweatherlike.org/cuba/havana.htm", "passage_text": "The climate of Havana (Cuba). Havana is the capital of Cuba. With its 2.2 million inhabitants it also is the largest city on the island. Havana is a beautiful city with an exciting character. This is not surprising in view of Havana s history."}, {"url": "https://en.wikipedia.org/wiki/Havana", "passage_text": "Havana, like much of Cuba, has a tropical climate that is tempered by the island's position in the belt of the trade winds and by the warm offshore currents. Under the Koeppen köppen climate, Classification havana has a tropical savanna. climate"}, {"url": "http://www.world-guides.com/latin-america/cuba/la-habana/havana/havana_weather.html", "passage_text": "Related Guides: Havana has the default Caribbean tropical climate along with the rest of Cuba. This means that it is warm year-round, and a fair bit warmer than nearby Florida, for example. Cuba has a couple of main seasons-the cool, dry season and the wet season."}, {"url": "http://www.weather2travel.com/climate-guides/cuba/", "passage_text": "The Cuba climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine. The Cuba climate guide shown below is for Havana."}, {"url": "http://www.whatstheweatherlike.org/cuba/havana.htm", "passage_text": "climate data for any destination ● this site in Dutch ● weather news ● contact more about Havana Havana information Havana information wikipedia this page in Dutch ... more interesting sites The climate of Havana (Cuba) Havana is the capital of Cuba. With its 2.2 million inhabitants it also is the largest city on the island. Havana is a beautiful city with an exciting character. This is not surprising in view of Havana s history."}, {"url": "http://www.holiday-weather.com/havana/", "passage_text": "Havana is located near the equator; as a result it has hot and humid climate throughout the year. Havana only experiences 2 seasons, summer and rainy. The summer season lasts from November to December, whereas the rainy season goes on through May to October."}]