[{"url": "http://www.answers.com/Q/How_many_second_place_finishes_in_majors_did_Jack_nicklaus_have", "passage_text": "How many second place finishes in majors does Tiger Woods have? He has 6 of them: - 2002 PGA Championship - 2005 U.S. Open - 2007 Masters (tied with Retief Goosen, and Rory Sabbatini) - 2007 U.S. Open (tied with Jim Furyk) - 2008 Masters … - 2009 PGA Championship."}, {"url": "http://golf.about.com/od/majorchampionships/f/jack-nicklaus-masters.htm", "passage_text": "Nicklaus also holds the Masters records for most Top 5 finishes (15), most Top 10 finishes (22) and most Top 25 finishes (25). Nicklaus played The Masters 45 times total, which includes a streak of 40 consecutive years."}, {"url": "http://www.nytimes.com/2005/07/17/sports/golf/nicklaus-in-his-time-counted-all-the-seconds.html", "passage_text": "It was not only there for his record 18 major victories that Tiger Woods is chasing, but also for another remarkable number in the 65-year-old Golden Bear's remarkable career: 19 second-place finishes in majors."}, {"url": "http://www.usatoday.com/story/gameon/2013/04/15/tiger-woods-jack-nicklaus-comparison/2083049/", "passage_text": "Nicklaus was better at Augusta during his prime. If Augusta National is the best test in golf, Nicklaus earned slightly better marks. From 1963 to 1979, Nicklaus played in 17 Masters, won five titles and had 14 top-10 finishes. From 1997 through this year, Woods played in 17 Masters, won four and had 13 top-10 finishes. Advantage: Nicklaus."}, {"url": "http://www.nicklaus.com/facts-and-figures/the-majors/", "passage_text": "Top-Five Finishes: 56. Top-10 Finishes: 73. Played in a record 154 consecutive major championships for which he was eligible from the 1957 U.S. Open to the 1998 U.S. Open."}, {"url": "http://www.usatoday.com/story/gameon/2013/04/15/tiger-woods-jack-nicklaus-comparison/2083049/", "passage_text": "1. Jack was second-best the most. Nicklaus finished second in 19 majors, and Woods has six runner-up results. Nicklaus had 48 top-three finishes at Slams, twice as many as Woods."}, {"url": "http://www.golf.com/tour-and-news/jack-nicklaus-wasnt-far-winning-28-major-titles", "passage_text": "Most notable are his 18 major championships and his half-dozen Masters titles. Only Tiger Woods (14) and Walter Hagen (11) have even half as many of the sport's coveted crowns as Nicklaus. Just as staggering: Jack was a runner-up in a major 19 times and finished in the top three 46 times in 164 starts."}]