[{"url": "http://www.livestrong.com/article/257590-vitamins-in-lemons/", "passage_text": "One lemon contains 44.5 mg of vitamin C. The A 2 Z of Health, Beauty and Fitness at learninginfo.org explains that because of the high vitamin C content in lemons they may help prevent and treat infections, bring down high fevers and hasten wound healing."}, {"url": "http://healthyeating.sfgate.com/lemons-provide-vitamin-c-like-oranges-do-3508.html", "passage_text": "Vitamin C Content. A 100-gram serving of orange or lemon provides you with 53 milligrams of vitamin C, which is 88 percent of the daily value of 60 milligrams per day. This serving equals either one small orange or slightly less than two lemons."}, {"url": "http://www.answers.com/Q/How_much_vitamin_C_in_a_lemon", "passage_text": "One lemon weighing 100 grams contains about 53 mg of vitamin C.  Amla is rich with 600 mg to 1800mg in every 100 grams serving. The  Indian Gooseberry packs more of a punch … that a lemon. Bonnie Peregrine. 36,009 Contributions."}, {"url": "http://healthyeating.sfgate.com/lemons-provide-vitamin-c-like-oranges-do-3508.html", "passage_text": "Lemons vs. Oranges. While lemons have fewer calories and less sugar, with only 29 calories and 2.9 grams of sugar per 100-gram serving, compared to the 47 calories and 9.4 grams of sugars found in the same-sized serving of oranges, oranges are more nutritious overall."}, {"url": "http://healthyeating.sfgate.com/lemons-provide-vitamin-c-like-oranges-do-3508.html", "passage_text": "Lemons provide less calcium, with 26 milligrams compared to 40 milligrams in oranges; less potassium, with 138 milligrams compared to 181 milligrams; less vitamin A, with only 22 international units compared to 225 international units; and less folate, with 11 micrograms compared to 30 micrograms."}, {"url": "http://www.dietandfitnesstoday.com/vitamin-c-in-lemon.php", "passage_text": "The list below gives the total Vitamin C content in the 1 items from the general description 'lemon'.There is 1 item containing Lemons, raw, without peel per 100g of lemon."}, {"url": "http://www.answers.com/Q/How_much_vitamin_C_in_a_lemon", "passage_text": "The concentration of vitamin C in lemons is between 40 mg/100 g and. 50 mg/100 g."}, {"url": "http://www.naturalhub.com/natural_food_guide_fruit_vitamin_c.htm", "passage_text": "In the particular case of lemon and lime, the 'slice' value is juice of one wedge. For a few small fruit, such as Kei apple, the ranking is adjusted upward where the fruit mg/100 gram analysis shows it has large amounts of vitamin C, but the small size of the fruit gives it a lower per fruit vitamin C content."}]