[{"url": "http://www.foundersworkbench.com/participating-vs-non-participating-preferred-stock/", "passage_text": "The difference between the two types of preferred stock is that participating preferred stock, after receipt of its preferential return, also shares with the common stock (on an as-converted to common stock basis) in any remaining available deal proceeds, while non-participating preferred stock does not. "}, {"url": "http://www.businessdictionary.com/definition/founders-shares.html", "passage_text": "Definition. Issued to the originators of a firm, these shares (stock) normally do not receive any return until dividend payable to common stock holders (ordinary share holders) is paid out. However, these shares are entitled to all of the remaining (after tax) profits, no matter how much. "}, {"url": "http://www.alleywatch.com/2013/08/what-is-founders-stock-legally/", "passage_text": "The term “founder” and “founders’ stock” are not legal terms, rather, they are terms of art describing a certain class of early participants of a company and their ownership interests. You will not find the terms “founder” or “founders’ stock” defined in the corporations code. Founders’ stock means the shares of common stock that are issued in the organizational minutes or consent of the board of directors of the company when they are setting up the new business, adopting bylaws and appointing officers."}, {"url": "http://www.investopedia.com/terms/d/dualclassstock.asp", "passage_text": "DEFINITION of 'Dual Class Stock'. The issuing of various types of shares by a single company. A dual class stock structure can consist of stocks such as Class A and Class B shares, and where the different classes have distinct voting rights and dividend payments."}, {"url": "https://en.wikipedia.org/wiki/Investopedia", "passage_text": "Investopedia is a resource for investing education, personal finance, market analysis, and free trading simulators. With a comprehensive financial dictionary, exam preparation materials, and active trading strategies, it is a leading destination for investors. On September 9, 2011 Investopedia released a free iPhone App. The App gives users access to Investopedia's full financial dictionary, articles, and other content. Investopedia's App has over 211,000 downloads and is the #25 free Finance App in iTunes."}, {"url": "http://lsvp.com/2008/09/15/what-entrepreneurs-need-to-know-about-founders-stock/", "passage_text": "However, many times vesting of founders’ shares will follow a different schedule to that of typical startup employees. First, most founder vesting is not subject to the one year cliff because founders usually have a history working with each other, and know and trust each other. In addition, most founders will start vesting of their shares from the date they actually started providing services to the company. "}, {"url": "http://www.alleywatch.com/2013/08/what-is-founders-stock-legally/", "passage_text": "Companies that do not exist cannot issue shares of stock. Founders’ stock means the shares of common stock that are issued in the organizational minutes or consent of the board of directors of the company when they are setting up the new business, adopting bylaws and appointing officers."}, {"url": "http://www.investopedia.com/terms/d/deferredshare.asp", "passage_text": "DEFINITION of 'Deferred Share'. 1. A share that does not have any rights to the assets of a company undergoing bankruptcy until all common and preferred shareholders are paid. 2. A method of stock payment to directors and executives of a company through the deposit of shares into a locked account. "}, {"url": "http://www.investopedia.com/terms/d/dualclassstock.asp", "passage_text": "Well-known companies such as Ford and Warren Buffett's Berkshire Hathaway have dual class stock structures that provide founders, executives and family the ability to control the majority shareholder voting power with a relatively small amount of total equity in the company. A dual class stock structure can consist of stocks such as Class A and Class B shares, and where the different classes have distinct voting rights and dividend payments."}, {"url": "https://en.wikipedia.org/wiki/Investopedia", "passage_text": "Investopedia is an Internet site devoted to investing education based in Edmonton in Alberta, Canada started by Cory Janssen and Cory Wagner in June 1999. On September 9, 2011 Investopedia released a free iPhone App. The App gives users access to Investopedia's full financial dictionary, articles, and other content. Investopedia's App has over 211,000 downloads and is the #25 free Finance App in iTunes."}]