[{"url": "https://en.wikipedia.org/wiki/Bhajji", "passage_text": "Bhajji, bhaji or bajji, is a spicy Indian snack similar to a fritter, with several variants. Outside the Indian states of Maharashtra, Andhra Pradesh, Tamil Nadu, and Karnataka, such preparations are often known as pakora. It is usually served as a topping with various Indian meals, but has become popular to eat alone as a snack."}, {"url": "http://www.wisegeek.com/what-is-an-onion-bhaji.htm", "passage_text": "Onions, the main ingredient in onion bhaji. Mango chutney, which is often served with onion bhajis. Onion bhaji is frequently served with a yogurt-based dip. Spicy fried onion bhajis are often sprinkled with chili powder and turmeric. Chili powder is commonly included in onion bhajis."}, {"url": "http://www.bbc.co.uk/food/recipes/onionbhaji_85976", "passage_text": "Preparation method. Beat the eggs in a bowl. Add the onion rings and mix well. Add the flour, ground coriander and cumin seeds and stir well to combine. Heat the oil in a deep-sided frying pan over a medium heat. When hot add a large spoonful of the bhaji mixture and fry for 30-45 seconds, until golden-brown"}, {"url": "http://www.wisegeek.com/what-is-an-onion-bhaji.htm", "passage_text": "Chickpeas, which are used to make a flour for onion bhajis. Onion Bhaji is popular in Indian restaurants, especially in the U.K. Onion bhajis are one of the many savory street foods sold at outdoor markets in India. Mango chutney, which is often served with onion bhajis. Onion bhaji is frequently served with a yogurt-based dip. Spicy fried onion bhajis are often sprinkled with chili powder and turmeric. Chili powder is commonly included in"}, {"url": "http://www.wisegeek.com/what-is-an-onion-bhaji.htm", "passage_text": "Popular in the United Kingdom, onion bhaji is a spicy fried onion dish of Indian origin. Often served in Indian restaurants, onion bhaji combines spices, flour, and sliced onion to create a fritter-like appetizer or snack. Mango chutney, which is often served with onion bhajis. Onion bhaji is frequently served with a yogurt-based dip. Spicy fried onion bhajis are often sprinkled with chili powder and turmeric. Chili powder is commonly included in"}, {"url": "http://jeenaskitchen.blogspot.com/2007/12/onion-bhaji-recipe.html", "passage_text": "How to make perfect onion bhaji recipe. Cut the onions in half then cut into slices, not too thick nor too thin. Drizzle a little oil into a large pan/wok and gently cook the onions until they start turning soft and translucent in colour, do not brown them or over cook them. "}, {"url": "http://www.hub-uk.com/foodpages12/recip0590.htm", "passage_text": "Very carefully drop spoonfuls of the mixture into the hot oil and fry until keep warm whilst you cook the remaining bhajis. Drain well on kitchen paper and serve very hot. The onion bhaji is a spicy Indian snack of which the main ingredient is fried onions. In the UK the onion bhaji has become popular to eat as a snack or as a starter in Indian restaurants. The basic recipe consists of onions being chopped and then made into a sort of batter with chickpea or gram flour, spices, and sometimes with herbs, then fried until golden. They have a mild taste and are not hot. 1 Gradually add enough water to the flour mixture to form a thick batter mixing very well so the onions are well coated. 2  Very carefully drop spoonfuls of the mixture into the hot oil and fry until keep warm whilst you cook the remaining bhajis. 3  Drain well on kitchen paper and serve very hot."}, {"url": "http://www.bbcgoodfood.com/recipes/335606/red-onion-and-chilli-bhajis-with-mint-and-garlic-r", "passage_text": "1 Finely chop one onion and thinly slice the other. 2  Sift the flour and baking powder into a bowl. 3  Add the curry paste or powder, chopped chilli and a good sprinkling of salt. 4  Add about 150ml of cold water to make a thick batter. 1 Add the curry paste or powder, chopped chilli and a good sprinkling of salt. 2  Add about 150ml of cold water to make a thick batter. 3  Stir in the chopped and sliced onions until they are well coated. 4  Mix together the raita ingredients with a little salt and pepper, then spoon into a small bowl."}]