[{"url": "http://www.easynotecards.com/notecard_set/29323", "passage_text": "B. Anaphase I occurs in a haploid cell while anaphase II occurs in a diploid cell. C. Sister chromatids separate during anaphase II while homologous chromosomes separate during anaphase I. D. The cell undergoing anaphase II is genetically different from what it contained while undergoing anaphase I. B. The gametes are the diploid phase of the life cycle. C. The products of the haploid phase of the life cycle are larger than those of the diploid phase. D. Meiosis is not a necessary component of the animal"}, {"url": "http://www.answers.com/Q/What_does_the_term_chiasma_refer", "passage_text": "This is  as opposed to simple carbohydrates, or sugars (monosaccharides and  disaccharides). Some nutritionists, … however, use the term complex  carbohydrate to refer to any sort of digestible saccharide present  in a whole food where fiber, vitamins and minerals are also found. 1 person found this useful"}, {"url": "http://www.wisegeek.com/in-genetics-what-is-a-chiasma.htm", "passage_text": "Technically, the sister chromatids are connected in the center, but after reading this article and from what I know, I think chiasma is only used to refer to the joining of centromeres when crossing over happens. Obviously, crossing over is only part of meiosis, hence the term chiasma only being used in that context. At the chiasma, the chromatids can exchange genetic information, resulting in new combinations of genetic material. When the chromatids separate and become sister chromosomes, they will contain a different mix of genetic material than their parent chromosomes."}, {"url": "https://en.wikipedia.org/wiki/Chiastic_structure", "passage_text": "The term chiastic derives from the mid-17th century term chiasmus, which refers to a crosswise arrangement of concepts or words that are repeated in reverse order. Chiasmus derives from the Greek word khiasmos, a word that is khiazein, marked with the letter khi. From khi comes chi. The two mentions of the 150 days refer to the same period, and the first 40 days (7:13,17) are part of the 150 days. All this is consistent with the date in 8:4."}, {"url": "http://www.easynotecards.com/notecard_set/29323", "passage_text": "A. The haploid cell products of meiosis II fuse. B. Meiosis stops after meiosis I and does not proceed to meiosis II. C. Cytokinesis does not follow endomitosis that results in a tetraploid cell. D. During anaphase II, the sister centromeres fail to separate and daughter cells will not form. B. The gametes are the diploid phase of the life cycle. C. The products of the haploid phase of the life cycle are larger than those of the diploid phase. D. Meiosis is not a necessary component of the animal"}, {"url": "http://www.biology-online.org/dictionary/Crossing_over", "passage_text": "Crossing over. Definition. noun. A process occurring during meiosis wherein two chromosomes pair up and exchange segments of their genetic material. Supplement. This occurs at the stage when chromatids of homologous chromosomes pair up during synapsis, forming X-structure (chiasma). Crossing over is important because it results in new combinations of genes that are different from either parent, contributing to genetic diversity. See also: meiosis, homologous chromosomes."}, {"url": "http://www.wisegeek.com/in-genetics-what-is-a-chiasma.htm", "passage_text": "A chiasma is a point of contact between sister chromatids that forms during meiosis, a process of cell division and replication used by a wide variety of organisms. At the chiasma, the chromatids can exchange genetic information, resulting in new combinations of genetic material. When the chromatids separate and become sister chromosomes, they will contain a different mix of genetic material than their parent chromosomes."}, {"url": "http://www.freezingblue.com/flashcards/print_preview.cgi?cardsetID=187299", "passage_text": "What is the importance of crossing-over: A it provides extra genetic material for the daughter cells. B it increases the likelihood that daughter cells contain different genetic material. B it increases the likelihood that daughter cells contain different genetic material. A. Mitosis produces two daughter cells that contain the same number of chromosomes as the parent cell. B. Mitosis uses a 2n parent cell to form daughter cells containing n chromosomes. C. Mitosis is a process that duplicates and divides the nuclear contents only."}, {"url": "http://www.wisegeek.com/in-genetics-what-is-a-chiasma.htm", "passage_text": "The term “chiasma,” which comes from the Greek, refers generally to an intersection or crossing. This term is also used in anatomy to refer to bundles of nerves at the point of intersection, like the optic chiasm, where the optic nerves cross each other. At the chiasma, the chromatids can exchange genetic information, resulting in new combinations of genetic material. When the chromatids separate and become sister chromosomes, they will contain a different mix of genetic material than their parent chromosomes."}, {"url": "http://www.answers.com/Q/What_does_the_term_chiasma_refer", "passage_text": "hte term solar system is derived from the sun which is solar and system for the planets that it constitutes that is revolves. Edit. Share to: 1  Examples of Impromptu Speech The term impromptu refers to speaking or acting in a fashion that is unplanned, often as a reaction to a situation that has occurred. 2  Intubation: What It Is, It's Uses, and Risks Anyone who has had exposure to or discussions about serious illness, accident, or surgery may have come across the term intubation. Some nutritionists, … however, use the term complex  carbohydrate to refer to any sort of digestible saccharide present  in a whole food where fiber, vitamins and minerals are also found."}]