[{"url": "https://en.wikipedia.org/wiki/Tepui", "passage_text": "There are 115 such mesas in the Gran Sabana in the south-east of Venezuela on the border with Guyana and Brazil, where the highest concentration of tepuis is found. The precipitous mountains tower over the surrounding area by up to 1,000 meters. Tepuis range in elevation from 1,000–3,000 metres (3,300–9,800 ft). Because of their great age, some tepuis exhibit surface features and subsurface caves typical of karst topography, formed in more water-soluble rocks such as limestone."}, {"url": "http://www.amusingplanet.com/2013/05/tabletop-mountains-or-tepuis-of.html", "passage_text": "Tepuis are flat table-top mountains found in the Guayana Highlands of South America, especially in Venezuela. In the language of the Pemon people who live in the Gran Sabana, Tepui means ‘House of the Gods’ due to their height. There are 115 such tabletop mountains in the Gran Sabana region in the south-east of Venezuela where the highest concentration of tepuis are found. The most famous among them is Mount Roraima."}, {"url": "https://en.wikipedia.org/wiki/Auyantepui", "passage_text": "[auˌʝanteˈpui]), also spelled Ayan, is a tepui in Bolivar bolívar, State. Venezuela it is the most visited and one of the (largest but not the) highest tepuis in The Guiana, highlands with a summit area of.666 9 km (2.257 5 sq) mi and an estimated slope area of 715 km (2 276 sq). mi The massif has a total summit area of roughly 670 km 2 (260 sq mi) and an estimated slope area of 795 km 2 (307 sq mi). It is situated entirely within the bounds of Canaima National Park. Auyan-auyán tepui Means'devil S house in the Local pemon. pemón language"}, {"url": "http://www.definitions.net/definition/tepui", "passage_text": "A tepui, or tepuy, is a table-top mountain or mesa found in the Guiana Highlands of South America, especially in Venezuela. The word tepui means house of the gods in the native tongue of the Pemon, the indigenous people who inhabit the Gran Sabana. Wiktionary (0.00 / 0 votes) Rate this definition: tepui (Noun). A table-top mountain or mesa found in the Guiana Highlands of South America, especially in Venezuela. Origin: Meaning"}, {"url": "https://en.wikipedia.org/wiki/Tepui", "passage_text": "[teˈpui]), is a table-top mountain or mesa found in the Guiana Highlands of South America, especially in Venezuela and western Guyana. The word tepui means house of the gods in the native tongue of the Pemon, the indigenous people who inhabit the Gran Sabana. The precipitous mountains tower over the surrounding area by up to 1,000 meters. Tepuis range in elevation from 1,000–3,000 metres (3,300–9,800 ft). Because of their great age, some tepuis exhibit surface features and subsurface caves typical of karst topography, formed in more water-soluble rocks such as limestone."}, {"url": "https://en.wikipedia.org/wiki/Auyantepui", "passage_text": "Auyan-auyán (. [tepui]), auˌʝanteˈpui also Spelled, ayan is a tepui In bolivar, Bolívar. State venezuela it is the most visited and one of (the largest but not) the highest tepuis In The, guiana highlands with a summit area.of 666 9 (km.2 257 5) sq mi and an estimated slope area of 715 (km 2 276). sq mi The massif has a total summit area of roughly 670 km 2 (260 sq mi) and an estimated slope area of 795 km 2 (307 sq mi). It is situated entirely within the bounds of Canaima National Park. Auyan-auyán tepui Means'devil S house in the Local pemon. pemón language"}, {"url": "https://en.wikipedia.org/wiki/Auyantepui", "passage_text": "It is the most visited and one of the largest (but not the highest) tepuis in the Guiana Highlands, with a summit area of 666.9 km 2 (257.5 sq mi) and an estimated slope area of 715 km 2 (276 sq mi). The massif has a total summit area of roughly 670 km 2 (260 sq mi) and an estimated slope area of 795 km 2 (307 sq mi). It is situated entirely within the bounds of Canaima National Park. Auyan-auyán tepui Means'devil S house in the Local pemon. pemón language"}, {"url": "http://www.worldwildlife.org/ecoregions/nt0169", "passage_text": "They range from 1,000 to 3,000 m in elevation. And they are called tepuis (singular: tepui), a word from the Pemon Pemón. Amerindians many tepuis are graced with dramatic, waterfalls the tallest of (which in, fact the tallest in the) world Is Angel falls dropping 979. meters Hundreds of smaller sandstone mountains exist in the ecoregion as well. The Tepuis are characteristically flat-topped steep, nearly vertical escarpments interrupted by terraced talus slopes. Some mountains present more undulating irregular summit contours."}, {"url": "http://www.bbc.com/travel/story/20121020-venezuelas-lost-world", "passage_text": "Venezuela’s lost world. In southern Venezuela’s tepuis – the sandstone, table-topped mountains that inspired Sir Arthur Conan-Doyle’s novel The Lost World – travellers still feel like 19th-century explorers. facebook. But southern Venezuela’s tepuis – the sandstone, table-topped mountains that inspired Sir Arthur Conan-Doyle’s novel The Lost World – still make travellers feel like 19 th-century explorers setting off into the hinterland."}]