[{"url": "http://www.webmd.com/women/guide/understanding-thyroid-problems-basics", "passage_text": "Through the hormones it produces, the thyroid gland influences almost all of the metabolic processes in your body. Thyroid disorders can range from a small, harmless goiter (enlarged gland) that needs no treatment to life-threatening cancer. The most common thyroid problems involve abnormal production of thyroid hormones. Too much thyroid hormone results in a condition known as hyperthyroidism. Causes of hypothyroidism include: 1  Hashimoto's thyroiditis: In this autoimmune disorder, the body attacks thyroid tissue. 2  The tissue eventually dies and stops producing hormones. 3  Removal of the thyroid gland: The thyroid may have been surgically removed or chemically destroyed."}, {"url": "http://www.emedicinehealth.com/thyroid_problems/article_em.htm", "passage_text": "Diseases of the thyroid gland can result in either production of too much (overactive thyroid disease or hyperthyroidism), too little (underactive thyroid disease or hypothyroidism) thyroid hormone, thyroid nodules, and/or goiter. Thyroid problems are much more common in women than in men. "}, {"url": "http://www.medicinenet.com/thyroid_disorders/article.htm", "passage_text": "Thyroid Disease Symptoms and Signs. Thyroid disease is a common problem that can cause symptoms because of over-or under-function of the thyroid gland. The thyroid gland is an essential organ for producing thyroid hormones, which maintain are body metabolism. The thyroid gland is located in the front of the neck below the Adam's apple. Thyroid disease can also sometimes lead to enlargement of the thyroid gland in the neck, which can cause symptoms that are directly related to the increase in size of the organ (such as difficulty swallowing and discomfort in front of the neck)."}, {"url": "http://www.healthline.com/health/common-thyroid-disorders", "passage_text": "Thyroid nodules are growths that form on or in the thyroid gland. The causes are not always known but can include iodine deficiency and Hashimoto's disease. The nodules can be solid or fluid-filled. Most are benign, but they can also be cancerous in a small percentage of cases. The body's systems speed up and cause symptoms that are common to hyperthyroidism when there’s a high level of thyroid hormone in the bloodstream. Symptoms include: 1  anxiety. 2  irritability. 3  fatigue."}, {"url": "http://www.rightdiagnosis.com/t/thyroid/intro.htm", "passage_text": "Thyroid disorders can cause the thyroid gland to become overactive (hyperthyroidism) or underactive (hypothyroidism). Thyroid disorders are most often due to autoimmune thyroid diseases, such as Graves' disease and Hashimoto's thyroiditis. The most common thyroid disorders that result in hyperthyroidism include thyroid nodules and Graves' disease."}, {"url": "http://www.webmd.com/women/guide/understanding-thyroid-problems-basics", "passage_text": "1 Graves' disease: The production of too much thyroid hormone. 2  Toxic adenomas: Nodules develop in the thyroid gland and begin to secrete thyroid hormones, upsetting the body's chemical balance; some goiters may contain several of these nodules. Causes of hypothyroidism include: 1  Hashimoto's thyroiditis: In this autoimmune disorder, the body attacks thyroid tissue. 2  The tissue eventually dies and stops producing hormones. 3  Removal of the thyroid gland: The thyroid may have been surgically removed or chemically destroyed."}, {"url": "http://www.rightdiagnosis.com/t/thyroid/intro.htm", "passage_text": "Thyroid disorders: Introduction. Thyroid disorders are common disorders of the thyroid gland. Thyroid disorders include such diseases and conditions as Graves' disease, thyroid nodules, Hashimoto's thyroiditis, trauma to the thyroid, thyroid cancer and birth defects. These include being born with a defective thyroid gland or without a thyroid gland. Thyroid disorders are most often due to autoimmune thyroid diseases, such as Graves' disease and Hashimoto's thyroiditis. The most common thyroid disorders that result in hyperthyroidism include thyroid nodules and Graves' disease."}, {"url": "http://www.hormone.org/diseases-and-conditions/thyroid", "passage_text": "Thyroid Disorders. The thyroid gland is located at the front of your neck. This gland secretes hormones that govern many of the functions in your body, such as the way the body uses energy, consumes oxygen and produces heat. Thyroid disorders typically occur when this gland releases too many or too few hormones. Hypothyroidism is often caused by Hashimoto's disease, an autoimmune disease where the body's immune system attacks the thyroid gland. This condition can be treated using a drug called T4. Most patients must stay on T4 for their entire lives, and must be closely monitored by physicians."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hashimotos-disease/basics/definition/CON-20030293", "passage_text": "Thyroid gland. Hashimoto's disease is a condition in which your immune system attacks your thyroid, a small gland at the base of your neck below your Adam's apple. The thyroid gland is part of your endocrine system, which produces hormones that coordinate many of your body's activities. "}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/thyroid-Disease.html", "passage_text": "Your thyroid is a small gland at the base of your neck that makes thyroid hormone. Thyroid hormone controls many activities in your body, including how fast you burn calories and how fast your heart beats. Diseases of the thyroid cause it to make either too much or too little of the hormone. "}]