[{"url": "http://www.medicinenet.com/diclofenac_and_misoprostol/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Arthrotec is a combination of diclofenac and misoprostol. Diclofenac is a nonsteroidal anti-inflammatory drug (NSAID) similar to ibuprofen (Motrin or Advil), naproxen (Naprosyn), and others that is used to treat inflammation, pain, and fever."}, {"url": "http://www.everydayhealth.com/drugs/diclofenac-misoprostol", "passage_text": "Diclofenac and misoprostol is a combination medicine used to treat osteoarthritis and rheumatoid arthritis in people at high risk for developing stomach or intestinal ulcers."}, {"url": "http://www.rxlist.com/arthrotec-drug.htm", "passage_text": "ARTHROTEC (diclofenac sodium/misoprostol) is a combination product containing diclofenac sodium, a nonsteroidal anti-inflammatory drug (NSAID) with analgesic properties, and misoprostol, a gastrointestinal (GI) mucosal protective prostaglandin E1 analog."}, {"url": "http://www.webmd.com/drugs/2/drug-2310/diclofenac-misoprostol-oral/details", "passage_text": "This medication is a combination of 2 drugs, diclofenac and misoprostol. Do not take this medication if you are pregnant or think that you may be pregnant. Misoprostol may cause loss of pregnancy, premature birth, or birth defects."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0009926/?report=details", "passage_text": "Uses of This Medicine. Diclofenac and misoprostol combination is used to relieve symptoms of arthritis (eg, osteoarthritis or rheumatoid arthritis) in patients who may develop stomach ulcers from taking nonsteroidal anti-inflammatory drugs (NSAIDs)."}, {"url": "http://www.goodrx.com/diclofenac-sodium-misoprostol/what-is", "passage_text": "diclofenac sodium/misoprostol. DICLOFENAC; MISOPROSTOL is a combination of two different drugs. Diclofenac is a non-steroidal anti-inflammatory drug (NSAID). It is used to reduce swelling and to treat pain. Misoprostol protects the stomach against ulcers."}, {"url": "http://www.goodrx.com/diclofenac-sodium-misoprostol/what-is", "passage_text": "Chemical Classification: Diclofenac. Uses For diclofenac sodium/misoprostol. Diclofenac and misoprostol combination is used to relieve symptoms of arthritis (eg, osteoarthritis or rheumatoid arthritis) in patients who may develop stomach ulcers from taking nonsteroidal anti-inflammatory drugs (NSAIDs)."}, {"url": "https://www.pfizermedicalinformation.com/en-us/arthrotec", "passage_text": "ARTHROTEC (diclofenac sodium/misoprostol) is a combination product containing diclofenac sodium, a nonsteroidal anti-inflammatory drug (NSAID) with analgesic properties, and misoprostol, a gastrointestinal (GI) mucosal protective prostaglandin E 1 analog."}, {"url": "http://www.goodrx.com/diclofenac-sodium-misoprostol/what-is", "passage_text": "Diclofenac is a nonsteroidal anti-inflammatory drug (NSAID), used to relieve symptoms of arthritis such as inflammation, swelling, stiffness, and joint pain. Misoprostol is used to decrease the chance of having stomach and intestinal ulcers."}]