[{"url": "http://www.youtube.com/watch?v=DBUz2nkOKsc", "passage_text": "Music video by Blackstreet performing Don't Leave Me. (C) 1997 Interscope Records. 1  Music. 2  Standard YouTube License. "}, {"url": "https://en.wikipedia.org/wiki/Don%27t_Leave_Me_This_Way", "passage_text": "Don't Leave Me This Way  is a song written by Kenneth Gamble, Leon Huff and Cary Gilbert. First charting as a hit for Harold Melvin & the Blue Notes, an act on Gamble & Huff's Philadelphia International label in 1975, Don't Leave Me This Way was later a huge disco hit for Motown artist Thelma Houston in 1977. The song was a major hit for British group The Communards in 1986"}, {"url": "https://en.wikipedia.org/wiki/Don%27t_Let_Me_Be_Lonely_Tonight", "passage_text": "Don't Let Me Be Lonely Tonight  is a song written and performed by American singer-songwriter James Taylor, from his 1972 album One Man Dog. It was released as the lead single from the album, and peaked at #14 on the Billboard charts on January 13, 1973. "}, {"url": "http://www.azlyrics.com/lyrics/karmin/brokenhearted.html", "passage_text": "Come on, that's right, cheeri, cheerio. When you gonna call. Don't leave me brokenhearted. I've been waiting up. Let's finish what we started, oh oh. I can't seem to let you go. Come on, that's right, cheerio, uh! Submit Corrections. Visit www.azlyrics.com for these lyrics. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060801184547AAoK3UG", "passage_text": "Who sings that song with the lyrics;  ... I remember seeing the video a long time ago. Then, I heard it in Mexico by the pool again. I can't remember the rest of the lyrics. "}, {"url": "http://www.directlyrics.com/karmin-broken-hearted-lyrics.html", "passage_text": "Karmin-Brokenhearted lyrics. Lyrics » A-Z » Karmin. Pop music duo Karmin push forward with Brokenhearted, the official second single from their much-anticipated debut album set to hit stores in 2012 via Epic Records! Broken Hearted was helmed by Emily Wright, Claude Kelly and Benny Blanco. This has 'smash hit' written all over it"}, {"url": "http://tasteofcountry.com/the-band-perry-dont-let-me-be-lonely/", "passage_text": "‘Don’t Let Me Be Lonely,’ the third single from the Band Perry ‘s ‘Pioneer’ album, is thematically similar to their biggest hit, but few will confuse this song with ‘If I Die Young.’ The latest track may not be as instantly catchy, but it’s every bit the sharp songwriting effort the cut from the trio’s debut album was. The romance angle is somewhat forced and never fully realized, leaving the overall message a little cloudy. Truthfully, 100 different fans may have 100 different ways to explain ‘If I Die Young,’ as well. Subtle obfuscation has served the Band Perry well."}, {"url": "http://tasteofcountry.com/blake-shelton-ashley-monroe-lonely-tonight/", "passage_text": "Warner Music Nashville. Blake Shelton ’s latest from ‘Bringing Back the Sunshine’ brings a needed female voice to country radio. Ashley Monroe sings alongside Shelton during ‘Lonely Tonight,’ a dark love song set deep into a traditional arrangement. ‘Lonely Tonight’ finds the two singers longing for one another one more time."}]