[{"url": "http://www.afro-fusion.com/page/397881096", "passage_text": "A single dry coconut, place on a white plate in front of eleggua or behind the front door of the house. Light on a candle (white or red) above the coconut for three days at the same time. Asking Elegua order to remove the envy off the house and yourself. After three days throw at a crossroad of four corners with 3 or 21 cents (coins. TO PREPARE A LETTER TO THE FOOT OF Elegua."}, {"url": "http://www.afro-fusion.com/page/397881096", "passage_text": "He lives behind the door of the house in a clay pot or in a cabinet. His eleke (collar) is also red and black black and white. Below it you will need to offer Elegua: White candle, burning water cane, snuff or cigars, coffee nego, honey, butter royal palm (palm oil). Light on a candle (white or red) above the coconut for three days at the same time. Asking Elegua order to remove the envy off the house and yourself. After three days throw at a crossroad of four corners with 3 or 21 cents (coins. TO PREPARE A LETTER TO THE FOOT OF Elegua."}, {"url": "http://elboricua.com/sorullitos.html", "passage_text": "Sorullitos De Maiz. 1¼ cups corn meal 1 tsp. salt 1 tsp. sugar 2 tbsp butter 2 cups water 1 cup shredded cheese (or Queso de bola). In a medium saucepan boil the water. Add salt, sugar, butter, corn meal and stir until it forms a soft ball that separates from the sides of the pot. Remove from heat. Add the cheese and stir. Cover with clean dishcloth and wait 5 minutes or so."}, {"url": "http://www.mexgrocer.com/19988.html", "passage_text": "Galletas con Malvavisco (bonbon), coco y jalea de fresa. Las galletas Marinela Sponch son una deliciosa confeccion que a sido amada por generaciones. Bombones coloridos con coco rociado en encima y un exquisito topping de fresa adornan esta dulce galleta. Marinela Sponch marshmallow cookies are scrumptious treats that have been loved for generations. Colorful marshmallows sprinkled with coconut and strawberry topping adorn this delectable cookie."}, {"url": "http://www.mexgrocer.com/9215.html", "passage_text": "Duvalin Hazelnut and Vanilla. Duvalin Chocolate Hazelnut Vanilla candy creams. Duvalin Bi Sabor is a delicious hazelnut and vanilla flavored candy cream, which is similar to pudding in its consistency. What makes it a fun treat is that you can mix both of its vanilla and hazelnut flavors to create an even tastier treat. Its so good that you won't change Duvalin for anything! Ingredients: sugar, palm oi, skim milk subsitute, cocoa, corn starch, soy lecithin, polyglycerol polyricinoleate and artificial flavor"}, {"url": "http://www.youtube.com/watch?v=nzkElockWjY", "passage_text": "This feature is not available right now. Please try again later. http://www.clubdereposteria.com El merengue italiano es una de las cubiertas del grupo de merengues que se elaboran con base en la mezcla de claras de huevo y azucar. Este video sobre merengue italiano, muestra paso a paso como elaborar un almibar con azucar y agua para agregar a claras batidas a la nieve. Con el merengue italiano se pueden decorar tortas y postres. Se pueden hacer diversas decoraciones con espatulas o con manga y boquillas."}, {"url": "http://www.afro-fusion.com/page/397881096", "passage_text": "It is an incense stick to leaves and Poplar Llamao and roasted, is linked with myrrh, benzoin, valerian, anise and cinnamon. Binds and becomes an incense mix and pass the open letter by the smoke, then you take a little iyefa the envelope and throw it on a drip three drops of holy water and placed at the foot of Elegua. Light on a candle (white or red) above the coconut for three days at the same time. Asking Elegua order to remove the envy off the house and yourself. After three days throw at a crossroad of four corners with 3 or 21 cents (coins. TO PREPARE A LETTER TO THE FOOT OF Elegua."}]