[{"url": "http://medical-dictionary.thefreedictionary.com/middle+ear+cavity", "passage_text": "The space located between the eardrum and the inner ear that contains the three auditory ossicles, which convey vibrations through the oval window to the cochlea. Also called tympanic cavity, tympanum. It is separated from the external ear by the tympanic membrane and from the inner ear by the oval window. The auditory (eustachian) tube carries air from the posterior nasopharynx into the middle ear. Also called tympanic cavity. Compare external ear, internal ear."}, {"url": "http://medical-dictionary.thefreedictionary.com/middle+ear+cavity", "passage_text": "Middle ear. The cavity or space between the eardrum and the inner ear. It includes the eardrum, the three little bones (hammer, anvil, and stirrup) that transmit sound to the inner ear, and the eustachian tube, which connects the inner ear to the nasopharynx (the back of the nose). It is separated from the external ear by the tympanic membrane and from the inner ear by the oval window. The auditory (eustachian) tube carries air from the posterior nasopharynx into the middle ear. Also called tympanic cavity. Compare external ear, internal ear."}, {"url": "https://www.earq.com/hearing-loss/ear-anatomy/middle-ear", "passage_text": "The middle ear includes: 1  eardrum. 2  cavity (also called the tympanic cavity). 3  ossicles (3 tiny bones that are attached). 4  malleus (or hammer) long handle attached to the eardrum. 5  incus (or anvil) the bridge bone between the malleus and the stapes. 6  stapes (or stirrup) the footplate; the smallest bone in the body. "}, {"url": "https://www.boystownhospital.org/knowledgeCenter/articles/hearing/Pages/TheNormalEar.aspx", "passage_text": "The middle ear is an air-filled cavity that sits between the tympanic membrane (3) and the inner ear. The middle ear consists of the tympanic membrane (3), three tiny bones called ossicles (4), the round window (5), the oval window (6), and the Eustachian tube (7). The tympanic membrane is a very thin structure that separates the external ear canal from the middle ear space. The inner ear consists of three parts: the vestibule (9), the cochlea (10), and the semicircular canals (11). The vestibule is the central inner ear cavity, the cochlea is the organ of hearing, and the semicircular canals are part of the balance system."}, {"url": "https://en.wikipedia.org/wiki/Ear", "passage_text": "The Eustachian tube connects from the chamber of the middle ear to the back of the nasopharynx. The middle ear is very much like a specialized paranasal sinus, called the tympanic cavity; it, like the paranasal sinuses, is a hollow mucosa-lined cavity in the skull that is ventilated through the nose. In most mammals, the visible ear is a flap of tissue that is also called the pinna (or auricle in humans) and is the first of many steps in hearing. Vertebrates have a pair of ears placed somewhat symmetrically on opposite sides of the head."}, {"url": "http://medical-dictionary.thefreedictionary.com/cavity+of+middle+ear", "passage_text": "pulp cavity. the pulp-filled central chamber in a tooth; called also dental cavity. serous cavity. a celomic cavity, like that enclosed by the pericardium, peritoneum or pleura, not communicating with the outside of the body and lined with a serous membrane, i.e. one which secretes a serous fluid. tym·pan·ic cav·i·ty. An air chamber in the temporal bone, medial to the tympanic membrane, between the external acoustic meatus and the inner ear containing the ossicles. Synonym(s): cavity of middle ear."}, {"url": "http://www.betterhearing.org/hearingpedia/how-we-hear", "passage_text": "On that inner side of the tympanic membrane is an air-filled space called the middle ear cavity. It contains the bones of hearing, two muscles, a number of ligaments, a small branch of the nerve of taste, and the opening of the Eustachian tube. The ossicles are suspended from the roof of the middle ear cavity by tiny ligaments, and the malleus is connected to the tympanic membrane by a ligament, as well. In addition, there are two muscles located in the middle ear space. One is called the stapedius."}, {"url": "http://medical-dictionary.thefreedictionary.com/cavity+of+middle+ear", "passage_text": "tympanic cavity the major portion of the middle ear, consisting of a narrow air-filled cavity in the temporal bone that contains the auditory ossicles and communicates with the mastoid air cells and the mastoid antrum by means of the aditus and the nasopharynx by means of the auditory tube. tym·pan·ic cav·i·ty. An air chamber in the temporal bone, medial to the tympanic membrane, between the external acoustic meatus and the inner ear containing the ossicles. Synonym(s): cavity of middle ear."}, {"url": "https://en.wikipedia.org/wiki/Middle_ear", "passage_text": "The Middle Ear is the portion of the ear internal to the eardrum, and external to the oval window of the inner ear. Also mammalian middle ear contains three ossicles, which transfers the vibrations of the eardrum into waves in the fluid and membranes of the inner ear. The hollow space of the middle ear has also been called the tympanic cavity, or cavum tympani. The eustachian tube (also known as the auditory tube or the pharyngotympanic tube) joins the tympanic cavity with the nasal cavity (nasopharynx), allowing pressure to equalize between the middle ear and throat."}, {"url": "https://en.wikipedia.org/wiki/Ear", "passage_text": "Often the entire organ is considered the ear, though it may also be considered just the visible portion. In most mammals, the visible ear is a flap of tissue that is also called the pinna (or auricle in humans) and is the first of many steps in hearing. Vertebrates have a pair of ears placed somewhat symmetrically on opposite sides of the head. This arrangement aids in the ability to localize sound sources"}]