[{"url": "http://www.school-for-champions.com/science/infrared_greenhouse_effect.htm", "passage_text": "The atmosphere, oceans and surface of the Earth are heated by the absorption of visible light from the Sun. Those items, in turn, emit infrared radiation that is primarily absorbed by gases and water vapor in the atmosphere, increasing its temperature. This is called the Greenhouse Effect."}, {"url": "http://luc.edu/faculty/dslavsk/courses/phys478/classnotes/heating-atmosphere.pdf", "passage_text": "Solar Radiation and how the Atmosphere is Heated As the temperature profile of the Earth shows, several factors contribute to the heating of the Earth's atmosphere. To understand how the atmosphere is heated, we must first understand the nature of radiation."}, {"url": "http://www.school-for-champions.com/science/infrared_greenhouse_effect.htm", "passage_text": "Water vapor and certain gases in the atmosphere absorb infrared radiation, causing what is called the Greenhouse Effect. This infrared radiation comes from materials on the Earth's surface that have been heated by sunlight."}, {"url": "http://www.answers.com/Q/Does_the_atmosphere_gets_heated_up_by_radiation", "passage_text": "In Planetary Science. The atmosphere is heated chiefly by radiation from Earth's surface  rather than by direct solar radiation because about 50 percent of  the solar energy is absorbed at Earth' … s surface. 30 percent is  reflected back to space. 20 percent is absorbed by clouds and the  atmosphere's gases."}, {"url": "http://www.answers.com/Q/The_atmosphere_is_heated_chiefly_by_radiation_emitted_by_Earth", "passage_text": "The atmosphere is heated chiefly by radiation from Earth's surface rather than by direct solar radiation because about 50 percent of the solar energy is absorbed at Earth's surface. 30 percent is reflected back to space."}, {"url": "http://www.answers.com/Q/Does_the_atmosphere_gets_heated_up_by_radiation", "passage_text": "The atmosphere is heated chiefly by radiation emitted by Earth? The atmosphere is heated chiefly by radiation from Earth's surface  rather than by direct solar radiation because about 50 percent of  the solar energy is absorbed at Earth' … s surface. 30 percent is  reflected back to space."}]