[{"url": "http://www.investopedia.com/terms/f/foreign-exchange.asp", "passage_text": "The exchange of one currency for another, or the conversion of one currency into another currency. Foreign exchange also refers to the global market where currencies are traded virtually around-the-clock. The term foreign exchange is usually abbreviated as forex and occasionally as FX.. Next Up"}, {"url": "https://en.wikipedia.org/wiki/Student_exchange_program", "passage_text": "A student exchange program is a program in which students from a secondary school or university study abroad at one of their institution's partner institutions. A student exchange program may involve international travel, but does not necessarily require the student to study outside of his or her home country. "}, {"url": "http://www.investorwords.com/2044/foreign_exchange_rate.html", "passage_text": "Definition. Rate at which one currency may be converted into another. also called rate of exchange or exchange rate or currency exchange rate."}, {"url": "http://www.econlib.org/library/Enc/ForeignExchange.html", "passage_text": "The exchange rate is the price of foreign currency. For example, the exchange rate between the British pound and the U.S. dollar is usually stated in dollars per pound sterling ($/£); an increase in this exchange rate from, say, $1.80 to say, $1.83, is a depreciation of the dollar. The foreign exchange market is the market in which foreign currency—such as the yen or euro or pound—is traded for domestic currency—for example, the U.S. dollar."}, {"url": "http://definitions.uslegal.com/i/international-exchange-rate/", "passage_text": "International Exchange Rate Law & Legal Definition. An international exchange rate, also known as a foreign exchange (FX) rate, is the price of one country's currency in terms of another country's currency. Foreign exchange rates are relative and are expressed as the value of one currency compared to another. When selling products internationally, the exchange rate for the two trading countries' currencies is an important factor."}, {"url": "http://www.investopedia.com/terms/forex/i/international-currency-exchange-rates.asp", "passage_text": "DEFINITION of 'International Currency Exchange Rate'. The rate at which two currencies in the market can be exchanged. International currency exchange rates display how much of one unit of a currency can be exchanged for another currency. For example, for a U.S. investor, knowing the dollar to euro exchange rate is valuable when choosing European investments. A declining U.S. dollar could increase the value of foreign investments, just as an increasing U.S. dollar value could hurt the value of foreign investments. RELATED TERMS."}, {"url": "https://en.wikipedia.org/wiki/Foreign_exchange_market", "passage_text": "The foreign exchange market (forex, FX, or currency market) is a global decentralized market for the trading of currencies. This includes all aspects of buying, selling and exchanging currencies at current or determined prices. "}, {"url": "http://smallbusiness.chron.com/definition-foreign-exchange-13438.html", "passage_text": "Definition of Foreign Exchange. Foreign currency exchange is a large global financial market. Creatas/Creatas/Getty Images. The foreign exchange market plays a crucial role in global trade. Institutions such as banks can buy and sell currencies like the euro or the yuan. As a result, international trading and investments run smoothly."}, {"url": "http://www.thefreedictionary.com/foreign+exchange", "passage_text": "1. foreign exchange-the system by which one currency is exchanged for another; enables international transactions to take place. interchange, exchange-reciprocal transfer of equivalent sums of money (especially the currencies of different countries); he earns his living from the interchange of currency. Translations. "}]