[{"url": "https://en.wikipedia.org/wiki/Footspeed", "passage_text": "Footspeed, or sprint speed, is the maximum speed at which a human can run. It is affected by many factors, varies greatly throughout the population, and is important in athletics and many sports, such as association football, rugby, American football, track and field, and basketball. The average human has an almost-equal ratio of fast-twitch to slow-twitch fibers, but top sprinters may have as much as 80% fast-twitch fibers, while top long-distance runners may have only 20%. This ratio is believed to have genetic origins, though some assert that it can be adjusted by muscle training."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080110181036AA3lzXA", "passage_text": "The highest human footspeed ever recorded is 48 km/h (29.8 mph), seen during a 100 meter sprint by Asafa Powell. (His average speed over that distance was 36.96 km/h (22.95 mph) owing to the need for acceleration.) 4 to 6 seconds is average for a 40 yd dash and 12-13 seconds is average for a 100 yard. Speed depends on the following Distance of race Age Gender For example if you run the 100m in 10.00 seconds (=10 meters per second) there is no way you can acieve the same speed for anything shorter beacuse genitically human beings are build with slightly higher levels of speed endurance than acseleration speed."}, {"url": "http://www.answers.com/Q/How_fast_can_the_average_man_sprint", "passage_text": "Making the world better, one answer at a time. The average man can sprint 15. 9 miles per hour. The record holder for the fastest 100 meter is Usain Bolt. He ran at a foot speed of 27. 44 miles per hour. "}, {"url": "https://en.wikipedia.org/wiki/Footspeed", "passage_text": "The fastest human footspeed on record is 44.7 km/h (12.4 m/s or 27.78 mph), seen during a 100 meters sprint (average speed between the 60th and the 80th meter) by Usain Bolt. Maximum human sprint speed is strikingly slower than that of many animals. The average human has an almost-equal ratio of fast-twitch to slow-twitch fibers, but top sprinters may have as much as 80% fast-twitch fibers, while top long-distance runners may have only 20%. This ratio is believed to have genetic origins, though some assert that it can be adjusted by muscle training."}, {"url": "http://voices.nationalgeographic.com/2013/08/09/how-fast-can-a-human-run/", "passage_text": "The fastest human footspeed on record is 44.72 km/h (27.79 mph), seen during a 100 meters sprint (average speed between the 60th and the 80th meter) by Usain Bolt. Maximum human sprint speed is strikingly slower than that of many animals. Noone at this time can run the 100 meter dash as fast as Bolt.I heard he can hit 30m.p.h. in sprints.Anything under 10 seconds in the 100 meter is incredibly fast."}, {"url": "http://www.answers.com/Q/How_fast_can_an_average_woman_sprint", "passage_text": "The average man can sprint 15. 9 miles per hour. The record holder  for the fastest 100 meter is Usain Bolt. He ran at a foot speed of  27. 44 miles per hour. "}, {"url": "http://www.telegraph.co.uk/sport/olympics/athletics/9450234/100m-final-how-fast-could-you-run-it.html", "passage_text": "At a sprint. The fastest among us can sprint 100m at a speed of 15.9 mph, or between 13-14 seconds. That might sound fast, but it doesn’t mean we’re ready to take on the champions. The Olympic qualifying time for London 2012 was 10.18 seconds in the men’s race and 11.29 seconds for women. Walking. The average, healthy human walks at a pace of 3 mph, or 100m in 1 minute, 14 seconds; more than seven times slower than Bolt. Walking is an Olympic sport, but that doesn’t mean the athletes are taking it easy: the world record is 9.6 mph."}, {"url": "http://www.elitefeet.com/how-fast-can-humans-run", "passage_text": "The average human walking speed is in the neighborhood of 3 mph (4.8 km/h). How fast do you think you could run at a full sprint? 10 mph? 15 mph? Men's World Records Translated Into Average Speeds. It's interesting to note that the 60 meter race has a slower average speed for both men and women than the 100 meter race. This must be because accelerating at the start of a race takes some time."}, {"url": "http://www.elitefeet.com/how-fast-can-humans-run", "passage_text": "Below, I have taken several men's and women's world records and calculated the runners' average speed. Usain Bolt has averaged over 23 miles per hour in both the 100 and 200 meter events. It's interesting to note that the 60 meter race has a slower average speed for both men and women than the 100 meter race. This must be because accelerating at the start of a race takes some time. These world records were last updated on May 5, 2010. Men's World Records Translated Into Average Speed"}]