[{"url": "http://regentsprep.org/Regents/math/geometry/GT3/Ldilate2.htm", "passage_text": "dilation is a transformation (notation) that produces an image that is the same shape as the original, but is a different size. A dilation stretches or shrinks the original figure. The description of a dilation includes the scale factor (or ratio) and the center of the dilation. The center of dilation is a fixed point in the plane about which all points are expanded or contracted. It is the only invariant point under a dilation. A dilation of scalar factor k whose center of dilation is the origin may be written: Dk (x, y) = (kx, ky). If the scale factor, k, is greater than 1, the image is an enlargement (a stretch). If the scale factor is between 0 and 1, the image is a reduction (a shrink)."}, {"url": "http://www.mathwarehouse.com/transformations/dilations/dilations-in-math.php", "passage_text": "Example 1. The picture below shows a dilation with a scale factor of 2. This means that the image, A', is twice as large as the pre-image A. Like other transformations, prime notation is used to distinguish the image fromthe pre-image. The image always has a prime after the letter such as A'. Dilations can also reduce the size of shape. The picture below demonstrations a dilation of $$ \\frac{1}{2}$$ Any time that the scale factor is a fraction, the image will get smaller."}, {"url": "http://www.mathwarehouse.com/transformations/dilations/dilations-in-math.php", "passage_text": "A dilation is a type of transformation that changes the size of the image. The scale factor, sometimes called the scalar factor, measures how much larger or smaller the image is. Below is a picture of each type of dilation (one that gets larger and one that gest smaller). Dilations can also reduce the size of shape. The picture below demonstrations a dilation of $$ \\frac{1}{2}$$ Any time that the scale factor is a fraction, the image will get smaller."}, {"url": "https://en.wikipedia.org/wiki/Cervical_dilation", "passage_text": "Cervical dilation (or cervical dilatation) is the opening of the cervix, the entrance to the uterus, during childbirth, miscarriage, induced abortion, or gynecological surgery. Cervical dilation may occur naturally, or may be induced by surgical or medical means."}, {"url": "http://www.asge.org/patients/patients.aspx?id=392", "passage_text": "Esophageal dilation is a procedure that allows your doctor to dilate, or stretch, a narrowed area of your esophagus [swallowing tube]. Doctors can use various techniques for this procedure. Your doctor might perform the procedure as part of a sedated endoscopy. "}, {"url": "http://www.thebump.com/a/dilation", "passage_text": "Normally, your cervix — the opening to your uterus — is tightly shut. That’s a good thing; your cervix keeps your baby “in” while you’re pregnant. But obviously, baby eventually needs to come out. That’s where dilation comes in. At the end of your pregnancy, your cervix thins and starts to open up — this is dilation. Leading up to and during the course of labor, your cervix will dilate to around 10 centimeters, which is about equal to the diameter of a softball. (Or, not-so-coincidentally, a baby’s head"}, {"url": "http://www.virtualnerd.com/common-core/grade-8/8_G-geometry/A/3/dilation-example", "passage_text": "Note: When someone's eyes dilate, their pupils get bigger or smaller, but they always stay the same shape. Dilation in math is very similar. When you dilate a figure, you change the size of the figure without changing its shape. This tutorial introduces you to dilation. Take a look!"}, {"url": "http://study.com/academy/lesson/what-is-dilation-definition-meaning-quiz.html", "passage_text": "Dilation. The word dilation, in terms of human physiology, means to 'relax, open, or widen.' This is usually used in structures where materials are allowed to pass. Dilation is an autonomic process, which means you cannot consciously control it. Instructor: John Williams. Dilation is a key factor in regulating body processes. In this lesson, you will learn the definition of dilation, the purpose of it, and examples of its use in the body."}]