[{"url": "http://www.theartstory.org/movement-pop-art.htm", "passage_text": "Synopsis. Pop art is now most associated with the work of New York artists of the early 1960s such as Andy Warhol, Roy Lichtenstein, James Rosenquist, and Claes Oldenburg, but artists who drew on popular imagery were part of an international phenomenon in various cities from the mid-1950s onwards. By creating paintings or sculptures of mass culture objects and media stars, the Pop art movement aimed to blur the boundaries between high art and low culture. The concept that there is no hierarchy of culture and that art may borrow from any source has been one of the most influential characteristics of Pop art."}, {"url": "http://www.answers.com/Q/Which_is_considered_by_many_to_be_the_first_work_of_pop_art", "passage_text": "Pop art is the abbreviation for popular art, a style that emerged as a direct response to abstract expressionism. The style emerged in the UK and US during the 1950s and was i … nspired by everyday objects and bright colours, so that everyone could appreciate and enjoy it. Pop art is a visual art movement that emerged in the mid 1950s in Britain and in the late 1950s in the US. Pop art combines it with other objects, for contemplation.Its sort o … f a Postmodern Art. Pop art often takes as its imagery that which is currently in use in advertising"}, {"url": "http://www.osnatfineart.com/articles/pop-art.php", "passage_text": "In 1962 the world's first public exhibit of pop art was shown at the Pasadena Art Museum. The works included artists Jim Dine, Roy Lichtenstein, Andy Warhol, Robert Dowd, Phillip Hefferton, Joe Goode, Edward Ruscha, and Wayne Thiebaud. I like to think of pop are as being fun, colorful and playful. Abstract expressionism precedes pop art. An offshoot of pop are is a type of art called Lowbrow. It was started in the 70's in California, USA and is often termed pop surrealism. One of the most notable pop artists was the artist Andy Warhol (1928-1987)."}, {"url": "http://www.creativebloq.com/art/pop-art-8133921", "passage_text": "Pop Art was a visual art movement that emerged during the mid 1950s. A sign of the times, the style focused on mass production, celebrity and the expanding industries of advertising, TV, radio and print media-shaping a new cultural identity in the field of art and design. On the Balcony is an iconic piece of British Pop Art. At first glance it looks like a collage but is, in fact, a painting, beautifully composed by Peter Blake-one of the most famous British Pop Artists of the 1950s."}, {"url": "http://www.osnatfineart.com/articles/pop-art.php", "passage_text": "Pop Art is the movement in art when artists began to create art with the subject of things that are the iconic in nature such as famous people, advertising, and movies. The British and the American people were responsible for setting off this type of art in the 1950's and 60's. Abstract expressionism precedes pop art. An offshoot of pop are is a type of art called Lowbrow. It was started in the 70's in California, USA and is often termed pop surrealism. One of the most notable pop artists was the artist Andy Warhol (1928-1987)."}, {"url": "https://en.wikipedia.org/wiki/Pop_art", "passage_text": "Pop art is widely interpreted as a reaction to the then-dominant ideas of abstract expressionism, as well as an expansion of those ideas. Due to its utilization of found objects and images, it is similar to Dada. Pop art and minimalism are considered to be art movements that precede postmodern art, or are some of the earliest examples of postmodern art themselves."}, {"url": "http://www.artyfactory.com/art_appreciation/art_movements/pop_art.htm", "passage_text": "ROY LICHTENSTEIN (1923-1997). 'Whaam!', 1963 (oil and acrylic resin on canvas). Pop Art was the art of popular culture. It was the visual art movement that characterised a sense of optimism during the post war consumer boom of the 1950's and 1960's. It coincided with the globalization of pop music and youth culture, personified by Elvis and the Beatles."}, {"url": "http://www.answers.com/Q/Which_is_considered_by_many_to_be_the_first_work_of_pop_art", "passage_text": "Pop art is a visual art movement from the 50's that originated in the U.S. and Britain. This art form took images and ideas from popular culture (such as movies, television, m … agazines, comics, or current news) and emphasized them to the audience as an art form. Pop art is a visual art movement that emerged in the mid 1950s in Britain and in the late 1950s in the US. Pop art combines it with other objects, for contemplation.Its sort o … f a Postmodern Art. Pop art often takes as its imagery that which is currently in use in advertising"}, {"url": "https://en.wikipedia.org/wiki/Pop_art", "passage_text": "Among the early artists that shaped the pop art movement were Eduardo Paolozzi and Richard Hamilton in Britain, and Robert Rauschenberg and Jasper Johns in the United States. Pop art presented a challenge to traditions of fine art by including imagery from popular culture such as advertising and news. Due to its utilization of found objects and images, it is similar to Dada. Pop art and minimalism are considered to be art movements that precede postmodern art, or are some of the earliest examples of postmodern art themselves."}]