[{"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/The-Speed-of-a-Wave", "passage_text": "The Speed of a Wave. A wave is a disturbance that moves along a medium from one end to the other. If one watches an ocean wave moving along the medium (the ocean water), one can observe that the crest of the wave is moving from one location to another over a given interval of time."}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-2/The-Speed-of-a-Wave", "passage_text": "In the case of a wave, the speed is the distance traveled by a given point on the wave (such as a crest) in a given interval of time. In equation form, If the crest of an ocean wave moves a distance of 20 meters in 10 seconds, then the speed of the ocean wave is 2.0 m/s. On the other hand, if the crest of an ocean wave moves a distance of 25 meters in 10 seconds (the same amount of time), then the speed of this ocean wave is 2.5 m/s."}, {"url": "http://physics.tutorvista.com/waves/wave-speed.html", "passage_text": "The speed of the wave is not affect by its wavelength and its frequency. Rather the speed of wave is not affected by the characteristics of the wave but by the characteristics of the medium in which it is traveling."}, {"url": "http://physics.tutorvista.com/waves/wave-speed.html", "passage_text": "$D_{W}$ = distance travelled by crest or trough of the wave. T = time taken to travel the distance $D_{W}$. This equation is the speed of any particle according to the classical theory of physics and it is equally applicable to the waves due to their dual nature."}, {"url": "http://physics.tutorvista.com/waves/wave-speed.html", "passage_text": "Wave Speed. A wave is defined as a disturbance which is moved medium; for example, the wave of the ocean moves in medium water and we can see the movement of wave crest from one side to the other side in a given time period. The motion of objects is described in terms of speed which shows the fastness of the object."}, {"url": "http://physics.tutorvista.com/waves/wave-speed.html", "passage_text": "A wave is defined as a disturbance which is moved medium; for example, the wave of the ocean moves in medium water and we can see the movement of wave crest from one side to the other side in a given time period. The motion of objects is described in terms of speed which shows the fastness of the object."}, {"url": "http://www.physicsclassroom.com/class/waves/Lesson-1/What-is-a-Wave", "passage_text": "A wave can be described as a disturbance that travels through a medium from one location to another location. Consider a slinky wave as an example of a wave. When the slinky is stretched from end to end and is held at rest, it assumes a natural position known as the equilibrium or rest position."}, {"url": "http://www.bbc.co.uk/bitesize/standard/physics/telecommunications/communication_using_waves/revision/5/", "passage_text": "The speed (or sometimes you might see it called velocity) of a wave, v, is how far the wave travels in a certain time. Wave speed is measured in metres per second (m/s). All the electromagnetic waves travel at 300,000,000 metres per second (3 x 10 8 m/s)."}]