[{"url": "http://www.thinkbabynames.com/meaning/0/Kaylee", "passage_text": "Kaylee /kay-lee/ [2 sylls.] as a girls' name is pronounced KAY-lee. It is of Gaelic origin, and the meaning of Kaylee is slender. From Caollaidhe. Variant of Kayla with the popular-ley ending, much favored in spelling variants. May also be considered a combination of Kay with Lee. See also Cayla and Kaylin. Kaylee is a very popular first name for females (#1800 out of 4276, Top 42%) but a unique surname for all people. (2000 U.S. Census). Charted below is the birth name popularity of Kaylee for girls. Kaylee entered the list in 1980-1989 and reached its top rank of #26 in the U.S. in the year 2009, and is presently at #52."}, {"url": "http://www.ourbabynamer.com/meaning-of-Kaylee.html", "passage_text": "What does Kaylee mean, popularity, numerology and more. The name Kaylee is of English origin. The meaning of Kaylee is modern invented name. It is also of Irish origin, where its meaning is descendant of Caolladhe, slender and Hebrew origin, where its meaning is crown of laurels. The name Kayley is of recent origin and uncertain derivation. It is possibly a form of the Hebrew name Kayla. It may have also been derived from the Irish Gaelic name O Caollaidhe meaning descendant of Gaolladhe, a personal name drawn from the element caol, meaning slender."}, {"url": "http://www.sheknows.com/baby-names/name/kaylee", "passage_text": "The name Kaylee is a Greek baby name. In Greek the meaning of the name Kaylee is: Pure. American Meaning: The name Kaylee is an American baby name. In American the meaning of the name Kaylee is: Pure. English Meaning: The name Kaylee is an English baby name. In English the meaning of the name Kaylee is: Pure. ' Variant of Kay and Kayla 'keeper of the keys; pure. '."}, {"url": "https://en.wikipedia.org/wiki/Kaylee", "passage_text": "Kaylee (also commonly spelled Kaley, Kayley, and Kayleigh) is a female given name formed through the combination of the names Kay and Lee. Alternately, it is sometimes considered as an Anglicized version of the Gaelic ceilidh, céilidh a type of social dance or party In. scotland "}, {"url": "http://www.ourbabynamer.com/meaning-of-Kaylee.html", "passage_text": "Kaylee is a variant spelling of Kayley. The name Kayley is of recent origin and uncertain derivation. It is possibly a form of the Hebrew name Kayla. It may have also been derived from the Irish Gaelic name O Caollaidhe meaning descendant of Gaolladhe, a personal name drawn from the element caol, meaning slender."}, {"url": "http://www.meaning-of-names.com/english-names/kaylee.asp", "passage_text": "Meaning of Kaylee. English name. In English, the name Kaylee means-Variant of Katherine. Pure. Variant of Kay and Kayla keeper of the keys; pure. .. Other origins for the name Kaylee include-English, American.The name Kaylee is most often used as a girl name or female name. English Name Meaning-Variant of Katherine. Pure. Variant of Kay and Kayla keeper of the keys; pur"}, {"url": "http://www.babynology.com/meaning-kaylee-f20.html", "passage_text": "Kaylee is a female given name formed through the combination of the names Kay and Lee. Kay is an English short form of the name Katherine,which means 'pure'; while Lee means pasture, meadow in English. It means pure. It means pure. Derived From Michael. Kaylee name is the combination of the names Kay and Lee. Kay is an English short form of the name Katherine means ‘Rejoice’ and lee means “shelter from the strom” in English. So it means Rejoice for the shelter from the strom. Kaylee Name also appears in following Origin(s): Gaelic, Scottish, Celtic, Irish."}]