[{"url": "http://www.kriska.com/kriska/Portals/0/downloads/PTO_Expectations.pdf", "passage_text": "The Professional Transport Operator is responsible to manage him/herself and his/her equipment on the road in compliance with all MOT/ DOT moving regulations.  Is knowledgeable of all applicable DOT / MOT regulations for equipment operation. Operates legally with respect for these regulations at all times. PHYSICAL DEMANDS: A professional transport operator requires physical agility and stamina for pre-and post-trip inspections, hand-bombing and manual adjustments to equipment, and mental concentration for long periods of sitting and driving. Other physical demands include:  Sitting (constant for driving truck)."}, {"url": "http://jobs.virginia.gov/careerguides/TransEquipOperator.htm", "passage_text": "While Transportation Equipment Operators within the Commonwealth are all located within the Transportation Operations Career Group, individuals may want to pursue other opportunities within the Commonwealth depending upon individual training, education, knowledge, skills, abilities, and interests. The Transportation Operator III role provides a career track for the expert equipment operators having exceptional skill and accuracy in performing tasks such as excavating, landscaping, or paving."}, {"url": "http://www.kriska.com/kriska/Portals/0/downloads/PTO_Expectations.pdf", "passage_text": "The Professional Transport Operator is responsible for maintaining his/her ability to provide driving services throughout Canada and the USA at all times.  Understands and complies with all customs regulations and has no restrictions in his/her ability to enter or exit the USA because of legal or immigration issues. PHYSICAL DEMANDS: A professional transport operator requires physical agility and stamina for pre-and post-trip inspections, hand-bombing and manual adjustments to equipment, and mental concentration for long periods of sitting and driving. Other physical demands include:  Sitting (constant for driving truck)."}, {"url": "http://www.dttas.ie/roads/english/rtol-faqs", "passage_text": "Every road transport undertaking must hold an Operator Licence in order to operate for hire or reward, and one of the conditions of the licence is that the operator must have a qualified transport manager, i.e. a person who holds a CPC. Operator Licences are issued by Road Transport Operator Licensing Unit. You will need to make an application for a new licence in the name of the limited company or partnership and return the sole trader licence documents to Road Transport Operator Licensing Unit. The same requirements apply when changing from a limited company or partnership to a sole trader."}, {"url": "http://www.rahejaqbe.com/Corporate/Marine/MarineSpecialty/TransportOperatorsLiability/Insurance.html", "passage_text": "Multimodal transport operators, freight forwarders, logistic and warehouse operators, ship agents, ship brokers and other service providers in the transport and shipping industries face a wide range of liability exposures because they may: a) act for their Principal in arranging shipping and transport services; or. Transport Operator's Liability. Raheja QBE’s TRANSPORT OPERATORS’ LIABILITY product is designed specifically to cover Liability exposure of service providers in the transport and shipping industries."}, {"url": "http://www.kriska.com/kriska/Portals/0/downloads/PTO_Expectations.pdf", "passage_text": "The Professional Transport Operator is responsible to manage his/her personal utilization to achieve or exceed minimum company period mileage targets on the assigned power unit over the year.  Manages available time to be available for duty 5-6 days in a 7 day period. PHYSICAL DEMANDS: A professional transport operator requires physical agility and stamina for pre-and post-trip inspections, hand-bombing and manual adjustments to equipment, and mental concentration for long periods of sitting and driving. Other physical demands include:  Sitting (constant for driving truck)."}, {"url": "http://www.fta.co.uk/services/training/transport_manager_cpc/", "passage_text": "The Transport Manager CPC is a legal requirement of the operator licensing system for both Standard National and International licences. "}, {"url": "http://www.trios.com/lead/?section=Lead2_employmentnewstrucking", "passage_text": "Call us toll free at 1-888-222-1290. The triOS Professional Transport Operator is a unique program that combines Supply Chain and Logistics education with hands-on Tractor-Trailer operations, delivered in partnership with the Ontario Truck Training Academy (OTTA). "}, {"url": "https://ciltuk.org.uk/TrainingCPD/Training/CPC.aspx", "passage_text": "1 Demonstrate their professional competence to meet Operator Licencing requirements (Holding a CPC is one of the elements an applicant must satisfy for the Transport Commissioner to grant an ‘O’ Licence). A requirement for the granting of a standard ‘O’Licence for both freight and passenger operations is that the licence holder either holds, or has access to the services of someone who holds a Certificate of Professional Competence."}]