[{"url": "http://www.livescience.com/45192-how-do-wind-turbines-work.html", "passage_text": "One of the fastest-growing sources of energy in the world, wind turbines generate electricity without emitting greenhouse gases into the environment (unlike fossil fuels). These modern-day windmills convert mechanical energy from the wind into electrical power. Most wind turbines have three main parts: the tower (the long stem that connects to the ground); the blades, which connect to a central hub (the rotor); and the nacelle (a box behind the blades that contains the generator)."}, {"url": "http://windeis.anl.gov/guide/basics/", "passage_text": "The terms  wind energy  or  wind power  describe the process by which the wind is used to generate mechanical power or electricity. Wind turbines convert the kinetic energy in the wind into mechanical power. This mechanical power can be used for specific tasks (such as grinding grain or pumping water) or a generator can convert this mechanical power into electricity to power homes, businesses, schools, and the like. Wind is a form of solar energy. Winds are caused by the uneven heating of the atmosphere by the sun, the irregularities of the earth's surface, and rotation of the earth. Wind flow patterns are modified by the earth's terrain, bodies of water, and vegetative cover."}, {"url": "http://www.livescience.com/45192-how-do-wind-turbines-work.html", "passage_text": "The wind turbines used by utility companies to provide power to a grid are usually placed in groups or rows, called wind farms, to take full advantage of windy areas. Follow Elizabeth Palermo on Twitter @techEpalermo, Facebook or Google+ . Follow LiveScience @livescience. We're also on Facebook & Google+ . These modern-day windmills convert mechanical energy from the wind into electrical power. Most wind turbines have three main parts: the tower (the long stem that connects to the ground); the blades, which connect to a central hub (the rotor); and the nacelle (a box behind the blades that contains the generator)."}, {"url": "http://energy.gov/eere/wind/how-do-wind-turbines-work", "passage_text": "Instead of using electricity to make wind, like a fan, wind turbines use wind to make electricity. The wind turns the blades, which spin a shaft, which connects to a generator and makes electricity. The terms wind energy or wind power describe the process by which the wind is used to generate mechanical power or electricity. Wind turbines convert the kinetic energy in the wind into mechanical power."}, {"url": "https://en.wikipedia.org/wiki/Wind_turbine", "passage_text": "A wind turbine is a device that converts kinetic energy from the wind into electrical power. The term appears to have migrated from parallel hydroelectric technology (rotary propeller). The technical description for this type of machine is an aerofoil-powered generator. Onshore wind turbines are installed in low wind speed areas and getting higher and higher towers. Usual towers of multi megawatt turbines have a height of 70m to 120m and in extremes up to 160m. All turbines are rotating with a speed, that the blade tip speed reach 80 m/s to 90 m/s."}, {"url": "http://energy.gov/eere/wind/how-do-wind-turbines-work", "passage_text": "Wind turbines operate on a simple principle. The energy in the wind turns two or three propeller-like blades around a rotor. The rotor is connected to the main shaft, which spins a generator to create electricity. Click on the image to see an animation of wind at work. The terms wind energy or wind power describe the process by which the wind is used to generate mechanical power or electricity. Wind turbines convert the kinetic energy in the wind into mechanical power."}, {"url": "http://windeis.anl.gov/guide/basics/", "passage_text": "Wind Turbines. Wind turbines, like aircraft propeller blades, turn in the moving air and power an electric generator that supplies an electric current. Simply stated, a wind turbine is the opposite of a fan. Instead of using electricity to make wind, like a fan, wind turbines use wind to make electricity. Wind is a form of solar energy. Winds are caused by the uneven heating of the atmosphere by the sun, the irregularities of the earth's surface, and rotation of the earth. Wind flow patterns are modified by the earth's terrain, bodies of water, and vegetative cover."}, {"url": "http://goldpower.net/news/how-does-a-wind-turbine-generate-electricity/", "passage_text": "This is done by using a large wind turbine usually consisting of propellers; the turbine can be connected to a generator to generate electricity, or the wind used as mechanical power to perform tasks such as pumping water or grinding grain. Converting Wind to Mechanical Energy. Wind is converted by the blades of wind turbines. The blades of the wind turbines are designed in two different ways, the drag type and lift type. • Drag type: this blade design uses the force of the wind to push the blades around."}, {"url": "http://energy.gov/eere/wind/how-do-wind-turbines-work", "passage_text": "View the wind turbine animation to see how a wind turbine works or take a look inside. Wind is a form of solar energy and is a result of the uneven heating of the atmosphere by the sun, the irregularities of the earth's surface, and the rotation of the earth. The terms wind energy or wind power describe the process by which the wind is used to generate mechanical power or electricity. Wind turbines convert the kinetic energy in the wind into mechanical power."}]