[{"url": "http://www.thinkbabynames.com/meaning/1/Clarence", "passage_text": "Presented below is the baby name popularity of Clarence for boys. Clarence reached its apex rank of #17 in the U.S. during 1890-1899, but is not in the Top 1000 at the moment. (2014 Birth Statistics). Popular variation forms of Clarence listed in the Top 1000 are Clare, Clarance, Claire and Clair. The title Duke of Clarence was created for a 14th-century royal prince who married a girl from the Clare family. First used as a given name since the mid-19th century. Author Clarence Day; lawyer Clarence Darrow."}, {"url": "http://www.babynamespedia.com/meaning/Clarence", "passage_text": "Other English forms include the short form Clare, the pet forms Clair (used in French as well), Clancey, Clancy, and Clarrie, and the variant spelling Clarance. Clarence is uncommon as a baby name for boys. At the height of its usage in 1901, 1.035% of baby boys were given the name Clarence. Its ranking then was #17. The baby name has since markedly fallen in popularity, and is of only irregular use now. [ 2 syll. cla-ren-ce, cl-are-nce ] The baby boy name Clarence is pronounced KL EH R-ehNS- †. Clarence's origin is English, and its use, English and German."}, {"url": "http://www.meaning-of-names.com/english-names/clarence.asp", "passage_text": "Meaning of Clarence. English name. In English, the name Clarence means-From the surname and place name Clare, meaning bright or clear. Famous bearers: George, Duke of Clarence, brother of King Edward IV and King Richard III, who is traditionally believed to have drowned in Malmsey wine.. Other origins for the name Clarence include-English, Latin-American.The name Clarence is most often used as a boy name or male name. English Name Meaning-From the surname and place name Clare, meaning bright or clear. Famous bearers: George, Duke of Clarence, brother of King Edward IV and King Richard III, who is traditionally believed to have drowned in Malmsey wine. Origin-English"}, {"url": "http://www.sheknows.com/baby-names/name/clarence", "passage_text": "The name Clarence is an American baby name. In American the meaning of the name Clarence is: From the surname and place name Clare, meaning bright or clear. Famous bearers: George, Duke of Clarence, brother of King Edward IV and King Richard III, who is traditionally believed to have drowned in Malmsey wine. Latin Meaning: The name Clarence is a Latin baby name."}, {"url": "http://www.thenamemeaning.com/clarence/", "passage_text": "The first thing you should know if you are considering Clarence for your baby's name is that in most countries all over the world the name Clarence is a boy name. The name Clarence is of English origin, and is used mostly in English speaking countries but also in a few other countries and languages of the world. Instead, we recommend that you pay a greater attention to the origin and meaning of the name Clarence. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Clarence, spread the love and share this with your friends."}, {"url": "http://www.behindthename.com/name/clarence", "passage_text": "From the Latin title Clarensis which belonged to members of the British royal family. The title ultimately derives from the name of the town of Clare in Suffolk. As a given name it has been in use since the 19th century. "}, {"url": "http://www.ancestry.com/name-origin?surname=clarence", "passage_text": "Clarence Name Meaning. English: Clarence was the name of a dukedom created in 1362 for Lionel, third son of Edward III, whose wife was the heiress of Clare in Suffolk. How the name came to be adopted as a surname is uncertain, but it is recorded in 1453; its use as a personal name is not attested until the late 19th century."}, {"url": "http://www.thinkbabynames.com/meaning/1/Clarence", "passage_text": "Clarence /clar-ence/ [2 sylls.] as a boys' name is pronounced KLARE-ence. It is of Latin origin, and the meaning of Clarence is one who lives near the River Clare. From a Celtic river name not connected with the given name Clare. The title Duke of Clarence was created for a 14th-century royal prince who married a girl from the Clare family. First used as a given name since the mid-19th century. Author Clarence Day; lawyer Clarence Darrow."}, {"url": "http://www.ourbabynamer.com/meaning-of-Clarence.html", "passage_text": "What does Clarence mean, popularity, numerology and more. The name Clarence is of Latin origin. The meaning of Clarence is bright. It is also of English origin, where its meaning is illustrious. Clarence is generally used as a boy's name. It consists of 8 letters and 2 syllables and is pronounced Cla-rence. In the U.S. in 2014, it ranked 1027 in baby name popularity for boys with 195 occurrences. Less than 5 girls were given the name."}, {"url": "http://www.sheknows.com/baby-names/name/clarence", "passage_text": "The name Clarence is an English baby name. In English the meaning of the name Clarence is: From the surname and place name Clare, meaning bright or clear. Famous bearers: George, Duke of Clarence, brother of King Edward IV and King Richard III, who is traditionally believed to have drowned in Malmsey wine. In American the meaning of the name Clarence is: From the surname and place name Clare, meaning bright or clear. Famous bearers: George, Duke of Clarence, brother of King Edward IV and King Richard III, who is traditionally believed to have drowned in Malmsey wine. Latin Meaning: The name Clarence is a Latin"}]