[{"url": "http://www.sheknows.com/baby-names/name/reuben", "passage_text": "Biblical Meaning: The name Reuben is a Biblical baby name. In Biblical the meaning of the name Reuben is: Who sees the son; the vision of the son. American Meaning: The name Reuben is an American baby name. In American the meaning of the name Reuben is: Who sees the son; the vision of the son. Hebrew Meaning: The name Reuben is a Hebrew baby name."}, {"url": "http://www.babynamewizard.com/baby-name/boy/ruben", "passage_text": "Meanings and history of the name Ruben: | Edit. From Hebrew רְאוּבֵן (r'uven). Uvén this is The spanish version of the Name, reuben and is much more popular than Its english. Equivalent it is often Spelled. ruben rubén Meanings and history of the name Ruben: | Edit. From Hebrew רְאוּבֵן (r'uven). Uvén this is The spanish version of the Name, reuben and is much more popular than Its english. equivalent"}, {"url": "http://www.thinkbabynames.com/meaning/1/Ruben", "passage_text": "Ruben is a very popular first name for males (#203 out of 1220, Top 17%) and also a very popular last name for all people (#10532 out of 150436, Top 7%). (2000 U.S. Census). Charted below is the baby name popularity of Ruben for boys. Ruben reached its peak position of #178 in the U.S. in 1992, and is presently at #357. Displayed below is an analysis of the popularity of the boy name Ruben and related names. Popular variation forms of Ruben (#357 last year) are Reuben (#848 last year) , Ruby, Rubin and Rube."}, {"url": "http://www.thinkbabynames.com/meaning/1/Ruben", "passage_text": "Ruben /ru-ben/ [2 sylls.] as a boys' name is of Spanish origin. Variant of Reuben (Hebrew) see, a son. Displayed below is an analysis of the popularity of the boy name Ruben and related names. Popular variation forms of Ruben (#357 last year) are Reuben (#848 last year) , Ruby, Rubin and Rube."}, {"url": "http://www.sheknows.com/baby-names/name/ruben", "passage_text": "Hebrew Meaning: The name Ruben is a Hebrew baby name. In Hebrew the meaning of the name Ruben is: Behold a son. American Meaning: The name Ruben is an American baby name. In American the meaning of the name Ruben is: Behold a son. Scandinavian Meaning: The name Ruben is a Scandinavian baby name. In Scandinavian the meaning of the name Ruben is: See-a son. Spanish Meaning: The name Ruben is a Spanish baby name. In Spanish the meaning of the name Ruben is: See, a son!."}, {"url": "http://www.ohbabynames.com/meaning/name/ruben/1467", "passage_text": "Etymology & Historical Origin-Ruben. Ruben is the Scandinavian and Dutch equivalent to Reuben, which is a Hebrew name borne from the Bible. In the book of Genesis, Rueben is the eldest son of Jacob and Leah, and the first born of Jacob’s twelve sons. Popularity of the Name Ruben. Interestingly, Ruben is the preferred spelling in the United States over the more traditionally Biblical Reuben (which is the spelling mainly used in Great Britain). Perhaps it is the Americans of Hispanic and Latino descent influencing the popularity of Ruben rubén without the “first”. e"}, {"url": "http://www.chabad.org/library/article_cdo/aid/1047613/jewish/What-Does-the-Name-Reuben-Mean.htm", "passage_text": "E-mail. Discuss (3). Reuben (or Reuven, as it is pronounced in Hebrew) was the name of the oldest of Jacob 's twelve sons, fathers of the twelve tribes. The Torah records when he was given this name and as well as its meaning. But first a little background information: Jacob had intended to marry Rachel, but was tricked by his father-in-law into first marrying Leah – Reuben's mother."}]