[{"url": "http://www.trichologistbrisbane.com.au/page/oilyscalpconditions", "passage_text": "Seborrhea Oleosa is a greasy skin condition resulting from excessive secretion of sebum from the sebaceous glands. Seborrhea Oleosa on the scalp presents as oily, greasy, stringy hair that requires daily washing. The oiliness on the scalp commonly causes the scalp to be itchy and the hair to be limp. "}, {"url": "http://www.viartis.net/parkinsons.disease/news/140208.htm", "passage_text": "Those medical disorders asociated with the skin that commonly occur in Parkinson's Disease are seborrhea, hyperhidrosis, and melanoma. Seborrhea causes excessively oily skin. Sebaceous glands are glands in the skin that secrete sebum, to lubricate the skin and hair. Seborrhea can therefore result in excessive secretion of sebum by the sebaceous glands and its accumulation on the skin surface. There is an increased likelihood of seborrhea in Parkinson's Disease that is due to low dopamine. "}, {"url": "http://www.theskinstudio.com/skindisorders.html", "passage_text": "Oily skin. Oily skin is characterized by an over production of sebum (oil). A Combination of factors contribute to oily skin. These factors may be, hormone imbalance or a change in hormone levels, and hot, humid climates which may stimulate the sebaceous glands to produce more sebum. The oily skin has enlarged pores (follicles) that may be filled with dirt, dead tissue and sebum."}, {"url": "https://en.wikipedia.org/wiki/Sebaceous_gland", "passage_text": "In humans, they are found in the greatest number on the face and scalp, and are also found on all parts of the skin except the palms of the hands and soles of the feet. The type of secretion of the sebaceous glands is referred to as holocrine. In the eyelids, meibomian glands, also called tarsal glands, are a type of sebaceous gland that secrete a special type of sebum into tears. Fordyce spots are ectopic (misplaced) sebaceous glands found usually on the lips, gums and inner cheeks. The sebaceous glands are found throughout all areas of the skin except the palms of the hands and soles of the feet. There are two types of sebaceous gland, those connected to hair follicles, in pilosebaceous units, and those that exist independently."}, {"url": "http://www.essentialdayspa.com/skin-problems-c_62.htm", "passage_text": "Seborrhea is often the basis of an acne condition. Following are common disorders of the sebaceous (oil) glands: Comedones (KOM-e-donz), or blackheads, are a worm-like mass of keratinized cells and hardened sebum appearing most frequently on the face, chest, shoulders, and back. Blackheads accompanied by pimples often occur in youths between the ages of 13 and 20."}, {"url": "http://www.essentialdayspa.com/skin-problems-c_62.htm", "passage_text": "Disorders of the Sebaceous (Oil) Glands. Seborrhea (seb-o-REE-ah) is a skin condition caused by overactivity and excessive secretion of the sebaceous glands. An oily, or shiny, condition of the nose, forehead, or scalp indicates the presence of seborrhea. Following are common disorders of the sebaceous (oil) glands: Comedones (KOM-e-donz), or blackheads, are a worm-like mass of keratinized cells and hardened sebum appearing most frequently on the face, chest, shoulders, and back. Blackheads accompanied by pimples often occur in youths between the ages of 13 and 20."}, {"url": "http://www.theskinstudio.com/skindisorders.html", "passage_text": "Seborrhea. Seborrhea is a condition of the sebaceous glands in which excessive secretion or disturbed quality of sebum (oil) collects on the skin and forms an oily coating, crusts or scales accompanied with a itching or burning sensation. Treatment is designed to minimize the signs and symptoms. These factors may be, hormone imbalance or a change in hormone levels, and hot, humid climates which may stimulate the sebaceous glands to produce more sebum. The oily skin has enlarged pores (follicles) that may be filled with dirt, dead tissue and sebum."}, {"url": "http://encyclopedia2.thefreedictionary.com/Sebaceous+gland+diseases", "passage_text": "The secretion of cutaneous sebum is promoted by the contraction of the skin musculature. The musk glands of certain reptiles and mammals and the uropygial glands of birds are sebaceous glands. In humans, the most common diseases of the sebaceous glands are atheroma, acne, and seborrhea. E. S. K. Excessive secretions of sebum may be related to acne acne,common inflammatory disease of the hair follicles and sebaceous glands characterized by blackheads, whiteheads, pustules, nodules and, in the more severe forms, by cysts and scarring."}]