[{"url": "https://en.wikipedia.org/wiki/Coprolite", "passage_text": "Coprolites are classified as trace fossils as opposed to body fossils, as they give evidence for the animal's behaviour (in this case, diet) rather than morphology. Paleofaeces, on the other hand, retain much of their original organic composition and can be reconstituted to determine their original chemical properties, though in practice the term coprolite is also used for ancient human faecal material in archaeological contexts."}, {"url": "http://archaeology.about.com/od/cterms/qt/coprolites.htm", "passage_text": "Since Callen's death, coprolite studies have included the investigations of chemical, immunological protein, steroids (which determine sex), and DNA studies, in addition to phytoliths, pollen, parasites, algae, and viruses. By K. Kris Hirst. In archaeological terms, a coprolite is the name given to fossil feces, preserved human excrement discovered in an archaeological context."}, {"url": "http://www.ucmp.berkeley.edu/paleo/fossilsarchive/coprol.html", "passage_text": "By formal definition, coprolites are the fossilization or preservation of the contents of the intestine and the excrement of organisms, or quite simply they are fossilized feces. Coprolites are quite rare because they tend to decay rapidly, but when they are found, they are most commonly found among sea organisms. Coprolites of fish and reptiles are especially common. Typically nodular or contorted in appearance, coprolites are composed of pulverized indigestible remnants of the organism's food, such as portions of scales, bones, teeth or shells, hence, they are very phosphatic in composition as well."}, {"url": "https://en.wikipedia.org/wiki/Coprolite", "passage_text": "Prior to this they were known as fossil fir cones  and  bezoar stones. They serve a valuable purpose in paleontology because they provide direct evidence of the predation and diet of extinct organisms. Coprolites may range in size from a few millimetres to over 60 centimetres. Coprolites, distinct from paleofaeces, are fossilized animal dung. Paleofaeces, on the other hand, retain much of their original organic composition and can be reconstituted to determine their original chemical properties, though in practice the term coprolite is also used for ancient human faecal material in archaeological contexts."}, {"url": "http://www.ucmp.berkeley.edu/paleo/fossilsarchive/coprol.html", "passage_text": "Fossils. Window to the past. Coprolites & Gastroliths. Coprolites and gastroliths belong to the category of trace fossils. Both these types of fossilization deal with the behavior of the organism from which they came rather than the actual organism itself. Coprolites of fish and reptiles are especially common. Typically nodular or contorted in appearance, coprolites are composed of pulverized indigestible remnants of the organism's food, such as portions of scales, bones, teeth or shells, hence, they are very phosphatic in composition as well."}, {"url": "https://en.wikipedia.org/wiki/Coprolite", "passage_text": "A coprolite is fossilized feces. Coprolites are classified as trace fossils as opposed to body fossils, as they give evidence for the animal's behaviour (in this case, diet) rather than morphology. The name is derived from the Greek words κόπρος (kopros, meaning dung) and λίθος (lithos, meaning stone). Paleofaeces, on the other hand, retain much of their original organic composition and can be reconstituted to determine their original chemical properties, though in practice the term coprolite is also used for ancient human faecal material in archaeological contexts."}, {"url": "http://www.poozeum.com/coprolites.html", "passage_text": "Some of the finest coprolite specimens in the world come from the river beds and coasts of South Carolina. Fossil hunters use scuba equipment and weights to sink to the bottom of the murky rivers. Once on the river floor they use metal rods or screwdrivers to search the sediment for fossils. The most common coprolite inclusions are bones, scales, teeth, and plant fragments. This gallery features coprolites from various geographical areas with inclusions. If you want to see a modern day example of feces with inclusions-eat some corn and peanuts."}, {"url": "http://www.oxforddictionaries.com/definition/english/coprolite", "passage_text": "1 New experimental evidence on the faeces of modern fish show that faeces must be buried in less than 24 hours if they are to be preserved as coprolites in the fossil record. 2  Researchers extracted DNA from this 30,000-year-old ground sloth coprolite-fossilized dung-in a Nevada desert cave last year. 1"}, {"url": "http://www.oxforddictionaries.com/definition/english/coprolite", "passage_text": "Example sentences. 1  New experimental evidence on the faeces of modern fish show that faeces must be buried in less than 24 hours if they are to be preserved as coprolites in the fossil record. 1 Researchers extracted DNA from this 30,000-year-old ground sloth coprolite-fossilized dung-in a Nevada desert cave last year."}]