[{"url": "http://www.medicinenet.com/creatinine_blood_test/article.htm", "passage_text": "The kidneys maintain the blood creatinine in a normal range. Creatinine has been found to be a fairly reliable indicator of kidney function. Elevated creatinine level signifies impaired kidney function or kidney disease. As the kidneys become impaired for any reason, the creatinine level in the blood will rise due to poor clearance of creatinine by the kidneys. Abnormally high levels of creatinine thus warn of possible malfunction or failure of the kidneys."}, {"url": "http://answers.webmd.com/answers/1171660/what-are-normal-blood-creatinine-levels", "passage_text": "242,131 Helpful Votes. 190 Followers. A. Normal levels of creatinine in the blood are approximately 0.6 to 1.2 milligrams (mg) per deciliter (dl) in adult males and 0.5 to 1.1 milligrams per deciliter in adult females. (In the metric system, a milligram is a unit of weight equal to one-thousandth of a gram, and a deciliter is a unit of volume equal to one-tenth of a liter.). "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=creatinine_serum", "passage_text": "A normal level of creatinine depends on how much muscle mass you have. A normal level for a man is higher than it is for a woman. Children have lower levels than both men and women. Creatinine is measured in milligrams per deciliter (mg/dL). Creatinine is a normal waste product that builds up in your blood from using your muscles. Your body produces creatinine at a constant rate all the time, and healthy kidneys remove almost all of this creatinine."}, {"url": "http://www.ehow.com/about_5182878_normal-level-creatinine_.html", "passage_text": "According to Frederick Hecht, MD, the average normal levels of creatinine in men are 0.6 to 1.2 milligrams per deciliter, and 0.5 to 1.1 milligrams per deciliter in women. These numbers rarely ever change unless there is a problem. The creatinine levels are determined by muscle mass. Men will have higher levels of creatinine than women. This is due to the fact that men typically have more muscle mass"}, {"url": "http://www.medicinenet.com/creatinine_blood_test/page2.htm", "passage_text": "Normal levels of creatinine in the blood are approximately 0.6 to 1.2 milligrams (mg) per deciliter (dL) in adult males and 0.5 to 1.1 milligrams per deciliter in adult females. "}, {"url": "http://www.webmd.com/a-to-z-guides/creatinine-and-creatinine-clearance?page=3", "passage_text": "Results. Creatinine and creatinine clearance tests measure creatinine levels in your blood and urine. These tests give information about how well your kidneys are working. The creatinine clearance value is found from the amounts of creatinine in the urine and blood and from the amount of urine you pass in 24 hours. "}, {"url": "http://www.medicinenet.com/creatinine_blood_test/article.htm", "passage_text": "The creatinine levels in both urine and blood are determined and compared. Normal creatinine clearance for healthy women is 88-128 mL/min. and 97 to 137 mL/min. in males (normal levels may vary slightly between labs). Blood urea nitrogen (BUN) level is another indicator of kidney function. Elevated creatinine level signifies impaired kidney function or kidney disease. As the kidneys become impaired for any reason, the creatinine level in the blood will rise due to poor clearance of creatinine by the kidneys. Abnormally high levels of creatinine thus warn of possible malfunction or failure of"}, {"url": "http://www.medicinenet.com/creatinine_blood_test/article.htm", "passage_text": "Creatinine is a chemical waste molecule that is generated from muscle metabolism. Creatinine is produced from creatine, a molecule of major importance for energy production in muscles. Approximately 2% of the body's creatine is converted to creatinine every day. Creatinine is transported through the bloodstream to the kidneys. Elevated creatinine level signifies impaired kidney function or kidney disease. As the kidneys become impaired for any reason, the creatinine level in the blood will rise due to poor clearance of creatinine by the kidneys. Abnormally high levels of creatinine thus warn of possible malfunction or failure of"}, {"url": "http://www.davita.com/kidney-disease/overview/symptoms-and-diagnosis/what-is-creatinine?/e/4726", "passage_text": "Creatinine is a chemical waste product in the blood that passes through the kidneys to be filtered and eliminated in urine. The chemical waste is a by-product of normal muscle contractions. Creatinine is made from creatine, a supplier of energy to the muscle. A creatinine clearance test is usually ordered if the serum creatinine level is higher than normal or when a person is starting dialysis. Normal creatinine clearance for men is between 97 to 137 milliliters per minute, and women have a normal clearance of 88 to 128 milliliters per minute."}, {"url": "http://www.webmd.com/a-to-z-guides/creatinine-and-creatinine-clearance", "passage_text": "Creatinine and creatinine clearance tests measure the level of the waste product creatinine (say kree-AT-uh-neen) in your blood and urine. These tests tell how well your kidneys are working. Creatine is broken down into creatinine. Your kidneys take creatinine out of your blood and pass it out of your body in urine. If your kidneys are damaged and can't work as they should, the amount of creatinine in your urine goes down while its level in your blood goes up. Three types of tests can be done."}]