[{"url": "http://healthyeating.sfgate.com/stop-pureed-food-infants-2122.html", "passage_text": "Knowing when to stop pureed foods in your baby's diet isn't as easy as knowing when to change his diaper. There is no one-size-fits-all rule for feeding your baby -- but he'll let you know when he's ready. Adding pureed foods to your baby’s diet at around 4 months of age introduces a new world of tastes and textures. But knowing when to stop pureed foods -- usually around 1 year of age -- is important for helping your baby develop chewing and swallowing skills."}, {"url": "http://www.babycenter.com/0_age-by-age-guide-to-feeding-your-baby_1400680.bc", "passage_text": "If you want to give your baby a taste of tofu at age 6 months, go ahead, even though it's not listed on our chart until age 8 months. And while cereal is a traditional first food in the United States, it's just fine to start with mashed fruits or vegetables instead."}, {"url": "http://healthyeating.sfgate.com/stop-pureed-food-infants-2122.html", "passage_text": "If your baby does well with these foods, introduce soft, cooked vegetables and cooked fruits, breads, soft cereals, scrambled eggs and yogurt around 10 to 12 months of age. If your baby manages these soft foods easily, stop pureed foods. Ideally, your baby should not be eating pureed foods after 1 year of age."}, {"url": "http://www.webmd.com/parenting/baby/baby-food-nutrition-9/baby-food-milestones", "passage_text": "If your baby is around this age, can sit up well with support, and shows interest in the foods he sees you eating, it’s probably a good time to venture into feeding your baby solid food. If your baby is exclusively breastfed, it is recommended that you wait until he is 6 months to start solids."}, {"url": "https://answers.yahoo.com/question/index?qid=20060727111255AAJ1wvF", "passage_text": "Report Abuse. You can start when you baby shows signs that formula/breastmilk is not enough anymore. normally around 4/5 months, but every child is different. Start by giving rice cereal with their milk at the night feed and then when everything goes well, start little bit (1-2 teaspoons is fine) of pureed fruit or veg. One at a time for about 3-4 days so you can see any allergic reactions if any. Dont rush, your baby. He/she will let you know when she needs more."}, {"url": "http://www.livestrong.com/article/527184-when-should-babies-eat-meat/", "passage_text": "Babies often are ready for solid foods at 4 to 6 months. The Babycenter website says that when babies are eager to eat cereal, strained fruits and vegetables, they are ready to give meat a try. Usually this happens between 7 and 10 months of age."}]