[{"url": "http://www.answers.com/Q/Why_is_freedom_of_religion_an_important_right", "passage_text": "Freedom of religion is important because people must have the right  to believe and trust in their own religion.    Answer   Religion without freedom of or from re … ligion is tyranny. This  freedom is one of the most basic rights of man.    Answer   People need to be able to worship; or to change religions such as  when they do not feel safe in their religion, or they get  interested in another religion's history so they decide to convert."}, {"url": "http://www.answers.com/Q/Why_is_freedom_of_religion_an_important_right", "passage_text": "Yes.   Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or … the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. This  freedom is one of the most basic rights of man.    Answer   People need to be able to worship; or to change religions such as  when they do not feel safe in their religion, or they get  interested in another religion's history so they decide to convert."}, {"url": "http://www.answers.com/Q/Why_is_freedom_of_religion_important", "passage_text": "Freedom of religion is so important, because no matter what one's religion is, all religions have one thing in common: If an individual is forced to follow certain customs and … beliefs, that person is not whole-heartedly being religious. This freedom is one of the most basic rights of man. Answer. People need to be able to worship; or to change religions such as when they do not feel safe in their religion, or they get interested in another religion's history so they decide to convert."}, {"url": "http://www.answers.com/Q/Why_is_freedom_of_religion_important", "passage_text": "Freedom of religion is important because people must have the right to believe and trust in their own religion. Answer. Religion without freedom of or from religion is tyranny. This freedom is one of the most basic rights of man. Answer. People need to be able to worship; or to change religions such as when they do not feel safe in their religion, or they get interested in another religion's history so they decide to convert."}, {"url": "http://www.heritage.org/research/reports/2010/12/why-does-religious-freedom-matter", "passage_text": "Freedom engages the moral responsibility of each and every person. In a free society, religion is an ally of good government as it forms the moral character of individuals and communities. Religious freedom is a fundamental human right that ought to be enjoyed by the people of all nations. This principle has been recognized in the 1948 Universal Declaration of Human Rights and subsequent international agreements. Despite widespread recognition, many people are unable to exercise this basic liberty. While it does not mean that anything and everything done in the name of religious liberty is not subject to the rule of law, it does mean that the law ought to make as much room as possible for the practice of religious faith."}, {"url": "https://en.wikipedia.org/wiki/Freedom_of_religion", "passage_text": "Freedom of religion in Canada is a constitutionally protected right, allowing believers the freedom to assemble and worship without limitation or interference. Canadian law goes further, requiring that private citizens and companies provide reasonable accommodation to those, for example, with strong religious beliefs. Poland has a long tradition of religious freedom. The right to worship freely was a basic right given to all inhabitants of the Commonwealth throughout the 15th and early 16th century, however, complete freedom of religion was officially recognized in Poland in 1573 during the Warsaw Confederation."}, {"url": "http://www.answers.com/Q/Why_is_freedom_of_religion_an_important_right", "passage_text": "Freedom of religion is so important, because no matter what one's religion is, all religions have one thing in common: If an individual is forced to follow certain customs and … beliefs, that person is not whole-heartedly being religious. This  freedom is one of the most basic rights of man.    Answer   People need to be able to worship; or to change religions such as  when they do not feel safe in their religion, or they get  interested in another religion's history so they decide to convert."}, {"url": "https://answers.yahoo.com/question/index?qid=20080518175212AAdomtG", "passage_text": "That is why freedom of religion is so very important. It gives us to believe in Religion X or Religion Y or even Religion ABC without having to worry about being punished by our government for not following the religion it thinks we should follow. What's right for one person to believe in isn't right for another. "}, {"url": "http://youthvoices.net/discussion/why-religion-so-important-0", "passage_text": "Religion was not very important to me in the past because I thought religion is just believing in a God and believing that my God is the Saviour of the world. Being that I didn’t have a lot of background information on religion, I chose to do some research on the topic. All of this makes me think that religion is important because people could rely on it when they are feeling down, religion can also help turn a person from doing bad into doing something that will benefit him or herself in the future. 1  Add new comment. 2  Share."}]