[{"url": "https://uk.answers.yahoo.com/question/index?qid=20090808000258AAfIBCs", "passage_text": "You usually get a complimentary service a month or two after purchase .. and the book is marked accordingly ,,The fact you don't have a book will not affect the service the car gets,, Its just a record of how regularly servicing was carried out,, .."}, {"url": "http://www.honestjohn.co.uk/forum/post/index.htm?t=67481", "passage_text": "With the car having done 15k when I bought it, it was due a service 5000 miles ago and without the old service book, I've no proof that it was serviced on time and thus I fear that the remainder of the 5 year warranty (1 year) will be gone down the drain (the dealer didn't provide any warranty either)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090808000258AAfIBCs", "passage_text": "I brought a Renault Clio last year and am going in to get it serviced today and need to take the service history book. I have kept all the paper together for the car, the reg certificate, recept, policy, insurance etc but I have never been given a service history book. Where would I find this,... Source(s): find cars service history book like: https://biturl.im/YP6DD."}, {"url": "http://www.mbclub.co.uk/forums/general-discussion/132050-no-service-book.html", "passage_text": "Looking for some advice. Picked up my car 3 weeks ago from the local MB Dealer in Ayrshire (no names). Was told car had all the documentation, service book etc. I asked to confirm this as my wifes car (bought from same dealer 3 years ago) came with a replacement service book-not bad for a car 12 months old. My car is 3 years old. Have asked dealer for the missing service book and was given a bit of a run around."}, {"url": "http://www.honestjohn.co.uk/forum/post/index.htm?t=67481", "passage_text": "If it was me, id book it in at a hyundai dealer for a service and get them to supply you with a new service book that they can stamp, for piece of mind if nothing else, then from now on, you can keep your service record up to date."}]