[{"url": "http://essentialchemicalindustry.org/polymers/polymers-an-overview.html", "passage_text": "Polymers are large molecules, a type of macromolecule. Their chemical properties are similar to those of simple molecules. For example, if the polymer contains a carbon-carbon double bond, as in poly(but-1,3-diene), it will undergo additions reactions with, say hydrogen or bromine."}, {"url": "http://www.materialsworldmodules.org/resources/polimarization/2-polymers+monomers.html", "passage_text": "Polymer means many monomers. Sometimes polymers are also known as macromolecules or large-sized molecules. Usually, polymers are organic (but not necessarily). A monomer is a molecule that is able to bond in long chains. Here is a monomer: Here is a polymer: A polymer can be made up of thousands of monomer. This linking up of monomers is called polymerization. It is the long chains that give polymers their unique properti"}, {"url": "http://www.nobelprize.org/educational/chemistry/plastics/readmore.html", "passage_text": "One of the most common is the plastic grocery bag. Polyethylene is made from just ethylene monomers-but it's also possible to create polymers from two or more different monomers. You can make hundreds of different polymers depending on which monomers and catalysts you use. "}, {"url": "http://www.employees.csbsju.edu/SSAUPE/biol121/chem_biol.htm", "passage_text": "III. Life is polymeric Many macromolecules are polymers large molecules made from two or more repeating units (called monomers). As an analogy, a polymer is like a freight train with many cars. The individual cars would represent the monomers making up the polymer. "}, {"url": "http://essentialchemicalindustry.org/polymers/polymers-an-overview.html", "passage_text": "One type is produced when two or more monomers are mixed and polymerized together. Depending on the reactivities of the monomers, they may form polymers with different arrangements of the monomer units (Figure 2). SBS is an example of a block co-polymer. SBS is so named with S referring to Styrene (phenylethene) and B for Buta-1,3-diene. First, phenylethene is polymerized. Their chemical properties are similar to those of simple molecules. For example, if the polymer contains a carbon-carbon double bond, as in poly(but-1,3-diene), it will undergo additions reactions with, say hydrogen or bromine."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/21c_pre_2011/materials/molecstructpropertiesrev3.shtml", "passage_text": "Low-density polyethene. Some polymer chains have side branches. Low-density polyethene (LDPE) is like this. LDPE. The side branches stop the polymer molecules from lining up regularly. Its structure is not crystalline. This means that: 1  the material has a lower density than HDPE. 2  the forces of attraction between polymer molecules are weakened. "}, {"url": "http://chemistry.need.org/content.asp?contentid=149", "passage_text": "Polymers are very large molecules made of repeating patterns of small molecules, called monomers. Many polymers are made by repeating the same small molecule over and over again. Others are made from two monomers linked in a pattern. While most polymers with which you are familiar are man-made, there are some biological polymers – proteins, nucleic acids, and complex carbohydrates – that are fundamental to the way your body functions."}, {"url": "https://answers.yahoo.com/question/index?qid=20111115204724AAdglqt", "passage_text": "For instance polystyrene is a polymer of the styrene (C6H5CH=CH2) monomer, while polyethylene is a polymer of the Ethene molecule (CH2=CH2). The polymers form by the breaking of the double bonds, allowing the carbons involved in the double bonds to bond to one more atom, resulting in the long chained polymers. Now what makes these polymers different is the fact that polystyrene has a benzene ring attached to one of the carbons. To my knowledge while this is not a different functional group, the chemical properties of the two should remain the same, however the physical properties will change."}, {"url": "http://www.brooklyn.cuny.edu/bc/ahp/SDPS/SD.PS.polymers.html", "passage_text": "Monomers and Polymers. Monomers are small molecules, mostly organic, that can join with other similar molecules to form very large molecules, or polymers. All monomers have the capacity to form chemical bonds to at least two other monomer molecules. monomers. Polymers are a class of synthetic substances composed of multiples of simpler units called monomers. Polymers are chains with an unspecified number of monomeric units. a polymer. Homopolymers are polymers made by joining together monomers of the same chemical composition or structure. Heteropolymers are polymers composed of more than one kind of monomer. a polymer consisting of more than one type of monomer. Artificial Polymers and Special Properties. One of the first humans to discover, and make, an artificial polymer, was the German chemist Hans von Pechmann."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/bonding/structure_propertiesrev3.shtml", "passage_text": "Polymers. Polymers polymer: A polymer is a large molecule formed from many identical smaller molecules (monomers). have properties which depend on the chemicals they are made from, and the conditions in which they are made. "}]