[{"url": "http://study.com/academy/lesson/human-resource-management-vs-personnel-management.html", "passage_text": "Peter works for a company in personnel management. Personnel management is an administrative function of an organization that exists to provide the personnel needed for organizational activities and to manage the general employee-employer relationship. Let's see how Peter does it."}, {"url": "http://study.com/academy/lesson/human-resource-management-vs-personnel-management.html", "passage_text": "Personnel Management Defined. Peter works for a company in personnel management. Personnel management is an administrative function of an organization that exists to provide the personnel needed for organizational activities and to manage the general employee-employer relationship. Let's see how Peter does it."}, {"url": "http://managementstudyguide.com/personnel-management.htm", "passage_text": "1 Personnel management includes the function of employment, development and compensation-These functions are performed primarily by the personnel management in consultation with other departments. 2  Personnel management is an extension to general management."}, {"url": "http://www.answers.com/Q/What_is_the_enlisted_personnel_management_system", "passage_text": "The Enlisted Personnel Management system is a comprehensive process that supports personnel readiness."}, {"url": "http://cpol.army.mil/library/permiss/", "passage_text": "Personnel Management Information and Support System (PERMISS). PERMISS is a decision support system designed to provide general guidance and information on all areas of Army Civilian Personnel Management. This site provides easy to understand, accurate information for viewing and retrieving purposes only."}, {"url": "http://managementstudyguide.com/personnel-management.htm", "passage_text": "1 Personnel management is an extension to general management. 2  It is concerned with promoting and stimulating competent work force to make their fullest contribution to the concern. 3  Personnel management exist to advice and assist the line managers in personnel matters."}, {"url": "http://www.dms.myflorida.com/workforce_operations/human_resource_management/for_state_personnel_system_employees", "passage_text": "The State Personnel System is the largest of the state government employers within Florida. There are 31 entities in the State Personnel System and while they are governed by the same state and federal laws, the day to day operations are managed by each entity."}]