[{"url": "http://www.bankrate.com/finance/money-guides/recovering-excess-fica-payments.aspx", "passage_text": "You also can claim the overpayment if you file the shorter Form 1040A. While it's not specifically noted on the return, Form 1040A Instructions tell taxpayers to enter their Social Security tax overpayments on line 44 and write Excess SST on the line to indicate your claim. Remember, however, that claiming credit for overpaid Social Security taxes on your return doesn't guarantee you'll get a check from the Internal Revenue Service for that amount. Your excess retirement tax is considered by the IRS as part of all the taxes you've already paid."}, {"url": "http://finance.zacks.com/refund-social-security-taxes-withheld-4223.html", "passage_text": "Social Security Tax Credit. Form 1040, line 69 is where you can claim a credit for your overpayment. Add up the amounts from each of your Form W-2s for Social Security taxes withheld, and subtract $4,624.20 from that amount. The remaining amount is what you overpaid and is the amount of the Social Security tax credit you receive."}, {"url": "https://www.irs.gov/taxtopics/tc608.html", "passage_text": "Most employers must withhold Social Security tax from your wages. Certain government employers (some federal, state and local governments) do not have to withhold Social Security tax. If you work for a railroad employer, your employer must withhold Tier 1 Railroad Retirement Tax Act (RRTA) tax and Tier 2 RRTA tax."}, {"url": "https://answers.yahoo.com/question/index?qid=20080205170836AAwy66p", "passage_text": "The employer should adjust the tax for you. If the employer does not adjust the overcollection, you can file a claim for refund using IRS Form 843. If you worked for two or more employers in 2007, you may have had too much social security tax withheld from your pay. You can claim the excess social security tax as a credit against your income tax. "}, {"url": "https://www.ssa.gov/ssi/text-overpay-ussi.htm", "passage_text": "If you no longer receive SSI, we may withhold your overpayment from a Federal Income Tax refund and/or from any future Social Security benefits you may receive. If you become eligible for SSI in the future, we will withhold your overpayment from future SSI payments. "}, {"url": "http://finance.zacks.com/overpayment-social-security-taxes-2-employers-3202.html", "passage_text": "You can total your Social Security tax paid by adding the amounts in box 4 of the W-2 you receive from each employer. For example, if each employer withheld $4,200, the total paid is $8,400. Then, subtract the annual limit from the total paid to find your overpayment. In this example, subtract $4,624.20 from $8,400. For example, in 2012, the Social Security tax applied to the first $110,100 of your earned income. You'd pay the same in Social Security taxes whether your wages that year were $110,100 or $1 million."}, {"url": "https://www.irs.gov/taxtopics/tc608.html", "passage_text": "Joint returns-If you are filing a joint return, you and your spouse must figure any excess Social Security tax or Tier 1 RRTA tax separately. Employer's error-If any one employer withheld too much Social Security or RRTA tax, you cannot claim the excess as a credit against your income tax. Your employer should make an adjustment of the excess for you. If the employer does not make an adjustment, you can use Form 843 (PDF) to claim a refund. Certain government employers (some federal, state and local governments) do not have to withhold Social Security tax. If you work for a railroad employer, your employer must withhold Tier 1 Railroad Retirement Tax Act (RRTA) tax and Tier 2 RRTA tax."}, {"url": "http://finance.zacks.com/refund-social-security-taxes-withheld-4223.html", "passage_text": "Social Security Tax Basics. The Social Security tax is based on a percentage of your salary. At the time of publication, you pay 4.2 percent of your income from employment in Social Security taxes. You pay this percentage on your first $110,100 in income, for a maximum of $4,624.20 per year. Form 1040, line 69 is where you can claim a credit for your overpayment. Add up the amounts from each of your Form W-2s for Social Security taxes withheld, and subtract $4,624.20 from that amount. The remaining amount is what you overpaid and is the amount of the Social Security tax credit you receive."}, {"url": "http://finance.zacks.com/refund-social-security-taxes-withheld-4223.html", "passage_text": "Social Security taxes are withheld from the paychecks of all employees working in the United States up to the allowable maximums. Social Security tax is based on a flat percentage of salary and does not allow for deductions from your income like the income tax system, so refunds due to overpayment are rare. Form 1040, line 69 is where you can claim a credit for your overpayment. Add up the amounts from each of your Form W-2s for Social Security taxes withheld, and subtract $4,624.20 from that amount. The remaining amount is what you overpaid and is the amount of the Social Security tax credit you receive."}, {"url": "http://www.ssa.gov/pubs/EN-05-10098.pdf", "passage_text": "If you are not receiving benefits, and you do not pay the amount back, we can recover the overpayment from your federal income tax refund or from your wages if you are working. Also, we can recover overpayments from future SSI or Social Security benefits. We also will report the delinquency to credit bureaus. If you agree that you have been paid too. much and that the overpayment amount is. correct, you have options for repaying it. If you are receiving Social Security benefits, we will withhold the full amount of your. benefit each month, unless you ask for a lesser. withholding amount and we approve your. request."}]