[{"url": "http://www.healthcommunities.com/cystic-fibrosis/what-is-bronchiectasis.shtml", "passage_text": "Print. Bronchiectasis is a rare chronic lung condition resulting from recurrent or persistent inflammation that ultimately damages the walls of the bronchial tubes. The ability to expel mucus is impaired, which leads to further infection and inflammation. 1 Currently, cystic fibrosis causes one-half of all cases of bronchiectasis. 2  Other diseases that affect the lungs (such as pneumonia, chronic bronchitis, emphysema, measles, or tuberculosis) may result in bronchiectasis. 3  A congenital bronchial defect may distort or weaken the walls of the bronchial tubes"}, {"url": "http://emedicine.medscape.com/article/296961-overview", "passage_text": "Practice Essentials. Bronchiectasis is an uncommon disease, most often secondary to an infectious process, that results in the abnormal and permanent distortion of one or more of the conducting bronchi or airways. In 1950, Reid characterized bronchiectasis as cylindrical, cystic, or varicose in nature. "}, {"url": "http://www.medicalnewstoday.com/articles/185759.php", "passage_text": "Bronchiectasis, along with emphysema, bronchitis and cystic fibrosis is classified as an obstructive lung disease. Air enters and leaves the lungs through a series of branching airways called bronchial tubes (airways). Knowledge center. Bronchiectasis, also known as bronchiectasia, is a lung condition that causes persistent cough and excess phlegm (sputum); it is defined by localized, irreversible dilation (widening) of part of the bronchial tree-the airways widen, become flabby and scarred."}, {"url": "http://www.webmd.com/lung/tc/bronchiectasis-topic-overview", "passage_text": "Bronchiectasis (say brawn-kee-ECK-tuh-sus) is a lung problem in which the breathing tubes (airways) in the lungs are stretched and become larger. It starts when your airways are damaged. The damage may be caused by another health problem-usually cystic fibrosis-or a lung infection such as pneumonia or tuberculosis. Other causes include whooping cough and autoimmune problems, such as AIDS. Bronchiectasis can also be congenital, which means you were born with it."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001199/", "passage_text": "Bronchiectasis (brong-ke-EK-tah-sis) is a condition in which damage to the airways causes them to widen and become flabby and scarred. The airways are tubes that carry air in and out of your lungs. Bronchiectasis often is caused by an infection or other condition that injures the walls of the airways or prevents the airways from clearing mucus. Mucus is a slimy substance. It helps remove inhaled dust, bacteria, and other small particles from the airways."}, {"url": "http://www.medicinenet.com/bronchiectasis_acquired_congenital/page2.htm", "passage_text": "1 The most severe form of bronchiectasis and the least common form is cystic bronchiectasis. 2  This form has large air spaces and a honeycombed appearance in CT scan studies and usually has thicker walls than the blebs seen with emphysema. 3  Some people have more than one type in their lungs. "}, {"url": "https://en.wikipedia.org/wiki/Bronchiectasis", "passage_text": "Cystic fibrosis eventually results in severe bronchiectasis in nearly all cases. The cause in 10-50% of those without cystic fibrosis is unknown. The mechanism of disease is breakdown of the airways due to an excessive inflammatory response. Involved bronchi become enlarged and thus less able to clear secretions. Bronchiectasis is a disease in which there is permanent enlargement of parts of the airways of the lung. Symptoms typically include a chronic cough productive of mucus. Other symptoms include shortness of breath, coughing up blood, and chest pain. Wheezing and nail clubbing may also occur."}]