[{"url": "http://www.bbc.co.uk/food/techniques/how_to_roast_a_duck", "passage_text": "During this hour baste the duck after 30 minutes, by spooning the fat from the bottom of the roasted tray over the back of the duck. - After the hour baste again, then turn the oven back up to 220C/425F/Gas 7 and roast for a final 15 minutes to crisp the skin. "}, {"url": "http://www.epicurious.com/recipes/food/views/crisp-roast-duck-235744", "passage_text": "Roast duck, breast side up, 45 minutes, then remove from oven. Turn duck over using 2 wooden spoons, and roast 45 minutes more. Turn duck over again (breast side up), tilting duck to drain any liquid from cavity into pan. Continue to roast duck until skin is brown and crisp, about 45 minutes more (total roasting time: about 2 1/4 hours). Tilt duck to drain any more liquid from cavity into pan. Transfer duck to a cutting board and let stand 15 minutes before carving"}, {"url": "https://answers.yahoo.com/question/index?qid=20091201204353AAQsJ4t", "passage_text": "Place duck skin side up in a roasting tin and add 1 tbsp of the fat into the tin. Mix 1/2 tbsp honey with the same amount of water and brush on the duck skin. Place in oven to cook, around 25 - 35 minutes depending on how well you like the meat. Best Answer: Roast Duck. 1 duck, 4 to 5 lbs. Salt Freshly ground pepper 1/2 tsp. thyme 1 lemon 1 sm. onion, peeled Wash the duck, rub it with lemon, and rub salt and pepper into the skin along with the thyme."}, {"url": "https://answers.yahoo.com/question/index?qid=20080829121919AA88izB", "passage_text": "Position the duck on a rack placed in a roasting tray, breast side up. Pour a few cups of boiling water over the duck and into the roasting tray and place into the preheated oven. Roast the duck for up to 3 hours or until no fat remains and the skin is crispy and brown, turning the duck over after every 30 minutes."}, {"url": "http://www.food.com/recipe/roast-crisp-duck-133854", "passage_text": "1 Place duck on a rack in an open roasting pan and cook for 1 hour. 2  Set oven up to 400°F and roast 30 to 60 minutes more. 3  During this time, turn bird for even browning and baste with orange juice. 4  Remove duck from oven and drain all fat from pan. 5  Save brown drippings and 2 tablespoons fat for your sauce. "}, {"url": "http://www.youtube.com/watch?v=V3ngfyJJGHM", "passage_text": "After 15 minutes, lower the oven temperature to 350 degrees. After 45 minutes, remove duck from oven. Remove any fat that may have collected in the bottom of the roasting pan. Carefully turn duck over, place back on rack in roasting pan, and return to oven for 35 minutes. "}, {"url": "http://www.foodnetwork.com/recipes/roast-duck-recipe.html", "passage_text": "Place the onion inside the duck. Truss the bird and prick the skin. Dry thoroughly. Place the duck breast-side up in a roasting pan and place in the center rack of a 425 degree preheated oven for 15 minutes to brown lightly. Reduce the oven temperature to 350 degrees and roast for 1 additional hour to 1 hour and 25 minutes. Remove accumulated fat occasionally with a bulb baster. "}, {"url": "http://www.helpwithcooking.com/cooking-poultry/roast-duck.html", "passage_text": "1 Position the duck on a rack placed in a roasting tray, breast side up. 2  Pour a few cups of boiling water over the duck and into the roasting tray and place into the preheated oven. 3  Roast the duck for up to 3 hours or until no fat remains and the skin is crispy and brown, turning the duck over after every 30 minutes. 1 Pour a few cups of boiling water over the duck and into the roasting tray and place into the preheated oven. 2"}, {"url": "http://www.wikihow.com/Cook-a-Duck", "passage_text": "Roast the duck for about 3 hours, turning the duck every 30 minutes. 9. Remove the roasting pan from the oven and test to make sure the duck is finished cooking. 1  Insert a cooking thermometer into the thickest portion of the duck meat, either the breast or thigh. 2  Be sure the thermometer is not touching any bones. "}]