[{"url": "http://www.crab-o-licious.com/how-to-safely-store-crab.html", "passage_text": "As long as they were cooked (and I would have to beleive they were if you bought them at a store), one can keep crab on ice or better yet in the freezer for 6 months or more even if they're not cleaned. Fresh (live) crab can not be stored in the fridge. They must be kept alive in aerated water until cleaning and cooking. Putting them the fridge (or freezer) before cleaning them will cause them to die and dead crab is BAD crab."}, {"url": "http://www.marylandbluecrabexpress.com/seafood-preparation-and-handling-guide.html", "passage_text": "Crab cakes should be stored in the refrigerator for no more then 1-2 days. For longer storage, crab cakes can be stored in the freezer. Crab cakes can remain in the freezer for up to 6 months. Shrimp-Raw shrimp can be stored in the refrigerator on ice for up to 2-3 days. Shrimp should be steamed for 3-5 minutes. Steamed shrimp is best eaten cold but can be microwaved for 2-3 minutes."}, {"url": "http://www.freshfromflorida.com/Divisions-Offices/Marketing-and-Development/Consumer-Resources/Buy-Fresh-From-Florida/Seafood-Products/Stone-Crab/About-Stone-Crab-Claws", "passage_text": "Store cooked crabs and picked meat in the coldest part of your refrigerator or meat keeper at 32 degrees F and use within two days. Stone crab claws that are completely intact (occasionally claws crack during handling) can be frozen at 0 degrees F for up to six months. "}, {"url": "http://articles.latimes.com/1985-08-29/food/fo-23985_1_shelf-life", "passage_text": "Vacuum-sealed products that are pasteurized have a refrigerator shelf life of two months but, once opened, should be treated like fresh fish and used within three days. Imitation crab sold in loose form in trays in fish cases will keep in the refrigerator three to five days. When frozen, they should be used within six months. Signs of spoiled imitation crab are similar to those of fish, Kishimoto said--foul fishy smell, slimy surface and sour taste. A: Coconuts are best stored, refrigerated, at 32 to 35 degrees; they will keep well for one to two months. Address questions on food preparation to You Asked About, Food Section, The Times, Times Mirror Square, Los Angeles 90053."}, {"url": "http://www.crab-o-licious.com/refrigerating-crab1.html", "passage_text": "When you buy cooked king crab legs from the store and place them in the fridge for future consumption it's a good rule of thumb to treat them like any other meat you would purchase. We wouldn't feel comfortable keeping thawed out crab in the refrigerator before eating them, safely, any longer than 3-4 days. 5 days at the very most if they are kept stored in a drawer area, where they aren't subject to the door being opened and closed much. Return to Crab Chat."}, {"url": "http://www.chowhound.com/post/long-crab-meat-fridge-790935", "passage_text": "I have half a container of lump crab meat in the fridge. (Used half for a grilled snapper with crabmeat stuffing that was less than highly successful. DH loved it, I thought it blah.). I don't really want to freeze it, because I'd like to stuff some tomatoes with crab salad. A Google search found a couple of seafood purveyors that say it can be held in the fridge for up to 10 days."}, {"url": "http://www.thedailymeal.com/leftover-guide-how-long-can-you-keep-it", "passage_text": "You can refrigerate them for up to 5 days as long as they are stored properly — wrapped in a paper towel and then sealed inside a plastic bag. Fresh Beans/Peas: Depending on the variety, they can be kept, tightly wrapped, in the refrigerator for 3-5 days. Poultry/Ground Meats/Stew Meats/Lamb or Pork Chops: These raw ingredients can be kept, wrapped well, in the refrigerator for 1-2 days. Steak/Roasts/Large Cuts of Meat: These cuts of meat can be kept for up to 3-4 days in the refrigerator as long as they are wrapped tightly. Fish/Shellfish: Most seafood is best consumed as fresh as possible and should only be refrigerated for up to 2 days before use"}, {"url": "https://answers.yahoo.com/question/index?qid=20100815074210AAIz4sK", "passage_text": "Imitation Crab Meat-How long will it stay good in the fridge? So I bought some fake crab, opened it, ate some and sealed it in a ziplock bag 2 weeks ago. Report Abuse. i have left fake crab meat in ref. for about 2 weeks and used it. it all depends on how cold you keep your ref. i can only say open smell and if it smells good."}, {"url": "https://answers.yahoo.com/question/index?qid=20101129061008AAAMsrM", "passage_text": "Rating Newest Oldest. Best Answer: Pasteurized crab meat can be kept in the fridge for about 6 months. Fresh crab meat will keep 3-5 days in the refrigerator (surround with ice)."}]