[{"url": "http://www.answers.com/Q/How_long_does_it_take_Mars_to_rotate_on_its_axis", "passage_text": "Neptune takes 16 hours, 6 minutes and 36 seconds to rotate once on  its axis. That's about 2/3rds of an earth day.    Note that the period of rotation is measured by w … atching Neptune's  magnetic field. The time cited is the time it takes the whole  planet to rotate once on its axis. RDK-Rotation period for other planets-For Mars, the year is near … ly twice as long as ours, 686.98 days, and the rotation period is a little longer than ours, 24 hours 37 minutes 22.66 seconds (this is often erroneously listed as the length of the day)."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/53-How-long-is-a-day-on-Venus-", "passage_text": "A planet's day is the time it takes the planet to rotate or spin once on its axis. Venus rotates much more slowly than Earth does, so a day on Venus is much longer than a day on Earth. A day on Venus lasts for 243 Earth days or 5,832 hours! A day on Earth is 23.943 hours. "}, {"url": "http://www.windows2universe.org/kids_space/period.html&edu=elem", "passage_text": "All these things spin around a center point which we call an axis. This type of motion is called rotation, so the amount of time it takes an object to rotate is called a rotational period. It takes the Earth 23 hours, 56 minutes to rotate on its axis. We call the rotational period of Earth a day. Mars takes just a little longer to rotate, at 24 hours, 37 minutes. The Moon is much slower than either Earth or Mars. It takes over 655 hours for the Moon to turn just once on its axis--that's more than 27 days! Second, all the planets and moons in our solar system also move around other things. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_Mars_to_rotate_on_its_axis", "passage_text": "Mars has a rotation just a little bit longer than Earth's at 24 hours, 37 minutes and 22 seconds. (This is about 1.026 Earth days.). RDK-Rotation period for other planets-For Mars, the year is near … ly twice as long as ours, 686.98 days, and the rotation period is a little longer than ours, 24 hours 37 minutes 22.66 seconds (this is often erroneously listed as the length of the day)."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/131-How-long-is-a-day-on-Uranus-", "passage_text": "A planet's day is the time it takes the planet to rotate or spin once on its axis. Uranus rotates faster than Earth so a day on Uranus is shorter than a day on Earth. A day on Uranus is 17.24 Earth hours while a day on Earth is 23.934 hours. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_Mars_to_rotate_on_its_axis", "passage_text": "Therefore, it rotates 39 minutes more than Earth. RDK-Rotation period for other planets-For Mars, the year is near … ly twice as long as ours, 686.98 days, and the rotation period is a little longer than ours, 24 hours 37 minutes 22.66 seconds (this is often erroneously listed as the length of the day)."}, {"url": "http://www.windows2universe.org/kids_space/period.html", "passage_text": "The rotational period of an object in the solar system is the amount of time it takes for the object to complete one turn, or rotate on its axis. In addition to rotational movement, the bodies in our solar system also move around, or orbit, other bodies. Planets orbit the Sun while moons orbit around planets. The amount of time required for a planet or moon to complete one orbit around another body is called an orbital period. On Earth, we call this orbital period a year. Our year is 365.256 days. On Mars it takes 686.98 days (Earth days, that is) to complete one orbit about the Sun--that's a long time to wait between birthdays!"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_Mars_spin_on_its_axis", "passage_text": "The Sun's spin, as measured at its equator, is about 7189 km/hr. Because the Earth is orbiting the Sun, from Earth the rotation appears to take about 28 days, which is the average time for sunspots to make a complete spin. The period of this actual rotation is approximately 25.6 days at the equator and 33.5 days at the poles. However, due to our constantly changing vantage point from the Earth as it orbits the Sun, the apparent rotation of the star at its equator is about 28 days."}, {"url": "http://www.universetoday.com/14889/mars-rotation/", "passage_text": "Mars rotation is 24 hours, 39 minutes, and 35 seconds if you are interested in the solar day or 24 hours, 37 minutes and 22 seconds for the sidereal day. Since the planet only rotates about 40 minutes slower than Earth, this is one category where the two planets are not very different. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_Mars_spin_on_its_axis", "passage_text": "Take those 4 minutes a day, each day for a year, and it adds up to one extra day, or spin. It takes the earth roughly 24 hours to spin on its axis. 24 hours It takes 3minutes 56seconds less than 24hours for the Earth to spin (rotate) once on it's axis. It takes 365.2422days for the Earth to revolve once around the Sun. The period of this actual rotation is approximately 25.6 days at the equator and 33.5 days at the poles. However, due to our constantly changing vantage point from the Earth as it orbits the Sun, the apparent rotation of the star at its equator is about 28 days."}]