[{"url": "http://www.babycenter.com/0_vitamin-a-in-your-pregnancy-diet_675.bc?page=2", "passage_text": "See which nutrients you need in your pregnancy diet, from vitamin A to zinc, how to get pregnancy nutrients from food, and how... Foods and beverages to avoid during pregnancy. Print our handy chart that shows which foods and drinks are risky during pregnancy and how to safely avoid the risks. "}, {"url": "http://livewell.jillianmichaels.com/much-much-vitamin-during-pregnancy-5283.html", "passage_text": "Vitamin A is a necessary nutrient during pregnancy that contributes to your health and the development of your baby. However, like many vitamins, vitamin A can be dangerous in high doses. Overdose symptoms include headache, nausea, vomiting, drowsiness and blurred vision. According to the American Pregnancy Association, consuming too much vitamin A during the first trimester has been linked to birth defects such as nerve abnormalities."}, {"url": "http://www.nhs.uk/conditions/pregnancy-and-baby/pages/vitamins-minerals-supplements-pregnant.aspx", "passage_text": "Vitamin D in pregnancy. Vitamin D regulates the amount of calcium and phosphate in the body, which are needed to keep bones and teeth healthy. You need to take vitamin D during your pregnancy to provide your baby with enough vitamin D for the first few months of its life. Remember that eating a healthy balanced diet during pregnancy will help mothers-to-be get the vitamins and minerals they need, but there are some supplements they need to take: -10 micrograms of vitamin D throughout pregnancy and when breastfeeding."}, {"url": "http://teratology.org/pubs/vitamina.htm", "passage_text": "The National Research Council's recommended dietary allowance for vitamin A during pregnancy is 1,000 retinol equivalents (RE)/day, which is equivalent to 3,300 IU as retinol or 5,000 IU of vitamin A obtained from the typical American diet as a combination of retinol and carotenoids, e.g., beta-carotene. The recommended dietary allowance (RDA) of vitamin A during pregnancy is 1,000 RE, which is equal to 3,300 IU of retinol or retinyl esters or 5,000 U in an average U.S. diet containing a mixture of retinol and carotenoids (Food and Nutrition Board, 1980) (Table 2)."}, {"url": "http://www.babycenter.com/0_vitamin-a-in-your-pregnancy-diet_675.bc", "passage_text": "Why you need vitamin A during pregnancy. Vitamin A, a fat-soluble vitamin stored in the liver, is important for your baby's embryonic growth – including the development of the heart, lungs, kidneys, eyes, and bones, and the circulatory, respiratory, and central nervous systems. It also helps with infection resistance and fat metabolism. Vitamin A in your pregnancy diet. In this article. 1  Why you need vitamin A during pregnancy. 2  Understanding vitamin A. 3  How much vitamin A you need."}, {"url": "http://www.pregnancy.org/article/safety-vitamin-intake-during-pregnancy", "passage_text": "Vitamin A is required and essential for maintenance of normal reproductive function. The recommended daily level during pregnancy is 8,000 IU. Doses of Vitamin A, consumed as retinol of more than 10,000 IU can be harmful to unborn children. In summary, if a woman is taking a multivitamin, prenatal vitamin or Vitamin A supplements containing less than 10,000 IU (as retinol or retinyl), or beta-carotene at any dose, there is no evidence of an increase in the risk of malformations in her baby."}, {"url": "http://www.webmd.com/baby/guide/prenatal-vitamins", "passage_text": "Eating a healthy diet is always a wise idea -- especially during pregnancy. It's also a good idea during pregnancy to take a prenatal vitamin to help cover any nutritional gaps in the mother's diet. Prenatal vitamins contain many vitamins and minerals. Their folic acid, iron, iodine, and calcium are especially important"}, {"url": "http://www.babycenter.com/0_vitamin-a-in-your-pregnancy-diet_675.bc", "passage_text": "See which nutrients you need in your pregnancy diet, from vitamin A to zinc, how to get pregnancy nutrients from food, and how... Foods and beverages to avoid during pregnancy. Print our handy chart that shows which foods and drinks are risky during pregnancy and how to safely avoid the risks. Vitamin A in your pregnancy diet. In this article. 1  Why you need vitamin A during pregnancy. 2  Understanding vitamin A. 3  How much vitamin A you need."}, {"url": "http://www.babycentre.co.uk/a561818/buying-pregnancy-multivitamins", "passage_text": "As long as you're having a healthy pregnancy, there are only two vitamins you're advised to take as a supplement. They are the B vitamin folic acid and vitamin D. You shouldn't need to take supplements to get the rest of your vitamins and minerals. If they contain vitamin A at all, it will be the type of vitamin A that occurs in plants. This is called beta-carotene and is safe for your baby. If you choose to take a daily multivitamin and mineral supplement during your pregnancy, make sure it has the vitamins that are essential for your pregnancy."}]