[{"url": "http://www.answers.com/Q/How_long_does_take_to_become_a_psychiatrist", "passage_text": "This will last for around 6 years and will include assessments through out the six years. On successful completion of speciality training, you will be able to apply for a consultant post. So it will take about 13 years to become a psychiatrist, perhaps more if you do nto already have a bachelor's degree (4 years). it takes approximatly 14 years to become a professional scientist depending on how long your taking the college classes. the most it has taken normal class taking students is … 15 years. to become a basic scientist it only takes 6 years and 2 months Answer: People are generally done high school by 18."}, {"url": "http://www.wikihow.com/Become-a-Psychiatrist", "passage_text": "1 During the first four years of medical school you take classes, do lab work, and learn about medical ethics. 2  You may not have the opportunity to do hands-on psychiatry work at this stage, but earning your medical degree is a requirement in the path to becoming a psychiatrist, so stick with it. 1 You must have 1 year of inorganic chemistry, 1 year of organic chemistry, 1 year of biology, 1 year of mathematics including calculus, and 1 year of physics in order to apply for medical school. 2  Grades must be outstanding in order to secure admission. 3  For every one person admitted to medical school, 7 will be rejected."}, {"url": "http://www.youtube.com/watch?v=klMKIlouLrM", "passage_text": "The formal training for becoming a psychiatrist usually involves taking eight to 10 years of education in a number of settings. Learn about undergraduate school, medical school and residencies of psychiatrists with help from a licensed mental health counselor in this free video on psychiatry. "}, {"url": "http://www.gapmedics.com/blog/2013/12/30/how-to-become-a-psychiatrist-training-licensing-and-certification-requirements/", "passage_text": "How long does it take to become a psychiatrist? Typically, it takes about 8 years of post-undergraduate study to become a board-certified psychiatrist – 4 years to complete your M.D. degree plus another 4 years of residency. If you are interested in becoming certified in a sub-specialty area, you may have to complete a fellowship that could take an additional one to two years of post-residency work. The average annual salary for a psychiatrist in the US is $163,660."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080424123713AAPwTiI", "passage_text": "Report Abuse. 4 years of college (undergraduate work). 4 years of medical school, and a 3 year residency. As soon as you finish your residency (you generally make about $40,000/yr in residency) you will be completely ready to move into the six digits. So it will take about 13 years to become a psychiatrist, perhaps more if you do nto already have a bachelor's degree (4 years). ::::::::::::::::::::::::::::::::::::::... Source(s): http://wiki.answers.com/Q/How_long_does_... OR · 8 years ago. Thumbs up."}, {"url": "http://www.howlongdoes.com/life/how-long-does-it-take-to-become-a-psychiatrist/", "passage_text": "You can roughly estimate the time for how long does it take to become a psychiatrist by the idea that the bachelor’s degree will take you 4 years to complete which will be followed by 4 years of tireless education in medical school. Once you have cleared that in flying colors you are left with 4 years of residency. Psychiatrists are easily the coolest doctors. This branch of medicine also happens to be very old and the organization that looks after the professional work and has been active for a time period of 150 years is called as American Psychiatric Association (APA)."}, {"url": "http://www.gapmedics.com/blog/2013/12/30/how-to-become-a-psychiatrist-training-licensing-and-certification-requirements/", "passage_text": "In order to become a psychiatrist, you must complete all of the requirements to become a medical doctor from an accredited school of medicine. After you have obtained you M.D. degree, you will need to complete a 4 year residency program with at least three of these years spent specifically in the practice of psychiatry. If you are interested in becoming certified in a sub-specialty area, you may have to complete a fellowship that could take an additional one to two years of post-residency work. The average annual salary for a psychiatrist in the US is $163,660."}, {"url": "http://www.howlongdoes.com/life/how-long-does-it-take-to-become-a-psychiatrist/", "passage_text": "Before getting to know that how long does it take to become a psychiatrist we should understand what a psychiatrist is and what does he do. A psychiatrist is a doctor daring enough to deal with mental illnesses and their treatment. Psychiatrists are easily the coolest doctors. This branch of medicine also happens to be very old and the organization that looks after the professional work and has been active for a time period of 150 years is called as American Psychiatric Association (APA)."}, {"url": "http://www.learnhowtobecome.org/psychiatrist/", "passage_text": "The first step to becoming a psychiatrist is to earn a bachelor’s degree from an accredited institution. In preparation for medical school, a good choice would be to focus on pre-med, physical sciences or psychology — or a combination of the three by utilizing a double major or minor. Students who enter medical school can choose between two designations to eventually become a psychiatrist: a Doctor of Medicine (MD) program or a Doctor of Osteopathic Medicine (DO) program. Each degree focuses on the same methods of treatment, but a DO degree also focuses on osteopathic manipulative medicine."}]