[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/10548186", "passage_text": "The study population was similar to that of other studies of pediatric intensive care. The PICU was 86% efficient. The total cost for PICU care was $16,983,323. Average cost per admission was $12,342 +/- $22,313, and average cost per patient day was $2,264 +/- $868. The cost because of the PICU location (room cost) was 52.1% of all costs, and cost of laboratory studies was 18.3%."}, {"url": "http://www.livescience.com/39510-icu-treatment-overused.html", "passage_text": "The average cost of one day of futile treatment in the ICU was $4,004 per patient. The cost of caring for the 123 patients whose treatment was perceived as being futile, both in and out of the ICU, was $2.6 million, the researchers found."}, {"url": "http://newsroom.ucla.edu/releases/researchers-explore-frequency-248172", "passage_text": "The average cost for a day of futile treatment in the ICU was about $4,000, the researchers found. For the 123 patients perceived as receiving futile ICU care, total costs during the three months of the study amounted to $2.6 million for the five ICUs."}, {"url": "http://link.springer.com/content/pdf/10.1007/BF03010674.pdf", "passage_text": "Respective cost per day values for non-ICU (ward) care were $232 and $281. Differences in cost per day were $1,152 for medical survivors and $1,220 for surgical survivors. The mean ratios of ICU to non-ICU cost per day for survivors were 6.2 for surgical cases and 7.2 for medical cases. The 95% confidence intervals for the difference mean cost per day between ICU and non-ICU cost per day were $1,201 and $1,356 for surgical survivors, and $1,154 and $1,294 for med"}, {"url": "http://www.aast.org/GeneralInformation/mechanicalventilation.aspx", "passage_text": "-A total of 44.6% had at least one major co-morbid condition; the most common co-morbidities included diabetes (13.2 %) and pulmonary disease (13.2%). -Daily incremental cost of mechanical ventilation for ICU patients is estimated at between $600 and $1500 per day."}, {"url": "https://www.debt.org/medical/hospital-surgery-costs/", "passage_text": "Hospital and Surgery Costs. Total health care spending in America was approximately $2.7 trillion in 2011. A little over 31 percent of that amount, or $814 billion, was spent on hospital services. Hospital costs averaged $3,949 per day, and costs per stay averaged $15,734. According to the U.S. Centers for Disease Control and Prevention (CDC), the total number of inpatient surgeries performed in 2009 was 48 million."}, {"url": "http://link.springer.com/content/pdf/10.1007/BF03010674.pdf", "passage_text": "The ICU direct costs per day for survivors were between six and seven times those for non-ICU care. A one day substitution of general ward for ICU care would result in a cost reduction of $1,200 per patient for survivors."}]