[{"url": "http://www.history.com/topics/black-history/civil-rights-movement", "passage_text": "Many leaders from within the African American community and beyond rose to prominence during the Civil Rights era, including Martin Luther King, Jr., Rosa Parks, Malcolm X, Andrew Goodman and others. They risked—and sometimes lost—their lives in the name of freedom and equality. Introduction. Nearly 100 years after the Emancipation Proclamation, African Americans in Southern states still inhabited a starkly unequal world of disenfranchisement, segregation and various forms of oppression, including race-inspired violence."}, {"url": "http://tvone.tv/4513/five-tragic-deaths-of-the-civil-rights-movement/", "passage_text": "Learn the names and stories of five black men who helped shape the civil rights movement in life and death. 5. James Earl Chaney. James Earl Chaney was a young black man born and raised in Meridian, Mississippi. (Originally published on 03.01.2012). If you ask a friend to name someone from the Civil Rights Movement, most will probably name Martin Luther King, Jr. and there’s no questioning the legacy left behind by MLK and his impact on the African-American Civil Rights Movement."}, {"url": "http://www.infoplease.com/spot/civilrightstimeline1.html", "passage_text": "According to King, it is essential that the civil rights movement not sink to the level of the racists and hatemongers who oppose them: We must forever conduct our struggle on the high plane of dignity and discipline, he urges. "}, {"url": "http://www.sparknotes.com/history/american/civilrights/terms.html", "passage_text": "A civil rights leader during the 1950 s and 1960 s who fought to protect the rights of blacks in the South. King rose to national fame after he took charge of the Montgomery bus boycott in 1955. An amazing speaker, he quickly became the de facto leader of the civil rights movement. Dwight D. Eisenhower. The least supportive president of the civil rights movement in the mid–twentieth century. Eisenhower refused to endorse or comment publicly on the Supreme Court’s decision in Brown v. Board of Education and even privately admitted that he regretted appointing Chief Justice Earl Warren to the bench."}, {"url": "http://www.history.com/topics/black-history/civil-rights-movement", "passage_text": "Post 1960′s Civil Rights Movement. Severe government repression, the assassinations of Malcolm X and Martin Luther King, and the intense infighting within the black militant community caused a decline in protest activity after the 1960s. Introduction. Nearly 100 years after the Emancipation Proclamation, African Americans in Southern states still inhabited a starkly unequal world of disenfranchisement, segregation and various forms of oppression, including race-inspired violence."}, {"url": "http://www.myblackhistory.net/Civil_Rights.htm", "passage_text": "Rosa Parks, Martin Luther King, Malcolm X are some of the names that come to mind when we think of the Civil Rights Movement. But the movement was made of hundreds of heroes, some famous, and some only known to their families and localities. That day Rosa Parks, Martin Luther King Jr., and thousands of Black Americans rode the buses and sat at the front. On February 1, 1960, four students from North Carolina Agricultural and Technical College in Greensboro launched a radical new phase of the civil rights movement."}, {"url": "http://www.infoplease.com/spot/bhmheroes1.html", "passage_text": "Learn about the heroes of the American civil rights movement, including Rosa Parks, Martin Luther King, Jr., Thurgood Marshall, and more. Rosa Parks, seated on a Montgomery bus. The civil rights movement of the 1950s and 1960s challenged racism in America and made the country a more just and humane society for all. Below are a few of its many heroes."}, {"url": "http://www.aarp.org/politics-society/history/info-2014/female-civil-rights-leaders.html", "passage_text": "On Dec. 1, 1955, Parks was arrested after she refused to obey a bus driver and give her seat to a white passenger in Montgomery, Ala. Her act of defiance, and the 381-day bus boycott that followed, soon became keystones of the modern civil rights movement. En espanol | Español in a largely-behind-the scenes career that spanned more than five, Decades baker worked with many famous civil rights, leaders including The. Rev Martin Luther King., Jr Thurgood marshall And. A Philip. randolph"}, {"url": "http://www.history.com/topics/black-history/civil-rights-movement", "passage_text": "Civil Rights Movement. 1  Contents. 2  Background. 3  Montgomery Bus Boycott and the Southern Christian Leadership Conference, 4  Birmingham and the March on Washington. 5  Freedom Summer. 6  Selma to Montgomery March. 7  Rise of Black Nationalism. 8  Post 1960′s Civil Rights Movement. 9  Print. 10  Cite. Introduction. Nearly 100 years after the Emancipation Proclamation, African Americans in Southern states still inhabited a starkly unequal world of disenfranchisement, segregation and various forms of oppression, including race-inspired violence."}, {"url": "http://mashable.com/2015/02/05/civil-rights-women/", "passage_text": "Everyone knows the boldfaced icons of the civil rights movement: MLK, Jr. and Malcolm X. However, there are so many names deserving of praise. While some women loom large in the canon — Coretta Scott King and Rosa Parks among them — there are many whose voices and actions were just as powerful. 8. Once dubbed the Mother of the Movement by none other than Martin Luther King, Jr. himself, Septima Clark was a teacher and leader in the education realm. The South Carolina native began volunteering for the NAACP in 1919, going on to lead civil rights workshops in Tennessee."}]