[{"url": "http://www.youtube.com/watch?v=_wROGTfgxXs", "passage_text": "Please try again later. This video describes about methods to study mineral requirements of plants, plants could be grown to maturity in a defined nutrient solution in complete absence of soil. This technique of growing plants in a nutrient solution is known as hydroponics."}, {"url": "http://www.aces.uiuc.edu/vista/html_pubs/hydro/require.html", "passage_text": "Mineral Nutrients. Green plants must absorb certain minerals through their roots to survive. In the garden these minerals are supplied by the soil and by the addition of fertilizers such as manure, compost, and fertilizer salts."}, {"url": "http://www.studymode.com/essays/Mineral-Requirements-Of-Plants-102931.html", "passage_text": "With the study of hydroponics and how plants required certain amount of mineral they can be manipulated to yield a higher quality and quantity produce. The use of hydroponics have been as early as the seventeenth century in England and France where mint plants were grown with out the use of soil."}, {"url": "http://www.studymode.com/essays/Mineral-Requirements-Of-Plants-102931.html", "passage_text": "With the worlds population growing constantly quicker and more reliable ways to produce foods need to be made. Through hydroponics more plants and crops can be created in a shorter amount of time. Hydroponics is an excellent method of conducting research with controlled conditions of nutrient availability.."}, {"url": "http://biology-igcse.weebly.com/plants-mineral-requirements-and-fertilisers.html", "passage_text": "#47 Plant's mineral requirements and fertilisers. Plant is in need for mineral ions to control chemical activities, grow, and produce materials. The most important minerals are Magnesium ions and Nitrates. Plants need minerals for healthy growth."}, {"url": "http://plantphys.info/plant_physiology/minerals.shtml", "passage_text": "The mineral particles in soil can be solid bedrock pieces, boulders scraped from bedrock by glaciers, rocks, stones, and even gravel. But these particles are too large to be interacting well with plant roots."}, {"url": "http://biology-igcse.weebly.com/plants-mineral-requirements-and-fertilisers.html", "passage_text": "Nitrogen fertilisers. Sometimes the soil is lacking of the mineral ions needed, this problem can be solved by adding fertilisers to the soil. Fertilisers are chemical compounds rich in the mineral ions needed by the plants."}, {"url": "http://www.els.net/WileyCDA/ElsArticle/refId-a0023717.html", "passage_text": "Several inorganic minerals are essential for plant growth and these are usually obtained by roots from the soil. Availability of minerals in the soil is determined by the physical and chemical characteristics of the soil."}]