[{"url": "http://www.wikihow.com/Make-Female-Friends", "passage_text": "Find friends that like the same things as you, so join clubs, online groups, and just go out places. If you chose something you hate, your future friends' hobbies will bore you. 1 Don't worry about what others think. 2  Its your life, live it. 3  Good hygiene is always a plus. 4  Try Hards = Fail Hards. 5  If you love sports, go to some sort of sports complex and try talking to the more athletic girls. 6  You will have more in common and lots more to talk about. 7  Remember Be a friend to get a friend."}, {"url": "http://www.wikihow.com/Make-Female-Friends", "passage_text": "Tips. 1  BE YOURSELF. 2  Don't worry about what others think. 3  Its your life, live it. 4  Good hygiene is always a plus. 5  Try Hards = Fail Hards. 6  If you love sports, go to some sort of sports complex and try talking to the more athletic girls. 7  You will have more in common and lots more to talk about. 1 Don't worry about what others think. 2  Its your life, live it. 3  Good hygiene is always a plus. 4  Try Hards = Fail Hards. 5  If you love sports, go to some sort of sports complex and try talking to the more athletic girls. 6  You will have more in common and lots more to talk about. 7  Remember Be a friend to get a friend."}, {"url": "http://www.girlfriendsocial.com/", "passage_text": "Welcome To Girlfriend Social.. Girlfriend Social is website that connects women with new female friendships. This website is for Ladies only, who just like you, are looking to make platonic women friendships. Inside women can make new friends with fabulous ladies in a safe and friendly environment. It doesn't matter if you're single or married, 20 or 60, All women who are looking for friendships are welcome here. If you are a woman over 18 who is in a 'M4' category-Moved, Married, Motherhood-or you simply are looking for More Friends to be part of your girlfriend circles of friendship, You are in the right place!"}, {"url": "http://www.rachelwilkerson.com/2012/01/04/how-to-make-adult-women-friends/", "passage_text": "A lot of people have e-mailed me over the past year or so asking for advice on how to make female friends after college, and I noticed this point in my 2012 verb post attracted a lot of attention — apparently a lot of you just moved to new cities and are feeling a bit lonely! Come up with good date ideas. Unlike dating, when you might expect the other person to ask you out and make the plans, you have to be a bit more aggressive with other women. Don’t just say, “We should get together sometime!” If a guy said that to me, I’d think, Eh. Whatever."}, {"url": "http://www.sosuave.com/rondavid/succeed18.htm", "passage_text": "Some women keep you as a friend because you've been too scared to make your romantic interest known, or you've made a bunch of bonehead mistakes, and alienated her (at least temporarily) from being romantic. Perhaps you've made fart jokes, said callous things, or treated her like a buddy; nothing too serious. If you want to turn a friend into a lover, it is crucial beyond words that she not be your one-and-only-hope for sex. You MUST be pursuing other women, flirting with other women, romancing other women, and being sexual with other women."}, {"url": "http://www.wikihow.com/Make-Female-Friends", "passage_text": "Tips. 1  BE YOURSELF. 2  Don't worry about what others think. 3  Good hygiene is always a plus. 4  Try Hards = Fail Hards. 5  If you love sports, go to some sort of sports complex and try talking to the more athletic girls. 6  Remember Be a friend to get a friend.. 7  Chin Up, Hottie. 8  If you are not having fun with your friend, they may not be your type. 1 Don't worry about what others think. 2  Its your life, live it. 3  Good hygiene is always a plus. 4  Try Hards = Fail Hards. 5  If you love sports, go to some sort of sports complex and try talking to the more athletic girls. 6  You will have more in common and lots more to talk about. 7  Remember Be a friend to get a friend."}, {"url": "https://www.socialjane.com/", "passage_text": "SocialJane.com is a women's-only friendship website, where women meet new friends everyday! Join us-and start to meet new friends-quickly and easily. "}, {"url": "http://www.wikihow.com/Make-a-Female-Friend-Love-You", "passage_text": "3. You should not listen to her problems because you will surely remain only a friend, you will be like her female friends. Instead you should tease her and what I mean by this is to make her laugh while maintaining a high status. Simply say to her You probably are not such a good kisser this will set a challenge in her mind, and women love challenges. This will do magic for her. Then tell her close your eyes and get closer to her like you would kiss her, but don't do it yet. Another magic move, that will make her desire you much more."}]