[{"url": "http://www.softschools.com/examples/science/chemical_energy_examples/18/", "passage_text": "1. Cold packs used in sports are examples of chemical energy. When the inner pouch is broken which is filled with water it reacts with the ammonium nitrate granules and makes new chemical bonds during the reaction absorbing energy from the surroundings."}, {"url": "http://chemteacher.chemeddl.org/services/chemteacher/index.php?option=com_content&view=article&id=38", "passage_text": "The oil industry uses chemical reactions such as cracking of petroleum. The military uses chemical reactions in the gas bomb. Plastic making involves chemical changes with the composition of polymers. Turning fat or oil and alkaline solution into a bar of soap, widely used in soap industry, is a chemical change. Reactions in the human body such as digestion, turning food into glucose, ATP, ADP formation, etc., are chemical changes. Chemical changes even occur in art."}, {"url": "http://www.d123.org/olhms/kguerrero/documents/DSection3.4.pdf", "passage_text": "The same type of material is used in the printing of books and newspapers. A similar reaction occurs in photocopiers and laser printers. This is an example of how one type of chemical reaction has helped change industry and society in important ways."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/applications-redox-reactions-industry-oxidation-reduction-reactions-commonly-known-redox-r-q1833669", "passage_text": "Applications of redox reactions in industry. Oxidation-reduction reactions, commonly known as redox reactions, are an important class of chemical reactions encountered in everyday processes. Redox reactions are used in a wide range of industrial applications."}, {"url": "http://sciencelearn.org.nz/Contexts/Nanoscience/Science-Ideas-and-Concepts/Chemical-reactions-and-catalysts", "passage_text": "Chemical reactions and catalysts. A chemical reaction involves a chemical change, which happens when two or more particles (which can be molecules, atoms or ions) interact. For example, when iron and oxygen react, they change to a new substance, iron oxide (rust)."}, {"url": "http://chemistry.about.com/od/chemicalreactions/a/reactiontypes.htm", "passage_text": "A chemical reaction is a process that is usually characterized by a chemical change in which the starting materials (reactants) are different from the products. Chemical reactions tend to involve the motion of electrons, leading to the formation and breaking of chemical bonds."}]