[{"url": "http://www.browsebiography.com/bio-stephen_curry_basketball.html", "passage_text": "Email Print. is an American professional basketball player with the Golden State Warriors of the National Basketball Association. A point guard, who at times plays shooting guard, Curry is listed as 6 ft 3 in (1.91 m) and 185 lb (84 kg) and wears size 14 (US) shoes. NBA CAREER : "}, {"url": "http://www.evevi.com/140-stephen-curry-mother-ethnicity.html", "passage_text": "Creole could be of caucasian, french, african, spaniard, native america, mix ancestry. The baby face sharpshooter is of mix race. His dad Wardell stephen curry ethnicity is a retired American professional basketball player and played in the NBA as well. All of the family siblings are into sports. His brother Seth plays college basketball and her sister is a college volleyball player. A lot of people are confuse and ask what is the race or ethnicity of Stephen Curry. steph curry mom ethnicity Well here is the answer. The American NBA basketball player was born to an African American father and a Caucasian but African America Croele mother just like Beyonce's mom"}, {"url": "http://nbafamily.wikia.com/wiki/Sonya_Curry", "passage_text": "Sonya Adams Curry (born May 30, 1966) is a former American volleyball player for Virginia Tech and is the wife of former NBA player Dell Curry. Sonya Curry, a former American volleyball player for Virginia Tech, was born on May 30, 1966 to Candy Adams and has a brother Cleive Adams and a sister India Adams. India Adams played basketball at Belmont Abbey College. Sonya is an African American Creole and Haitian ethnic background from both her parents side"}, {"url": "http://nbainternational.blogspot.com/2014/01/is-stephen-curry-black-or-white-race-or.html", "passage_text": "The baby face sharpshooter is of mix race. His dad Wardell Stephen Dell Curry is a retired American professional basketball player and played in the NBA as well. All of the family siblings are into sports. His brother Seth plays college basketball and her sister is a college volleyball player. Stephen's mother, Sonya Curry is also a former volleyball player. "}, {"url": "http://theurbandaily.com/2013/04/17/who-is-ayesha-alexander-curry/", "passage_text": "Who is Stephen Curry’s wife? Stephen Curry is married to Ayesha Alexander, a former model and actress. The Golden State Warriors guard met his beautiful wife when the two were teenagers in Charlotte, N.C."}, {"url": "http://nbafamily.wikia.com/wiki/Ayesha_Curry", "passage_text": "Ayesha Curry. 161 pages on this wiki. Ayesha Alexander Curry (born March 23, 1989) is a former Canadian-American actress and model and is wife of NBA Most Valuable Player Award winner, Stephen Curry, a professional basketball player for the Golden State Warriors. "}, {"url": "http://www.biography.com/people/stephen-curry", "passage_text": "Synopsis. Born in Ohio in 1988 to former NBA player Dell Curry, Stephen Curry garnered national attention for his impressive play at Davidson College. Drafted in 2009 by the Golden State Warriors, he developed into one of pro basketball's top players with his stellar shooting skills. "}, {"url": "http://ethnicelebs.com/stephen-curry", "passage_text": "by ethnic on. Birth Name: Wardell Stephen Curry II. Birthplace: Akron, Ohio, United States. Date of Birth: March 14, 1988. Ethnicity: African-American. Stephen Curry is an NBA player who was born to former NBA player, Dell Curry and former volleyball player Sonya Curry. A picture of his parents can be seen below. Top photo by Keith Allison from Hanover, MD, USA (Stephen Curry) [ CC BY-SA 2.0 ], via Wikimedia Commons. Tagged as: 9 NBA, African "}]