[{"url": "http://businessfinder.syracuse.com/1742677/Fleetpride-Syracuse-NY", "passage_text": "Fleet Pride can be found at Spencer St 805. The following is offered: Trucks. The entry is present with us since Sep 7, 2010 and was last updated on Nov 12, 2013. In Syracuse there are 6 other Trucks. An overview can be found here. Fleetpride, Inc is located at the address 805 Spencer St in Syracuse, New York 13204. They can be contacted via phone at (315) 475-7248 for pricing, hours and directions. Fleetpride, Inc specializes in Luxury, Domestic, Trucks. Fleetpride, Inc has an annual sales volume of 5M – 9,999,999."}, {"url": "http://www.fleetcare.info/", "passage_text": "FleetCare Truck Service Centers specialize in heavy-duty truck repair and maintenance. The FleetCare network spans the U.S. with over 240 state-of-the-art, fully-equipped locations, staffed with highly-trained technicians who are true heavy-duty experts. Specialization, expediency and quality. We Live and Breathe Heavy Duty."}, {"url": "http://fleetpride.com/contact-us", "passage_text": "600 E. Las Colinas Boulevard Suite 400 Irving, Texas 75039 469.249.7500 main 866.4.FLEETPRIDE toll free 866.435.3387 214.932.8500 fax. "}, {"url": "http://www.hoursmap.com/n/fleet+pride-hours-locations-s1280160", "passage_text": "Headquartered in The Woodlands, Texas, FleetPride is the nation’s largest independent distributor of heavy-duty truck and trailer replacement parts, with over 185 branches spanning the country. "}, {"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=169824", "passage_text": "FleetPride, Inc. announced that it has opened its second branch in the greater Charlotte, North Carolina, metro area. Located at 155 Corporate Boulevard in Indian Trail, its southeastern metro location just off Highway 74 is also well situated to serve customers in nearby Monroe. FleetPride, Inc. announced that Don Sturdivant has been selected by the Board of Directors to serve as the new CEO of the company. Serving most recently as the interim CEO and as a member of the FleetPride Board of Directors since April of 2014."}, {"url": "http://www.bbb.org/east-texas/business-reviews/recreational-vehicles-dealers/fleet-pride-in-kilgore-tx-28038953", "passage_text": "Fleet Pride Inc is not BBB Accredited. Businesses are under no obligation to seek BBB accreditation, and some businesses are not accredited because they have not sought BBB accreditation. To be accredited by BBB, a business must apply for accreditation and BBB must determine that the business meets BBB accreditation standards, which include a commitment to make a good faith effort to resolve any consumer complaints."}, {"url": "http://www.indeed.com/cmp/Fleetpride", "passage_text": "Founded in 1949, the company boasts 18 locations in Minnesota, Wisconsin, the Dakotas, and Illinois. The CATCO acquisition follows several other 2012 deals. FleetPride took over all of the US operating assets of Canada-based Fleet Brake. While terms of the deal with TPG were not disclosed, Investcorp, which acquired Fleetpride in mid-2006 for $506 million, was reported to be seeking as much as $1 billion for Fleetpride."}, {"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=169824", "passage_text": "Branch Manager Mike Morris and his team of heavy-duty parts experts also have direct access to one of the industry's inventories of regular stock and specialty products through the company's national network of branches and regional distribution centers. FleetPride, Inc. announced that Don Sturdivant has been selected by the Board of Directors to serve as the new CEO of the company. Serving most recently as the interim CEO and as a member of the FleetPride Board of Directors since April of 2014."}, {"url": "http://www.bloomberg.com/research/stocks/private/snapshot.asp?privcapId=169824", "passage_text": "The company provides heavy-duty truck and trailer parts for use in brake and wheel end, drivetrain, engine components, hydraulics, suspension, and electrical applications. It serves customers in freight and shipping, leasing services, agriculture, food and beverage, construction, and waste management industries. FleetPride, Inc. announced that Don Sturdivant has been selected by the Board of Directors to serve as the new CEO of the company. Serving most recently as the interim CEO and as a member of the FleetPride Board of Directors since April of 2014."}, {"url": "http://www.indeed.com/cmp/Fleetpride", "passage_text": "About Fleetpride. For FleetPride, bigger is better. The company is one of the largest independent distributors of heavy-duty truck and trailer parts in the US; it offers hefty parts for buses, tractor-trailers, waste-disposal trucks, and large off-road vehicles, as well as repair and maintenance services. While terms of the deal with TPG were not disclosed, Investcorp, which acquired Fleetpride in mid-2006 for $506 million, was reported to be seeking as much as $1 billion for"}]