[{"url": "https://bca.gov.sg/Publications/EnhancementSeries/others/design2Ch3.pdf", "passage_text": "Homogeneous tiles Homogeneous tile is a form of ceramic tile composed of fine porcelain clays but fired at much higher temperatures than ceramic tile. This process makes homogeneous tiles denser, harder, less porous and therefore less prone to moisture and stain absorption than ceramic tiles. "}, {"url": "http://thepropertizer.blogspot.com/2010/09/homogeneous-tiles-vs-ceramic-tiles.html", "passage_text": "Homogeneous tiles are generally 30 - 50% more expensive than Ceramic tiles, although polished homogeneous of bigger size may cost much more. Homogeneous tiles have almost become the choice for kitchen flooring and stove in Singaporean homes (although ceramics tiles are just as feasible). Between these 2 materials, only Homogeneous tiles will be considered for the flooring of any commercial project, as Ceramic tiles will not be able to withstand the kind of load produced by high traffic of human flow. Ceramic Tiles. Ceramic tiles are more common and have a wider variety of colors, tones and textures. The usual range of Ceramic tiles is inexpensive. For a tile layer, it is a material which is easier to work with, compared to Homogeneous tiles (it does not pop out after few years"}, {"url": "http://ceramictilesingapore.com/homogeneous-tiles/", "passage_text": "Near impervious quality. Homogeneous tiles have incredibly low water absorption quality. At 0.3%, the homogeneous tiles’ absorption rate is much lower than that of porcelain tiles which is 0.5% and that of regular ceramic tiles which can be up to 25%. "}, {"url": "http://www.answers.com/Q/What_is_Homogeneous_tile", "passage_text": "Chamfering the edges of the tile will reveal the red base below-PVC strips will be need to cover the edges of ceramic tiles). Homogeneous tiles are generally 30 - 50% more expensive than Ceramic tiles, although polished homogeneous of bigger size may cost much more. Homogeneous tiles have almost become the choice for kitchen flooring and stove in Singaporean homes (although ceramics tiles are just as feasible). You can tile over existing tiles if the wall is sturdy and none of  the old tiles is cracked or loose. If there are only a few loose  tiles, remove and clean them, then rein … stall them with fresh  adhesive before retiling the wall."}, {"url": "http://renoadvise.blogspot.com/2008/01/faq-on-tiles.html", "passage_text": "(Porcelain) Glazed tiles are often referred by Reno IDs as Anti-stain Homogeneous Tiles. It is coated with a liquid glass, which is then baked into the surface of the clay. Hence, this surface, provides an unlimited array of designs and colours, and also protects the tile from staining. Most of this homogeneous tiles are made in China. Usually Homogeneous for Living Hall between this range is acceptance. Why acceptable, partially could be because the quality control is more control over $2.80 above tiles than a $2 tiles."}, {"url": "http://www.wannabehippie.com/homogeneous-tile-and-granite-tile-which-is-the-best/", "passage_text": "The two alternatives are homogeneous tile and granite tile. Each of the tiles has its own characteristic so that it is your task to determine which one is the best for your flooring. In terms of absorption rate, homogeneous tile is definitely won from granite tiles. "}, {"url": "http://www.answers.com/Q/What_is_Homogeneous_tile", "passage_text": "Homogeneous Tiles. With much lower water absorption rate and higher density, Homogeneous is definitely a much tougher tile compared to Ceramics tiles, and therefore more long lasting. You can tile over existing tiles if the wall is sturdy and none of  the old tiles is cracked or loose. If there are only a few loose  tiles, remove and clean them, then rein … stall them with fresh  adhesive before retiling the wall."}, {"url": "http://renoadvise.blogspot.com/2008/01/homogeneous-tiles.html", "passage_text": "Porcelain tile is often refer as Homogeneous Tile. It is used as term to refer to tiles with full porcelain body which are more subtle and predictable with no ugly crack lines and spots (Glazed/Unglazed/Full-body tiles). Most of this tiles are manufactured cheaply from China which are lower cost compared to those of Europe. The price range for homogeneous tiles can be from $2.10 to $15.00. Different Colours range also have different pricing. For whiter colours, the cost will be slightly more than the colored ones within the same range (brand)."}, {"url": "http://thepropertizer.blogspot.com/2010/09/homogeneous-tiles-vs-ceramic-tiles.html", "passage_text": "Homogeneous Tiles vs. Ceramic Tiles. Homogeneous Tiles. With much lower water absorption rate and higher density, Homogeneous is definitely a much tougher tile compared to Ceramics tiles, and therefore more long lasting. Between these 2 materials, only Homogeneous tiles will be considered for the flooring of any commercial project, as Ceramic tiles will not be able to withstand the kind of load produced by high traffic of human flow. Ceramic Tiles. Ceramic tiles are more common and have a wider variety of colors, tones and textures. The usual range of Ceramic tiles is inexpensive. For a tile layer, it is a material which is easier to work with, compared to Homogeneous tiles (it does not pop out after few years)"}]