[{"url": "http://www.usclimatedata.com/climate/blackshear/georgia/united-states/usga0733", "passage_text": "Climate data for waycross 4 ne, Longitude: -82.312, Latitude: 31.2514. Average weather Blackshear, GA - 31516 - 1981-2010 normals. Jan: January, Feb: February, Mar: March, Apr: April, May: May, Jun: June, Jul: July, Aug: August, Sep: September, Oct: October, Nov: November, Dec: December. "}, {"url": "http://forecast.weather.gov/MapClick.php?site=JAX&lat=31.2989&lon=-82.2417", "passage_text": "Some Rain Along parts of the East Coast Tonight. A cold front along the East Coast will bring rain to parts of the Northeast and Florida through Tuesday night. High temperatures Wednesday continue to be 15 to 20 degrees above average over parts of the Central Plains. Read More..."}, {"url": "http://www.areavibes.com/blackshear-ga/weather/", "passage_text": "The Blackshear, GA pollution index is 88% less than the Georgia average and 92.5% less than the national average. Loading... The Blackshear, GA air quality index is a median value which considers the most hazardous air pollutants. The Blackshear, GA air quality index is 21.1% less than the Georgia average and 35.6% less than the national average. The Blackshear, GA pollution index is the sum of the most hazardous air pollutants displayed in pounds"}, {"url": "http://www.areavibes.com/blackshear-ga/weather/", "passage_text": "The highest average temperature in Blackshear is August at 81.3 degrees. The coldest average temperature in Blackshear is January at 52.9 degrees. The most monthly precipitation in Blackshear occurs in January with 0 inches. Loading... The Blackshear, GA air quality index is a median value which considers the most hazardous air pollutants. The Blackshear, GA air quality index is 21.1% less than the Georgia average and 35.6% less than the national average. The Blackshear, GA pollution index is the sum of the most hazardous air pollutants displayed in pound"}, {"url": "http://www.usclimatedata.com/climate/georgia/united-states/3180", "passage_text": "Av. annual snowfall: -. Climate data for Atlanta, GA - 31120 - 1981-2010 normals-weather. Jan: January, Feb: February, Mar: March, Apr: April, May: May, Jun: June, Jul: July, Aug: August, Sep: September, Oct: October, Nov: November, Dec: December. "}]