[{"url": "https://en.wikipedia.org/wiki/Leukocyte_esterase", "passage_text": "Leukocyte esterase. Leukocyte esterase (LE) is a urine test for the presence of white blood cells and other abnormalities associated with infection. White blood cells in the urine usually indicate a urinary tract infection. The leukocyte esterase (LE) test detects esterase, an enzyme released by white blood cells. Positive test results are clinically significant. The LE test is also used to screen for gonorrhea and for amniotic fluid infections."}, {"url": "http://umm.edu/health/medical/ency/articles/leukocyte-esterase", "passage_text": "Leukocyte esterase is a screening test used to detect a substance that suggests there are white blood cells in the urine. This may mean you have a urinary tract infection. If this test is positive, the urine should be examined under a microscope for white blood cells and other signs that point to an infection. Leukocyte esterase is a urine test to look for white blood cells and other signs associated with"}, {"url": "http://www.ehow.com/about_5577338_positive-leukocytes-mean.html", "passage_text": "Shares & Saves. Save. Leukocytes are a type of white blood cell. When urine is positive for leukocytes, there are leukocytes in the urine. White blood cells in urine are typically a sign of infection. A urinalysis positive for leukoctyes is most commonly the result of a urinary tract infection. Leukocytes are white blood cells, the body's defense mechanism against invaders such as infection and disease. When foreign materials enter the body, white blood cells attack it by destroying infectious agents or producing antibodies."}, {"url": "http://www.brighthub.com/science/medical/articles/71126.aspx", "passage_text": "A positive finding of the enzyme leukocyte esterase in urinalysis indicates the presence of white blood cells in the urine. This normally suggests inflammation of some sort, often from a urinary tract infection. Although a urinary tract infection is the most common cause of leukocyte esterase in urinalysis some other and rarer causes for the positive result with a negative microorganism culture do exist. [2] These include:"}, {"url": "http://symptomstreatment.org/leukocytes-in-urine-what-does-it-mean/", "passage_text": "Sponsored link. The presence of leukocytes in urine is generally indicative of a urinary tract infection. When a urinalysis is ordered, it may be ordered as part of a panel of multiple constitutes monitoring for abnormal levels; or as a single test called leukocyte esterase. "}, {"url": "http://www.brighthub.com/science/medical/articles/71126.aspx", "passage_text": "Causes of Positive Results. Although a urinary tract infection is the most common cause of leukocyte esterase in urinalysis some other and rarer causes for the positive result with a negative microorganism culture do exist. [2] These include: 1  Chlamydia. 2  Infection with a sexually transmitted microorganism called ureaplasma urealyticum"}, {"url": "http://www.answers.com/Q/What_does_a_positive_result_for_leukocyte_esterase_ua_from_a_urinalysis_mean", "passage_text": "You may have an infection. A positive finding of the enzyme leukocyte esterase in urinalysis indicates the presence of white blood cells in the urine. This normally suggests inflammation of some sort, often from a urinary tract infection. A simple dipstick test as part of a urinalysis can detect the presence of this enzyme. Leukocytes are a type of white blood cell. The presence of  leukocytes in the urine is likely to mean that there is a bacterial  infection, quite possibly a urinary tract in … fection."}]