[{"url": "http://medical-dictionary.thefreedictionary.com/creatinine", "passage_text": "A laboratory test for the creatinine level in the blood may be used as a measurement of kidney function (see creatinine clearance). creatinine clearance test a test of renal function based on the rate of creatinine clearance. (krē-at'i-nēn, -nin), Do not confuse this word with creatine. It is formed in the muscle in relatively small amounts, passes into the blood and is excreted in the urine. A laboratory test for the creatinine level in the blood may be used as a measurement of kidney function."}, {"url": "http://medical-dictionary.thefreedictionary.com/creatinine", "passage_text": "creatinine. a nitrogenous compound formed as the irreversible end product of creatine metabolism. It is formed in the muscle in relatively small amounts, passes into the blood and is excreted in the urine. A laboratory test for the creatinine level in the blood may be used as a measurement of kidney function."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=21166", "passage_text": "creatinine (Cr). Definitions: 1. A component of urine and the final product of creatine catabolism; formed by the nonenzymatic dephosphorylative cyclization of phosphocreatine to form the internal anhydride of creatine. The definition information for creatinine is provided by Stedman's. You can search our medical dictionary here."}, {"url": "http://medical-dictionary.thefreedictionary.com/creatinine", "passage_text": "Normal adult blood levels of creatinine are 0.5 to 1.1 mg/dL for females and 0.6 to 1.2 mg/dL for males; the numbers decrease in elderly patients because of a smaller muscle mass. It is formed in the muscle in relatively small amounts, passes into the blood and is excreted in the urine. A laboratory test for the creatinine level in the blood may be used as a measurement of kidney function."}, {"url": "http://answers.webmd.com/answers/1198396/what-is-bun-creatinine-ratio", "passage_text": "A. BUN stands for blood urea nitrogen. Creatinine is a natural product of muscle breakdown that occurs at a low level in the body. Both BUN and creatinine are filtered by the kidney and excreted in urine. For this reason, BUN and creatinine are used together to measure kidney function. If kidney function begins to decline, BUN and creatinine rise. A normal creatinine depends on muscle mass and age. In general, a normal creatine is 0.5 to 1.2 milligrams per deciliter (mg/dL). A normal BUN is 7 to 20 mg/dL. Remember that different laboratories use different testing equipment, and may have slightly different ranges for normal"}, {"url": "http://www.kidneyfailureweb.com/creatinine/243.html", "passage_text": "Kidney failure is a medical term used to describe the illness condition in which kidneys fail to filter blood and discharge wastes. Creatinine is one of the wastes produced by our body and normal discharged by our kidney. Therefore, creatinine level is always maintain in a stable range (0.5-1.3mg/dl). Does High Creatinine Level Mean Kidney Failure. Creatinine level is an important medical index used to measure kidney function, so high creatinine is always misunderstood as kidney failure by some patients. High creatinine indeed indicates kidney problem in many cases, but it does not always mean kidney failure"}, {"url": "http://www.webmd.com/a-to-z-guides/creatinine-and-creatinine-clearance-blood-tests", "passage_text": "In this article. Creatinine is a waste product from the normal breakdown of muscle tissue. As creatinine is produced, it's filtered through the kidneys and excreted in urine. Doctors measure the blood creatinine level as a test of kidney function. The kidneys ' ability to handle creatinine is called the creatinine clearance rate, which helps to estimate the glomerular filtration rate (GFR) -- the rate of blood flow through the kidneys."}, {"url": "http://medical-dictionary.thefreedictionary.com/Creatinine+Test", "passage_text": "The creatinine test is used to measure the amount of creatinine in the blood. Because creatinine is a nonprotein end-product of creatine phosphate, which is used in skeletal muscle contraction, the daily production of creatine, and the following product, creatinine, depends on muscle mass, which fluctuates very little. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=12550", "passage_text": "Creatinine: A chemical waste molecule that is generated from muscle metabolism. Creatinine is produced from creatine, a molecule of major importance for energy production in muscles. Approximately 2% of the body's creatine is converted to creatinine every day. Creatinine is transported through the bloodstream to the kidneys. (In the metric system, a milligram is a unit of weight equal to one-thousandth of a gram, and a deciliter is a unit of volume equal to one-tenth of a liter.) Muscular young or middle-aged adults may have more creatinine in their blood than the norm for the general population."}]