[{"url": "http://www.improvenet.com/r/costs-and-prices/concrete-patios", "passage_text": "The overall cost of a concrete patio depends on the design and size of the patio. Prices usually start at around $6 per square foot up to $10 per square foot for a basic design without any colors or special designs. Adding colors or a pattern to the design can increase the price to $15 per square foot."}, {"url": "http://www.improvenet.com/r/costs-and-prices/concrete-patios", "passage_text": "The average price that homeowners pay for a concrete patio is around $2,800 to just over $4,000, but some homeowners report spending as little as $1,000 or as much as $6,500. A custom design typically costs more because those projects involve more work."}, {"url": "http://home.costhelper.com/patio.html", "passage_text": "1 Total costs for a do-it-yourself brick patio can run $2.80 a square foot or $560 for a 10x20-foot area, according to AskTheBuilder.com. 2  Having a brick patio professionally installed can run around $15 a square foot (labor and materials) or $3,000 for a 10x20-foot area, according to Landscape-Design-Advice.com."}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/06/30/how-much-will-that-patio-or-deck-cost", "passage_text": "And how much is a cheap patio? The cost to install a 200-square-foot concrete patio is about $740 to $840 on average, according to HomeWyse.com, an online reference for home projects."}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/06/30/how-much-will-that-patio-or-deck-cost", "passage_text": "A low-frills patio or deck is pretty cheap. Everyone's definition of cheap is different, but decks can be had for as low as $1,000, according to Jessica Piha, a spokeswoman for Porch.com, a website that helps homeowners find the right contractor. But the average deck costs $8,300, Piha says."}, {"url": "http://www.fixr.com/costs/build-patio", "passage_text": "1 According to PaveTech, the average concrete patio will cost around $700 using pavers and doing all of the work independently. 2  When professional concrete contractors and excavators are used the costs will obviously climb substantially. 3  Traditionally, a patio at the size mentioned will cost roughly $2,000 to $4,000."}, {"url": "http://www.fixr.com/costs/build-patio", "passage_text": "1 Traditionally, a patio at the size mentioned will cost roughly $2,000 to $4,000. 2  The resale value of this update would hold at the high-end of $3,200, or an 80% return on investment. 3  The above figures place the patio installation at $21 per square foot."}, {"url": "http://www.improvenet.com/r/costs-and-prices/natural-stone-patio", "passage_text": "Maximum cost: $19.38 per square foot. A natural stone patio can cost anywhere from $8.48 per square foot to $19.38 per square foot including the cost of materials and labor. However, the average cost of installing a natural stone patio is closer to $12.98 per square foot. This means that a 100 square foot natural stone patio would cost homeowners between $1,070 to $1,527 on average, which includes $308 to $380 worth of materials and $762 to $1,147 worth of installation costs."}]