[{"url": "http://www.netstate.com/economy/ma_economy.htm", "passage_text": "Greenhouse and nursery products (flowers, ornamental shrubs) are the primary source of farm income in Massachusetts. These products generate 35% of the state's total agricultural revenue. Cranberries rank second among the other crop products of the state. Massachusetts produces more than 25% of the cranberries grown in the nation. Other important crops are sweet corn and apples. Hay is the major field crop grown in the state."}, {"url": "https://en.wikipedia.org/wiki/History_of_Lowell,_Massachusetts", "passage_text": "The History of Lowell is closely tied to its location along the Pawtucket Falls of the Merrimack River, from being an important fishing ground for the Pennacook tribe to providing water power for the factories that formed the basis of the city's economy for a century. Named after Francis Cabot Lowell, it was officially chartered on March 1, 1826, with a population of 2,500. Within a decade the population jumped from 2,500 to 18,000, and on April 1, 1836, the town of Lowell officially received a charter as a city, granted by the Massachusetts General Court."}, {"url": "https://en.wikipedia.org/wiki/Massachusetts", "passage_text": "Massachusetts is the 7th smallest state in the United States. It is located in the New England region of the northeastern United States, and has an area of 10,555 square miles (27,340 km 2). Several large bays distinctly shape its coast. Like the rest of the northeastern United States, the population of Massachusetts has continued to grow in the past few decades. Massachusetts is the fastest growing state in New England and the 25th fastest growing state in the United States."}, {"url": "http://www.infoplease.com/us-states/massachusetts.html", "passage_text": "During the 19th century, Massachusetts was famous for the intellectual activity of its writers and educators and for its expanding commercial fishing, shipping, and manufacturing interests. Massachusetts pioneered the manufacture of textiles and shoes. "}, {"url": "https://en.wikipedia.org/wiki/Massachusetts", "passage_text": "In 2004, Massachusetts became the first U.S. state to legally recognize same-sex marriage as a result of the decision of the state's Supreme Judicial Court. Massachusetts has contributed many prominent politicians to national service, including members of the Adams family and the Kennedy family. Like the rest of the northeastern United States, the population of Massachusetts has continued to grow in the past few decades. Massachusetts is the fastest growing state in New England and the 25th fastest growing state in the United States."}, {"url": "http://www.history.com/topics/us-states/massachusetts", "passage_text": "Introduction. One of the original 13 colonies and one of the six New England states, Massachusetts (officially called a commonwealth) is known for being the landing place of the Mayflower and the Pilgrims. English explorer and colonist John Smith named the state for the Massachuset tribe. "}, {"url": "https://en.wikipedia.org/wiki/Massachusetts", "passage_text": "Plymouth was the site of the first colony in New England, founded in 1620 by the Pilgrims, passengers of the Mayflower. Harvard University, founded in 1636, is the oldest institution of higher learning in the United States. Like the rest of the northeastern United States, the population of Massachusetts has continued to grow in the past few decades. Massachusetts is the fastest growing state in New England and the 25th fastest growing state in the United States."}, {"url": "https://en.wikipedia.org/wiki/Massachusetts", "passage_text": "It is bordered by Rhode Island and Connecticut to the south, New York to the west, Vermont and New Hampshire to the north, and the Atlantic Ocean to the east. Massachusetts is the 7th smallest state by land area, but the 14th most populous and the 3rd most densely populated of the 50 States. Like the rest of the northeastern United States, the population of Massachusetts has continued to grow in the past few decades. Massachusetts is the fastest growing state in New England and the 25th fastest growing state in the United States."}, {"url": "http://history1800s.about.com/od/whaling/a/histwhaling.htm", "passage_text": "Some of these voyages could last for years. A number of seaports in New England supported the whaling industry, but one town, New Bedford, Massachusetts, became known as the world’s center of whaling. Of the more than 700 whaling ships on the world’s oceans in the 1840s, more than 400 called New Bedford their home port"}]