[{"url": "http://www.kids-fun-science.com/earths-crust.html", "passage_text": "Earths Crust. Introduction. The Earths crust is the outermost layer of our planet and is less than 1% of the Earth's volume. The crust and the mantle contain different kinds of rocks making them chemically different. The upper mantle rocks are primarily peridotite. "}, {"url": "http://study.com/academy/lesson/oceanic-crust-definition-composition-facts.html", "passage_text": "Oceanic crust is the part of the Earth's crust that makes up the seafloor. It's thinner, denser, and simpler in structure than the continental crust. Oceanic crust is also younger, on average; from its birth at a mid-ocean ridge to its end at a subduction zone is no more than 250 million years. "}, {"url": "https://en.wikipedia.org/wiki/Crust_%28geology%29", "passage_text": "The internal structure of Earth. The crust of the Earth is composed of a great variety of igneous, metamorphic, and sedimentary rocks. The crust is underlain by the mantle. The upper part of the mantle is composed mostly of peridotite, a rock denser than rocks common in the overlying crust. The boundary between the crust and mantle is conventionally placed at the Mohorovičić discontinuity, a boundary defined by a contrast in seismic velocity. The crust occupies less than 1% of Earth's volume. The oceanic crust of the sheet is different from its continental crust. The crust forms in part by aggregation of island arcs including granite and metamorphic fold belts, and it is preserved in part by depletion of the underlying mantle to form buoyant lithospheric mantle."}, {"url": "http://www.thefreedictionary.com/Earth's+crust", "passage_text": "Noun. 1. Earth's crust-the outer layer of the Earth. crust. layer-a relatively thin sheetlike expanse or region lying over or under another. asthenosphere-the lower layer of the crust. horst-a ridge of the earth's crust that has been forced upward between two faults and so is higher than the surrounding land"}, {"url": "http://www.thefreedictionary.com/Earth's+crust", "passage_text": "geosphere, lithosphere-the solid part of the earth consisting of the crust and outer mantle. crustal plate, plate-a rigid layer of the Earth's crust that is believed to drift slowly. sial-the granitelike rocks that form the outermost layer of the earth's crust; rich in silicon and aluminum. sima-rock that form the continuous lower layer of the earth's crust; rich in silicon and magnesium. 1  Facebook. Earth's crust-the outer layer of the Earth. crust. layer-a relatively thin sheetlike expanse or region lying over or under another. asthenosphere-the lower layer of the crust. horst-a ridge of the earth's crust that has been forced upward between two faults and so is higher than the surrounding land"}, {"url": "http://www.yourdictionary.com/crust", "passage_text": "verb. Crusts cut from a sandwich. Crusts cut from a sandwich. The definition of crust is the hard, outer part of a loaf of bread, or a layer of pastry covering a pie, or a hardened layer on something. 1  The brown outer part of white bread that you may have to cut off your child's sandwich is an example of crust"}, {"url": "http://www.thefreedictionary.com/crust", "passage_text": "crust. The solid, outermost layer of the Earth. ♦ The crust that lies underneath the continents is called continental crust, and is approximately 22 to 37 miles (35.4 to 59.6 kilometers) thick. It consists mostly of rocks rich in silica and aluminum, with minor amounts of iron, magnesium, calcium, sodium, and potassium. "}]