[{"url": "http://www.budapestbylocals.com/special-hungarian-foods.html", "passage_text": "You can purchase Special Hungarian Foods in every grocery store. The food markets of Budapest (Central Market, are good places to buy these items too. TIP: gastro festivals like the Gourmet Festival at the end of May, or the monthly WAMP fairs are good places to hunt for artisan food products."}, {"url": "https://www.finedininglovers.com/stories/budapest-food-guide/", "passage_text": "Your trip to Budapest must include a few of the most famous ones such as Dobos torta, Esterhāzy, the poppy seed strudel and the multi-layered flodni. Raj Rachel of Noe Cukraszda (Cafe Café) noe noé in The Gentrifying jewish district makes an excellent. Lighter Version Cafe café noe, Noé Wesselenyi. wesselényi utca 13 budapest website"}, {"url": "http://www.budapestbylocals.com/special-hungarian-foods.html", "passage_text": "Special Hungarian Foods. You can purchase Special Hungarian Foods in every grocery store. The food markets of Budapest (Central Market, are good places to buy these items too. TIP: gastro festivals like the Gourmet Festival at the end of May, or the monthly WAMP fairs are good places to hunt for artisan food products."}, {"url": "http://visitbudapest.travel/articles/traditional-hungarian-dishes-on-the-menu/", "passage_text": "Traditional Hungarian Dishes on the Menu. Comment Posted by: Roberta Gyori On: 04/06/2010. Tweet. 'Hungary' puns aside, cuisine is a major component of the culture in Budapest, and the country's traditional dishes must be sampled in order to truly experience Hungary."}, {"url": "http://www.budapest.com/things_to_do/restaurants.en.html", "passage_text": "Restaurants. Advertisement. Budapest is famous for its excellent food, as traditional Hungarian cuisine is among the best and richest in Europe. Traditional Hungarian restaurants offer tasty food, often accompanied by traditional Gipsy musicians, who come to your table to play Hungarian tunes directly into your ear."}]