[{"url": "http://www.softschools.com/facts/biomes/temperate_deciduous_forest_biome_facts/161/", "passage_text": "The temperate deciduous forest biome is characterized by its leaf-shedding trees and its seasons. This biome experiences all four seasons-winter, spring, summer, and fall. The temperate deciduous forest biome is located in the United States, Canada, Europe, China, and Japan. The trees of the temperate deciduous forest are deciduous of course. Their leaves change color with the season and eventually fall to the ground during winter. The four seasons are easily recognizable and each lasts about 3 months."}, {"url": "http://www.marietta.edu/~biol/biomes/temprain.htm", "passage_text": "Climate: The obvious element of climate in the temperate rain forest is precipitation. At least 200 cm of it, perhaps up to 350 centimeters in warmer areas. The precipitation can fall in the form of rain or snow, with snow becoming more likely at higher elevations. This reduction in the number of species as one moves from the tropics to the poles is a global phenomenon, and is not restricted to the temperate rainforest; the temperate deciduous forest likewise has fewer species than a tropical forest, and the boreal forest and tundra biomes house fewer species still."}, {"url": "http://www.softschools.com/facts/biomes/temperate_deciduous_forest_biome_facts/161/", "passage_text": "The zone levels are dependent upon the height of the trees. The temperate deciduous forest gets its name because the temperatures are temperate meaning they are not extreme. Temperate deciduous forests receive 30 - 60 inches of rain each year and are ranked second only to the rainforest as the rainiest biome. Although the average temperature is 50° F, the winter typically sees temperatures below freezing. The trees of the temperate deciduous forest are deciduous of course. Their leaves change color with the season and eventually fall to the ground during winter. The four seasons are easily recognizable and each lasts about 3 months."}, {"url": "http://www.bioexpedition.com/temperate-deciduous-forest-biome/", "passage_text": "Temperate Deciduous Forest Biome Characteristics. The temperate deciduous forest biome receives a large amount of rain annually. In the summer the polar air masses cause it. In the winter, it is the result of the polar and arctic masses that are moving south. The humidity is also a factor in this type of biome. It ranges from 60% to 80% all the time. The largest temperate deciduous forest biome is found in the Northern part of Russian and into Scandinavia."}, {"url": "http://www.ucmp.berkeley.edu/exhibits/biomes/forests.php", "passage_text": "Temperate forest. Temperate forests occur in eastern North America, northeastern Asia, and western and central Europe. Well-defined seasons with a distinct winter characterize this forest biome. Moderate climate and a growing season of 140-200 days during 4-6 frost-free months distinguish temperate forests. Today, forests occupy approximately one-third of Earth's land area, account for over two-thirds of the leaf area of land plants, and contain about 70% of carbon present in living things."}, {"url": "http://www.mbgnet.net/sets/rforest/explore/special.htm", "passage_text": "1 They are winter homes to many birds that breed in temperate latitudes. 2  Tropical rainforests are some of the most beautiful wildernesses on our planet. 3  They are home to tribal cultures that have survived successfully in the forests for many thousands of years. 1 They are home to tribal cultures that have survived successfully in the forests for many thousands of years. 2  The forests are a potential source of medicinal plants that may benefit everyone on Earth. 3  The ecosystem of the rainforest is based on the most complex interdependence of plants and animals."}, {"url": "http://biologydf.webnode.com/physical-features/", "passage_text": "Physical Features. The biggest feature of this biome happens in the fall, when the leaves change colors. This attracts many visitors to the Temperate Deciduous Forest to gaze apon the beautiful array of colors. The leaves change there before they fall off. They fall off in autumn, which is why these trees are deciduous."}, {"url": "http://www.ehow.com/info_8189501_special-features-temperate-rain-forest.html", "passage_text": "The world's largest temperate rain forests are found on the Pacific coast of North America. The forests start in Alaska and run along the coast to Oregon and California. Isolated patches of temperate rain forests are found in coastal Chile, Norway, the United Kingdom, Japan, Australia and New Zealand. The temperate rain-forest biome, or sets of related ecosystems, support many species of flora and fauna."}, {"url": "http://www.bioexpedition.com/temperate-deciduous-forest-biome/", "passage_text": "The tallest of all trees that grow in a temperate deciduous forest biome is the Sequoia. They can be up to 275 feet tall and more than 95 feet in circumference. They are found in areas of California in the United States. However, the canopy is dense rather than thick like in a rainforest. The humidity is also a factor in this type of biome. It ranges from 60% to 80% all the time. The largest temperate deciduous forest biome is found in the Northern part of Russian and into Scandinavia."}]