[{"url": "https://answers.yahoo.com/question/index?qid=20100218061810AAJxOHV", "passage_text": "Best Answer: I work in a bakery and really prefer to decorate my cakes while they are at least, partially frozen. I don't know if you are also asking if you can ice the cake while frozen. I also do this but not if the cake is frozen extremely hard, like a rock hard. If you ice it when the cake is frozen too hard then when the cake thaws it will move and in so doing crack the icing. I like to pull my cakes out for about 30 minutes before I fill, ice and decorate. Source(s): Emu · 6 years ago. I ALWAYS decorate frozen cakes. 1. I always freeze them well wrapped in seran wrap while they are still slightly warm. This locks a little moisture in the cakes. 2. I ALWAYS decorate them from frozen for a couple of reasons. 1 you can use a nice firm frosting and not worry about ripping the cake. 2. You have that moisture locked in, and the fats in the frosting will help Lock it in even more"}, {"url": "http://www.recipetips.com/kitchen-tips/t--1650/storing-a-cake.asp", "passage_text": "1 When freezing a cake, be sure that it is completely cooled before wrapping. 2  Wrap the cake tightly in plastic wrap and then wrap it again in foil before placing it in the freezer. 3  If you do not have time to freeze the cake overnight, freezing it for 2 or 3 hours will help when it comes time to decorate it. 1 Place the frosted cake on a solid flat surface that can be used to hold the cake when placed in the freezer, such as a cookie sheet, cake board, or cutting board. 2  Place the unwrapped cake in the freezer. 3  Freeze unwrapped until the frosting and decorations are frozen hard."}, {"url": "http://www.cakecentral.com/forum/t/676585/can-cakes-be-frozen-if-so-for-how-long", "passage_text": "post #1 of 12. I want to make a cake early, so the day that I need to decorate it, it won't take me as long, but I've never frozen a cake before. This time it will be a 6 and 9 round cake. Can anyone give me any ideas/pointers as to what is the best way to do this, so my cakes are still moist when it's time to eat it. Thanks! Hope this helps. I take the cakes out two days ahead. For an example, if you need the cake for saturday, take the cakes out thursday night and put them in the fridge. Then friday morning take them out from the fridge and leave them on the counter to come to room ttemperature."}, {"url": "http://www.wikihow.com/Freeze-Cakes", "passage_text": "Keep your cake in the freezer within certain time limits. A cake will generally freeze well for a few months, but not more than that. Whilst freezing initially retains the moisture of a pre-baked cake, cakes will tend to dry out after two months of freezing and you can expect the flavor to change at around four months."}, {"url": "http://www.wikihow.com/Freeze-Cakes", "passage_text": "Let your cake cool. Before you can freeze your cake for later consumption, you must let it cool. So if you've just baked a cake, put it aside for about three hours. Lightly place your hand on it to make sure it's cool to the touch. A cake will generally freeze well for a few months, but not more than that. Whilst freezing initially retains the moisture of a pre-baked cake, cakes will tend to dry out after two months of freezing and you can expect the flavor to change at around four months."}]