[{"url": "https://support.google.com/mail/answer/56283?hl=en", "passage_text": "Option 2: Import old emails and get new emails from other account. Use this option If you’re switching from a different Gmail address or if you want to bring both old and new emails into your Gmail. Gmail will first import your old messages and then continue to bring in new messages sent to your other account. You can add up to 5 accounts."}, {"url": "http://techrena.net/exporting-copying-gmail-contacts-list-as-csv-to-another-gmail-account/", "passage_text": "1.Log in to your Gmail account,from where you want to transfer contacts. 2.Click on the ‘Contacts’ link in the left hand side. 3.Now find the links ‘Import Export Print’ at the right hand side of your browser. 4.Click on the ‘Export’ link. Choose the contacts you want to choose (You may choose all contacts or contacts by group).Choose the following option under the export file format. Google’s CSV format (for importing into another Google account). 5.Download window will pop up download the CSV file and then open your new Gmail account to which you want to transfer the contacts and use ‘import’ option and upload your contacts CSV list"}, {"url": "https://support.office.com/en-us/article/Import-Google-Gmail-contacts-into-Outlook-EDBACFDE-F48C-49DA-A6A3-BCBB8F4F4819", "passage_text": "Import your Google Gmail contacts into Outlook. In Outlook, click. Click Import /Export. Click Import from another program or file, and then click Next. Click Comma Separated Values, and then click Next. At the top of the contacts section, click Export. Under Which contacts do you want to export, click a contact group or All Contacts. Under Which export format, click Outlook CSV (for importing into Outlook or another application) , and then click Export. When prompted to download the export file, click Save As."}, {"url": "https://support.google.com/mail/answer/56283?hl=en", "passage_text": "Option 1: Import old emails and contacts from other account. If you’re switching from another email provider to Gmail, this is an easy way to get all your old emails and contacts imported into Gmail. New emails are forwarded to your Gmail account for 30 days to give you time to tell your friends about your new address. Use this option If you’re switching from a different Gmail address or if you want to bring both old and new emails into your Gmail. Gmail will first import your old messages and then continue to bring in new messages sent to your other account. You can add up to 5 accounts."}, {"url": "http://productforums.google.com/d/topic/gmail/YmQapFDmvtg", "passage_text": "1. Go to your old gmail account from where you want to get your contacts copied to your new gmail account. 2. Click on the contacts tab on the left menu bar (usually below the chat option). 3. On the right hand side you will see import, export, print options. Click on the export link. I have a Gmail account which is working fine without any problem. I have a big network of contacts which are very important and precious. I have created another Gmail account (for some private use). Now I want to import those contacts from my old gmail account to this newly created G"}, {"url": "http://smallbusiness.chron.com/sync-contacts-between-gmail-accounts-54911.html", "passage_text": "Click the Google CSV option if it's not selected already. Step 7. Click Export; then navigate to the location on your computer where you want to save your contacts. You can save the contacts file anywhere, and after you import it to the other Gmail account, you can delete the file if you prefer. Step 2. Click the Gmail drop-down menu on the left side of the window. Step 3. Click Contacts.. Step 4. Click the More drop-down menu; then click the Import option. Step 5. Click Choose File and then navigate to the file you just exported in the window that opens."}, {"url": "https://support.google.com/mail/answer/164640?hl=en", "passage_text": "1 Open Gmail. 2  Click the gear in the top right. 3  Select Settings. 4  Open the Accounts and Import tab at the top. 5  Click the Import mail and contacts link. 6  If you don't see this setting, it may be because the administrator for your work or school account hasn’t allowed users to import mail. 1 Click the gear in the top right. 2  Select Settings. 3  Open the Accounts and Import tab at the top. 4  Click the Import mail and contacts link. 5"}, {"url": "https://support.google.com/mail/answer/164640?hl=en", "passage_text": "Before you begin, keep in mind that you'll need to have access to the other email account for this to work. 1  Open Gmail. 2  Click the gear in the top right. 3  Select Settings. 4  Open the Accounts and Import tab at the top. 5  Click the Import mail and contacts link. 1 Click the gear in the top right. 2  Select Settings. 3  Open the Accounts and Import tab at the top. 4  Click the Import mail and contacts link. 5  If you don't see this setting, it may be because the administrator for your work or school account hasn’t allowed users to import mail."}, {"url": "https://support.office.com/en-us/article/Import-Google-Gmail-contacts-into-Outlook-EDBACFDE-F48C-49DA-A6A3-BCBB8F4F4819", "passage_text": "If you want to see and use your Google Gmail contacts in Outlook, you don’t have to enter them one at a time. Instead, export your Gmail contacts to a file, and then import them into Outlook. It’s not a one-click button but there’s a wizard that’ll walk you through the steps. At the top of the contacts section, click Export. Under Which contacts do you want to export, click a contact group or All Contacts. Under Which export format, click Outlook CSV (for importing into Outlook or another application) , and then click Export. When prompted to download the export file, click Save As."}]