[{"url": "https://en.wikipedia.org/wiki/Flin_Flon", "passage_text": "The majority of Flin Flon's surface topology is exposed Canadian Shield bedrock, hence the nickname the city built on rock. Due to this and climatic factors, agriculture is generally not possible, although grain farming is found 130 kilometres (80 mi) southeast in The Pas, Manitoba. The economy of Flin Flon is primarily based on copper and zinc mining, chiefly Hudbay Minerals Co. Ltd/Hudson Bay Mining & Smelting's 777 Mine (including Callinan lenses) and Trout Lake Mine (slated for shutdown in 2012)."}, {"url": "http://flinflon.net/flinflon/", "passage_text": "Located just over 800 kilometres (600 miles) North-northwest of Manitoba's capital city, Winnipeg, parts of the community are in both Manitoba and Saskatchewan. Flin Flon is the gateway to Northern Manitoba's bustling tourism industry. Abundant mineral resources enabled the small village to grow to the present status of the day. Flin Flon is proud of being the only city in the world named after a science-fiction character. The Flin Flon Heritage Museum, located in the tourist park, contains artifacts and memorabilia of the city from its inception as a mining hamlet to the present day. It is open daily in the summer and special tours can be arranged."}, {"url": "https://en.wikipedia.org/wiki/Flin_Flon_Bombers", "passage_text": "The Flin Flon Bombers are a junior ice hockey team and current member of the Saskatchewan Junior Hockey League (SJHL), and are based in Flin Flon, Manitoba, Canada. The team moved and became the Edmonton Oil Kings in 1978, but the Flin Flon Bomber name was retained. The 1956–57 Flin Flon Bombers were inducted into both the Manitoba Sports Hall of Fame and Museum and the Manitoba Hockey Hall of Fame."}, {"url": "http://flinflon.net/flinflon/", "passage_text": "Beginning with a prospector's claim and a dime store novel, Flin Flon started mining in the 1920s and is now Manitoba's sixth largest city. Built on rock, the city sits proudly on the Manitoba-Saskatchewan border. The Flin Flon Heritage Museum, located in the tourist park, contains artifacts and memorabilia of the city from its inception as a mining hamlet to the present day. It is open daily in the summer and special tours can be arranged."}, {"url": "https://en.wikipedia.org/wiki/Flin_Flon_Bombers", "passage_text": "Flin Flon is located on the Manitoba / Saskatchewan border with a portion of the city in both provinces, while Creighton is located approximately 1 km from Flin Flon and is wholly within Saskatchewan. The 1956–57 Flin Flon Bombers were inducted into both the Manitoba Sports Hall of Fame and Museum and the Manitoba Hockey Hall of Fame."}, {"url": "https://flinflon.vicinn.com/", "passage_text": "Victoria Inn – one of the Best Flin Flon hotels. Experience what Northern Manitoba has to offer and stay in one of the premier Flin Flon hotels. The Victoria Inn Hotel and Convention Centre is a comfortable and relaxing accommodation offering everything you’ll need for your next visit. The Victoria Inn is one of the best Flin Flon hotels to host your event. Banquet and catering services are available at your fingertips, making the Victoria Inn your Northern meeting destination."}, {"url": "https://en.wikipedia.org/wiki/Flin_Flon", "passage_text": "Flin Flon straddles the provincial border of Manitoba and Saskatchewan, with the majority of the city being located in Manitoba. The economy of Flin Flon is primarily based on copper and zinc mining, chiefly Hudbay Minerals Co. Ltd/Hudson Bay Mining & Smelting's 777 Mine (including Callinan lenses) and Trout Lake Mine (slated for shutdown in 2012)."}, {"url": "https://en.wikipedia.org/wiki/Flin_Flon", "passage_text": "Flin Flon was founded in 1927 by Hudson Bay Mining and Smelting (HBM&S) to exploit the large copper and zinc ore resources in the region. In the 1920s, HBM&S invested in a railway, mine, smelter, and a hydroelectric power plant at Island Falls, Saskatchewan. By 1928 the rail line reached the mine. The economy of Flin Flon is primarily based on copper and zinc mining, chiefly Hudbay Minerals Co. Ltd/Hudson Bay Mining & Smelting's 777 Mine (including Callinan lenses) and Trout Lake Mine (slated for shutdown in 2012)."}, {"url": "http://www.flinflon.net/", "passage_text": "Welcome to www.flinflon.net. Your all in one Flin Flon site. Take the time to look around and see what flinflon.net has to offer. While you are here please take the time to learn a lot more about Flin Flon by visiting our website dedicated to this beautiful city. If you find your visit to Flin Flon interesting perhaps you would like to send friends or relatives a postcard from Flin Flon by visiting Postcards By KimK..."}, {"url": "http://flinflon.net/flinflon/", "passage_text": "Hotels, restaurants, shopping and full services all make Flin Flon the ideal place to visit and start exploring Greenstone Country. The city of Flin Flon is the major mining community in Northwestern Manitoba, and northeastern Saskatchewan. The Flin Flon Heritage Museum, located in the tourist park, contains artifacts and memorabilia of the city from its inception as a mining hamlet to the present day. It is open daily in the summer and special tours can be arranged."}]