[{"url": "http://amedicalspa.com/dermapen-frequently-asked-questions/", "passage_text": "Dermapen excels when used as a treatment for fine lines and wrinkles. As the Dermapen glides over your skin, it creates micro-point punctures in the skin, the majority of which are simply pushing your pores open temporarily. This is perceived by the body as damage, which stimulates the release of growth factors that trigger the production of collagen and elastin. You may also experience skin tightness and mild sensitivity to touch on the area being treated. This will diminish greatly after a few hours following treatments and within the next 24 hours the skin will be completely healed. After 3 days there is barely any evidence that the procedure has taken place."}, {"url": "http://amedicalspa.com/dermapen-frequently-asked-questions/", "passage_text": "The process of skin remodeling can go on for months after each Dermapen treatment. Results can be seen within a week or even a few days. The concept of micro-needling is based on the skin’s ability to repair itself whenever it encounters physical damage such as cuts, burns and other abrasions. You may also experience skin tightness and mild sensitivity to touch on the area being treated. This will diminish greatly after a few hours following treatments and within the next 24 hours the skin will be completely healed. After 3 days there is barely any evidence that the procedure has taken place."}, {"url": "http://www.skinnotion.com.au/face/dermapen/", "passage_text": "Instead, it is recommended that you apply the provided moisturiser for a period of three to seven days. Avoid exposure to the sun for 2 weeks after a Dermapen treatment as the skin is extra sensitive. It is highly recommended to regularly use sunscreens. The number of recommended treatments depends upon the type of treatment needed. Facial rejuvenation: 4-6 treatments at intervals of four weeks; Acne Scarring: 6-10 treatments at intervals of six weeks; and. Stretch Marks: At least 10 treatments at intervals of six weeks."}, {"url": "http://www.skinnotion.com.au/face/dermapen/", "passage_text": "A Dermapen treatment uses a sterile pen-like device, to vertically penetrate the skin with micro needles that are 0.25 mm to 2.5 mm in length. The number of recommended treatments depends upon the type of treatment needed. Facial rejuvenation: 4-6 treatments at intervals of four weeks; Acne Scarring: 6-10 treatments at intervals of six weeks; and. Stretch Marks: At least 10 treatments at intervals of six weeks."}, {"url": "http://www.dermanetwork.org/article/anti-aging-treatments/dermapen", "passage_text": "The Dermapen treatment plan is a process; there are no instant results. Minor skin improvement can be seen 6 to 8 days after having a treatment. Patients do see a more significant difference in their skin condition after 2 to 3 sessions. The full course of treatment is usually 5 to 6 sessions, which is optimal for a substantial change in the skin's appearance. Skin naturally heals itself in a 45-day cycle. 1 Burns and wound healing -- Dermapen is used to treat injuries to flesh caused by heat, electricity, chemicals, light, radiation or friction, and improves the appearance of scars. 2  Stretch marks -- These are scars resulting in an off-color hue to the skin. 3  Dermapen reduces and fades stretch marks."}, {"url": "http://www.stlouislipo.com/dermapen/faqs-about-dermapen/", "passage_text": "Most patients see full skin rejuvenation results in 6 to 8 weeks following their session. Results will vary in each patient. Rememeber that Dermapen’s effectiveness is at the level of new collagen being created and affecting the skin above it. Dermapen is a new technology in micro-needling procedures which induces skin remodeling and rejuvenation. The Dermapen is a small pen sized hand-held device that is often used to treat acne scars, fine lines, wrinkles, and help remove stretch marks."}, {"url": "http://www.skinnotion.com.au/face/dermapen/", "passage_text": "You should avoid exercising for about 24 hours after your Dermapen treatment as sweat can cause a stinging sensation. You should avoid direct exposure to the sun for about one or two weeks after your Dermapen treatment. It is recommended that you regularly use sunscreens. The number of recommended treatments depends upon the type of treatment needed. Facial rejuvenation: 4-6 treatments at intervals of four weeks; Acne Scarring: 6-10 treatments at intervals of six weeks; and. Stretch Marks: At least 10 treatments at intervals of six weeks."}, {"url": "http://dermapen.com/long-dermapen-treatment-results-last-treatment-treatment/", "passage_text": "Dermapen uses multiple needles that vertically pierce the skin. This enhances rejuvenation results and is far safer for the client because there is much less epidermal damage. The automatic vibrating function of the Dermapen increases the effectiveness of treatment by increasing absorption of products, while reducing pain and discomfort. Dermapen is just as effective as ablative treatments such as Fraxel, IPL, Laser Resurfacing, and Chemical Peels."}, {"url": "http://www.dermanetwork.org/article/anti-aging-treatments/dermapen", "passage_text": "Post-needling skin improvement continues for several months after the Dermapen treatment is completed. In order to maintain continued collagen stimulation, most physicians recommend maintenance Dermapen treatments to the area every 12 to 24 weeks. 1 Burns and wound healing -- Dermapen is used to treat injuries to flesh caused by heat, electricity, chemicals, light, radiation or friction, and improves the appearance of scars. 2  Stretch marks -- These are scars resulting in an off-color hue to the skin. 3  Dermapen reduces and fades stretch marks."}]