[{"url": "http://emedicine.medscape.com/article/1875813-overview", "passage_text": "Gross Anatomy. The vagus nerve is the longest cranial nerve. It contains motor and sensory fibers and, because it passes through the neck and thorax to the abdomen, has the widest distribution in the body. It contains somatic and visceral afferent fibers, as well as general and special visceral efferent fibers. (See Table 1, below.)."}, {"url": "http://www.healthline.com/human-body-maps/vagus-nerve", "passage_text": "Electrical stimulation of the vagus nerve, called vagus nerve stimulation (VNS), is sometimes used to treat people with epilepsy or depression. The vagus nerve is involved in one of the most common causes of fainting, called vasovagal syncope. This is an overreaction of the body to certain stimuli, like the sight of blood, which involves the stimulation of the vagus nerve. This stimulation causes a drop in blood pressure and heart rate. Less blood flows to brain, resulting in loss of consciousness."}, {"url": "http://mentalfloss.com/uk/health/30807/why-the-vagus-nerve-is-so-important", "passage_text": "3. The neurotransmitter acetylcholine, elicited by the vagus nerve, literally gives you the breath of life by telling your lungs to breathe. It’s one of the reasons that botox—often used cosmetically—can be potentially dangerous, because it interrupts your acetylcholine production. It helps you breathe"}, {"url": "http://mentalfloss.com/uk/health/30807/why-the-vagus-nerve-is-so-important", "passage_text": "07. 15. What happens in the vagus nerve, it turns out, doesn’t stay in the vagus nerve. The longest of the cranial nerves, the vagus nerve is so named because it “wanders” like a vagabond, sending out fibres from your brainstem to your visceral organs. It helps you breathe. The neurotransmitter acetylcholine, elicited by the vagus nerve, literally gives you the breath of life by telling your lungs to breathe. It’s one of the reasons that botox—often used cosmetically—can be potentially dangerous, because it interrupts your acetylcholine production."}, {"url": "http://www.healthline.com/human-body-maps/vagus-nerve", "passage_text": "The vagus nerve is one of 12 cranial nerves. It is the longest of the cranial nerves, extending from the brainstem to the abdomen by way of multiple organs including the heart, esophagus, and lungs. This is an overreaction of the body to certain stimuli, like the sight of blood, which involves the stimulation of the vagus nerve. This stimulation causes a drop in blood pressure and heart rate. Less blood flows to brain, resulting in loss of consciousness."}, {"url": "http://www.mindbodygreen.com/0-4986/What-You-Need-to-Know-About-the-Vagus-Nerve.html", "passage_text": "SHARES. The vagus is one of the larger more important nerves in the human body. One key role that it plays is as the “reset” button to counteract when our alarm system has been set off resulting in the infamous fight, flight or freeze response as some type of threat has been perceived. Also note that the vagus nerve is the “vagabond” nerve that wanders around and surrounds our heart and core area. It is heart-centered and noted as the nerve of intuition and the nerve of compassion. When we feel safe, without threat or anxiety, these abilities and inclinations are free to expand."}, {"url": "http://reset.me/story/the-soothing-vagus-how-our-wandering-nerve-returns-us-to-calm/", "passage_text": "It’s the commander-in-chief of your parasympathetic nervous system. The vagus nerve has the important job of ending your body’s fight-or-flight response once a stress has passed. That’s why vagus nerve stimulation is so effective for mood, and has been approved as a novel treatment for depression. That’s why the vagus is so important for mood. It monitors the organs to determine if all is well, and when it is, then the mind can rest easy. Contented. A good indicator of vagal activation is something called heart rate variability."}, {"url": "http://www.innovateus.net/innopedia/what-function-vagus-nerve", "passage_text": "Vagus Nerve is one such cranial nerve that also happens to be the longest nerves in the body that innervates the throat, thorax, abdominal muscles and other organs and has several functions, which is why it is one of the most important parts of our nervous system. Vagus nerve leaves the brain stem from the rootlets present in the medulla that has been found to be caudal to the rootlets in the ninth carnial nerve. The vagus nerve comprises of two sensory ganglia which are segmented into superior and inferior vagal ganglia."}, {"url": "http://www.healthguideinfo.com/neurological-disorders/p67717/", "passage_text": "The vagus nerve is the paired tenth cranial nerve that branches out from the brain and supplies parts of the gastrointestinal system such as the stomach, and parts of the respiratory system such as the lungs. To supply vital organs, it has further to travel than the other cranial nerves. "}, {"url": "http://reset.me/story/the-soothing-vagus-how-our-wandering-nerve-returns-us-to-calm/", "passage_text": "The vagus nerve influences heart rate, respiration, and digestion, but it’s also the brain’s way of monitoring what is going on with those organs. In fact, most of the traffic in the vagus (80 percent of its messages) travel upstream from the body to the brain. That’s why the vagus is so important for mood. It monitors the organs to determine if all is well, and when it is, then the mind can rest easy. Contented. A good indicator of vagal activation is something called heart rate variability."}]