[{"url": "http://www.imdb.com/title/tt0098063/", "passage_text": "Mr. Tinto Brass centered the view in Debora Caprioglio, who plays the roll of Paprika. Hell, she is very hot, sensual... but as nothing is perfect in her life she will go from one place to another and this is a kind of repetitive."}, {"url": "http://www.yourepeat.com/watch/?v=sM-wNAvwYoo#!", "passage_text": "Paprika is a 1991 Italian film directed by Tinto Brass. The film is loosely based on John Cleland's novel Fanny Hill, first published in 1748. It was remade as an explicit pornographic film by Joe D'Amato in 1995."}, {"url": "http://www.viduba.com/video:QVVMJl1V1s2VGRGRRxmUoVmaCREVn1TP", "passage_text": "Video Description. Paprika Tinto Brass-Viduba is the best way of download, watch, share, videos. We provide the best quality videos for download and watching on our featured content."}, {"url": "http://www.yourepeat.com/watch/?v=sM-wNAvwYoo#!", "passage_text": "Tinto Brass. Giovanni Brass, better known as Tinto Brass, is an Italian filmmaker. Although Brass has experimented with a plethora of genres since the 1960s, he is noted especially for his work in the erotic genre, with films such as Caligula, Cosi così fan, Tutte, Paprika monella And. Trasgredire: Ethnicity italian. people"}, {"url": "http://www.yourepeat.com/watch/?v=shgwYB0i3-4#!", "passage_text": "Tinto Brass. Giovanni Brass, better known as Tinto Brass, is an Italian filmmaker. Although Brass has experimented with a plethora of genres since the 1960s, he is noted especially for his work in the erotic genre, with films such as Caligula, Cosi così fan, Tutte, Paprika monella And. trasgredire"}, {"url": "http://www.yourepeat.com/watch/?v=shgwYB0i3-4#!", "passage_text": "Paprika is a 1991 Italian film directed by Tinto Brass. The film is loosely based on John Cleland's novel Fanny Hill, first published in 1748. It was remade as an explicit pornographic film by Joe D'Amato in 1995."}, {"url": "http://www.yourepeat.com/watch/?v=sM-wNAvwYoo#!", "passage_text": "LA NIPOTE 1. Tinto Brass. Giovanni Brass, better known as Tinto Brass, is an Italian filmmaker. Although Brass has experimented with a plethora of genres since the 1960s, he is noted especially for his work in the erotic genre, with films such as Caligula, Cosi così fan, Tutte, Paprika monella And. trasgredire"}]