[{"url": "http://www.questionbox.net/which-of-the-beryllium-halides-if-any-are-considered-ionic-compounds/", "passage_text": "F2 is a gas, and the bonds are 100% covalent. CH4, methane, is a gas, and the bonds are 97% covalent. SO4^2- is the sulfate polyatomic ion. The bonds in sulfate ion are 83% covalent. In Na3PO4 the bonds in the PO4^3- polyatomic ion are 68% covalent and the bonds between O and Na are 80% ionic. Therefore, Na3PO4 will have high ionic character."}, {"url": "http://onlinelibrary.wiley.com/doi/10.1002/0471238961.0205182519201514.a02/abstract", "passage_text": "Beryllium fluoride is essentially an ionic compound, whereas the other three halides are largely covalent. Beryllium fluoride, BeF 2, is produced commercially by the thermal decomposition of diammonium tetrafluoroberyllate, (NH 4) 2 BeF 4."}, {"url": "http://www.answers.com/Q/Reactions_of_beryllium_and_halogens", "passage_text": "1 Beryllium Atom History, Properties, and Uses Beryllium is a toxic, divalent chemical element in Group Two of the Periodic Table."}, {"url": "http://chemguide.co.uk/inorganic/group2/beryllium.html", "passage_text": "Reaction with water Beryllium chloride reacts vigorously and exothermically with water with the evolution of acidic, steamy hydrogen chloride gas. This is typical of covalent chlorides. In the first instance, it reacts to give hydrated beryllium ions, [Be(H2O)4]2+, and chloride ions."}, {"url": "http://chemguide.co.uk/inorganic/group2/beryllium.html", "passage_text": "Beryllium chloride reacts vigorously and exothermically with water with the evolution of acidic, steamy hydrogen chloride gas. This is typical of covalent chlorides. In the first instance, it reacts to give hydrated beryllium ions, [Be(H 2 O) 4 ] 2+ , and chloride ions."}, {"url": "http://chemguide.co.uk/inorganic/group2/beryllium.html", "passage_text": "The structure of beryllium chloride As a gas. . . Beryllium chloride, BeCl2, is a linear molecule with all three atoms in a straight line. Showing only the outer electrons: Beryllium chloride is known as an electron-deficient compound because it has the two empty orbitals at the bonding level. As a solid. . ."}, {"url": "http://schools-wikipedia.org/wp/b/Beryllium.htm", "passage_text": "Beryllium is the chemical element with the symbol Be and atomic number 4. Because any beryllium synthesized in stars is short-lived, it is a relatively rare element in both the universe and in the crust of the Earth. It is a divalent element which occurs naturally only in combination with other elements in minerals."}, {"url": "http://schools-wikipedia.org/wp/b/Beryllium.htm", "passage_text": "Because of its low density and atomic mass, beryllium is relatively transparent to X-rays and other forms of ionizing radiation; therefore, it is the most common window material for X-ray equipment and in particle physics experiments."}]