[{"url": "http://www.peachpundit.com/2015/04/24/uga-tuition-fees-triple-15-years-hope-isnt-keeping/", "passage_text": "Claire Suggs with the Georgia Budget and Policy Institute calculates that a UGA student’s HOPE award will now only cover 74.5% of tuition. This understates the challenge for HOPE recipients, though, as UGA charges $2,258 in mandatory (non-HOPE covered) fees per year. Taking fees into account, the HOPE scholarship now only covers 60.1% of the tuition and fees at UGA. The Augusta Chronicle has crunched the numbers and found that UGA’s tuition and mandatory fees have increased from $3,276 per year in 2000 by over 3.5 times – students next year will pay over $11,600."}, {"url": "http://www.freshmancollege.uga.edu/costs/", "passage_text": "Costs. **Please check back in November for updated program fees. The program fee for the 2015 Freshman College is $1,450. Participants are also responsible for the cost of their tuition (in-state or out-of-state), university fees, their UGA orientation session fee, and course materials/textbooks. You may also check for information related to tuition & fees for summer and fall semesters by visiting the Office of the Registrar's website. Please contact the Freshman College Office if you have any questions (706-583-0724 or fcse@uga.edu) related to this information."}, {"url": "https://www.admissions.uga.edu/prospective-students/tuition-fees", "passage_text": "Graduates of UGA have one of the lowest debts following completion of their degree and, with the HOPE Scholarship for Georgia residents, almost all in-state students begin their studies at UGA paying limited tuition or fees. In today's economic environment, families are more concerned than ever with the cost of higher education. The University of Georgia continues to be considered one of the 'best buys' in colleges, especially when rankings consider both the low cost of attending and the high quality of education received."}, {"url": "http://businesssrvs.georgiasouthern.edu/bursar/office-of-student-accounts/tuition-and-fees/", "passage_text": "Additional information regarding Tuition and Fees is available on the Board of Regents of the University System of Georgia website at www.usg.edu/student_affairs/tuition/ . Tuition and Fees charged by Georgia Southern University are approved by the University System of Georgia annually."}, {"url": "https://www.admissions.uga.edu/article/scholarships-at-uga", "passage_text": "1 $3,000 renewable which can be combined with the Zell Miller/HOPE scholarship for Georgia residents and for students who are non-resident, a Regents Waiver of the out-of-state fees will be included. Classic Scholars. Non-Georgia residents may be offered annual, fully-renewable scholarships, providing a waiver of tuition and fees equal to half the differential between in-state and out-of-state costs. This opportunity currently provides a minimum value to each student of $9,105 per year."}, {"url": "http://onlineathens.com/uga/2015-04-23/tuition-hike-outpaces-increase-hope-scholarhip-uga", "passage_text": "The combined annual cost of tuition and fees at the University of Georgia has more than tripled in the past 15 years. With a 9 percent tuition hike going into effect next fall, UGA undergraduates will shell out a total of $11,610 for two semesters, about twice what it cost in 2007. The declining value of the HOPE Scholarship is also helping drive up the cost of attending UGA. This academic year, a HOPE scholarship was worth $3,390 per semester for a UGA student taking 15 credit-hours. Next year’s state budget calls for a 3 percent increase in the value of a HOPE scholarship. But it will only cover part of the tuition increase for UGA students. HOPE will cover about 74.5 percent of undergraduate tuition in 2015-16, down from 79 percent this year, Georgia Budget and Policy Institute analyst Claire Suggs calculates. Year / Annual tuition plus fees"}, {"url": "http://summer.uga.edu/", "passage_text": "Students are charged per credit hour up to 14 hours; any credit accumulation of 15 hours or more will be charged a flat tuition rate of $4,682 (in-state). The credit hour rate for undergraduate students (in-state) is $312. For complete information on graduate tuition and fees, as well as out-of-state tuition and undergraduate costs, go to www.bursar.uga.edu/tuition. "}, {"url": "https://www.admissions.uga.edu/prospective-students/tuition-fees", "passage_text": "In addition, out-of-state tuition is applicable for all F-1 visa students. Georgia Resident Out of State Resident Tuition and Fees$10,836$29,046Typical Residence Hall$5,290$5,290Typical 7-Day Meal Plan$3,956$3,956Estimated Books, Supplies & Living Expenses $2,598$2,598 Total Cost $22,680 $40,890. In today's economic environment, families are more concerned than ever with the cost of higher education. The University of Georgia continues to be considered one of the 'best buys' in colleges, especially when rankings consider both the low cost of attending and the high quality of education received."}]