[{"url": "http://voices.washingtonpost.com/answer-sheet/high-school/should-kids-take-physical-ed-e.html", "passage_text": "Yet that’s what’s happening now that two D.C. Council members have submitted a Healthy Schools Act that calls for, among other things, 30 minutes of physical education a day for kids in kindergarten through fifth grade and 45 minutes a day for sixth-through eighth-graders. Twenty-two percent do not require students to take any physical ed class. The National Association for Sport and Physical Education recommends that schools provide at least 150 minutes of exercise per five-day school week at the elementary school level and 225 minutes a week for middle and high school students."}, {"url": "http://usatoday30.usatoday.com/news/education/2009-06-21-physical-education_N.htm", "passage_text": "There are no vending machines with candy or soda at any of the schools, and the food service at the middle schools gives students healthy choices. Elementary classes have PE for a half-hour four days a week, and gym-like activities at recess on the fifth day. Middle school students have PE for 40 minutes each day. The curriculum is designed to get students moving and appeal to everyone, regardless of athletic ability"}, {"url": "http://usatoday30.usatoday.com/news/education/2009-06-21-physical-education_N.htm", "passage_text": "There's another gym on the fourth floor, but it's so old it has basketball hoops attached to ladders. Time and space limitations mean each class gets physical education just once a week for 40 minutes. In the fight against childhood obesity, getting kids moving is one of the most effective ways to combat the problem. Elementary classes have PE for a half-hour four days a week, and gym-like activities at recess on the fifth day. Middle school students have PE for 40 minutes each day."}, {"url": "http://www.usatoday.com/story/news/2013/05/23/physical-education-schools/2351763/", "passage_text": "Story Highlights. 1  Report: School is the best place for kids to be physically active because they spend so many hours there. 2  Elementary school children should spend at least 30 minutes a day in PE class. 3  Middle school and high school students should get an average of 45 minutes a day in PE. 1 Report: School is the best place for kids to be physically active because they spend so many hours there. 2  Elementary school children should spend at least 30 minutes a day in PE class."}, {"url": "http://www.usatoday.com/story/news/2013/05/23/physical-education-schools/2351763/", "passage_text": "• Elementary school children should spend at least 30 minutes a day in PE class; middle school and high school students should get an average of 45 minutes a day in PE. That's 150 minutes a week for elementary kids and 225 minutes for middle and high school students. 1 Report: School is the best place for kids to be physically active because they spend so many hours there. 2  Elementary school children should spend at least 30 minutes a day in PE class."}, {"url": "http://www.debate.org/opinions/should-children-have-more-p-e-in-school", "passage_text": "Yes there should be more P.E classes at school. We need more P.E classes because its more fun then learning and sitting in your chair like a nerd and you can get up and do something physical. Many students dont do excersise at home and once a week is not sufficien. We shouldn't have more P.E at school. P.E classes are just waste of time. Children fight each other that our team won or my team won. Children should study, not argue with friends.My younger sister always had P.E classes which lead to a bad situation."}, {"url": "http://www.usatoday.com/story/news/2013/05/23/physical-education-schools/2351763/", "passage_text": "Report: More PE, activity programs needed in schools. Students should be doing at least 60 minutes of vigorous or moderate-intensity physical activity at school with more than half of the activity occurring during regular educational hours. 1 Report: School is the best place for kids to be physically active because they spend so many hours there. 2  Elementary school children should spend at least 30 minutes a day in PE class."}, {"url": "http://www.usatoday.com/story/news/2013/05/23/physical-education-schools/2351763/", "passage_text": "• At least half of the PE class time should be spent doing vigorous to moderate-intensity physical activity. • Students should do additional vigorous or moderate-intensity activity throughout the day, including during recess, during classroom breaks that are physically active or in other active-learning opportunities. 1 Report: School is the best place for kids to be physically active because they spend so many hours there. 2  Elementary school children should spend at least 30 minutes a day in PE class."}, {"url": "http://www.debate.org/opinions/should-children-have-more-p-e-in-school", "passage_text": "I think students should be able to have longer PE. We cant help what they do on their own time, but we can at school. We cant help or tell them what to do at home, but we can at school. We should keep them active during the day, im not saying they have to run non-stop, cause i dont like running. We shouldn't have more P.E at school. P.E classes are just waste of time. Children fight each other that our team won or my team won. Children should study, not argue with friends.My younger sister always had P.E classes which lead to a bad situation."}]