[{"url": "https://en.wikipedia.org/wiki/At-will_employment", "passage_text": "It is common for employers to define what at-will employment means, explain that an employee’s at-will status cannot be changed except in a writing signed by the company president (or chief executive), and require that an employee sign an acknowledgment of his or her at-will status. At-will employment. From Wikipedia, the free encyclopedia. At-will employment is a term used in U.S. labor law for contractual relationships in which an employee can be dismissed by an employer for any reason (that is, without having to establish  just cause  for termination), and without warning."}, {"url": "https://en.wikipedia.org/wiki/Employment_contract", "passage_text": "An employment contract or contract of employment is a kind of contract used in labour law to attribute rights and responsibilities between parties to a bargain. The contract is between an employee and an employer.. It has arisen out of the old master-servant law, used before the 20th century. But generally, the contract of employment denotes a relationship of economic dependence and social subordination. In the words of the controversial labour lawyer Sir Otto Kahn-Freund,"}, {"url": "http://thelawdictionary.org/employment-contract/", "passage_text": "Agreement between an employer and an employee. It is typically voluntary, deliberate, and legally enforceable, therefore, binding. The employee must agree to this contract as a condition of his/her employment."}, {"url": "http://smallbusiness.chron.com/definition-employment-contract-1321.html", "passage_text": "Definition of an Employment Contract. Employment contracts may be written, verbal or implied. contract image by Valentin Mosichev from Fotolia.com. Employment contracts can be verbal or written and may be specific to you or the same for an entire company. A contract can completely negate at-will employment, which makes it a useful tool for enticing new employees. Even without a specific agreement, a Find Law article in Reuters upholds that “the behavior of the employer and the employee can be viewed as an implied employment contract.”."}, {"url": "http://employment.findlaw.com/hiring-process/employment-contracts-and-compensation-agreements.html", "passage_text": "1. CONFIDENTIALITY AGREEMENT. An employee confidentiality agreement is a contract (or part of a contract) in which the employee promises not to share any information about the details of the employer's business or the employer's secret processes, plans, formulas, data, or machinery. "}, {"url": "http://www.insee.fr/en/methodes/default.asp?page=definitions/contrat-trav-duree-determinee.htm", "passage_text": "Definition. A fixed-term employment contract (or CDD) is an employment contract by which an employer (company, enterprise...) recruits an employee for a limited period of time. Such contracts are possible only to perform a specific, temporary task, and only in those cases set out by law. Previous Next. A fixed-term employment contract (or CDD) is an employment contract by which an employer (company, enterprise...) recruits an employee for a limited period of time."}, {"url": "http://www.businessdictionary.com/definition/contract-employee.html", "passage_text": "Definition. An employee who works under contract for an employer. A contract employee is hired for a specific job at a specific rate of pay. A contract employee does not become a regular addition to the staff and is not considered a permanent employee."}, {"url": "http://smallbusiness.chron.com/definition-employment-contract-1321.html", "passage_text": "An employment contract is “a legally enforceable agreement, either oral or written … which defines terms and conditions of employment,” according to QFinance. The contract lists the rights, expectations and obligations of both the company and the individual. A contract can completely negate at-will employment, which makes it a useful tool for enticing new employees. Even without a specific agreement, a Find Law article in Reuters upholds that “the behavior of the employer and the employee can be viewed as an implied employment contract.”."}, {"url": "https://en.wikipedia.org/wiki/Employment_contract", "passage_text": "A contract of employment usually defined to mean the same as a contract of service. A contract of service has historically been distinguished from a contract for the supply of services, the expression altered to imply the dividing line between a person who is employed and someone who is self-employed. The contract is between an employee and an employer.. It has arisen out of the old master-servant law, used before the 20th century. But generally, the contract of employment denotes a relationship of economic dependence and social subordination. In the words of the controversial labour lawyer Sir Otto Kahn-Freund,"}]