[{"url": "http://www.livestrong.com/article/302294-aloe-vera-juice-and-vitamins/", "passage_text": "Vitamin E. One way to add vitamin E to your diet may be to drink aloe vera juice. According to the April 2009 volume of the Oxidative Medicine and Cellular Longevity Journal, vitamin E is one of the most potent antioxidants due to its ability to prevent and repair cellular damage. Aloe Vera. Drinking aloe vera juice that has been stripped of its cathartic yellow sap called aloin can provide you with immune boosting vitamins that your body cannot produce on its own. Aloin is a powerful laxative that may leave your body dehydrated instead of nourished. Aloe contains 12 essential vitamins"}, {"url": "http://www.puritan.com/aloe-vera-017", "passage_text": "1 Aloe contains a host of nutrients including vitamins, minerals and amino acids. 2  Aloe has been traditionally used for digestion. 3  Aloe is a soothing skin softener and has been used in the most exclusive and expensive skin care products on the market. The most common of these and the best known is aloe vera. Most species of aloe have a circular cluster of leaves (called a rosette) which radiate out from the center. In most aloe plants, the rosette is at or near the ground."}, {"url": "http://aloeverabenefits.com/what-vitamins-are-in-aloe-vera/", "passage_text": "Aloe Vera contains the following vitamins: 1  Vitamin A (Beta-Carotene). 2  Vitamin B1 (Thiamine). 3  Vitamin B2 (Riboflavin). 4  Vitamin B3 (Niacin). 5  Vitamin B5. 6  Vitamin B6 (Pyridoxine). 7  Vitamin B12. 8  Vitamin C. 9  Vitamin E. 10  Choline. 11  Folic Acid. Several different minerals have been found in Aloe Vera, following are the 10 most important ones: 1  Calcium. 2  Chromium. 3  Copper. 4  Iron. 5  Magnesium. 6  Manganese. 7  Potassium. 8  Phosphorous."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-607-ALOE.aspx?activeIngredientId=607&activeIngredientName=ALOE", "passage_text": "The useful parts of aloe are the gel and latex. The gel is obtained from the cells in the center of the leaf; and the latex is obtained from the cells just beneath the leaf skin. Aloe gel might cause changes in the skin that might help diseases like psoriasis. ALOE Overview Information. Aloe (often called aloe vera) produces two substances, gel and latex, which are used for medicines. Aloe gel is the clear, jelly-like substance found in the inner part of the aloe plant leaf. Aloe latex comes from just under the plant's skin and is yellow in color"}, {"url": "http://www.livestrong.com/article/361851-vitamins-minerals-in-aloe-vera/", "passage_text": "Aloe vera gel is packed with vitamins and minerals that heal and promote wellness. Photo Credit Jupiterimages/Photos.com/Getty Images. Skin lotions and topical anti-inflammatory treatments tout aloe vera as a healing and soothing wonder gel. The gel comes from the thick leaves of the aloe vera plant. It does more than just leave skin soft, however. Aloe vera is used to heal first-and second-degree burns, protect against radiation damage, rev up the immune system, make bowels move, and fight viruses and bacteria"}, {"url": "http://www.herbwisdom.com/herb-aloe-vera.html", "passage_text": "Aloe vera contains protein, calcium, magnesium, zinc, vitamins A and E and is naturally rich in: Vitamin C which helps maintain tone of blood vessels and promotes good circulation and is essential to the health of the adrenal gland which supports our body in times of stress. Aloe is also an excellent treatment for skin conditions such as burns and eczema. It is often reported that burns can be healed remarkably quickly and the pain reduced very quickly with topical application of Aloe Vera to the burn area."}, {"url": "http://aloeverabenefits.com/what-vitamins-are-in-aloe-vera/", "passage_text": "Vitamins A, C and E provide Aloe Vera’s antioxidant activity and neutralise free radicals. The “B” Vitamins and Choline are involved in amino acid metabolism, Vitamin B12 is required for the production of red blood cells, Folic Acid is required in the development of blood cells. Several different minerals have been found in Aloe Vera, following are the 10 most important ones: 1  Calcium. 2  Chromium. 3  Copper. 4  Iron. 5  Magnesium. 6  Manganese. 7  Potassium. 8  Phosphorous."}, {"url": "http://www.livestrong.com/article/361851-vitamins-minerals-in-aloe-vera/", "passage_text": "Vitamins. Aloe vera gel is packed with vitamins. It contains B-12, which helps make DNA, and also maintains blood and nerve cells. The gel contains folic acid, which makes new cells and prevents birth defects. Skin lotions and topical anti-inflammatory treatments tout aloe vera as a healing and soothing wonder gel. The gel comes from the thick leaves of the aloe vera plant. It does more than just leave skin soft, however."}]