[{"url": "http://www.bioexpedition.com/savanna-biome/", "passage_text": "Savanna Biome Description. When we think of the Savanna Biome, it is understandable that we think of hot and dry areas. However, it may surprise you to learn that there is a very wet season and then a very dry season in the Savanna. They are found in the lower latitudes. This particular biome falls in between a grassland and a forest region. They often border the rainforests and can overlap with other types of biomes"}, {"url": "http://www.ucmp.berkeley.edu/exhibits/biomes/grasslands.php", "passage_text": "Savanna. Savanna is grassland with scattered individual trees. Savannas of one sort or another cover almost half the surface of Africa (about five million square miles, generally central Africa) and large areas of Australia, South America, and India. Climate is the most important factor in creating a savanna. Savannas are sometimes classified as forests. The predominant vegetation consists of grasses and forbs (small broad-leaved plants that grow with grasses). Different savannas support different grasses due to disparities in rainfall and soil conditions."}, {"url": "http://www.ucmp.berkeley.edu/exhibits/biomes/grasslands.php", "passage_text": "Temperate grassland. Temperate grasslands are characterized as having grasses as the dominant vegetation. Trees and large shrubs are absent. Temperatures vary more from summer to winter, and the amount of rainfall is less in temperate grasslands than in savannas. Savannas are sometimes classified as forests. The predominant vegetation consists of grasses and forbs (small broad-leaved plants that grow with grasses). Different savannas support different grasses due to disparities in rainfall and soil conditions."}, {"url": "http://kids.nceas.ucsb.edu/biomes/grassland.html", "passage_text": "LOCATION: The name for this biome, temperate grasslands, is a great description for what it is like here. The most important plants in this biome are grasses! Temperate grasslands have some of the darkest, richest soils in the world (not in wealth, but in nutrients). Trees and large shrubs are rarely found in grassland areas. There are many species of grasses that live in this biome, including, purple needlegrass, wild oats, foxtail, ryegrass, and buffalo grass. Many animals munch on these grasses, but they survive because the growth point on the grasses is very close to the ground."}, {"url": "http://www.blueplanetbiomes.org/savanna.htm", "passage_text": "Plants Animals Climate Australian Tropical Savanna African Savanna A savanna is a rolling grassland scattered with shrubs and isolated trees, which can be found between a tropical rainforest and desert biome. Not enough rain falls on a savanna to support forests. African Savanna. A savanna is a rolling grassland scattered with shrubs and isolated trees, which can be found between a tropical rainforest and desert biome. Not enough rain falls on a savanna to support forests."}, {"url": "http://thetropicalgrasslands.weebly.com/", "passage_text": "Locations & Description. A savanna is a rolling grassland scattered with shrubs and isolated trees, not getting enough rain fall to support forests. They have warm temperatures year around, with two very different seasons, long dry winters and very wet summers."}, {"url": "https://en.wikipedia.org/wiki/Tropical_and_subtropical_grasslands,_savannas,_and_shrublands", "passage_text": "For the climate classification, see Tropical savanna climate. Tropical and subtropical grasslands, savannas, and shrublands are grassland terrestrial biomes located in semi-arid to semi-humid climate regions of subtropical and tropical latitudes. "}, {"url": "http://www.blueplanetbiomes.org/savanna.htm", "passage_text": "Savannas are also known as tropical grasslands. They are found in a wide band on either side of the equator on the edges of tropical rainforests. Savannas have warm temperature year round. There are actually two very different seasons in a savanna; a very long dry season (winter), and a very wet season (summer). African Savanna. A savanna is a rolling grassland scattered with shrubs and isolated trees, which can be found between a tropical rainforest and desert biome. Not enough rain falls on a savanna to support forests."}]