[{"url": "http://healthyliving.azcentral.com/difference-between-isometric-dynamic-exercises-14678.html", "passage_text": "Dynamic exercises involve concentric and eccentric contractions. For example, when you perform a biceps curl, the action of curling the weight up is the concentric motion. Concentric contractions occur as a muscle shortens and generates force against a load to move it. "}, {"url": "http://www.athleticquickness.com/musclecontractions.asp", "passage_text": "Concentric contractions: A concentric contraction is a type of muscle contraction where the length of the muscles shorten while undergoing tension. For example, when you pick up a curl bar and perform a biceps curl, the length of your biceps muscles shorten. Your hands start down by your sides, and ends with your hands up by your shoulders."}, {"url": "https://answers.yahoo.com/question/index?qid=20101020050324AAvqzl3", "passage_text": "Dynamic contractions assuming your talking about muscles refers to a contraction where by movement occurs. Like lifting a dumbbell from you side toward your shoulder. Static contractions refer to a contraction where no movement occurs (also called isometric). Source(s): Husband is a personal trainer with seven years experience and is currently completing a degree in exercise physiology. beautyspot23 · 5 years ago"}, {"url": "http://www.athleticquickness.com/musclecontractions.asp", "passage_text": "Isometric contractions: An isometric contraction is a type of muscle contraction where the length of the muscle doesn’t change while undergoing tension. An example of this would be if you were to take a 20 pound weight and perform a biceps curl and hold a position halfway between the repetition for 10 seconds. A concentric contraction is a type of muscle contraction where the length of the muscles shorten while undergoing tension. For example, when you pick up a curl bar and perform a biceps curl, the length of your biceps muscles shorten. Your hands start down by your sides, and ends with your hands up by your shoulders."}, {"url": "http://www.strengthandfitnessuk.com/types-of-muscle-contractions", "passage_text": "Dynamic Contractions/Isotonic Contractions. Dynamic occur with movement or through the use of free weights. When an athlete lifts a free weight they are exerting a force against gravity. This contraction is often called an isotonic contraction. This is inaccurate however, as the muscle tension changes in relation to the angle of flexion and since the angle of flexion changes throughout the movement the tension cannot be equal throughout. There are two types of dynamic contractions: 1) Concentric Contractions, 2) Eccentr"}, {"url": "http://muscle.ucsd.edu/musIntro/contractions.shtml", "passage_text": "Contractions that permit the muscle to shorten are referred to as concentric contractions. An example of a concentric contraction in the raising of a weight during a bicep curl. In concentric contractions, the force generated by the muscle is always less than the muscle's maximum (P o). As the load the muscle is required to lift decreases, contraction velocity increases. This occurs until the muscle finally reaches its maximum contraction velocity, V max. By performing a series of constant velocity shortening contractions, a force-velocity relationship can be determined"}, {"url": "http://muscle.ucsd.edu/musIntro/contractions.shtml", "passage_text": "A third type of muscle contraction, isometric contraction, is one in which the muscle is activated, but instead of being allowed to lengthen or shorten, it is held at a constant length. An example of an isometric contraction would be carrying an object in front of you. In concentric contractions, the force generated by the muscle is always less than the muscle's maximum (P o). As the load the muscle is required to lift decreases, contraction velocity increases."}, {"url": "https://quizlet.com/33023562/muscle-contractions-ch-7-kin-130-flash-cards/", "passage_text": "Isokinetics is a type of dynamic exercise usually using concentric and/or eccentric muscle contractions in which the speed or velocity of movement is constant and muscular contraction occurs throughout the full range of the movement. Nautilus machines are engineered to allow this type of contraction. "}, {"url": "http://www.netfit.co.uk/articles/fitness_articles/types_muscle_contractions.htm", "passage_text": "Isotonic contractions are those which cause the muscle to change length as it contracts causing movement. There are two types of isotonic contraction: -. Concentric. A concentric contraction is a type of muscle contraction in which the muscles shorten while generating force. During a concentric contraction, a muscle is stimulated to contract according to the sliding filament mechanism."}, {"url": "http://muscle.ucsd.edu/musIntro/contractions.shtml", "passage_text": "Types of contractions. When we think of a muscle contracting normally, we tend to think of the muscle shortening as it generates force. While it's true that this is a way of muscle contracting, there are many different ways that a muscle can generate force, as seen in Figure 1 below. In concentric contractions, the force generated by the muscle is always less than the muscle's maximum (P o). As the load the muscle is required to lift decreases, contraction velocity increases."}]