[{"url": "https://en.wikipedia.org/wiki/Marsh", "passage_text": "Marsh in shallow water on a lakeshore. A marsh is a wetland that is dominated by herbaceous rather than woody plant species. Marshes can often be found at the edges of lakes and streams, where they form a transition between the aquatic and terrestrial ecosystems. They are often dominated by grasses, rushes or reeds. The plants must be able to survive in wet mud with low oxygen levels. Many of these plants therefore have aerenchyma, channels within the stem that allow air to move from the leaves into the rooting zone. Marsh plants also tend to have rhizomes for underground storage and reproduction."}, {"url": "http://www.napsva.org/coastal_marshes.htm", "passage_text": "Salt marshes contain abundant organic matter, which is the source of energy. The mud in the marsh is anoxic because other bacteria quickly consume dissolved oxygen to respire (burn) the abundant organic matter. Groundwater discharge and surface runoff into the marsh provides nitrate. They can smell bad because of the release of hydrogen sulfide (rotten egg gas). They often breed undesirable organisms like mosquitoes. They consume prime waterfront real estate. They release greenhouse gasses like methane and nitrous oxide."}, {"url": "http://oceanservice.noaa.gov/education/kits/estuaries/media/supp_estuar06a_saltmarsh.html", "passage_text": "Marshes are divided into distinct zones, the high marsh and the low marsh. The difference in elevation between these two areas is usually only a few centimeters, but for the plants that inhabit each of these zones, a few centimeters makes a world of difference. The low marsh floods daily at high tide. Salt marshes are a mosaic of snaking channels called tidal creeks that fill with seawater during high tides and drain during low tides. Fish species including flounder and mullet live most of their lives in marsh creeks. (top) Levees are areas of higher ground that border the"}, {"url": "http://ag.arizona.edu/azaqua/aquaplants/classnotes/TidalSaltMarshes.pdf", "passage_text": "Sulfur in an abundant ingredient in seawater (MgSO 4 -Epson Salts). When it reaches marsh soils, the sulfur gets reduced by sulfur reducing bacteria. These bacteria, in turn, produce hydrogen sulfide (H2S-toxic at even low levels, makes that rotten egg smell). It also makes iron pyrites and iron sulfide. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090524073658AAKaifb", "passage_text": "Sulfur compounds are a big source of odors but not by far the only ones. Marshes are fairly prolific areas for life (so lots of stuff is available to decay), and include a lot of reducing (oxygen free) conditions where the end products of decay are organic compounds rather than CO2 and water. Source(s): busterwasmycat · 6 years ago."}, {"url": "http://www.answers.com/Q/How_does_marsh_smell", "passage_text": "Marshes have decaying plants and animals and sun-dried leaves. Since the water doesn't move around much, the decay plus wet muddy soil smells stagnant, earthy, 'froggy'. There may be the musty smell of various molds that love wetlands. A marsh is a type of wetland. Other types of wetlands include swamps, bogs, fens, forested wetlands, and others.   A marsh is almost always inundated, or full of wate … r. There is usually some open water present."}, {"url": "http://www.napsva.org/coastal_marshes.htm", "passage_text": "Coastal Marshes. Coastal marshes or wetlands can be viewed from two perspectives. They can smell bad because of the release of hydrogen sulfide (rotten egg gas). They often breed undesirable organisms like mosquitoes. They consume prime waterfront real estate. They release greenhouse gasses like methane and nitrous oxide."}, {"url": "http://www.answers.com/Q/How_does_marsh_smell", "passage_text": "A marsh is an area of soft, wet, low-lying land, characterized by  grassy vegetation and often forming a transition zone between water  and land.   The similar wetland c … alled a swamp is generally more heavily  forested. 12 people found this useful. A marsh is a type of wetland. Other types of wetlands include swamps, bogs, fens, forested wetlands, and others.   A marsh is almost always inundated, or full of wate … r. There is usually some open water present."}, {"url": "http://www.napsva.org/coastal_marshes.htm", "passage_text": "In our tidal marshes, which occupy approximately 18% of our 451 miles of shoreline, the salt marsh cordgrass Spartina alterniflora is the most abundant plant. It is adapted to a limited tidal range. Spartina grows rapidly in full sunlight and forms the base of what biologists call a detritus-based food chain. They can smell bad because of the release of hydrogen sulfide (rotten egg gas). They often breed undesirable organisms like mosquitoes. They consume prime waterfront real estate. They release greenhouse gasses like methane and nitrous oxide."}]