[{"url": "https://microbewiki.kenyon.edu/index.php/Staphylococcus_aureus", "passage_text": "Cell structure and metabolism. Staphylococcus aureus is a gram-positive bacteria, which means that the cell wall of this bacteria consists of a very thick peptidoglycan layer. They form spherical colonies in clusters in 2 planes and have no flagella. Staphylococci are spherical gram-positive bacteria, which are immobile and form grape-like clusters. They form bunches because they divide in two planes as opposed to their close relatives streptococci which form chains because they divide only in one plane."}, {"url": "http://gopetsamerica.com/bio/bacteria/staphylococcus.aspx", "passage_text": "Staphylococcus. Staphylococcus (pl. Staphylococci) is a genus of spherical, gram-positive bacteria which occur in grape-like clusters. They are natural part of skin flora in most mammals and birds; they normally colonize the upper respiratory, alimentary and urogenital tracts. They are also the most common cause in pus-forming infections. "}, {"url": "http://microbewiki.kenyon.edu/index.php/Staphylococcus", "passage_text": "Ecology. Staphylococcus aureus is a normal inhabitant of the skin and mucous membranes in the nose of a healthy human, while S. epidermidis inhabits only the skin of healthy humans. S. aureus is infectious to both animals and humans. Another common path of infection is the respiratory tract, where the bacterium causes pneumonia. By forming biofilms Staphylococcus epidermidis is resistant to antibiotics, antibodies, and phagocytosis, and can serve as a reservoir for antibiotic resistant genes that can be transferred to other bacteria."}, {"url": "http://microbewiki.kenyon.edu/index.php/Staphylococcus", "passage_text": "Cell Structure and Metabolism. Staphylococcus aureus is a gram positive bacteria, which means that the cell wall of this bacteria consists of a very thick peptidoglycan layer. They are spherical, form clusters in 2 planes and have no flagella. Another common path of infection is the respiratory tract, where the bacterium causes pneumonia. By forming biofilms Staphylococcus epidermidis is resistant to antibiotics, antibodies, and phagocytosis, and can serve as a reservoir for antibiotic resistant genes that can be transferred to other bacteria."}, {"url": "http://www.healthhype.com/staphylococcus-aureus.html", "passage_text": "Staphylococcus aureus (Gk. staphyle = bunch of grapes; Lat. coccus = spherical bacterium, aureus = golden) or golden staph (pronounced ‘staff’) is the most common species of staphylococcus bacteria causing infections in human. Staph may also appear in vascular and urinary catheters, prosthetic joints and heart valves. Staph skin infection usually appears as a red, warm, painful swelling with a blister, ulcer, or crust, and a drainage (Picture 1). Infection may spread into the deeper tissues, like the bones (Picture 2)."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_epidermidis", "passage_text": "S. epidermidis is a very hardy microorganism, consisting of nonmotile, Gram-positive cocci, arranged in grape-like clusters. It forms white, raised, cohesive colonies about 1–2 mm in diameter after overnight incubation, and is not hemolytic on blood agar. S. epidermidis does not possess the gelatinase enzyme, so it cannot hydrolyze gelatin. It is sensitive to novobiocin, providing an important test to distinguish it from Staphylococcus saprophyticus, which is coagulase-negative, as well, but novobiocin-resistant."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_epidermidis", "passage_text": "Staphylococcus epidermidis is a Gram-positive bacterium, and one of over 40 species belonging to the genus Staphylococcus. It is part of the normal human flora, typically the skin flora, and less commonly the mucosal flora. S. epidermidis does not possess the gelatinase enzyme, so it cannot hydrolyze gelatin. It is sensitive to novobiocin, providing an important test to distinguish it from Staphylococcus saprophyticus, which is coagulase-negative, as well, but novobiocin-resistant."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_epidermidis", "passage_text": "S. epidermidis is a particular concern for people with catheters or other surgical implants because it is known to form biofilms that grow on these devices. Being part of the normal skin flora, S. epidermidis is a frequent contaminant of specimens sent to the diagnostic laboratory. S. epidermidis does not possess the gelatinase enzyme, so it cannot hydrolyze gelatin. It is sensitive to novobiocin, providing an important test to distinguish it from Staphylococcus saprophyticus, which is coagulase-negative, as well, but novobiocin-resistant."}, {"url": "http://web.uconn.edu/mcbstaff/graf/Student%20presentations/S%20epidermidis/sepidermidis.html", "passage_text": "Staphylococcus epidermidis. (Buddycom). Introduction. Staphylococcus epidermidis is a gram-positive, coagulase-negative cocci that is a part of our normal flora. Consequently, it is a true opportunistic pathogen, as it requires a major breach in the host’s innate defenses. The biofilm of S. epidermidis consists of clusters of cells that are embedded in extracellular slime substance that is up to 160 micrometers thick, exceeding 50 cells. Biofilms as such act as a diffusion barrier to antibiotics and host defense. (Nilsson, et al."}]