[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/11892436", "passage_text": "Anthrax, an acute infectious disease of historical importance, is once again regaining interest with its use as a biological weapon. It is caused by B. anthracis, a Gram positive spore forming rod usually surrounded by a capsule and producing toxin. It occurs most frequently as an epizootic or enzootic disease of herbivores that acquire spores form direct contact with contaminated soil. Spores can survive for many years in soil"}, {"url": "https://www.osha.gov/SLTC/etools/anthrax/disease_rec.html", "passage_text": "Anthrax is an acute infectious disease caused by a spore-forming bacterium called Bacillus anthracis. It is generally acquired following contact with anthrax-infected animals or anthrax-contaminated animal products. Anthrax has received heightened attention recently because of its use as a biological warfare agent. What is Bacillus anthracis? 1  Bacillus anthracis, the etiologic agent of anthrax, is a large, gram-positive, non-motile, spore-forming bacterial rod. 2  Bacillus anthracis spores do not have a characteristic appearance such as color, smell, or taste."}, {"url": "http://www.medicinenet.com/anthrax/article.htm", "passage_text": "The agent of anthrax is a bacterium called Bacillus anthracis. While other investigators discovered the anthrax bacillus, it was a German physician and scientist, Dr. Robert Koch, who proved that the anthrax bacterium was the cause of a disease that affected farm animals in his community. "}, {"url": "http://www.livescience.com/37755-what-is-anthrax-bioterrorism.html", "passage_text": "View full size image. Anthrax is an infectious disease caused by the bacterium Bacillus anthracis. The bacteria live in soil and usually infect wild and domestic animals, such as goats, cattle and sheep. Anthrax outbreaks are fairly common worldwide and mostly affect agricultural workers. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/11892436", "passage_text": "In humans, the disease is acquired following contact with anthrax infected animals or their products. 3 types of anthrax infection can occur: cutaneous, inhalational and gastro intestinal. Cutaneous anthrax is the most common observed form. It is caused by B. anthracis, a Gram positive spore forming rod usually surrounded by a capsule and producing toxin. It occurs most frequently as an epizootic or enzootic disease of herbivores that acquire spores form direct contact with contaminated soil."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_anthracis", "passage_text": "Bacillus anthracis is the etiologic agent of anthrax —a common disease of livestock and, occasionally, of humans—and the only obligate pathogen within the genus Bacillus. B. anthracis is a Gram-positive, endospore-forming, rod-shaped bacterium, with a width of 1.0–1.2 µm and a length of 3–5 µm. "}, {"url": "http://www.ph.ucla.edu/epi/bioter/layanthrax_a.html", "passage_text": "Anthrax is caused by the organism Bacillus anthracis. In some parts of the world, this can be found in cattle or other hoofed mammals. It is infrequent in western Europe and the US, and is more likely to be found in animals in south and central America, south and east Europe, Asia and Africa. "}, {"url": "https://en.wikipedia.org/wiki/Anthrax", "passage_text": "Anthrax is an acute disease caused by the bacterium Bacillus anthracis. Most forms of the disease are lethal, and it affects mostly animals. It is contagious and can be transmitted through contact or consumption of infected meat. Anthrax does not spread directly from one infected animal or person to another; rather, it is spread by spores. These spores can be transported by clothing or shoes. The body of an animal that had active anthrax at the time of death can also be a source of anthrax spores."}, {"url": "http://www.emedicinehealth.com/anthrax/article_em.htm", "passage_text": "Anthrax Introduction. Anthrax is caused by exposure to the spores of the bacteria Bacillus anthracis that become entrenched in the host body and produce lethal poisons. It is primarily a disease of grazing animals such as cattle, sheep, goats, and horses. Pigs are more resistant, as are dogs and cats"}]