[{"url": "http://www.lawstuff.org.uk/the-facts/crime-police-and-court/if-you-are-arrested", "passage_text": "You can be held for 24 hours if the police think that you have committed an offence. Another 12 hours can be added onto this if the offence they think that you have committed is serious. Sometimes, but not often, the police will ask the court whether you can be held for longer. The court can only allow the police to hold you for an extra 96 hours (4 days) before you are charged. You can be held for up to 14 days if you are arrested under a Terrorism Act. "}, {"url": "http://www.safe.met.police.uk/your_rights_including_stop_search/consequences_and_the_law.html", "passage_text": "How long do the police have a right to hold you? 1  You can't usually be held for more than 24 hours without being charged with a crime. 2  For a serious crime, a police Superintendent can extend the amount of time that you are held to 36 hours-a court can extend it further to 96 hours. 1"}, {"url": "https://www.gov.uk/arrested-your-rights/how-long-you-can-be-held-in-custody", "passage_text": "2. The police can hold you for up to 24 hours before they have to charge you with a crime or release you. They can apply to hold you for up to 36 or 96 hours if you’re suspected of a serious crime, eg murder. You can be held without charge for up to 14 days If you’re arrested under the Terrorism Act."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081207081051AAnzVB6", "passage_text": "Report Abuse. In Police Custody, 24 hours from the time of detention being authorised. This can be extended to up to 36 hours by a Police Superintendent if circumstances justify that extension. If charged the Police can apply for a remand in Custody to a Magistrates Court. "}, {"url": "http://www.offendersfamilieshelpline.org/index.php/rights-in-custody/", "passage_text": "In the cases of more serious offences a further 12 hour detention can be granted by a senior police officer and police can apply to a Magistrates Court to hold the suspect for up to 96 hours (four days). If arrested under suspicion of terrorism a judge can authorise the police to hold the person for up to 14 days. If the police do not have enough evidence to charge someone they may only be detained if the police believe that further detention will allow them to obtain the evidence they need to bring charges. A person remanded into police custody has the right to the following and the custody officer must explain these: 1  free legal representation. 2  a phone call to inform someone that they’ve been arrested. 3  medical help if they are feeling ill."}, {"url": "http://www.legalaid.vic.gov.au/find-legal-answers/police-powers-and-your-rights/being-arrested", "passage_text": "The police can only keep you in custody for a reasonable time before they charge you. The law does not say what a reasonable time is. This depends on the seriousness of the offence and how long it takes the police to interview you. When you think the police have kept you in custody for too long: 1  ask when they are going to charge you or release you. 2  ask to phone a lawyer. 3  make a complaint later. The police officer may handcuff you. While you are in custody, the police may: 1  ask you for your name and address. 2  ask you to give a statement. 3  interview you. 4  fingerprint you. 5  search you. 6  ask to photograph you. 7  charge you. 8  charge you and give you bail."}, {"url": "http://www.legalaid.wa.gov.au/InformationAboutTheLaw/crime/securityOfficers/Pages/Policepowerstoarrestanddetain.aspx", "passage_text": "For Commonwealth offences, police can only keep you in custody for a “reasonable time” but this is otherwise limited to: two hours if you are under 18 years old or you are an Aboriginal or Torres Straight Islander, or. four hours otherwise. If you are in custody because police suspect you have committed an offence, police may keep you in custody for a reasonable time to investigate the offence, question you about it, carry out searches and decide whether to charge you."}, {"url": "https://www.gov.uk/arrested-your-rights/how-long-you-can-be-held-in-custody", "passage_text": "How long you can be held in custody. The police can hold you for up to 24 hours before they have to charge you with a crime or release you. They can apply to hold you for up to 36 or 96 hours if you’re suspected of a serious crime, eg murder. You can be held without charge for up to 14 days If you’re arrested under the Terrorism Act."}, {"url": "https://www.qld.gov.au/law/crime-and-police/being-arrested-and-police-custody/being-held-in-police-custody/", "passage_text": "Without charge. If you are detained for questioning about a serious offence (e.g. murder, rape, robbery, assault, and break and enter) without any charge, the police can hold you for up to 8 hours, but can only question you for up to 4 hours however police can apply to a magistrate to extend the period to 12 hours. "}]