[{"url": "https://en.wikipedia.org/wiki/Epiglottitis", "passage_text": "Epiglottitis is an inflammation of the epiglottis — the flap at the base of the tongue that keeps food from going into the trachea (windpipe). Epiglottitis involves bacterial infection of the epiglottis, most often caused by Haemophilus influenzae type B, although some cases are attributable to Streptococcus pneumoniae, Streptococcus agalactiae, Staphylococcus aureus, Streptococcus pyogenes, Haemophilus influenzae, and Moraxella catarrhalis."}, {"url": "http://www.mayoclinic.org/diseases-conditions/epiglottitis/basics/definition/con-20027854", "passage_text": "Throat anatomy. Epiglottitis is a potentially life-threatening condition that occurs when the epiglottis — a small cartilage lid that covers your windpipe — swells, blocking the flow of air into your lungs. "}, {"url": "http://www.nhs.uk/Conditions/Epiglottitis/Pages/Introduction.aspx", "passage_text": "Introduction. Epiglottitis is inflammation and swelling of the epiglottis. In most cases, it's caused by infection. The epiglottis is a flap of tissue that sits beneath the tongue at the back of the throat. Its main function is to close over the windpipe (trachea) while you're eating, to prevent food entering your airways."}, {"url": "https://en.wikipedia.org/wiki/Epiglottis", "passage_text": "The epiglottis is a flap that is made of elastic cartilage tissue covered with a mucous membrane, attached to the entrance of the larynx. It projects obliquely upwards behind the tongue and the hyoid bone, pointing dorsally. Epiglottitis is mainly caused by Haemophilus influenzae. A person with epiglottitis may have a fever, sore throat, difficulty swallowing, and difficulty breathing. For this reason, in children, acute epiglottitis is considered a medical emergency, because of the risk of obstruction of the pharynx."}, {"url": "http://www.medicalnewstoday.com/articles/169521.php", "passage_text": "Knowledge center. Epiglottitis is inflammation (swelling) of the epiglottis-a flap located at the base of the tongue which stops food from going down the wrong way into the windpipe (trachea) when we are eating. As the epiglottis sits in a crucial place for proper breathing, if it becomes swollen it can cause serious breathing difficulties and is treated as a medical emergency. In some cases, epiglottitis can completely close off the windpipe and the patient cannot breathe, known as respiratory failure."}, {"url": "https://en.wikipedia.org/wiki/Epiglottis", "passage_text": "The epiglottis is shaped like a leaf, with the stem attached to the anterior part of the thyroid cartilage. The epiglottis is one of nine cartilaginous structures that make up the larynx (voice box). During breathing, it lies completely within the larynx. Epiglottitis is mainly caused by Haemophilus influenzae. A person with epiglottitis may have a fever, sore throat, difficulty swallowing, and difficulty breathing. For this reason, in children, acute epiglottitis is considered a medical emergency, because of the risk of obstruction of the pharynx."}, {"url": "http://www.healthline.com/health/epiglottitis", "passage_text": "Epiglottitis is a life-threatening condition characterized by inflamed epiglottis tissue. The epiglottis is made of cartilage and is located at the base of the tongue. It helps prevent food from entering your windpipe. The tissue of the epiglottis can swell and block your airway. This requires immediate medical attention. If you suspect that you or your child has epiglottitis, call a doctor or seek emergency medical help immediately."}, {"url": "http://www.emedicinehealth.com/epiglottitis/article_em.htm", "passage_text": "Epiglottitis is a medical emergency that may result in death if not treated quickly. The epiglottis is a flap of tissue that sits at the base of the tongue that keeps food from going into the trachea (windpipe) during swallowing. When it becomes infected and inflamed, it can swell and obstruct or close off the windpipe, which may be fatal unless promptly treated. 1 Epiglottitis occurs with different peaks in both children and adults. 2  In children, generally epiglottitis typically peaks in children aged 2-4 years. 3  In adults, the average age of onset is 45 years."}, {"url": "http://www.webmd.com/a-to-z-guides/epiglottitis-infection-inflammation?print=true", "passage_text": "Epiglottitis Overview. Epiglottitis is a medical emergency that may result in death if not treated quickly. The epiglottis is a flap of tissue that sits at the base of the tongue that keeps food from going into the trachea, or windpipe, during swallowing. When it gets infected and inflamed, it can obstruct, or close off, the windpipe, which may be fatal unless promptly treated."}, {"url": "http://www.innerbody.com/image_digeov/dige02-new2.html", "passage_text": "The epiglottis is a flexible flap at the superior end of the larynx in the throat. It acts as a switch between the larynx and the esophagus to permit air to enter the airway to the lungs and food to pass into the gastrointestinal tract. In its relaxed position, the epiglottis projects into the pharynx, or throat, and rests just posterior to the tongue. Viewed from the posterior direction, it is shaped like a teardrop with a wide, rounded region at the superior end and a narrow tapered point at its inferior end.... Click to read more below."}]