[{"url": "http://chemistry.about.com/od/moleculescompounds/a/caffeine.htm", "passage_text": "Caffeine is naturally produced by several plants, including coffee beans, guarana, yerba mate, maté cacao, beans and. Tea for the, plants caffeine acts as a natural. Pesticide it paralyzes and kills insects that attempt to feed on the. plants However, caffeine is also an addictive stimulant. In humans, it stimulates the central nervous system, heart rate, and respiration, has psychotropic (mood altering) properties, and acts as a mild diuretic."}, {"url": "http://www.answers.com/Q/What_is_the_common_name_of_caffeine", "passage_text": "Caffeine is actually the common name and the systematic name is 1,3,7-trimethylxanthine. 1 In the past, caffeine was ingested mainly through coffee. 2  Now, it has found its way into soft drinks, en…. 3  Coffee and Its Effects on the Symptoms of Parkinson's Disease Parkinson's disease is a degenerative disorder that strikes the central nervous system."}, {"url": "https://en.wikipedia.org/wiki/Caffeine", "passage_text": "Caffeine is a central nervous system (CNS) stimulant of the methylxanthine class of psychoactive drugs. It is the world's most widely consumed psychoactive drug, but unlike many other psychoactive substances, it is legal and unregulated in nearly all parts of the world. Caffeine is also a common ingredient of soft drinks, such as cola, originally prepared from kola nuts. Soft drinks typically contain 10 to 69 milligrams of caffeine per 12 ounce serving. By contrast, energy drinks, such as Red Bull, can start at 80 milligrams of caffeine per serving."}, {"url": "https://en.wikipedia.org/wiki/Caffeine", "passage_text": "Caffeine is extracted from the plant part containing it for making beverages by steeping it in water, a process called infusion. These beverages are very popular; in North America, 90% of adults consume caffeine daily. Caffeine is also a common ingredient of soft drinks, such as cola, originally prepared from kola nuts. Soft drinks typically contain 10 to 69 milligrams of caffeine per 12 ounce serving. By contrast, energy drinks, such as Red Bull, can start at 80 milligrams of caffeine per serving."}, {"url": "http://www.caffeineinformer.com/which-ingredients-contain-caffeine", "passage_text": "Other Names for Caffeine. Just because a food or drink doesn’t list caffeine on the ingredients list doesn’t mean it is caffeine-free. There are many ingredients on food labels that contain plant products, which have caffeine or caffeine similar compounds in them. What’s worse, many of these products do not disclose caffeine amounts. Advertisement. If you are sensitive to caffeine, then it’s a great idea to educate yourself concerning all the different ways caffeine can be hidden in products, especially those that are being promoted as all-natural and healthy"}, {"url": "http://www.answers.com/Q/What_are_five_other_names_for_caffeine", "passage_text": "The chemical name for caffeine is trimethylxanthine. The other  names for caffeine are theine, mateine, guaranine, and  methltheobromine. Caffeine is naturally in coffee, te … a, and guarna. 1 Caffeine is a very common substance that is encountered almost every day. 2  Beverages such as coffee, tea, soda, and energy drinks conta…. 3  Drinks with the Most Caffeine On those days when you need extra energy to make up for a lack of sleep, high-caffeine drinks provide a nice solution."}, {"url": "https://en.wikipedia.org/wiki/IUPAC_nomenclature_of_inorganic_chemistry", "passage_text": "The names  caffeine  and  3,7-dihydro-1,3,7-trimethyl-1H-purine-2,6-dione  both signify the same chemical. The systematic name encodes the structure and composition of the caffeine molecule in some detail, and provides an unambiguous reference to this compound, whereas the name caffeine just names it. These advantages make the systematic name far superior to the common name when absolute clarity and precision are required."}, {"url": "http://chemistry.about.com/od/moleculescompounds/a/caffeine.htm", "passage_text": "The chemical is also known as coffeine, theine, mateine, guaranine, or methyltheobromine. Caffeine is naturally produced by several plants, including coffee beans, guarana, yerba mate, maté cacao, beans and. tea However, caffeine is also an addictive stimulant. In humans, it stimulates the central nervous system, heart rate, and respiration, has psychotropic (mood altering) properties, and acts as a mild diuretic."}, {"url": "http://chemistry.about.com/od/moleculescompounds/a/caffeine.htm", "passage_text": "A normal dose of caffeine is generally considered to be 100 mg, which is roughly the amount found in a cup of coffee. However, more than half of all American adults consume more than 300 mg of caffeine every day, which makes it America's most popular drug. However, caffeine is also an addictive stimulant. In humans, it stimulates the central nervous system, heart rate, and respiration, has psychotropic (mood altering) properties, and acts as a mild diuretic."}, {"url": "http://www.answers.com/Q/What_is_the_common_name_of_caffeine", "passage_text": "As a vasoconstrictor, caffeine narrows the blood vessels in the body. Symptoms of the common cold like nasal congestion may be temporarily relieved through the use of caffeine … by reducing acute inflammation of the turbinates. 1 In the past, caffeine was ingested mainly through coffee. 2  Now, it has found its way into soft drinks, en…. 3  Coffee and Its Effects on the Symptoms of Parkinson's Disease Parkinson's disease is a degenerative disorder that strikes the central nervous system."}]