[{"url": "http://www.invasivespecies.wa.gov/priorities/marine_clam.shtml", "passage_text": "Corbula amurensis, commonly known as the overbite clam, Asian marine clam or Amur River clam, is a tan, white or yellow clam, up to about 25 mm long. It lives partly buried in the sediment, with its hind third or half exposed above the surface. 1 Corbula amurensis is a tan, white or yellow clam, up to about 25 mm long. 2  The 'overbite' clam, derives its name from right half of the shell being larger than the left and slightly overbiting its lower margin."}, {"url": "https://en.wikipedia.org/wiki/Clam", "passage_text": "A clam's shell consists of two (usually equal) valves, which are connected by a hinge joint and a ligament that can be external or internal. The ligament provides tension to bring the valves apart, while one or two adductor muscles can contract to close the valves. The word clam is used in the idiom to clam up, meaning to refuse to talk or answer, based on the clam behaviour of quickly closing the shell when threatened. A  clamshell  is the name given to a container or mobile phone consisting of two hinged halves that lock together."}, {"url": "http://clamup.weebly.com/characteristics.html", "passage_text": "1 Clams can control their outer shells and shut them in response to stimuli, via a elastic ligament and two large muscles. 2  In side their usually grey, black shells you can see a white, tan center. 3  Clams have siphons that forces water out and allows them to take in micro organisms. 1 Clams have two shells(Bivalve) that filters their food. 2  Clams can control their outer shells and shut them in response to stimuli, via a elastic ligament and two large muscles. 3  In side their usually grey, black shells you can see a white, tan center."}, {"url": "http://clamup.weebly.com/characteristics.html", "passage_text": "Characteristics. 1  Clams have two shells(Bivalve) that filters their food. 2  Clams can control their outer shells and shut them in response to stimuli, via a elastic ligament and two large muscles. 3  In side their usually grey, black shells you can see a white, tan center. 1 Clams have two shells(Bivalve) that filters their food. 2  Clams can control their outer shells and shut them in response to stimuli, via a elastic ligament and two large muscles. 3  In side their usually grey, black shells you can see a white, tan center."}, {"url": "https://en.wikipedia.org/wiki/Giant_clam", "passage_text": "The giant clam (Tridacna gigas), known as pā’ua in Cook Islands Māori, is a clam that is the largest living bivalve mollusk. Tridacna gigas is one of the most endangered clam species. Antonio Pigafetta documented these in his journal as early as 1521. The giant clam is considered a delicacy in Japan (known as himejako), France, South East Asia and many Pacific Islands. Some Asian foods include the meat from the muscles of clams."}, {"url": "https://en.wikipedia.org/wiki/Clam", "passage_text": "Clam  is an informal term used to refer to any molluscans within Class Bivalvia. Remains first appeared in Cambrian age rocks 510 million years ago. They presently live in both freshwater and marine habitats, and range in adult size from nearly microscopic to the giant clam, which can weigh 200 kg (440 lb). The word clam is used in the idiom to clam up, meaning to refuse to talk or answer, based on the clam behaviour of quickly closing the shell when threatened. A  clamshell  is the name given to a container or mobile phone consisting of two hinged halves that lock together."}, {"url": "http://interestinganimals.net/clam_facts/clam_facts.html", "passage_text": "Physical Characteristics. Although clams are usually thought of as one soft mass—and they are, in a sense—they do actually have body parts. That’s right, clams have a head, foot, and radula! The foot is located at the front where the shells open. Clam Facts. Interesting Facts About Clams. You might think that most facts about clams are boring, but clams are actually quite remarkable! The name clam can be used in reference to a number of mollusks, mussels, and oysters. For the most part, clams are masses of tissue and are completely invertebrate—meaning they have no bone structure"}, {"url": "http://www.biokids.umich.edu/critters/Mollusca/", "passage_text": "snails, clams, squids and octopodes. Mollusca. Mollusks are a large group of invertebrate animals. Mollusks have soft bodies, and their bodies are not divided into rings like the segmented worms called annelids. Mollusks don't have legs, though some have flexible tentacles for sensing their environment or grabbing things."}]