[{"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "In most cases, oxygen is also released as a waste product. Most plants, most algae, and cyanobacteria perform photosynthesis; such organisms are called photoautotrophs. Photosynthesis maintains atmospheric oxygen levels and supplies all of the organic compounds and most of the energy necessary for life on Earth. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}, {"url": "http://study.com/academy/lesson/photosynthesis-i-photolysis-and-the-light-reactions.html", "passage_text": "Before we begin on how the light reactions work, let's remind ourselves of the products and reactants for photosynthesis. In this process, remember that light energy, carbon dioxide, and water are used to produce glucose, or sugar, and oxygen. In this lesson, we'll learn how two of these reactants are used. These reactions use photolysis, or the use of light energy to split water molecules and produce oxygen. In these light-dependent reactions, light energy is absorbed by chlorophyll and other pigments and transferred to the reaction center of photosystem II."}, {"url": "https://en.wikipedia.org/wiki/Light-dependent_reactions", "passage_text": "The light-dependent reactions begin in photosystem II. When a chlorophyll a molecule within the reaction center of PSII absorbs a photon, an electron in this molecule attains a higher energy level. The thylakoid membrane contains some integral membrane protein complexes that catalyze the light reactions. There are four major protein complexes in the thylakoid membrane: Photosystem II (PSII), Cytochrome b6f complex, Photosystem I (PSI), and ATP synthase."}, {"url": "https://en.wikipedia.org/wiki/Light-dependent_reactions", "passage_text": "In photosynthesis, the light-dependent reactions take place on the thylakoid membranes. The inside of the thylakoid membrane is called the lumen, and outside the thylakoid membrane is the stroma, where the light-independent reactions take place. The thylakoid membrane contains some integral membrane protein complexes that catalyze the light reactions. There are four major protein complexes in the thylakoid membrane: Photosystem II (PSII), Cytochrome b6f complex, Photosystem I (PSI), and ATP synthase."}, {"url": "https://simple.wikipedia.org/wiki/Photosynthesis", "passage_text": "Water, when broken, makes oxygen, hydrogen, and electrons. Hydrogen, along with electrons energized by light, convert NADP into NADPH which is then used in the light-independent reactions. Oxygen diffuses out of the plant as a waste product of photosynthesis and ATP is synthesized from ADP and inorganic phosphate. This all happens in the grana of chloroplasts. During this reaction, sugars are built up using carbon dioxide and the products of the light-dependent reactions (ATP and NADPH) and various other chemicals found in the plant in the Calvin Cycle."}, {"url": "http://wps.aw.com/bc_campbell_concepts_7_oa/215/55164/14122052.cw/content/index.html", "passage_text": "Oxygen is released when carbon dioxide is broken down to extract carbon for later use in building glucose. Oxygen is released when water is broken down to extract electrons and protons for use in the light reactions. Oxygen is produced from breakdown of an intermediate product in the Calvin cycle. Oxygen is produced as a waste product in the form of cellular respiration that is used by photosynthetic producers. The light reactions produce _____. glucose and oxygen, completing the process of photosynthesis. "}, {"url": "http://study.com/academy/lesson/photosynthesis-i-photolysis-and-the-light-reactions.html", "passage_text": "Meanwhile, ATP is also formed. Therefore, these light reactions release oxygen as a waste product of photosynthesis, while ATP and NADPH are essential to the next step in photosynthesis, the dark reactions. To unlock this lesson you must be a Study.com Member. These reactions use photolysis, or the use of light energy to split water molecules and produce oxygen. In these light-dependent reactions, light energy is absorbed by chlorophyll and other pigments and transferred to the reaction center of photosystem II."}, {"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "This chemical energy is stored in carbohydrate molecules, such as sugars, which are synthesized from carbon dioxide and water – hence the name photosynthesis, from the Greek φῶς, phōs, light, and σύνθεσις, synthesis, putting together. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}, {"url": "http://www.answers.com/Q/What_photosynthesis_waste_product_is_formed_in_the_light_reaction", "passage_text": "The products of the light reaction are 602, 12 NADPH2 and 18 ATP.    The products of the dark reaction are C6H12O6, 12 NADP, 18 ADP, 18 Phosphates and 6H2O. 3 people found this useful. Edit. Share to: 1  Photosynthesis: The Process and Significance Photosynthesis plays a vital role for sustaining plant and animal life. 1 The Chemiluminescence Reaction and Its Uses The term chemiluminescence reaction is used to describe light that is created by a chemical reaction. 2  The ability to create light by combining chemicals is used in the labo…."}, {"url": "https://simple.wikipedia.org/wiki/Light-dependent_reaction", "passage_text": "Water, when broken, makes oxygen, hydrogen, and electrons. These electrons move through structures in chloroplasts and by chemiosmosis, make ATP. The hydrogen is converted to NADPH which is then used in the light-independent reactions. Oxygen diffuses out of the plant as a waste product of photosynthesis. This all happens in the thylakoid of chloroplasts. "}]