[{"url": "http://www.answers.com/Q/How_long_does_a_sunspot_cycle_last", "passage_text": "7 people found this useful.   In a sunspot cycle the magnetic poles of the sun flip, thus while this flipping occurs on average every 11 years, it will in fact take 22 years for the Sun's poles to be … back to the same position as when you started measuring. "}, {"url": "http://www.windows2universe.org/sun/activity/sunspot_cycle.html", "passage_text": "The length of the sunspot cycle is, on average, around eleven years. But the length of the cycle does vary. Between 1700 and today, the sunspot cycle (from one solar min to the next solar min) has varied in length from as short as nine years to as long as fourteen years. Sometimes it is hard to get an exact count of number of sunspots on the Sun. The number of sunspots seen on the  surface  of the Sun changes from year to year. This rise and fall in sunspot counts is a cycle. The length of the cycle is about eleven years on average."}, {"url": "http://starchild.gsfc.nasa.gov/docs/StarChild/questions/question17.html", "passage_text": "Answer: The amount of magnetic flux that rises up to the Sun's surface varies with time in a cycle called the solar cycle. This cycle lasts 11 years on average. This cycle is sometimes referred to as the sunspot cycle. During this solar maximum, there will be sunspots visible on the Sun almost all the time (often there are more than 100 spots visible at a time!), and some of those spots will be very large (up to 50,000 km in diameter) and last several weeks."}, {"url": "https://en.wikipedia.org/wiki/Sunspot", "passage_text": "Their numbers also change on over long periods. For example, from 1900 to the 1960s, the solar maxima trend of sunspot count was upwards; for the following decades it diminished. However, the Sun was last as active as this period over 8,000 years ago. The variation caused by the sunspot cycle to solar output is relatively small, on the order of 0.1% of the solar constant (a peak-to-trough range of 1.3 W·m −2 compared to 1366 W·m −2 for the average solar constant)."}, {"url": "http://scied.ucar.edu/sunspot-cycle", "passage_text": "Between 1700 and the present, the sunspot cycle (from one solar min to the next solar min) has varied in length from as short as nine years to as long as fourteen years. This solar cycle is, on average, about 22 years long-twice the duration of the sunspot cycle. Some scientists believe there is evidence for other, longer-period variations in the sunspot and solar cycles."}, {"url": "https://en.wikipedia.org/wiki/Sunspot", "passage_text": "Individual sunspots may endure anywhere from a few days to a few months, but eventually decay. Sunspots expand and contract as they move across the surface of the Sun with a size ranging from 16 kilometers (10 mi) to 160,000 kilometers (100,000 mi) in diameter. The larger variety are visible from Earth without the aid of a telescope. The variation caused by the sunspot cycle to solar output is relatively small, on the order of 0.1% of the solar constant (a peak-to-trough range of 1.3 W·m −2 compared to 1366 W·m −2 for the average solar constant)."}, {"url": "http://scied.ucar.edu/sunspot-cycle", "passage_text": "An example of a recent sunspot cycle spans the years from the solar min in 1986, when 13 sunspots were seen, through the solar max in 1989 when more than 157 sunspots appeared, on to the next solar min in 1996 (ten years after the 1986 solar min) when the sunspot count had fallen back down to fewer than 9. This solar cycle is, on average, about 22 years long-twice the duration of the sunspot cycle. Some scientists believe there is evidence for other, longer-period variations in the sunspot and solar cycles."}, {"url": "http://www.answers.com/Q/How_long_is_one_sunspot_cycle", "passage_text": "How long is a sunspot cycle?   In a sunspot cycle the magnetic poles of the sun flip, thus while this flipping occurs on average every 11 years, it will in fact take 22 years for the Sun's poles to be … back to the same position as when you started measuring. They come and go over the surface of the Sun and last from a few days to a few weeks. The period of time between maximum outbreaks of sunspots is about 9 to 14 years, with an average of 11 years. A link can be found below."}]