[{"url": "http://www.wisegeek.org/what-is-a-fbi-background-check.htm", "passage_text": "Post 1. In many states an FBI criminal Background check must be run before you can buy a gun. The process is easy, and only takes about five minutes. The states with the most lax gun laws only require an FBI check and two forms of identification to verify your age and address. An FBI background check is a means through which individuals, employers, and government officials can access criminal records and arrest data on United States citizens and residents."}, {"url": "https://en.wikibooks.org/wiki/FBI_Name_Check", "passage_text": "FBI Name Check is requested by USCIS for immigration benefit applicants. The FBI NNCP conducts manual and electronic searches of the FBI’s Central Records System (CRS) Universal Index (UNI). The CRS encompasses the centralized records of FBI Headquarters, field offices, and Legal Attache offices. The objective of this book is to provide a general guide for dealing with FBI name check. It is recommended that all users read the Essential information section, which consists of the first half of the article. Lawsuit steps contains step by step information about how to file a lawsuit by yourself."}, {"url": "http://www.trackitt.com/usa-discussion-forums/i485-eb/670745125/uscis-background-check", "passage_text": "What is name check? What is USCIS background check? When it is done? It is just FBI criminal record check or something else....How long does it take to clear it?"}, {"url": "http://www.ehow.com/about_4678199_fbi-background-check-show_.html", "passage_text": "Significance. In most cases, an FBI background check is used in conjunction with vetting an individual for a job. Most applications will ask an individual to volunteer information about their criminal records, and an FBI background check can be used to check the veracity of the application responses. "}, {"url": "http://work.chron.com/fbi-federal-background-check-consist-of-28722.html", "passage_text": "A federal background check may also include a credit history. A credit history is often required for security clearance with a government agency or government contractor. According to the FBI, a poor credit history may not disqualify you as a job candidate. Any company can require a background check as a condition of employment. However, only you can request a copy of your criminal history summary from the FBI. You will be notified whether or not you have a criminal history."}, {"url": "https://en.wikipedia.org/wiki/FBI_Name_Check", "passage_text": "The FBI Name Check for an individual involves a search of the FBI’s Central Records System Universal Index for any appearance of the name of the individual, as well as close phonetic variants and permutations of that name, in any of the records stored in the Universal Index. 1 Less detailed Name Checks are also possible. 2  The agency requesting a Name Check pays FBI a fee that depends on the level of detail required. 3  The requesting agency can also specify different levels of priority and set specific deadlines for the Name Checks that it requests."}, {"url": "http://work.chron.com/fbi-federal-background-check-consist-of-28722.html", "passage_text": "Criminal History. All FBI background checks include a summary of your criminal history. The FBI compiles criminal history, sometimes called a rap sheet, through information gathered from fingerprint matches obtained through federal, state and local law enforcement agencies. Any company can require a background check as a condition of employment. However, only you can request a copy of your criminal history summary from the FBI. You will be notified whether or not you have a criminal history."}, {"url": "https://en.wikipedia.org/wiki/FBI_Name_Check", "passage_text": "There is no federal law that specifically requires that FBI Name Check be used for any type of immigration benefits. Federal law does require that applicants for various types of immigration benefits undergo background checks, but the specific procedures to be used are not explicitly mandated. 1 Less detailed Name Checks are also possible. 2  The agency requesting a Name Check pays FBI a fee that depends on the level of detail required. 3  The requesting agency can also specify different levels of priority and set specific deadlines for the Name Checks that it requests."}, {"url": "https://en.wikipedia.org/wiki/FBI_Name_Check", "passage_text": "The Name Check process and the way in which it is used are blamed some by immigration advocates, political commentators, and government officials for creating substantial delays in the processing of green card and citizenship applications. 1 Less detailed Name Checks are also possible. 2  The agency requesting a Name Check pays FBI a fee that depends on the level of detail required. 3  The requesting agency can also specify different levels of priority and set specific deadlines for the Name Checks that it requests."}]