[{"url": "http://textbookofbacteriology.net/Bacillus_2.html", "passage_text": "The capsule is not synthesized by the closest relatives of B. anthracis, i.e., B. cereus and B. thuringiensis, and this criterion can be used to distinguish the species. Cell Walls The variability of cell wall structure that is common in many Gram-positive bacteria does not occur in the genus Bacillus. A few species, such as Bacillus megaterium, require no organic growth factors; others may require amino acids, B-vitamins, or both. The majority are mesophiles, with temperature optima between 30 and 45 degrees, but some are thermophiles with optima as high as 65 degrees."}, {"url": "http://textbookofbacteriology.net/Bacillus_2.html", "passage_text": "Capsules The capsules of many bacilli, including B. anthracis, B. subtilis, B. megaterium, and B. licheniformis, contain poly-D- or L-glutamic acid. Other Bacillus species, e.g., B. circulans, B. megaterium, B. mycoides and B. pumilus, produce carbohydrate capsules. A few species, such as Bacillus megaterium, require no organic growth factors; others may require amino acids, B-vitamins, or both. The majority are mesophiles, with temperature optima between 30 and 45 degrees, but some are thermophiles with optima as high as 65 degrees."}, {"url": "https://en.wikipedia.org/wiki/Endospore", "passage_text": "An endospore is a dormant, tough, and non-reproductive structure produced by certain bacteria from the Firmicute phylum. The name endospore is suggestive of a spore or seed-like form (endo means within), but it is not a true spore (i.e., not an offspring). It is a stripped-down, dormant form to which the bacterium can reduce itself. Examples of bacteria that can form endospores include Bacillus and Clostridium. The endospore consists of the bacterium's DNA, ribosomes and large amounts of dipicolinic acid. Dipicolinic acid is a spore-specific chemical that appears to help in the ability for endospores to maintain dormancy."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_subtilis", "passage_text": "B. subtilis cells are typically rod-shaped, and are about 4-10 micrometers (μm) long and 0.25–1.0 μm in diameter, with a cell volume of about 4.6 fL at stationary phase. As other members of the genus Bacillus, it can form an endospore, to survive extreme environmental conditions of temperature and desiccation. A strain of B. subtilis formerly known as Bacillus natto is used in the commercial production of the Japanese food natto, as well as the similar Korean food cheonggukjang."}, {"url": "http://microbewiki.kenyon.edu/index.php/Bacillus_anthracis", "passage_text": "It is similar to Bacillus cereus, Bacillus subtilis, and Bacillus thuringiensis in cellular size, morphology, and spore formation (7). Bacillus anthracis is an important organism to study genome sequence because it's used as a biological weapon (1). Genome sequencing can also be useful for the development of vaccines. Bacillus anthracis is a Gram-positive, rod-shaped bacterium, 1 - 1.2µm in width and 3 - 5µm in length. It lives in soils worldwide at mesophilic temperatures (10). It can be grown in aerobic or anaerobic conditons (facultative anaerobe) in a medium with essential nutrients, including carbon and nitrogen sources (7)"}, {"url": "http://www.powerofprobiotics.com/Bacillus-subtilis.html", "passage_text": "Bacillus subtilis, or B. subtilis, is a ubiquitous naturally occurring Gram-positive bacterium that is commonly recovered from soil, water, air, and decomposing plant material. It also is one of those microbes in which the strain used is extremely important. Bacillus subtilis is thought to have a weak ability to cause disease in humans unless the number of bacteria a person consumes is very high or the immune status of the person is very low. NOTE: Probably due to the possibility of any virulence, NO Bacillus subtilis strain has GRAS status as of May, 2014 in the US."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_subtilis", "passage_text": "A member of the genus Bacillus, B. subtilis is rod-shaped, and can form a tough, protective endospore, allowing it to tolerate extreme environmental conditions. B. subtilis has historically been classified as an obligate aerobe, though evidence exists that it is a facultative aerobe. B. subtilis is considered the best studied Gram-positive bacterium and a model organism to study bacterial chromosome replication and cell differentiation. It is one of the bacterial champions in secreted enzyme production and used on an industrial scale by biotechnology companies. A strain of B. subtilis formerly known as Bacillus natto is used in the commercial production of the Japanese food natto, as well as the similar Korean food cheonggukjang."}, {"url": "http://www.answers.com/Q/Does_bacillus_subtilis_have_a_capsule", "passage_text": "Bacillus subtilis known also as hay bacillus or grass bacillus is a gram-positive catalase-positive bacterium found in soil. it is a member of the genus bacillus. 2 people found this useful. Edit. Bacillus subtillus will test positive when performing a VP and Citrate test. Also, bacillus cereus is much more motile. It isn't as dependable as the chemical tests, but the … cereus colonies will appear wispy and more widespread on an agar plate than those of subtilis. 9 people found this useful."}]