[{"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic-warts/hic_Plantar_Warts", "passage_text": "Warts are an infection of the skin caused by the human papillomavirus (HPV). The virus enters the body through a break in the skin (such as a cut) and then forms a rough bump on the surface of the skin. Warts are benign (non-cancerous) growths."}, {"url": "https://en.wikipedia.org/wiki/Plantar_wart", "passage_text": "A plantar wart also known as veruca, myrmecia and veruca plantaris is a wart caused by the human papillomavirus (HPV) occurring on the sole (Latin planta) or toes of the foot. HPV infections in other locations are not plantar; see human papillomavirus."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/plantar-warts-palmer-warts", "passage_text": "The culprit is a strain of virus called human papillomavirus or HPV. Many strains of the virus exist, and those that cause common warts on the hands and feet are not the same strains of HPV that cause genital warts. Some people mistakenly think plantar warts or palmer warts are malignant. In fact, they are not harmful."}, {"url": "http://www.mayoclinic.org/diseases-conditions/plantar-warts/basics/causes/con-20025706", "passage_text": "Causes. Plantar warts are caused by an infection with the human papillomavirus (HPV) in the outer layer of skin on the soles of your feet. More than 100 types of HPV exist, but only a few cause warts on your feet. Other types of HPV are more likely to cause warts on other areas of your skin or on mucous membranes."}, {"url": "http://www.medicinenet.com/image-collection/plantar_warts_picture/picture.htm", "passage_text": "Plantar warts: Warts that grow on the soles of the feet. Plantar warts are different from most other warts. They tend to be flat and cause the buildup of the top layer of the skin (that has to be peeled away before the plantar wart itself can be seen. They can be quite painful."}, {"url": "http://www.emedicinehealth.com/plantar_warts/article_em.htm", "passage_text": "Plantar Warts Overview. Patient Comments Read 34 Comments Share Your Story. Warts are produced by an infection of the skin by human papillomavirus (HPV), which is the most common viral infection of the skin. Plantar warts grow on the plantar surface or the sole of the foot. They can be found anywhere in this area but tend to produce symptoms in areas of pressure and friction."}]