[{"url": "https://en.wikipedia.org/wiki/Transduction_%28genetics%29", "passage_text": "Transduction. Transduction is the process by which DNA is transferred from one bacterium to another by a virus. It also refers to the process whereby foreign DNA is introduced into another cell via a viral vector. Generalized transduction is the process by which any bacterial gene may be transferred to another bacterium via a bacteriophage, and typically carries only bacterial DNA and no viral DNA. In essence, this is the packaging of bacterial DNA into a viral envelope"}, {"url": "https://en.wikipedia.org/wiki/Transformation_%28genetics%29", "passage_text": "Transformation is one of three processes by which exogenous genetic material may be introduced into a bacterial cell, the other two being conjugation (transfer of genetic material between two bacterial cells in direct contact) and transduction (injection of foreign DNA by a bacteriophage virus into the host bacterium). In molecular biology, transformation is the genetic alteration of a cell resulting from the direct uptake and incorporation of exogenous genetic material (exogenous DNA) from its surroundings and taken up through the cell membrane(s)."}, {"url": "http://www.biologyexams4u.com/2012/11/recombination-in-bacteria.html", "passage_text": "1 Transduction: gene transfer in bacteria mediated by viruses (virus mediated gene transfer). 2  Read more. 3  Conjugation: is the unidirectional transfer of genetic materials from a donor bacterium to a recipient through cell to cell contact via sex pili (conjugation tube). 1 Transformation: is the uptake of DNA fragments (originates from one bacterial cell) from the surroundings by a bacterial cell. 2  Later this gets integrated into the bacterial genome. 3  Read more. 4 "}, {"url": "http://www.wikilectures.eu/index.php/Conjugation,_Transformation_and_Transduction.", "passage_text": "Transformation [ edit | edit source]. Transformation is the process by which a donor DNA molecule is taken up from the external environment and incorporated into the genome of the recipient cell. Allows for Recombinant DNA Technology. Involves use of plasmids. Transduction [ edit | edit source]. Involves transfer genetic material from one bacterium to another by a bacteriophage. Acting as a vector, the virus carries its own genome plus a fragment of DNA from the bacterium it has recently infected. If the host bacterium survives the viral attack, recombination may occur,"}, {"url": "http://www.differencebetween.com/difference-between-transformation-and-vs-transduction/", "passage_text": "Posted on. by admin. Transformation vs Transduction. Conjugation is a well-known method of DNA recombination, which can be found in both eukaryotes and prokaryotes. Later on scientists found that DNA can transfer from one bacterial cell to another by another two mechanisms; namely, transformation and transduction. Similar to conjugation, these two mechanisms transfer DNA in one direction and recombination occur between alleles in homologous DNA regions."}]