[{"url": "http://www.momjunction.com/articles/is-it-safe-to-eat-banana-during-pregnancy_00102368/", "passage_text": "6. Green Bananas: Since banana is rich in nutrients, eating banana during pregnancy is a boon. 1  If you want to gorge on something low in calorie and with absolutely no fat, green bananas can be a good inclusion in your diet. 2  You can have them boiled as well."}, {"url": "https://woolworthsbabyandtoddlerclub.com.au/pregnancy/pregnancy-health-and-nutrition/why-bananas-are-good-for-you-during-pregnancy/", "passage_text": "1 Bananas are a good source of Vitamin C, which acts as an antioxidant in the body. 2  Antioxidants fight against damage caused by free radicals that can lead to some types of cancer, as well as heart disease and premature ageing. 3  Vitamin C is very important during your pregnancy as it helps to boost your immune system."}, {"url": "http://www.wheniampregnant.com/diet/banana-flower-during-pregnancy.html", "passage_text": "Bananas are safe during pregnancy. In fact, they are a very wholesome and nutritious choice, and you can have 1 to 2 big bananas every day. Bananas have great nutritional value. Bananas are packed with energy value, good quality protein, vitamins and minerals."}, {"url": "http://www.babycenter.com/400_is-it-true-if-you-eat-a-lot-of-bananas-during-pregnancy-the_14496049_343.bc", "passage_text": "Myth! In fact it's advised fir pregnant women to eat bananas during pregnancy since they promote good colon health, prevents anemia, leg cramps & helps reduce swelling, etc. at least a banana a day will keep the doctor away! :). posted 08/09/2013 by DLBarbee. Report answer."}, {"url": "https://woolworthsbabyandtoddlerclub.com.au/pregnancy/pregnancy-health-and-nutrition/why-bananas-are-good-for-you-during-pregnancy/", "passage_text": "1 Bananas are an excellent source of potassium, which helps to keep blood pressure at a normal level, which is important during pregnancy. 2  It is also important for a healthy nervous system and kidneys. 3  One medium banana contains 350mg potassium, which is around 12% of the recommended daily intake (RDI)."}]