[{"url": "http://www.collegesanddegrees.com/programs/social-work/salary-prospects", "passage_text": "Yes. A Bachelor of Social Work is sufficient to enter direct-contact social work, but it can limit overall earnings. According to PayScale, those with a Master of Social Work earned $31,000 to $62,000 a year, while those with a BSW earned $27,000 to $48,000. The type of social worker you decide to become can certainly affect your income. The following average annual salaries were reported by the Bureau of Labor Statistics for different social worker titles: 1  Mental, health, and substance abuse social workers: $39,000. 2  Child, family, and school social workers: $40,000."}, {"url": "http://www.collegesanddegrees.com/programs/social-work/salary-prospects", "passage_text": "How Much Does a Social Worker Make? The average annual salary for social workers ranges from $24,000 to $70,000 a year, according to the Bureau of Labor Statistics (BLS); PayScale puts the pay range at $26,000 to $56,000. The average annual salary is around $42,000, according to the BLS. The type of social worker you decide to become can certainly affect your income. The following average annual salaries were reported by the Bureau of Labor Statistics for different social worker titles: 1  Mental, health, and substance abuse social workers: $39,000. 2  Child, family, and school social workers: $40,000."}, {"url": "http://www.collegesanddegrees.com/programs/social-work/salary-prospects", "passage_text": "Pay also varies within specialization depending on the type of facility where the social worker is employed. For example, school, child, and family social workers make $54,000 in elementary and secondary schools, while they only make $35,000, on average, in individual and family services. The type of social worker you decide to become can certainly affect your income. The following average annual salaries were reported by the Bureau of Labor Statistics for different social worker titles: 1  Mental, health, and substance abuse social workers: $39,000. 2  Child, family, and school social workers: $40,000."}, {"url": "http://www.ssa.gov/pubs/EN-05-10069.pdf", "passage_text": "If you work, and are full retirement age or older, you may keep all of your benefits, no matter how much you earn. If you’re younger than full retirement age, there is a limit to how much you can earn and still receive full Social Security benefits. If you’re younger than full retirement age during all of 2015, we must deduct $1 from your benefits for each $2 you earn above $15,720. How Work Affects Your Benefits Y ou can get Social Security retirement or survivors benefits and work at the same time. But, if you’re younger than full retirement age, and earn more than certain amounts, your benefits will be reduced."}, {"url": "http://forums.studentdoctor.net/threads/is-there-any-money-in-social-work.1110566/", "passage_text": "I strongly advise you to not pursue SW. Regardless of what social work academics tell you there is no money in the field. With my MSW I will be lucky to find a job making 35k a year. When I was younger I thought that 35k would be enough for me to live comfortably but it is not. I am still very interested in working in a mental health field, but social work makes me wary when it comes to the earning potential after grad school. While I understand that people do not go into social work for the money, it is still somewhat important to me to make a comfortable income. I'm more interested in counseling rather than research, which is what makes social work more appealing than a psychology grad school"}, {"url": "http://work.chron.com/much-money-social-worker-make-year-4032.html", "passage_text": "The earning potential of a social worker can be influenced by her selection of an employer. Some social workers work in nonprofit and government agencies and public school systems, usually with limited budgets. Others work for private healthcare systems or in private practice, which can lead to higher pay. "}, {"url": "http://www.socialworkersspeak.org/hollywood-connection/money-guru-suze-orman-offers-social-workers-financial-advice.html", "passage_text": "Social workers work in a variety of settings. I have known (and know) social workers who own businesses and private practices, social workers who teach and consult, social workers in directorships and management positions. . . there are ways and places where social work can be lucrative. Still Orman, who just released her 10 th financial advice book “The Money Class: Learn to Create Your New American Dream” ($26, Spiegel & Grau), is not too sympathetic when social workers complain about low salaries and high student loans."}, {"url": "https://faq.ssa.gov/link/portal/34011/34019/Article/3739/What-happens-if-I-work-and-get-Social-Security-retirement-benefits", "passage_text": "You can get Social Security retirement benefits and work at the same time. However, if you are younger than full retirement age and make more than the yearly earnings limit, we will reduce your benefit. Starting with the month you reach full retirement age, we will not reduce your benefits no matter how much you earn. Starting with the month you reach full retirement age, you can get your benefits with no limit on your earnings. The earnings limits amounts for 2016 are not yet available. We will post the 2016 information on our website when we receive it."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-can-you-work-while-receiving-ssi-disability-benefits.html", "passage_text": "The Social Security Administration (SSA) defines a substantial amount of work, which it calls substantial gainful activity (SGA), as earning $1,090 a month from working (in 2015). Therefore, if you are earning this much from work when you apply for benefits, you will be denied. For example, if you make $1,465 per month, the SSA will subtract $65 (to get $1,400) and then half of the amount over $65 (to get $700). That $700 is your countable income from work, and it will be subtracted from your monthly SSI payment (which is $733 without a state supplement)."}]