[{"url": "http://tromboneworld.weebly.com/different-types-of-trombones.html", "passage_text": "The Tenor Trombone. This trombone is the most commonly used and most preferred trombone for all players of this instrument. It produces a smoother and high sound then the bass and contrabass."}, {"url": "http://www.thefreedictionary.com/trombone", "passage_text": "trombone. n. 1. (Instruments) a brass instrument, a low-pitched counterpart of the trumpet, consisting of a tube the effective length of which is varied by means of a U-shaped slide."}, {"url": "http://thehub.musiciansfriend.com/band-orchestra-buying-guides/trombone-buying-guide", "passage_text": "The three most common types of trombone are straight tenor, trigger-type tenor (also referred to as F-rotor or F-attachment), and bass trombones. Valve trombones, alto trombones, soprano trombones, and marching trombones are less common (but well loved) trombone types."}, {"url": "http://www.ebay.com/sch/Trombones/16216/bn_2311135/i.html", "passage_text": "One of the world s most iconic brass instruments is the trombone. With their distinctive slides and bright, brassy tones, trombones of one kind or another can be found in concert bands, marching bands,..."}, {"url": "http://www.normans.co.uk/blog/2014/07/different-types-trombones/", "passage_text": "The Trombone is a member of the brass family of instruments. Trombones can be found in all genres of music – from orchestras/ wind bands and even to provide backing for modern pop music."}, {"url": "http://www.normans.co.uk/blog/2014/07/different-types-trombones/", "passage_text": "The Bass Trombone. This is bigger then the tenor trombone with the valve attachment. It has the largest bell of the common trombone family ranging from 9.5 inch diameter up to 11. It also features the largest bore of the common trombones. Bass Trombones can vary in the number of valves attached to it."}, {"url": "http://www.yeodoug.com/articles/trombone_gallery/trombone_gallery.html", "passage_text": "This is my Yamaha YBL-822G bass trombone, an instrument I developed with Yamaha over a period of years which I now use for most of my playing. First launched as the YBL-622, it was redesigned with many improvements in 2007 and renamed the YBL-822G and made part of Yamaha's XENO trombone line."}, {"url": "http://www.blackdiamondbrass.com/trbhist/tbonehist.htm", "passage_text": "Like the modern trombone, these were a tenor instrument, and by the early 17th century there was an alto, a bass and a contrabass version. These early instruments often came with a variety of crooks, to lower the pitch a tone or more, or in some cases to drop the range of a particular instrument to the next register."}]