[{"url": "http://www.answers.com/Q/What_is_the_gestation_period_of_robin_eggs", "passage_text": "What is the gestation period for robins eggs? 14 days seems to be the correct answer. I have watched the Robins build their nest starting April 5, and I am watching them feed the babies today May 4th. Our Osprey's at Osprey House Environmental centre in Dohles Rocks Queensland Australia, laid an egg on the 22nd and a second on the 25th May 2009 with one egg still acti … ve. We have been told that gestation is between 38 and 40 days, so here is hoping that we have a chick late June or early July."}, {"url": "https://answers.yahoo.com/question/index?qid=20080422202407AAeK4MQ", "passage_text": "Rating Newest Oldest. Best Answer: Nesting: Two broods of 3-5 blue-green eggs with a 12-14 day incubation period. Fledging occurs 14-16 days after hatching. The nest is a mud cup lined with soft grass and reinforced with grass and twigs. The nest is usually placed in a tree, on a ledge, or on a windowsill. http://www.bird-friends.com/BirdPage.php... So they will hatch 12-14 days after the mother began incubating the eggs, and the babies will be fledging (leaving the nest) about 14-16 days after that. Remember, though, that when they first leave the nest, they will not yet be flying, so you need to be careful of any pets or children that may be in the area"}, {"url": "https://en.wikipedia.org/wiki/Avian_incubation", "passage_text": "Megapode eggs take from 49 to 90 days depending on the mound and ambient temperature. Even in other birds, ambient temperatures can lead to variation in incubation period. Normally, of course, the egg is incubated outside the body. However, in one recorded case, the egg incubation occurred entirely within a chicken. Incubation refers to the process by which certain oviparous (egg-laying) animals hatch their eggs and to the development of the embryo within the egg. The most vital factor of incubation is the constant temperature required for its development over a specific period."}, {"url": "http://www.ehow.com/how-does_5419182_long-robin-eggs-hatch.html", "passage_text": "Preparing the Nest. Before she can lay her eggs, the female robin, with help from her mate, builds a nest from twigs, mud and dried grass. A finished nest is circular and deep enough to safely cradle the eggs and, later, the nestlings. Nest-building takes the robins two to six days. "}, {"url": "http://www.learner.org/jnorth/tm/robin/ExpertAnswer02.html", "passage_text": "They also eat a wide variety of spiders, insects, and other small invertebrates, and there are even a few records of them taking tiny fish from the edges of shallow ponds! Q: How long is the incubation period, and how long are baby Robins dependent on their parents? A: Robins incubate for about 12 - 14 days. The record was 7 days--this must have been during a warm spell when the eggs could stay warm even when the mother was off the nest feeding. "}, {"url": "http://www.learner.org/jnorth/tm/robin/EggstraEggstra.html", "passage_text": "It means all the babies hatch close to the same time. Mother robins may start incubating their eggs during the evening after the second egg is laid, or after all the eggs are laid. They sit on the eggs for 12 to 14 days. Most birds lay their eggs at sunrise, but NOT robins! They lay their eggs at mid-morning. That's several hours later than most birds lay eggs. For robins, this makes good sense. Robins eat a lot of earthworms during the breeding season, and they use those early dark hours to hunt for worms because worms are most available before the sun gets too high. Robins lay their eggs mid-morning after feasting on worms. A robin can then fly over to her nest and lay her eggs easily, but most other birds seem to need a long period of quiet before they can lay eggs. Those other species can get a big breakfast even if they eat late because they don't want worms anyway!"}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_for_robins_eggs", "passage_text": "Making the world better, one answer at a time. 14 days seems to be the correct answer. I have watched the Robins build their nest starting April 5, and I am watching them feed the babies today May 4th. Our Osprey's at Osprey House Environmental centre in Dohles Rocks Queensland Australia, laid an egg on the 22nd and a second on the 25th May 2009 with one egg still acti … ve. We have been told that gestation is between 38 and 40 days, so here is hoping that we have a chick late June or early July."}, {"url": "http://en.allexperts.com/q/Wildlife-2507/Robin-Gestation.htm", "passage_text": "For example, some birds lay an egg a day and the last egg laid will sometimes be the day the incubation period started. This is more common for the first clutch of eggs for new parents... Old hands may lay one egg every second or even third day and then wait for another couple days to begin incubation. "}, {"url": "https://answers.yahoo.com/question/index?qid=20110528142354AAkqfY3", "passage_text": "Best Answer: Hi. You want to use the words incubation period for eggs. Gestation refers to animals that give live birth. The Incubation period for an American Robin is 12-13 days, it can be longer if the hen is absent from the nest due to being disturbed. It might hatch in as few a nine days or so if the egg received constant optimum heat"}]