[{"url": "http://www.innerbody.com/nutrition/micronutrients", "passage_text": "Whether they are macronutrients or micronutrients, vitamins, major minerals or trace minerals, they each have a unique role. A deficiency in any will impact your wellbeing. Eating a diet with both a variety of food groups and a variety within food groups is your best protection against nutrient imbalances. Micronutrients are those nutrients we require in relatively small quantities. They are vitamins and minerals, and our good health requires them in milligram and microgram amounts."}, {"url": "http://www.cdc.gov/immpact/micronutrients/index.html", "passage_text": "Deficiencies in micronutrients such as iron, iodine, vitamin A, folate and zinc can have devastating consequences. At least half of children worldwide ages 6 months to 5 years suffer from one or more micronutrient deficiency, and globally more than 2 billion people are affected 2. Recommend on Facebook Tweet ShareCompartir. Micronutrients are dietary components, often referred to as vitamins and minerals, which although only required by the body in small amounts, are vital to development, disease prevention, and wellbeing. Micronutrients are not produced in the body and must be derived from the diet 1"}, {"url": "http://www.unicef.org/nutrition/index_iodine.html", "passage_text": "Vitamin A is an essential micronutrient for the immune system. At least 100 million children under five suffer from vitamin A deficiency (VAD), high levels of which can cause blindness and greatly increase the risk that a child may die from diseases such as measles, diarrhoea and acute respiratory infections. Introduction. Micronutrients enhance the nutritional value of food and have a profound impact on a child’s development and a mother’s health. UNICEF works with governments and a diverse group of public and private organizations to deliver essential micronutrients including iodine, iron, vitamin A and folate."}, {"url": "http://www.goldenrice.org/Content3-Why/why1_vad.php", "passage_text": "Vitamin A Deficiency-Related Disorders (VADD). The most damaging micronutrient deficiencies in the world are the consequence of low dietary intake of iron, vitamin A, iodine and zinc. Vitamin A deficiency (VAD) is prevalent among the poor whose diets are based mainly on rice or other carbohydrate-rich, micronutrient-poor calory sources. "}, {"url": "http://www.orphannutrition.org/understanding-malnutrition/micronutrient-malnutrition/", "passage_text": "Micronutrient deficiency is a lack of essential vitamins and minerals required in small amounts by the body for proper growth and development. "}, {"url": "https://en.wikipedia.org/wiki/Micronutrient", "passage_text": "At the 1990 World Summit for Children, the gathered nations identified deficiencies in two microminerals and one micronutrient – iodine, iron, and vitamin A-as being particularly common and posing public health risks in developing countries. The microminerals or trace elements include at least iron, cobalt, chromium, copper, iodine, manganese, selenium, zinc and molybdenum. Micronutrients also include vitamins, which are organic compounds required as nutrients in tiny amounts by an organism, as well as phytochemicals."}, {"url": "http://www.micronutrient.org/what-we-do/by-micronutrient/micronutrientvitamin-a/", "passage_text": "1 Vitamin A can be found in two categories of food sources: animal sources such as dairy, fish, and meat; and plant sources such as green leafy vegetables, carrots, sweet potatoes, mangos. The solution for correcting vitamin A deficiency lies in improving the child’s diet – through increased consumption of vitamin A-rich foods, naturally rich or commercially fortified foods such as processed oils or sugar."}, {"url": "http://www.micronutrient.org/what-we-do/by-micronutrient/micronutrientvitamin-a/", "passage_text": "WHY VITAMIN A. Vitamin A deficiency is a public health problem all around the world, affecting more than 100 countries. A lack of vitamin A weakens the immune system, putting a child at greater risk of disease and early death; and it is also the leading cause of preventable child blindness. The solution for correcting vitamin A deficiency lies in improving the child’s diet – through increased consumption of vitamin A-rich foods, naturally rich or commercially fortified foods such as processed oils or sugar."}]