[{"url": "http://blog.constitutioncenter.org/2013/05/everything-you-ever-wanted-to-know-about-the-bill-of-rights/", "passage_text": "Many of the rights and liberties Americans cherish—such as speech, religion, and the right to fair trial—were not enumerated in the original Constitution drafted in Philadelphia Convention in 1787, but were included in the first 10 amendments, known as the Bill of Rights. "}, {"url": "http://www.ourdocuments.gov/doc.php?doc=43", "passage_text": "On June 16, 1866, the House Joint Resolution proposing the 14th amendment to the Constitution was submitted to the states. On July 28, 1868, the 14th amendment was declared, in a certificate of the Secretary of State, ratified by the necessary 28 of the 37 States, and became part of the supreme law of the land. Citation: The House Joint Resolution proposing the 14th amendment to the Constitution, June 16, 1866; Enrolled Acts and Resolutions of Congress, 1789-1999; General Records of the United States Government; Record Group 11; National Archives. How to use citation info."}, {"url": "http://www.ushistory.org/gov/10.asp", "passage_text": "However, they do refer to different kinds of guaranteed protections. Civil liberties are protections against government actions. For example, the First Amendment of the Bill of Rights guarantees citizens the right to practice whatever religion they please. Government, then, cannot interfere in an individual's freedom of worship. Most Americans think of civil rights and liberties as principles that protect freedoms all the time. However, the truth is that rights listed in the Constitution and the Bill of Rights are usually competing rights."}, {"url": "http://www.ushistory.org/gov/10.asp", "passage_text": "The Bill of Rights and 14th Amendment. The overwhelming majority of court decisions that define American civil liberties are based on the Bill of Rights, the first ten amendments added to the Constitution in 1791. Most Americans think of civil rights and liberties as principles that protect freedoms all the time. However, the truth is that rights listed in the Constitution and the Bill of Rights are usually competing rights."}, {"url": "http://home.ubalt.edu/shapiro/rights_course/Chapter3text.htm", "passage_text": "A Brief Summary of the Bill of Rights. The First Amendment protects freedom of religion and freedom of speech and of the press. It also protects the right of peaceful assembly and to petition the government. The Second Amendment protects the right to keep and bear arms, for the purpose of maintaining a militia. Nonetheless, most of the important rights contained in the Bill of Rights have been incorporated under this theory. Only a few have been held not to apply, such as the right to bear arms, the right to a grand jury indictment, and the right to a jury trial in civil cases."}, {"url": "https://en.wikipedia.org/wiki/Fourteenth_Amendment_to_the_United_States_Constitution", "passage_text": "Fourteenth Amendment to the United States Constitution. The Fourteenth Amendment (Amendment XIV) to the United States Constitution was adopted on July 9, 1868, as one of the Reconstruction Amendments. The last two clauses of the first section of the amendment disable a State from depriving not merely a citizen of the United States, but any person, whoever he may be, of life, liberty, or property without due process of law, or from denying to him the equal protection of the laws of the State."}, {"url": "http://www.ourdocuments.gov/doc.php?doc=43", "passage_text": "14th Amendment to the U.S. Constitution: Civil Rights (1868). Citation: The House Joint Resolution proposing the 14th amendment to the Constitution, June 16, 1866; Enrolled Acts and Resolutions of Congress, 1789-1999; General Records of the United States Government; Record Group 11; National Archives. How to use citation info."}, {"url": "http://www.boballey.org/Chapter%20Quizzes/Chapter%205%20Civil%20Liberties%20Quiz%20and%20Answers.pdf", "passage_text": "29) In Griswold v. Connecticut, the Supreme Court ruled that the First, Third, Fourth, Fifth, and Fourteenth Amendments cast penumbras, thereby creating A) zones of privacy. B) a constitutional right to abortion. C) the Bill of Rights. D) civil liberties. "}, {"url": "http://www.ourdocuments.gov/doc.php?doc=43", "passage_text": "Passed by Congress June 13, 1866, and ratified July 9, 1868, the 14th amendment extended liberties and rights granted by the Bill of Rights to former slaves. Citation: The House Joint Resolution proposing the 14th amendment to the Constitution, June 16, 1866; Enrolled Acts and Resolutions of Congress, 1789-1999; General Records of the United States Government; Record Group 11; National Archives. How to use citation info."}, {"url": "http://tenthamendmentcenter.com/2012/03/12/the-14th-amendment-and-the-bill-of-rights/", "passage_text": "And if that bulwark of the Bill of Rights — the First Amendment — was not incorporated into Fourteenth Amendment, then neither was the Fifth Amendment or any of the others in the Bill of Rights. And such was the case until late into the nineteenth century. It is a fact of history that James Madison’s proposal in 1789 to extend to the states the freedom of speech and of the press was rejected by the Congress that gave us the Bill of Rights. When the Constitution refers to the states it clearly says so."}]