[{"url": "http://www.differencebetween.com/difference-between-distal-and-proximal/", "passage_text": "Proximal and distal are terms that are used to indicate distances from a standard point of reference. These are terms that are mostly used in the medical world and not used commonly in daily conversation. Distal. In anatomical terms, distal is a point that is located farthest or far away from a standard point of reference. When a doctor uses the term distal to refer to a point in reference to a wound on the arm of his patient, he is referring to a point on the arm closer to the fingers past the wound."}, {"url": "https://en.wikipedia.org/wiki/Femur", "passage_text": "The femur (/ˈfiːmər/) (pl. femurs or femora (/ˈfɛmərə/)), or thigh bone, is the most proximal (closest to the center of the body) bone of the leg in tetrapod vertebrates capable of walking or jumping, such as most land mammals, birds, many reptiles such as lizards, and amphibians such as frogs. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9283", "passage_text": "Proximal: Toward the beginning, the nearer of two (or more) items. For example, the proximal end of the femur is part of the hip joint, and the shoulder is proximal to the elbow. The opposite of proximal is distal. For a more complete listing of terms used in medicine for spatial orientation, please see the entry to  Anatomic Orientation Terms ."}, {"url": "http://www.thefreedictionary.com/distal", "passage_text": "Adj. 1. distal-situated farthest from point of attachment or origin, as of a limb or bone. anatomy, general anatomy-the branch of morphology that deals with the structure of animals. proximal-situated nearest to point of attachment or origin; the proximal end of a bone. distal. adj. 1. (Anatomy) anatomy (of a muscle, bone, limb, etc) situated farthest from the centre, median line, or point of attachment or origin. Compare proximal."}, {"url": "http://www.differencebetween.com/difference-between-distal-and-proximal/", "passage_text": "In anatomy, proximal is always used to indicate the part that is situated closest to the point of attachment. Even if you find it difficult to remember the meaning of proximal, you can easily relate it with proximity that means nearness or closeness. Distal. Distal. In anatomical terms, distal is a point that is located farthest or far away from a standard point of reference. When a doctor uses the term distal to refer to a point in reference to a wound on the arm of his patient, he is referring to a point on the arm closer to the fingers past the wound."}]