[{"url": "http://courseweb.edteched.uottawa.ca/medicine-histology/English/SS_BasicTissues/Nervous_Tissue.htm", "passage_text": "The nervous system is divided into the central nervous system (CNS) and the peripheral nervous system (PNS). The central nervous system is limited to the brain and spinal cord, all other nervous tissue belongs to the peripheral nervous system. An individual nerve cell can have components in both the CNS and the PNS."}, {"url": "http://lifesci.dls.rutgers.edu/~babiarz/nervous.htm", "passage_text": "Glial Cells. Regular connective tissue types surround the components of the central nervous system, but they are not found within the tissue. The glial cells, derived from neuroectoderm, serve roles of connective tissue within the CNS tissue. NERVOUS TISSUE. Nervous tissue is the fourth basic tissue type of the body and is organized into two basic systems: (1) the Central Nervous System (CNS) and (2) the Peripheral Nervous System (PNS). The peripheral system responds to stimuli and sends impulses to the central system (brain and spinal cord)"}, {"url": "http://lifesci.dls.rutgers.edu/~babiarz/nervous.htm", "passage_text": "Central Nervous System. Spinal Cord. The spinal cord is composed of grey and white matter (Spinal Cord 1). The grey matter is composed of nerve cell bodies and in a cross-sectional cut appears as a darker stained H-like central area. NERVOUS TISSUE. Nervous tissue is the fourth basic tissue type of the body and is organized into two basic systems: (1) the Central Nervous System (CNS) and (2) the Peripheral Nervous System (PNS). The peripheral system responds to stimuli and sends impulses to the central system (brain and spinal cord)"}, {"url": "http://jeffline.jefferson.edu/Education/edservices/shared_files/neuroinf/ma04.html", "passage_text": "Virtual slides used in this laboratory exercise: The nervous system consists of the central nervous system (brain and spinal cord) and peripheral nervous system (all nervous tissue outside the central nervous system). Ganglia. Most of the neuron cell bodies that lie outside the central nervous system occur as aggregates known as ganglia. Ganglia are encapsulated by fibrous connective tissue and contain a mixture of elements, some connective tissue and some of neural origin. Most prominent is the ganglion cell."}, {"url": "https://en.wikipedia.org/wiki/Connective_tissue", "passage_text": "Connective tissue (CT) is one of the four types of biological tissue that support, connect, or separate different types of tissues and organs in the body. The other three types are epithelial, muscle, and nervous tissue. Connective tissue is found in between other tissues everywhere in the body, including the nervous system. In the central nervous system the outer membranes, the meninges, that cover the brain and spinal cord are composed of connective tissue. All connective tissue apart from blood and lymph consists of three main components: fibers (elastic and collagenous fibers), ground substance and cells. (Not all authorities include blood or lymph as connective tissue.) Blood and lymph lack the fiber component. All are immersed in the body water"}, {"url": "https://en.wikipedia.org/wiki/Connective_tissue_in_the_peripheral_nervous_system", "passage_text": "Structure [edit]. Nervous tissue is composed of neurons, also called nerve cells, and neuroglial cells. Typically, nervous tissue is categorized into four types of tissue. In the central nervous system (CNS), the tissue types found are grey matter and white matter. In the peripheral nervous system (PNS), the tissue types are nerves and ganglia. In the Peripheral Nervous System: 1  Ganglion tissue is composed of cell bodies, dendrites, and satellite glial cells. 2  Nerves are composed of myelinated and unmyelinated axons, Schwann cells surrounded by connective tissue."}, {"url": "http://www.training.seer.cancer.gov/anatomy/nervous/tissue.html", "passage_text": "Nerve Tissue. Although the nervous system is very complex, there are only two main types of cells in nerve tissue. The actual nerve cell is the neuron. It is the conducting cell that transmits impulses and the structural unit of the nervous system. The other type of cell is neuroglia, or glial, cell. The word neuroglia means nerve glue.. These cells are nonconductive and provide a support system for the neurons. They are a special type of connective tissue for the nervous system."}, {"url": "http://www.lab.anhb.uwa.edu.au/mb140/CorePages/Nervous/Nervous.htm", "passage_text": "Nervous tissue of the CNS does not contain connective tissue other than that in the three meninges (dura mater, arachnoid membrane and pia mater) and in the walls of large blood vessels. Collagenous fibers or fibrocytes/blasts are consequently not observed, which is quite unlike other tissues. "}]