[{"url": "https://en.wikipedia.org/wiki/Bacteremia", "passage_text": "For the systemic immune response to bacterial infection in the blood, see sepsis. Bacteremia (also bacteraemia) is the presence of bacteria in the blood. Blood is normally a sterile environment, so the detection of bacteria in the blood (most commonly accomplished by blood cultures) is always abnormal. Bacteremia is different from sepsis (so-called blood poisoning or toxemia), which is a condition where bacteremia is associated with an inflammatory response from the body (causing systemic inflammatory response syndrome, characterised by rapid breathing, low blood pressure, fever, etc.)."}, {"url": "http://www.ibuzzle.com/articles/what-is-blood-poisoning.html", "passage_text": "Bacteremia refers to the presence of bacteria in the blood stream while sepsis refers to the infection brought on by the presence of bacteria in the bloodstream which manifests as an overall inflammatory response from the body. While one is the cause of a blood infection, the other is a symptom of blood poisoning. Now that you know what is blood poisoning and how it gets to you, let's take a look at the various levels of this condition and how it is treated. The first stage of blood poisoning can be seen as Systemic Inflammation Response Syndrome (SIRS) which manifests as inflammation of the entire body."}, {"url": "http://www.mayoclinic.org/blood-poisoning/expert-answers/FAQ-20058534", "passage_text": "I suspect I have blood poisoning. Blood poisoning is not a medical term. But as the term is usually used, it refers to the presence of bacteria in the blood (bacteremia) — and not a poisonous substance in the blood. However, bacteremia is a serious illness and requires prompt medical attention. "}, {"url": "http://www.healthline.com/health/blood-poisoning", "passage_text": "Blood poisoning is a serious infection. It occurs when bacteria are in the bloodstream. Despite its name, the infection has nothing to do with poison. “Blood poisoning” isn’t a medical term, but medical professionals often use it to describe septicemia or sepsis. Still, the name sounds dangerous, and for good reason. Sepsis is a serious, potentially fatal infection. Blood poisoning occurs when bacteria causing infection in another part of your body enter your bloodstream. The presence of bacteria in the blood is referred to as septicemia. The terms septicemia and sepsis are often used interchangeably. Technically they aren’t quite the same"}, {"url": "http://www.medicinenet.com/sepsis/article.htm", "passage_text": "Blood poisoning is a nonspecific term used mainly by nonmedical individuals that describes, in the broadest sense, any adverse medical condition(s) due to the presence of any toxic agent in the blood. 1 Sepsis is a potentially life-threatening medical condition that's associated with an infection; the infection's signs and symptoms must fulfill a minimum of two criteria of a systemic inflammatory response syndrome (SIRS). 2  Blood poisoning is a nonmedical term that usually refers to the medical condition known as sepsis."}, {"url": "https://www.healthtap.com/topics/blood-poisoning-red-line", "passage_text": "8. Get help from a doctor now ›. Sepsis: Blood poisoning is the common term for sepsis which means bacteria or fungi have entered the blood stream and caused a cascade of immune events creating a very ill patient. "}, {"url": "http://www.medicinenet.com/sepsis/article.htm", "passage_text": "1 Blood poisoning is a nonmedical term that usually refers to the medical condition known as sepsis. 2  The major SIRS criteria are an increased heart rate, fever, and increased respiratory rate; the young and the elderly may show other early signs and symptoms of sepsis sometimes before exhibiting SIRS criteria. 1 Sepsis is a potentially life-threatening medical condition that's associated with an infection; the infection's signs and symptoms must fulfill a minimum of two criteria of a systemic inflammatory response syndrome (SIRS). 2 "}, {"url": "http://www.medicinenet.com/sepsis/article.htm", "passage_text": "Usually, the layperson using the term blood poisoning is referring to the medical condition(s) that arise when bacteria or their products (or both) reach the blood. Blood poisoning is not a medical term and does not appear in many medical dictionaries or scientific publications. However, when it is used, the correct medical term that most closely matches its intended meaning is sepsis. 1 Sepsis is a potentially life-threatening medical condition that's associated with an infection; the infection's signs and symptoms must fulfill a minimum of two criteria of a systemic inflammatory response syndrome (SIRS). 2  Blood poisoning is a nonmedical term that usually refers to the medical condition known as sepsis."}, {"url": "http://www.audioenglish.org/dictionary/blood_poisoning.htm", "passage_text": "Hypernyms (blood poisoning is a kind of...): sepsis (the presence of pus-forming bacteria or their toxins in the blood or tissues). blood disease; blood disorder (a disease or disorder of the blood). Hyponyms (each of the following is a kind of blood poisoning): • BLOOD POISONING (noun). The noun BLOOD POISONING has 1 sense: 1. invasion of the bloodstream by virulent microorganisms from a focus of infection. Familiarity information: BLOOD POISONING used as a noun is very rare."}]