[{"url": "http://www.aromaweb.com/essential-oils/sandalwood-oil.asp", "passage_text": "Sandalwood Essential Oil. Sandalwood Oil is a profoundly versatile essential oil for its applications spiritual and emotional applications as well as its applications in perfumery/fragrancing and skin care. Sandalwood has been used since ancient times as incense for spiritual applications. Sandalwood Essential Oil is deeply grounding and is useful for chakra work. Emotionally, Sandalwood Oil is calming and helps to instill a sense of inner peace. It is a good choice to try in cases of stress, depression or low self esteem."}, {"url": "https://en.wikipedia.org/wiki/Sandalwood", "passage_text": "Various unrelated plants with similarly scented wood or oil include: 1  Adenanthera pavonina-sandalwood tree, red or false red sandalwood. 2  Baphia nitida-camwood, also known as African sandalwood. 3  Eremophila mitchellii-sandalwood; false sandalwood (also sandalbox). Notable members of this group are Indian sandalwood (Santalum album) and Australian sandalwood (Santalum spicatum); others in the genus also have fragrant wood. These are found in India, Nepal, Bangladesh,Pakistan, Sri Lanka, Australia, Indonesia, Hawaii, and other Pacific Islands."}, {"url": "https://en.wikipedia.org/wiki/Pterocarpus_santalinus", "passage_text": "Red sandalwood redirects here. See also: Algum and Adenanthera pavonina. Pterocarpus santalinus, with the common names red sanders, red sandalwood, and saunderswood, is a species of Pterocarpus endemic to the southern Eastern Ghats mountain range of South India. This tree is valued for the rich red color of its wood. The wood is not aromatic."}, {"url": "http://www.dupont.com/products-and-services/construction-materials/surface-design-materials/brands/corian-solid-surfaces/products/corian-all-colors/sub-products/sandalwood.html", "passage_text": "Corian® Sandalwood has warm taupe veins that swirl through a light translucent base with a range of light particles. Share. "}, {"url": "http://www.benjaminmoore.com/en-us/paint-color/sandalwood", "passage_text": "1 Goes Great With: See colors that combine well with your chosen color. 2  More Color Combos: Get more color combinations for your color. 3  See More Shades: View different shades of your selected color. 4  View Similar Colors: See colors resembling the one you've chosen. 5  Share: Share colors with your friends on social networks. 1 View Similar Colors: See colors resembling the one you've chosen. 2  Share: Share colors with your friends on social networks. 3  Send: E-mail your color to others. 4  Print: Print your color. 5  Add to Favorites: Add your color to your Favorites folder."}, {"url": "http://www.benjaminmoore.com/en-us/paint-color/sandalwood", "passage_text": "1 See More Shades: View different shades of your selected color. 2  View Similar Colors: See colors resembling the one you've chosen. 3  Share: Share colors with your friends on social networks. 4  Send: E-mail your color to others. 5  Print: Print your color. 1 View Similar Colors: See colors resembling the one you've chosen. 2  Share: Share colors with your friends on social networks. 3  Send: E-mail your color to others. 4  Print: Print your color. 5  Add to Favorites: Add your color to your Favorites folder."}, {"url": "https://en.wikipedia.org/wiki/Sandalwood", "passage_text": "Sandalwood is the name of a class of woods from trees in the genus Santalum. The woods are heavy, yellow, and fine-grained, and unlike many other aromatic woods, they retain their fragrance for decades. Notable members of this group are Indian sandalwood (Santalum album) and Australian sandalwood (Santalum spicatum); others in the genus also have fragrant wood. These are found in India, Nepal, Bangladesh,Pakistan, Sri Lanka, Australia, Indonesia, Hawaii, and other Pacific Islands."}, {"url": "http://www.benjaminmoore.com/en-us/paint-color/sandalwood", "passage_text": "1 More Color Combos: Get more color combinations for your color. 2  See More Shades: View different shades of your selected color. 3  View Similar Colors: See colors resembling the one you've chosen. 4  Share: Share colors with your friends on social networks. 5  Send: E-mail your color to others. 6  Print: Print your color. 1 View Similar Colors: See colors resembling the one you've chosen. 2  Share: Share colors with your friends on social networks. 3  Send: E-mail your color to others. 4  Print: Print your color. 5  Add to Favorites: Add your color to your Favorites folder."}, {"url": "https://en.wikipedia.org/wiki/Pterocarpus_santalinus", "passage_text": "Pterocarpus santalinus, with the common names red sanders, red sandalwood, and saunderswood, is a species of Pterocarpus endemic to the southern Eastern Ghats mountain range of South India. See also: Algum and Adenanthera pavonina. Pterocarpus santalinus, with the common names red sanders, red sandalwood, and saunderswood, is a species of Pterocarpus endemic to the southern Eastern Ghats mountain range of South India. This tree is valued for the rich red color of its wood. The wood is not aromatic."}]