[{"url": "http://vithit.com/", "passage_text": "10% Citrus juice blended with water and vitamins. At just 17 calories per bottle, this delicious juice was designed for sustained energy release throughout the day. Revive is ideal as a daily pick-me-up with grapefruit, lemon and lime juice blended with two cups of white tea. With no added sugar, 100% of 8 highly effective vitamins and 25mg’s siberian ginseng, Revive is ideal as a natural energy alternative to caffeine."}, {"url": "http://www.songsforteaching.com/foodnutrition.htm", "passage_text": "Step Into It – Music with Mar. These food and nutrition songs are available from a variety of albums. Use them for teaching about fruits, vegetables, food groups, junk food, and healthy snack choices. Dairy."}, {"url": "http://www.webmd.com/diet/guide/vitamin-d-deficiency", "passage_text": "Known as the sunshine vitamin, vitamin D is produced by the body in response to skin being exposed to sunlight. It is also occurs naturally in a few foods -- including some fish, fish liver oils, and egg yolks -- and in fortified dairy and grain products. Because the body makes vitamin D when your skin is exposed to sunlight, you may be at risk of deficiency if you are homebound, live in northern latitudes, wear long robes or head coverings for religious reasons, or have an occupation that prevents sun exposure. You have dark skin."}, {"url": "http://www.health.harvard.edu/mens-health/vitamin-d-and-your-health", "passage_text": "Vitamin D's best-known role is to keep bones healthy by increasing the intestinal absorption of calcium. Without enough vitamin D, the body can only absorb 10% to 15% of dietary calcium, but 30% to 40% absorption is the rule when vitamin reserves are normal. It used to be simple: just get a healthy tan and your body will make all the vitamin D it needs. Desk jobs and sunscreen have changed all that, just as research is underlining the importance of vitamin D and suggesting its possible role in preventing many health problems."}, {"url": "http://www.health.com/health/gallery/0,,20585485,00.html", "passage_text": "by Amanda MacMillan. Nuts are nature's way of showing us that good things come in small packages. These bite-size nutritional powerhouses are packed with heart-healthy fats, protein, vitamins, and minerals. Here's a look at the pros and cons of different nuts, as well as the best and worst products on supermarket shelves today. And although nuts are a healthy choice by themselves, they'll quickly become detrimental to any diet when paired with sugary or salty toppings or mixes. Next: Best nuts for your diet. Get the latest health, fitness, anti-aging, and nutrition news, plus special offers, insights and updates from Health.com!"}, {"url": "http://raisingchildren.net.au/articles/vitamins.html", "passage_text": "Your child needs lots of essential vitamins and minerals for growth and development. They include vitamins A, B, C, D and E and minerals such as calcium, iron, iodine and zinc. The best way for your child to get enough vitamins and minerals is by eating a wide variety of fresh foods, including: 1  vegetables. 2  fruit. If your child has a chronic disease that affects how she absorbs food – such as coeliac disease or Crohn’s disease – the vitamins and minerals in a standard healthy diet might not be enough for her. Your GP or a dietitian can help you work out what you need to do to."}, {"url": "https://ods.od.nih.gov/factsheets/VitaminD-Consumer/", "passage_text": "1 Beef liver, cheese, and egg yolks provide small amounts. 2  Mushrooms provide some vitamin D. In some mushrooms that are newly available in stores, the vitamin D content is being boosted by exposing these mushrooms to ultraviolet light. Vitamin D is important to the body in many other ways as well. Muscles need it to move, for example, nerves need it to carry messages between the brain and every body part, and the immune system needs vitamin D to fight off invading bacteria and viruses."}, {"url": "http://vithit.com/", "passage_text": "VitHit Mandarin & Mango 10% juice blended with spring water and vitamins. Less than 35 calories per bottle. This drink contains 100% niacin, pantothenic acid, vitamin b6, folic acid, biotin & vitamin b12 which are great for a healthy metabolism. Also contains 300 mgs Green tea extract, perfect for inner cleansing. Revive is ideal as a daily pick-me-up with grapefruit, lemon and lime juice blended with two cups of white tea. With no added sugar, 100% of 8 highly effective vitamins and 25mg’s siberian ginseng, Revive is ideal as a natural energy alternative to caffeine."}, {"url": "http://www.webmd.com/diet/guide/vitamin-d-deficiency", "passage_text": "Your exposure to sunlight is limited. Because the body makes vitamin D when your skin is exposed to sunlight, you may be at risk of deficiency if you are homebound, live in northern latitudes, wear long robes or head coverings for religious reasons, or have an occupation that prevents sun exposure. You have dark skin."}]