[{"url": "http://allnurses.com/new-york-nursing/how-long-does-484918.html", "passage_text": "I called NY board of nursing and they have a message that says please allow 10 WEEKS before inquiring about your endorsement!!! They also needed my info from my California license. California says please allow at lease 6 WEEKS. Do the math...that's 4 MONTHS...just process some paper work. Aug 20, '10 by ssikhrakar. It all depends upon how soon they get all the necessary paperwork. As soon as they get all the paperwork, they will endorse the license. Mine took about 2 months because I had to send some of the paperwork twice because the board mentioned that they never received them."}, {"url": "http://www.op.nysed.gov/prof/nurse/nursing.htm", "passage_text": "The fee for licensure and first registration is $143. The fee for a limited permit is $35. Fees are subject to change. The fee due is the one in law when your application is received (unless fees are increased retroactively). You will be billed for the difference if fees have been increased. 1  Do not send cash. If you are licensed as a nurse in another state, you must submit the following: 1  Application for Licensure (Form 1) along with the $143 fee; 2  Certification of Professional Education (Form 2)(if you are foreign educated please use CGFNS."}, {"url": "http://www.op.nysed.gov/prof/nurse/nursing.htm", "passage_text": "The practice of nursing or use of Registered Professional Nurse (RN) or Licensed Practical Nurse (LPN) titles within New York State requires licensure. To be licensed as a registered professional nurse in New York State you must: 1  be of good moral character; 2  be at least eighteen years of age; If you are licensed as a nurse in another state, you must submit the following: 1  Application for Licensure (Form 1) along with the $143 fee; 2  Certification of Professional Education (Form 2)(if you are foreign educated please use CGFNS."}, {"url": "http://allnurses.com/new-york-nursing/how-long-does-484918.html", "passage_text": "0 I'm moving from New England to New York state. It took about a month for me to apply for and receive my RN licenses in Vermont and New Hampshire (both by endorsement). Aug 20, '10 by ssikhrakar. It all depends upon how soon they get all the necessary paperwork. As soon as they get all the paperwork, they will endorse the license. Mine took about 2 months because I had to send some of the paperwork twice because the board mentioned that they never received them."}, {"url": "http://allnurses.com/new-york-nursing/how-long-does-484918.html", "passage_text": "Cjthegreat, it only took 4 days for NY to endorse the license!? Is that typically of NY? I'm debating about whether or not to take my boards in NJ or NY state first. Aug 20, '10 by ssikhrakar. It all depends upon how soon they get all the necessary paperwork. As soon as they get all the paperwork, they will endorse the license. Mine took about 2 months because I had to send some of the paperwork twice because the board mentioned that they never received them."}, {"url": "https://www.ndbon.org/NurseLicensure/InitialEndorse/FAQ.asp", "passage_text": "Q. How long is my initial license valid? A. Effective 04/01/2014 applicants for initial licensure by endorsement or examination shall receive a license expiring 12/31 of the following year as part of the application fee. A. Once all of the paperwork and fee is received in our office, the process will take about 7 to 10 days. A temporary permit will be issued once the board office has received the application, fee, and either an official transcript from your school of nursing or Verification of licensure."}, {"url": "http://allnurses.com/new-york-nursing/license-of-endorsement-593327.html", "passage_text": "Question: If you are licensed in another state and are in the NY license endorsement process will you get a temporary license to work with? I will have my DE license in May and will be endorsing to New York as soon as i get my DE license. I'm a newly licensed RN from NJ. I'm new to this site as a member but I've certainly come here many time for answers. My question for right now is about the license of endorsement for NY. I have a current, active, license in New Jersey but I would also like to apply to have a license in New York as well."}, {"url": "http://floridasnursing.gov/nursing-faqs/licensure-by-endorsement/", "passage_text": "Endorsement is using your active license in another state, or board approved exam scores, to obtain a license in Florida. It is not the same as reciprocity. Reciprocity indicates Florida honors other state licenses and you would be allowed to work in Florida without obtaining a Florida License. "}, {"url": "http://www.ehow.com/info_8539768_long-york-nursing-license-endorsement.html", "passage_text": "All applicants for a New York license by endorsement must complete an application, which is available from the New York State Board of Nursing's website. The application must be notarized before its return. LPN candidates must include a copy of their high school diplomas or GEDs with the application. Applicants for a New York endorsement license must have verification of their nursing credentials sent to the New York State Board of Nursing directly from the boards that issued their credentials. Some boards of nursing accept verification requests through an online system called NURSYS."}]