[{"url": "http://www.smartselfdevelopmentplan.com/what-is-a-personal-development-plan", "passage_text": "1 A business related formal personal development plan: This can be an action plan linked with an annual interview or an action plan following a training. 2  In terms of motivation, it is important to resonate with the goals, even those suggested by your superior."}, {"url": "http://www.smartselfdevelopmentplan.com/what-is-a-personal-development-plan", "passage_text": "If you want to create a personal development plan that helps you to actually achieve your goals, solid preparation is the answer. Preparation already starts with your interest in reading this article, so you are already a good step ahead!"}, {"url": "https://www.healthylifestylesliving.com/liberate-the-mind/personal-development/what-is-a-personal-development-plan-pdp/", "passage_text": "The definition of A Personal Development Plan can be found on Widipedia. A Personal development plan (PDP) provides a powerful, flexible way for you to link your professional and personal development goals and growth. A PDP is a precise, definite written document that maps out how a person can develop skills and progress in their life and their career."}, {"url": "http://www.office.xerox.com/business-resources/careerdevelopmentplanmay2014.doc", "passage_text": "Personal Development Plan. (Insert Your Name Here). A personal development plan will help you improve or maintain your current level of success and prepare for future opportunities. You can include both personal and career goals in a single plan, or create a separate plan for each of the key areas of your life."}, {"url": "http://www.smartselfdevelopmentplan.com/what-is-a-personal-development-plan", "passage_text": "In general, there are three types of motivation to create a personal development plan: 1  A business related formal personal development plan: This can be an action plan linked with an annual interview or an action plan following a training."}, {"url": "http://www.ehow.com/about_5399650_personal-development-planning.html", "passage_text": "Focus. The focus of a personal development plan will provide a theme from which a person can develop individual goals, as well as the behaviors and habits that will make these goals possible. The focus ties in with a person's core value beliefs regarding life, and the role she wishes to fulfill."}, {"url": "http://www2.le.ac.uk/offices/ld/personal-development-planning-pdp", "passage_text": "Personal Development Planning (PDP) is a process designed to enable you to think about, and plan for, your own personal, academic and career development. Throughout your degree you will be encouraged to reflect on your progress and achievements, and to identify areas you wish to develop and improve on."}]