[{"url": "http://www.getproquotes.com/prices-and-costs/foundation-costs.php", "passage_text": "The excavation cost is $1.0 to $2.0 per square foot. The cost of materials and labor for a simple raised perimeter foundation is around $10.00 -$15 per square foot. Other items to be considered for raised perimeter foundation include site drainage, sidewalks, exterior stair landing, driveway retaining walls, perimeter insulation and so on. For complicated slab, the cost is around $15 to $20 per square foot. Raised perimeter foundation consists of a perimeter footing and a concrete stemwall upon which the walls and the floors are erected. The stemwall and the footings can be stepped up to permit the use of under-floor area and the sloping lot."}, {"url": "http://home.costhelper.com/house-foundation.html", "passage_text": "1 A slab foundation for an average 1,600- to 1,800-square-foot family home might cost about $7,000-$16,000 or more, while a slab foundation for a 3,000- to 4,500-square-foot home might cost $13,000-$40,000 or more. 1 And an Illinois log cabin owner-builder estimates about $17,000 in costs for a 24'x36' basement foundation with 8' walls with the concrete poured professionally but the rest done as a serious DIY project.."}, {"url": "http://home.costhelper.com/house-foundation.html", "passage_text": "1 Build Your Own House explains the pros and cons of a crawl space foundation. 2  A full basement foundation for an average home can cost $13,000-$30,000 or more, depending on the width and height of the walls, and whether utilities, windows or other features are included. 1 And an Illinois log cabin owner-builder estimates about $17,000 in costs for a 24'x36' basement foundation with 8' walls with the concrete poured professionally but the rest done as a serious DIY project.."}, {"url": "http://www.kompareit.com/homeandgarden/construction-compare-house-foundation-vs-slab.html", "passage_text": "The cost of a raised foundation varies widely based on the size of your home, its layout and the region of the country where you live. For an average-size home, you can expect to spend around $30,000 to $40,000 in most regions of the country. 1 Costs less to build-Homes with slab foundations, on average, cost about $10,000 less to build. 2  Faster to construct-Building a slab foundation is a simpler process than building a raised foundation, so it doesn’t take as long."}, {"url": "http://home.costhelper.com/house-foundation.html", "passage_text": "1 A crawl space foundation might cost $8,000-$21,000 for an average family home, or $15,000-$50,000 for a larger house. 1 And an Illinois log cabin owner-builder estimates about $17,000 in costs for a 24'x36' basement foundation with 8' walls with the concrete poured professionally but the rest done as a serious DIY project.."}, {"url": "http://njhouseraising.com/index.php/cost-to-raise-your-home", "passage_text": "Cost To Raise A House in NJ. The costs to raise your home above base elevation can be budgeted anywhere from $30,000 to over $100,000. This is a big range, because so many details are needed for a firm accurate pricing of this type of project. NJ house Raising can provide a detailed proposal upon Architect and Engineering drawings. "}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "Below are some concrete prices to help you determine your new concrete foundation cost. 1  Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 1 Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 2  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. 3  One customer in Texas received a quote for a 2,500 square foot foundation slab of about $20,000."}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 2  Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 3  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. 1 Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 2  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. 3  One customer in Texas received a quote for a 2,500 square foot foundation slab of about $20,000."}, {"url": "http://www.improvenet.com/r/costs-and-prices/raise-foundation-cost-estimator", "passage_text": "Many Americans are looking to raise their house foundations due to new restrictions from FEMA. If you want to improve your home and raise a foundation for this or any other reasons, it's an expensive but worthwhile process. Overall, you can expect to spend anywhere between $30,000 and $100,000 depending on the size of your house, number of floors and the size of your house's footprint. "}, {"url": "http://www.getproquotes.com/prices-and-costs/foundation-costs.php", "passage_text": "The cost of constructing simple slab foundation is around $6.00 to $10.00 per square foot including the materials and labor. For complicated slab, the cost is around $15 to $20 per square foot. Raised perimeter foundation consists of a perimeter footing and a concrete stemwall upon which the walls and the floors are erected. The stemwall and the footings can be stepped up to permit the use of under-floor area and the sloping lot."}]