[{"url": "http://grannysvitalvittles.com/real-food-economics-101-real-food-vs-average-food-budgets/", "passage_text": "So, just $5 per day each. That’s $2 less per person per day than the average USDA food budget. For a family of 4 that is $600 per month, with some families coming in a lot lower. The average USDA monthly food budget for that same family is $840. My family ranks toward the high end of the range mainly because we like to eat a larger amount of meat, raw milk and fresh cheese."}, {"url": "http://loweryourspending.com/average-cost-of-groceries-for-1-person-per-month.html", "passage_text": "For females, the average cost of groceries for 1 person per month is about two hundred eighty-three dollars ($283). For males, the average grocery bill for 1 person per month is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://loweryourspending.com/average-amount-spent-on-groceries-for-one-person-per-month.html", "passage_text": "Answer: According to the United States Department of Agriculture, Center for Nutrition Policy and Promotion, the average grocery bill for 1 person per month in the United States is approximately three hundred one dollars ($301.00). Foreword: In this article, we give you the estimated average grocery bill for 1 person per month for both single males and single females in various age groups. For all categories combined, the US average amount spent on groceries for one person per month is about $301.00."}, {"url": "http://loweryourspending.com/average-cost-of-groceries-for-1-person-per-month.html", "passage_text": "The average grocery bill for 1 person per month varied from a low of about one hundred ninety-six dollars ($196) for a single female in the 51 - 70 age group on a thrifty plan to almost four hundred fifty dollars ($450) for a single male in the 19 - 50 age group on a liberal plan. For males, the average grocery bill for 1 person per month is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://loweryourspending.com/average-amount-spent-on-groceries-for-one-person-per-month.html", "passage_text": "This average amount spent on groceries for one person per month was derived by taking an average of the estimated amount spent on groceries per month for a single male and single female in two age groups (19 - 50 and 51 - 70) and four different food-cost plans (thrifty to liberal), as shown in the chart below. Foreword: In this article, we give you the estimated average grocery bill for 1 person per month for both single males and single females in various age groups. For all categories combined, the US average amount spent on groceries for one person per month is about $301.00."}, {"url": "http://loweryourspending.com/average-cost-of-groceries-for-1-person-per-month.html", "passage_text": "Foreword: In this article, we give you the estimated average grocery bill for 1 person per month for both single males and single females in various age groups. For all categories combined, the US average cost of groceries for 1 person per month is about $301.00. For males, the average grocery bill for 1 person per month is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://grannysvitalvittles.com/real-food-economics-101-real-food-vs-average-food-budgets/", "passage_text": "To answer that question we need to know just how much do people spend on food on average on both an average diet and a real food diet. According to the USDA the average family of four is spending somewhere between $544 to $1235 per month for food eaten at home. That’s a huge range! They break it down into 4 plans: Thrifty, low-cost, moderate, and liberal. For a family of 4 that is $600 per month, with some families coming in a lot lower. The average USDA monthly food budget for that same family is $840. My family ranks toward the high end of the range mainly because we like to eat a larger amount of meat, raw milk and fresh cheese."}, {"url": "http://loweryourspending.com/average-cost-of-groceries-for-1-person-per-month.html", "passage_text": "Of course, the average cost of groceries for 1 person per month will vary throughout the United States, even within the contiguous 48 states, not to mention Hawaii and Alaska. For males, the average grocery bill for 1 person per month is closer to three hundred twenty dollars ($320). You can view the raw data at USDA. If you want to perform your own calculations, remember that the data shown is for individuals in a four-person family."}, {"url": "http://loweryourspending.com/average-amount-spent-on-groceries-for-one-person-per-month.html", "passage_text": "The average grocery bill for 1 person per month varied from a low of about one hundred ninety-six dollars ($196) for a single female in the 51 - 70 age group on a thrifty plan to about four hundred forty-eight dollars ($448) for a single male in the 19 - 50 age group on a liberal plan. Foreword: In this article, we give you the estimated average grocery bill for 1 person per month for both single males and single females in various age groups. For all categories combined, the US average amount spent on groceries for one person per month is about $301.00."}, {"url": "http://www.ign.com/boards/threads/how-much-should-groceries-cost-per-month-for-one-person.453322753/", "passage_text": "Depends on how much you're going to cook and make meals yourself, versus buying stuff that's already mostly prepared. If you're going to cook and do all the work yourself, probably $300 per month. If you're buying a lot of prepared stuff probably $500+. I spend $400-500 per month on groceries, give or take."}]