[{"url": "http://www.dailymail.co.uk/news/article-2249060/Corpse-flower-odour-like-rotten-flesh-captured-bloom-Indonesia.html", "passage_text": "Floral spectacle: Visitors look at a blooming titan arum at Djuanda Botanical Garden in Bandung, West Java, Indonesia. It is well-known for smelling like rotting meat. The smell resembles rotting meat to attract the carrion-eating beetles and flesh flies that pollinate it. One plant you definitely won’t want to smell: 'Corpse flower' that has odour like rotten flesh captured in full bloom in Indonesia. 1  Titan arum is seen in full bloom, an unpredictable and spectacular event. 2  The rare flower smells like rotting flesh to attract insects."}, {"url": "http://news.nationalgeographic.com/news/2013/07/130715-corpse-flower-bloom-botany-science/", "passage_text": "Photograph by Roger Hutchings, In Pictures/Corbis. With a name like corpse flower, you know the titan arum (Amorphophallus titanum) isn't going to be smelling like a rose. But until you've gotten up close and personal with the putrid plant, it's not clear just how terrible a flower can smell. A flash of diaper.. Native to Indonesia, the corpse flower favors high heat and humidity and ample space. Though the plant itself is relatively uncommon, the tricks it plays are also used by other members of the plant kingdom. Take the rafflesia, for instance, the giant, dark-red rainforest plant native to Southeast Asia."}, {"url": "http://voices.nationalgeographic.com/2009/06/29/corpse_flower_titan_arum/", "passage_text": "More ». “It really does smell like there’s a dead body in the room.”. Famous for its repulsive rotting-flesh stench and the largest flowering structure in the plant world, the corpse flower always causes something of a stir when it blooms. It is the first blooming of a corpse flower in the Netherlands in more than a decade, according to media reports. The university extended visiting hours to its greenhouse over the weekend to allow people to view and smell the blooming of its corpse flower, which it describes as “the elephant of the plant world.”."}, {"url": "https://en.wikipedia.org/wiki/Amorphophallus_titanum", "passage_text": "Amorphophallus titanum (from Ancient Greek amorphos, without form, misshapen + phallos,  phallus , and titan, giant), known as the titan arum, is a flowering plant with the largest unbranched inflorescence in the world. The titan arum's inflorescence can reach over 3 metres (10 ft) in height. Like the related cuckoo pint and calla lily, it consists of a fragrant spadix of flowers wrapped by a spathe, which looks like a large petal."}, {"url": "http://k99.com/watch-denver-botanical-gardens-corpse-flower-bloom-on-stinky-cam-video/", "passage_text": "Denver Botanic Gardens’ Corpse Flower or Titan Arum is finally blooming! It usually blooms 24-48 hours. The very unique plant is best known for smelling like rotting flesh. The smell of the plant which comes from central Sumatra draws flies and other insects for pollination. "}, {"url": "http://news.nationalgeographic.com/news/2013/07/130715-corpse-flower-bloom-botany-science/", "passage_text": "A titan arum, or corpse flower, blooms in England's Kew Gardens. Photograph by Roger Hutchings, In Pictures/Corbis With a name like corpse flower, you know the titan arum (Amorphophallus titanum) isn't going to be smelling like a rose. But until you've gotten up close and personal with the putrid plant, it's not clear just how terrible a flower can smell. A flash of diaper.. Native to Indonesia, the corpse flower favors high heat and humidity and ample space. Though the plant itself is relatively uncommon, the tricks it plays are also used by other members of the plant kingdom. Take the rafflesia, for instance, the giant, dark-red rainforest plant native to Southeast Asia."}, {"url": "http://www.livescience.com/51923-denver-stinky-corpse-flower-blooms.html", "passage_text": "Visitors to the Denver Botanic Gardens take a gander at a giant corpse flower (Amorphophallus titanum) that bloomed August 19. This was the first bloom for the 13-year-old plant, which produces a smell like rotting meat meant to attract flies, beetles and other carrion-loving pollinators. The plant earns its name — the flower does, indeed, smell like a corpse. First flower. The plant blooming this week at the Denver Botanic Gardens is the first titan arum ever to bloom in the Rocky Mountain region."}, {"url": "https://en.wikipedia.org/wiki/Amorphophallus_titanum", "passage_text": "Due to its odor, which is like the smell of a rotting animal, the titan arum is characterized as a carrion flower, and is also known as the corpse flower, or corpse plant (Indonesian: bunga bangkai – bunga means flower, while bangkai can be translated as corpse, cadaver, or carrion). The titan arum's inflorescence can reach over 3 metres (10 ft) in height. Like the related cuckoo pint and calla lily, it consists of a fragrant spadix of flowers wrapped by a spathe, which looks like a large petal."}, {"url": "http://www.livescience.com/48804-corpse-flower-about-to-bloom.html", "passage_text": "View full size image. In a matter of days, perhaps hours, a rare corpse flower will bloom in upstate New York. True to its name, the plant is expected to unleash a stench like rotting flesh. Affectionately called Wee Stinky, this corpse flower lives in a greenhouse at Cornell University in Ithaca, New York. Horticulturists at the school, who have been preparing for the plant to bloom for weeks, say it could open up any day now."}]