[{"url": "http://www.medicinenet.com/laryngitis/article.htm", "passage_text": "1 The most common symptoms of laryngitis are hoarseness, loss of voice, and throat pain. 2  Symptoms of laryngitis in adults include dry, sore throat, pain with swallowing, and a feeling of fullness in the throat or neck. 1 Chronic laryngitis, in which the symptoms last for weeks may be caused by by gastroesophageal reflux disease, smoking, constant exposure to secondhand smoke, air pollution, or alcohol use."}, {"url": "http://www.webmd.boots.com/cold-and-flu/cold-guide/laryngitis", "passage_text": "Acute laryngitis is most commonly caused by a viral infection, such as a cold or flu. Another type of acute laryngitis is mechanical laryngitis. This can be caused by: 1  Overusing or misusing your voice. 2  Excessive, singing, speaking or shouting. 3  Persistent coughing and throat clearing. 4  A throat injury. Laryngitis is an inflammation of the voice box, or larynx-the tube-like structure at the entrance of your windpipe (trachea). The Adam's apple represents where the larynx sticks out at the front of the throat. The larynx contains two membranes-vocal cords-which vibrate as air passes between them."}, {"url": "http://www.medicinenet.com/laryngitis/article.htm", "passage_text": "1 Symptoms of laryngitis in adults include dry, sore throat, pain with swallowing, and a feeling of fullness in the throat or neck. 2  If the laryngitis is caused by an infection additional symptoms of fever, swollen lymph nodes, may be experienced. 1 Chronic laryngitis, in which the symptoms last for weeks may be caused by by gastroesophageal reflux disease, smoking, constant exposure to secondhand smoke, air pollution, or alcohol use."}, {"url": "http://www.medicinenet.com/laryngitis/article.htm", "passage_text": "1 Symptoms of laryngitis in infants in children include croup, hoarse barky cough, and fever. 2  Chronic laryngitis, in which the symptoms last for weeks may be caused by by gastroesophageal reflux disease, smoking, constant exposure to secondhand smoke, air pollution, or alcohol use. 1"}, {"url": "http://www.webmd.com/cold-and-flu/tc/laryngitis-topic-overview", "passage_text": "Laryngitis can be caused by: 1  Colds or the flu. 2  This is the most common cause. 3  Acid reflux, also known as gastroesophageal reflux disease (GERD) . 4  Overuse of your voice, such as cheering at a sports event. 5  Irritation, such as from allergies or smoke. 6  Use of inhaled steroid medicines (such as those used to treat asthma). Laryngitis can be caused by: 1  Colds or the flu. 2  Acid reflux, also known as gastroesophageal reflux disease (GERD) . 3  Overuse of your voice, such as cheering at a sports event. 4  Irritation, such as from allergies or smoke. 5  Use of inhaled steroid medicines (such as those used to treat asthma). 6  Problems with the way you talk or sing."}, {"url": "http://www.webmd.com/cold-and-flu/tc/laryngitis-topic-overview", "passage_text": "Laryngitis is an inflammation of the voice box, or larynx (say LAIR-inks), that causes your voice to become raspy or hoarse. Laryngitis can be short-term or long-lasting (chronic). Most of the time, it comes on quickly and lasts no more than 2 weeks. Chronic symptoms are those that last 2 weeks or longer. Laryngitis can be caused by: 1  Colds or the flu. 2  Acid reflux, also known as gastroesophageal reflux disease (GERD) . 3  Overuse of your voice, such as cheering at a sports event. 4  Irritation, such as from allergies or smoke. 5  Use of inhaled steroid medicines (such as those used to treat asthma). 6  Problems with the way you talk or sing."}, {"url": "http://www.medicalnewstoday.com/articles/180271.php", "passage_text": "The most common cause of laryngitis is a viral infection, often similar to those that cause the common cold or flu. Overusing the voice-cheering at an event, for example-can also cause inflammation of the larynx. In very rare instances, acute laryngitis can be caused by diphtheria, a bacterial infection. Common symptoms of laryngitis include hoarseness, coughing and painful swallowing. 1  Cold or upper respiratory tract infection. 2  Dry cough (as well as bloody saliva in non-infectious laryngitis). 3  Difficult or painful swallowing. 4  Feeling of fullness, tickling or rawness in throat."}, {"url": "http://patient.info/health/laryngitis-leaflet", "passage_text": "Laryngitis is an inflammation of your voice box (larynx). It is usually due to an infection, most often a virus. You may become hoarse but symptoms usually go within a week or so. See a doctor if symptoms persist. The voice box (larynx) joins the back of the throat to the windpipe (trachea). Usually not. Laryngitis is usually caused by a virus. Antibiotics do not kill viruses; they only kill bacteria. Your immune system usually clears viral infections quickly. A more severe laryngitis is sometimes due to bacteria. An antibiotic may be advised if: 1  The infection is severe."}, {"url": "http://www.medicinenet.com/laryngitis/article.htm", "passage_text": "1 Causes of laryngitis include upper respiratory infection or cold; overuse of the voice box by talking, singing, or shouting; gastroesophageal reflux disease (GERD), reflux laryngitis; chronic irritation of the vocal cords; smoking; exposure to secondhand smoke; or exposure to polluted air. 1 Chronic laryngitis, in which the symptoms last for weeks may be caused by by gastroesophageal reflux disease, smoking, constant exposure to secondhand smoke, air pollution, or alcohol use."}]