[{"url": "http://answers.webmd.com/answers/1188126/what-are-the-side-effects-for", "passage_text": "A. Cranberry is LIKELY SAFE for most people. Cranberry juice and cranberry extracts have been used safely in research. Cranberry juice is LIKELY SAFE for children. But drinking too much cranberry juice can cause some side effects such as mild stomach upset and diarrhea. Drinking more than 1 liter per day for a long period of time might increase the chance of getting kidney stones"}, {"url": "http://www.zhion.com/herb/Cranberry_side_effects.html", "passage_text": "Technically, weight gain can be a side effect of taking cranberry juice. Further, drinking too much cranberry juice may also produce stomach and intestinal disturbance such as diarrhea. [7]CRANBERRY REFERENCES1. Its common names are cranberry, American cranberry bog cranberry. Cranberries are the fruit of a native plant of North America. These red berries are used in many food products, beverages and in herbal products in form of extracts, teas, and capsules or tablets."}, {"url": "http://www.zhion.com/herb/Cranberry_side_effects.html", "passage_text": "CRANBERRY SIDE EFFECTS AND BENEFITScranberry juice and urinary tract infection, cranberry juice benefits, cranberry pills. Cranberry [Vaccinium macrocarpon] is found in North America. Its common names are cranberry, American cranberry bog cranberry. Cranberries are the fruit of a native plant of North America. These red berries are used in many food products, beverages and in herbal products in form of extracts, teas, and capsules or tablets."}, {"url": "http://www.rxlist.com/cranberry-page2/supplements.htm", "passage_text": "home vitamins, herbs, dietary supplements a-z list cranberry. Cranberries contain certain chemicals that prevent bacteria from growing in the urinary tract. Cranberry is safe for most people, but drinking too much cranberry juice can cause some side effects such as mild stomach upset and diarrhea. Drinking more than 1 liter per day for a long period of time might increase the chance of getting kidney stones. Some cranberry juice products are sweetened with extra sugar"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-958-CRANBERRY.aspx?activeIngredientId=958&activeIngredientName=CRANBERRY", "passage_text": "Cranberry juice and cranberry extracts have been used safely in people. Cranberry juice is LIKELY SAFE for children. However, drinking too much cranberry juice can cause some side effects such as mild stomach upset and diarrhea. Drinking more than 1 liter per day for a long period of time might increase the chance of getting kidney stones. 1 Most research shows that drinking cranberry juice or taking certain cranberry extracts can lower the risk of repeated UTIs in some people. 2  Evidence suggests that taking cranberry products can reduce the occurrence of UTIs in women, most children, and people who are hospitalized."}, {"url": "http://answers.webmd.com/answers/1188126/what-are-the-side-effects-for", "passage_text": "Kidney stones: Cranberry juice and cranberry extracts contain a large amount of a chemical called oxalate. In fact, there is some evidence that some cranberry extract tablets can boost the level of oxalate in the urine by as much as 43%. Cranberry juice and cranberry extracts have been used safely in research. Cranberry juice is LIKELY SAFE for children. But drinking too much cranberry juice can cause some side effects such as mild stomach upset and diarrhea."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-958-CRANBERRY.aspx?activeIngredientId=958&activeIngredientName=CRANBERRY", "passage_text": "Kidney stones: Cranberry juice and cranberry extracts contain a large amount of a chemical called oxalate. In fact, there is some evidence that some cranberry extract tablets can boost the level of oxalate in the urine by as much as 43%. 1 Most research shows that drinking cranberry juice or taking certain cranberry extracts can lower the risk of repeated UTIs in some people. 2  Evidence suggests that taking cranberry products can reduce the occurrence of UTIs in women, most children, and people who are hospitalized."}, {"url": "http://www.livestrong.com/article/118844-side-effects-cranberry-juice/", "passage_text": "Kidney Stones. Cranberry juice can contribute to increased risk of developing kidney stones. Cranberry juice contains high levels of chemicals, called oxalate, that are associated with the formation of certain types of kidney stones. Drinking large quantities of cranberry juice may cause upset stomach and diarrhea. Cranberry juice has a high sugar content, so if you have diabetes or glucose intolerance you should avoid excessive sugar intake by choosing sugar-free cranberry juice."}, {"url": "https://nccih.nih.gov/health/cranberry", "passage_text": "Side Effects and Cautions. 1  Drinking cranberry juice products appears to be safe, although excessive amounts could cause gastrointestinal upset or diarrhea. 2  People who think they have a urinary tract infection should see a health care provider for proper diagnosis and treatment. These red berries are used in foods and in herbal products. Historically, cranberry fruits and leaves were used for a variety of problems, such as wounds, urinary disorders, diarrhea, diabetes, stomach ailments, and liver problems."}]