[{"url": "http://www.medicinenet.com/tuberculosis_tb_facts/page2.htm", "passage_text": "Tuberculosis (TB) is a multisystemic infectious disease caused by Mycobacterium tuberculosis, a rod-shaped bacterium. TB is the most common cause of infectious disease-related mortality worldwide (about 1.1 million to 1.7 million people die from it each year worldwide). "}, {"url": "http://www.emedicinehealth.com/tuberculosis/page2_em.htm", "passage_text": "Tuberculosis Causes. All cases of TB are passed from person to person via droplets. When someone with TB infection coughs, sneezes, or talks, tiny droplets of saliva or mucus are expelled into the air, which can be inhaled by another person. "}, {"url": "http://www.who.int/features/qa/08/en/", "passage_text": "A: Tuberculosis (TB) is caused by bacteria (Mycobacterium tuberculosis) that most often affect the lungs. Tuberculosis is curable and preventable. TB is spread from person to person through the air. When people with lung TB cough, sneeze or spit, they propel the TB germs into the air. "}, {"url": "http://www.medicalnewstoday.com/articles/8856.php", "passage_text": "1 TB symptoms (cough, fever, night sweats, weight loss etc.) may be mild for many months, and people ill with TB can infect up to 10-15 other people through close contact over the course of a year. 2  TB is an airborne pathogen, meaning that the bacteria that cause TB can spread through the air from person to person. 1 TB can either be active or latent (where no symptoms occur, and the condition cannot be passed on). 2 "}, {"url": "http://www.nhs.uk/Conditions/Tuberculosis/Pages/Causes.aspx", "passage_text": "Causes of tuberculosis. Tuberculosis (TB) is caused by a type of bacterium called Mycobacterium tuberculosis. The condition is spread when a person with an active TB infection in their lungs coughs or sneezes and someone else inhales the expelled droplets, which contain TB bacteria. Although it is spread in a similar way to a cold or the flu, TB is not as contagious."}, {"url": "http://www.cdc.gov/Features/TBsymptoms/index.html", "passage_text": "Tuberculosis (TB) is a disease caused by bacteria that are spread through the air from person to person. If not treated properly, TB disease can be fatal. People infected with TB bacteria who are not sick may still need treatment to prevent TB disease from developing in the future. Latent TB infection and TB disease. The bacteria that cause TB is spread through the air from person to person. The TB bacteria are put into the air when a person with TB disease coughs, sneezes, speaks, or sings."}, {"url": "http://www.medicalnewstoday.com/articles/8856.php", "passage_text": "Doctors make a distinction between two kinds of tuberculosis infection: latent and active. In latent TB, the TB bacteria remain in the body in an inactive state. They cause no symptoms and are not contagious, but they can become active. In active TB, the bacteria do cause symptoms and can be transmitted to others. 1 TB can either be active or latent (where no symptoms occur, and the condition cannot be passed on). 2  TB symptoms (cough, fever, night sweats, weight loss etc.) may be mild for many months, and people ill with TB can infect up to 10-15 other people through close contact over the course of a year."}, {"url": "https://en.wikipedia.org/wiki/Tuberculosis", "passage_text": "Tuberculosis, MTB, or TB (short for tubercle bacillus), in the past also called phthisis, phthisis pulmonalis, or consumption, is a widespread, infectious disease caused by various strains of mycobacteria, usually Mycobacterium tuberculosis. Tuberculosis typically attacks the lungs, but can also affect other parts of the body. It is spread through the air when people who have an active TB infection cough, sneeze, or otherwise transmit respiratory fluids through the air."}, {"url": "http://tuberculosis.emedtv.com/tuberculosis/causes-of-tuberculosis.html", "passage_text": "An Introduction to the Causes of Tuberculosis. The cause of tuberculosis (TB) is a bacterium called Mycobacterium tuberculosis. This bacterium usually attacks the lungs. However, it can attack any part of the body such as the kidney, spine, and brain. If not treated properly, TB can be fatal. TB was once the leading cause of death in the United States. TB is spread through the air from one person to another. The bacteria are put into the air when a person with active TB of the lungs or throat coughs or sneezes. People nearby may breathe in these bacteria and become infected."}, {"url": "http://www.cdc.gov/tb/publications/faqs/qa_introduction.htm", "passage_text": "Tuberculosis (TB) is a disease caused by bacteria called Mycobacterium tuberculosis. The bacteria usually attack the lungs. But TB bacteria can attack any part of the body such as the kidney, spine, and brain. From there, they can move through the blood to other parts of the body, such as the kidney, spine, and brain. TB disease in the lungs or throat can be infectious. This means that the bacteria can be spread to other people. TB in other parts of the body, such as the kidney or spine, is usually not"}]