[{"url": "https://en.wikipedia.org/wiki/Mithila", "passage_text": "1 Mithila (ancient) , a historical city and region, now divided between India and Nepal. 2  Mithila (India) , Mithila region in India. 3  Mithila (Nepal) , Mithila region in Nepal. 4  Mithila Airport, Asphalt airport in Nepal. Mithila May refer to: 1  Mithila (ancient) , a historical city and region, now divided between India and Nepal. 2  Mithila (India) , Mithila region in India. 3  Mithila (Nepal) , Mithila region in Nepal."}, {"url": "http://www.indianetzone.com/30/mithila_kingdom_ancient_india.htm", "passage_text": "Less... Mithila, the modern Tirhoot was a renowned kingdom in ancient India and mentioned in the Puranas. It existed in the eastern Gangetic plains in areas which are today spread over more than half of Bihar state of India. Mithila was the capital of Videha Kingdom as per epic Ramayana. Mithila is also the name of a style of Hindu art created in the Mithila area. Mithila Paintings started as a custom geometric and symbolic decoration of households done by women, mainly before a marriage the paintings."}, {"url": "https://amitjha.wordpress.com/mithilabirthplace-of-sita/", "passage_text": "She belonged to mithila… after 7th century, a extra country is divided from known as nepal… this wall divides the mithila state into mithila india and mithila nepal… the orginal birthplace of sita(janki) is janakpur which is in nepal… thats why some people say she was born in nepal.. Mithila has from time immemorial been a seat of the tantric tradition, with strong leanings towards the Saiva and Sakti cults. The tradition found expression in domestic rituals, and that is perhaps why the art form was once restricted to women."}, {"url": "http://ganeshbawra.blogspot.com/2012/02/history-of-mithila.html", "passage_text": "The name Mithila is also commonly used to refer to the Videha Kingdom itself, as well as to the modern-day territories that fall within the ancient boundaries of Videha. The city of Mithila has been identified as modern day Janakpur in Dhanusa district of Nepal. The name Mithila is also used to refer to a style of Hindu art, Madhubani art, created in the Mithila area. This art originated as ritual geometric and symbolic decorations on the walls and floors of a house, generally done by women before a marriage."}, {"url": "https://amitjha.wordpress.com/mithilabirthplace-of-sita/", "passage_text": "(right) A painting of Goddess Kali in the Bharni style by Krishnakant Jha. MITHILA, the birthplace of Sita of the Ramayana, lies in the state of Bihar, bounded by the Himalayas in the north and the rivers Kosi, Ganga and Gandak in the east, south and west respectively. Mithila has from time immemorial been a seat of the tantric tradition, with strong leanings towards the Saiva and Sakti cults. The tradition found expression in domestic rituals, and that is perhaps why the art form was once restricted to women."}, {"url": "https://en.wikipedia.org/wiki/Mithila,_India", "passage_text": "Proposed states of India. Mithila (Devnagri: मिथिला, mithilā Tirhuta: মিথিলা) is a proposed state in India, comprising the Maithili speaking region of North Bihar bordering Nepal. Mithila also refers to a Janakpur (Mithila Nagari), the capital of the Videha Kingdom, located in southern Nepal. The capital city of Mithila has been identified as Janakpur in the Dhanusa district of Nepal. "}, {"url": "http://ganeshbawra.blogspot.com/2012/02/history-of-mithila.html", "passage_text": "Mithila (Sanskrit: मिथिला, mithilā) was a city in Ancient India, the capital of the Videha Kingdom. The name Mithila is also commonly used ... The name Mithila is also used to refer to a style of Hindu art, Madhubani art, created in the Mithila area. This art originated as ritual geometric and symbolic decorations on the walls and floors of a house, generally done by women before a marriage."}, {"url": "http://wikitravel.org/en/Mithila", "passage_text": "Mithila is in Bihar. Mithila is an ancient cultural region of South Nepal and North India lying between the lower ranges of the Himalayas and the Ganges River. The Nepal border cuts across the top fringe of this region. The Gandak and Kosi Rivers are rough western and eastern boundaries of Mithila. "}]