[{"url": "http://www.hockey-reference.com/about/glossary.html", "passage_text": "Goals against. GAA. Goals against average; calculated by dividing goals against by minutes played, then multiplying by 60 (the length of a regulation game). GC. Goals created; calculated by adding goals scored to 0.5 times assists, then multiplying by team goals divided by team goals plus 0.5 times team assists. Plus/minus; calculated by subtracting the total number of goals allowed by a player's team while the player is on the ice (at even strength or on the power play) from the total number of goals scored by the player's team while the player is on the ice (at even strength or short-handed). 123."}, {"url": "http://icehockey.wikia.com/wiki/Goals_against_average", "passage_text": "Example: If you allowed 4 goals in 180 minutes your GAA is 1.33 (180 divided 60 = 3. 4 divided by 3 = 1.33). Another way is to take the amount of goals against, multiply that by 60 minutes (one game), and then divide by the amount of minutes played. It is typically given to two decimal places. 240 divided by 180 = 1.33). The result, both ways, suggests that for every full game you play, you allow 1.33 goals. Since the statistic is highly dependent on the team playing in front of a goalie, save percentage is usually considered a more accurate measure of a goaltender's skill."}, {"url": "https://en.wikipedia.org/wiki/Goals_against_average", "passage_text": "Goals Against Average (GAA) is a statistic used in field hockey, ice hockey, lacrosse, soccer and water polo that is the mean of goals allowed per game by a goaltender. GAA is analogous to a baseball pitcher 's earned run average (ERA). In Japanese, the same translation (防御率) is used for both GAA and ERA, because of this. For ice hockey, it is calculated per game by dividing the number of goals against by the number of minutes played in the game then multiplied by 60. For a season, divide the total number of goals against by the result of the total number of minutes played (also known as time on ice) multiplied by 60. Since the statistic is highly dependent on the team playing in front of a goalie, save percentage is usually considered a more accurate measure of a goaltender's skill, especially in ice hockey and lacrosse, as it takes into account the number of shots the goaltender has faced."}, {"url": "https://answers.yahoo.com/question/index?qid=20070203150014AAu04xl", "passage_text": "GAA It is calculated by dividing the number of minutes played by 60 minutes(one game) then dividing the goals against by that answer. It is typically given to two decimal places. http://en.wikipedia.org/wiki/Goals_Again... Say that season, in 10 games, I allowed 51 goals in 395 minutes (it's roller hockey, so it's going to be higher in my example, apply your stats as appropriate): (45/395) x 51 = 5.81 GAA You will need to know minutes and seconds and convert to a decimal to do this accurately."}, {"url": "https://answers.yahoo.com/question/index?qid=20080827171324AAGQ9mD", "passage_text": "GAA requires that you check out how many minutes the goalie has played. GAA = (Goals allowed * 60)/ minutes played For example. If a goalie has given up 3 goals and then gets pulled for the final minute, his GAA is not 3.00. It would actually be 3.05. Same thing for if a goalie gets pulled at intermission. For the save percentage you divide the number of saves by the number of shots. For EX. 24/25 = 96% For goals against Average you divide the number of goals against by the number of games played. For EX. 80/46=1.74 GAA. Jophis23 · 7 years ago."}, {"url": "http://www.sportingcharts.com/dictionary/nhl/goals-against-average.aspx", "passage_text": "Goals-against average, or GAA, is calculated by taking the number of goals scored on a goaltender, multiplying that figure by 60 (the number of minutes in a standard NHL game), and dividing the result by the total number of minutes the goaltender has played so far (GAA = (goals scored on x 60) / minutes played). Most goaltenders finish a season with a goals-against average of between 2.0 and 3.0. A goals-against average under 2.0 is excellent, and a GAA over 3.0 is considered high."}, {"url": "http://proicehockey.about.com/od/learnthegame/f/goalie_stats.htm", "passage_text": "Answer: Goals-Against Average. This is the number of goals allowed per 60 minutes played, rounded to two decimal points. The Formula: multiply the number of goals allowed by 60 and divide by the total number of minutes played. The Example: If you allowed 4 goals in 180 minutes your GAA is 1.33 (4 times 60 = 240. 240 divided by 180 = 1.33). The result suggests that for every full game you play, you allow 1.33 goals. This number expresses a goalie's success based on the number of shots he faces. The Formula: Divide the number saves made by the number of shots on goal. Work it out to 3 decimal places. The Example: If you faced 45 shots and allowed 5 goals, your save percentage is .888 (40 saves divided by 45 shots = .888)."}]