[{"url": "http://www2.ca.uky.edu/agc/pubs/agr/agr76/agr76.htm", "passage_text": "Lime and Fertilizer Needs. Alfalfa removes large amounts of nutrients from the soil. A ton of alfalfa hay contains 54 lb of nitrogen, 12 lb of phosphate, 50 lb of potash, 30 lb of calcium, 5 lb of magnesium, and 5 lb of sulfur plus the micronutrients. Alfalfa should be seeded at 15 to 20 lb of seed per acre for pure alfalfa stands. When moisture, timing, and seed-bed preparation are optimum, the lower rate can be used. When conditions are less than optimum, use the 20-lb/acre rate."}, {"url": "http://www.soilcropandmore.info/crops/alfalfa/Oklahoma_Alfalfa/fertility-alf-guide.htm", "passage_text": "Alfalfas response to phosphorus fertilizer the first year increased as applied phosphorus increased, with maximum yield of seven tons per acre at the 600 pounds per acre of P 2 O 5 rate (Table 4-4). The best way to determine how much phosphorus (P 2 O 5) and potassium (K 2 O) to apply is to test the soil. Results of a soil test are calibrated to give a Soil Test Index that relates to the amount needed in pounds per acre of P 2 O 5 or K 2 O (Table 4-2)."}, {"url": "http://www.extension.purdue.edu/extmedia/AY/AY-331-W.pdf", "passage_text": "Figure 3. A multi-year Purdue study found that the highest alfalfa yields were recorded when fertilizer rates were 50 pounds of P 2 O 5 per acre per year, and 200 pounds or more of K 2 O per acre per year. "}, {"url": "http://extension.missouri.edu/p/G4555", "passage_text": "Manure is an unbalanced fertilizer. If application rates of manure are based on one nutrient, other nutrients are likely to be overapplied or underapplied. For example, a 4-ton alfalfa crop will remove 200 pounds N per acre in the hay. At the same time, it will remove far less P and K; a 4-ton hay crop will remove only 40 pounds P 2 O 5 per acre (18 pounds P per acre) and 180 pounds K 2 O (150 pounds K per acre). Nutrient removal by alfalfa hay Alfalfa contains approximately 4.5 pounds P per ton (10 pounds P2O5 per ton) when harvested between early and late bloom. Potassium content increases as available soil K increases, ranging from 25 to 60 pounds K per ton (30 to 70 pounds K2O per ton)."}, {"url": "http://www1.foragebeef.ca/$foragebeef/frgebeef.nsf/all/frg90/$FILE/fertilizingalfalfa.pdf", "passage_text": "Fertilizing Alfalfa Forage A lfalfa is the most commonly grown forage legume in Manitoba with about 1.5 million acres (600,000 hectares) in crop. According to Manitoba AgriculturalServices Corporation statistics, the average yield of alfalfa forage in Manitoba is 2.3 tons/acre (5.7 tonnes/hectare)."}, {"url": "http://www.alisorganics.com/blogs/news/7791213-using-alfalfa-meal-as-a-fertilizer", "passage_text": "In garden soil or worm bins. Adding a cup of alfalfa meal two times a month to worm bins will boost worm activity. Add 5 pounds of Alfalfa Meal for every 100 square foot as a general fertilizer for vegetable gardens. Alfalfa tea is great for all plants! Wrap one cup of Alfalfa Meal in cheesecloth and let steep for two to three days in 3 gallons non-chlorinated water. Strain and spray on roses, or any other plant. "}, {"url": "http://www1.agric.gov.ab.ca/$department/deptdocs.nsf/all/agdex10473", "passage_text": "For example, if the recommended amount of nitrogen fertilizer for a pure grass stand is 60 lb/ac, then the recommended nitrogen in a stand with 25 per cent alfalfa would be reduced by about 25 per cent to 45 lb N/ac. Nitrogen is often the most limiting nutrient in grass production across Alberta. A 3 ton/ac grass crop will remove 90 to 100 lbs N/ac. Little research data is available on what the economic rates of nitrogen fertilizer are for grass production in Alberta."}, {"url": "http://www1.agric.gov.ab.ca/$department/deptdocs.nsf/all/agdex739", "passage_text": "Nitrogen. Alfalfa is a legume that can fix its own nitrogen (N) with the help of Rhizobium meliloti, a bacteria that lives in association with alfalfa roots. The bacteria converts nitrogen gas (N 2) in the air into a form that plants can use. A 5 ton/ac alfalfa crop will fix up to 250 lb/ac of nitrogen per year. Since the soils in southern Alberta are low in N-fixing bacteria, alfalfa seed must be inoculated with the R. meliloti. Alfalfa seed is often pre-inoculated before sale. Applying nitrogen fertilizer on healthy alfalfa stands is not recommended. Phosphorus. If phosphate was not applied before seeding or is limiting production, a grower may consider an annual maintenance application of 50 lb/ac of P 2 O 5 to meet crop removal rates."}, {"url": "http://www.gardeningknowhow.com/garden-how-to/soil-fertilizers/fertilizing-with-alfalfa-meal.htm", "passage_text": "How to Use Alfalfa Meal in the Garden. There is no great trick to learning how to use alfalfa meal. The amount you use is important, but it’s more likely that you won’t use enough rather than using too much. Sprinkle about 2 cups of the meal around rose bushes or other shrubs of that size. Work the alfalfa meal into the soil with a rake, then water the plants as usual. Do the first application in the spring, when your plants begin to show new growth. Those plants that only bloom once in the year don’t need any more meal added."}]