[{"url": "http://www.slurry.com/index.php/magazine-articles/3-asphalt-emulsions-definition-manufacture-and-usage", "passage_text": "1 Invert Emulsions are available and achieve penetration equal to a cutback. 2  It is the water phase in a standard emulsion that prevents the penetration into the pavement, one way of overcoming this is to make an emulsion where the Asphalt is the continuous phase. 1 The water phase means that the viscosity of the emulsion is lower than the base Asphalt, thus application will be at much lower temperatures than for Asphalt. 2  In many instances the emulsion may be applied at ambient. 3  This lower viscosity also means that Asphalt emulsions are less sensitive to weather conditions."}, {"url": "http://www.dictionaryofconstruction.com/definition/asphalt-emulsion.html", "passage_text": "Definition. Liquid asphalt in which water has been suspended. When the water evaporates, the asphalt hardens. Asphalt emulsion is used in pavingas a tack coat to bind one course to another. Print | Cite This Source | Link to This Page."}, {"url": "http://telfercompanies.com/asphalt-emulsions", "passage_text": "Asphalt Emulsions. Asphalt emulsion is a combination of three basic ingredients; asphalt, water, and small amounts of emulsifying agent. In the same process, these components are introduced into a mechanism known as a colloid mill, which shears the asphalt into tiny droplets. Asphalt emulsions are used in cold processes for road construction and maintenance. Emulsions are classified on the basis of how quickly the asphalt droplets will re-coalesce (break and setup). The terms rapid set (RS), medium set (MS), quick set (QS) and slow set (SS) have been adopted to classify the emulsions."}, {"url": "http://bitumina.co.uk/bitumen-emulsions.html", "passage_text": "In the production of bitumen emulsion, water is treated with an emulsifying agent and other chemicals and is pumped to a colloid mill along with bitumen. The colloid mill breaks the bitumen up into tiny droplets. The emulsifying agent migrates to the asphalt-water interface and keeps the droplets from coalescing. "}, {"url": "http://ftp.dot.state.tx.us/pub/txdot-info/cst/AsphaltEmulsions.pdf", "passage_text": "Asphalt Emulsion Emulsified asphalt, as used by TxDOT, consists of asphalt droplets suspended in water. This dispersion under normal circumstances would not take place, since everyone knows that oil and water don’t mix, but if an emulsifying agent is added to the water the asphalt will remain dispersed. The emulsifying agent migrates to the asphalt-water interface and keeps the droplets from coalescing. The emulsion is then pumped to a storage tank. Asphalt emulsions are very complicated and use a lot of chemistry to get the emulsion properties desired."}, {"url": "http://us.henry.com/roofing/protective-coatings/107-asphalt-emulsion", "passage_text": "Henry Building Envelope Systems Brochure. Henry 107 Asphalt Emulsion is a premium, versatile coating for the protection of roofing materials, metal, and masonry surfaces. Solvent-free, it is made from asphalt emulsified with bentonite clay and water. "}, {"url": "http://www.pavementinteractive.org/article/Emulsified-Asphalt/", "passage_text": "Please copy/paste the following text to properly cite this Pavement Interactive article: Emulsified asphalt is simply a suspension of small asphalt cement globules in water, which is assisted by an emulsifying agent (such as soap)."}, {"url": "http://ftp.dot.state.tx.us/pub/txdot-info/cst/AsphaltEmulsions.pdf", "passage_text": "In the production of asphalt emulsion, water is treated with an emulsifying agent and other chemicals and is pumped to a colloid mill along with asphalt. The colloid mill breaks the asphalt up into tiny droplets. The emulsifying agent migrates to the asphalt-water interface and keeps the droplets from coalescing. The emulsion is then pumped to a storage tank. Asphalt emulsions are very complicated and use a lot of chemistry to get the emulsion properties desired."}, {"url": "http://onlinepubs.trb.org/onlinepubs/circulars/ec102.pdf", "passage_text": "James: Overview of Asphalt Emulsion 3 Standard bitumen (asphalt) emulsions are normally considered to be of the O/W type and contain from 40% to 75% bitumen, 0.1% to 2.5% emulsifier, 25% to 60% water plus some minor components which are described below. The bitumen droplets range from 0.1–20 micron in diameter. USE OF ASPHALT EMULSION The first asphalt (bitumen) emulsions used in road construction were prepared in the early part of the 20th century. Today approximately 3 million tons of emulsions are produced in the United States representing about 5% to 10% of asphalt consumption."}]