[{"url": "http://traveltips.usatoday.com/average-temperature-athens-greece-14725.html", "passage_text": "Athens, Greece, has relatively mild weather, with the average daytime temperatures ranging from 52 degrees Fahrenheit in January to 92 degrees in August. The humidity does not add considerably to the heat you feel during the hottest days either."}, {"url": "http://www.currentresults.com/Weather/Greece/temperature-may.php", "passage_text": "Average Temperatures for Greece in May. Average temperatures for May at cities and islands throughout Greece are listed below in degrees Celsius and Fahrenheit. The tables give the maximum and minimum monthly temperatures based on weather data collected over several decades."}, {"url": "http://www.currentresults.com/Weather/Greece/temperature-may.php", "passage_text": "Average temperatures for May at cities and islands throughout Greece are listed below in degrees Celsius and Fahrenheit. The tables give the maximum and minimum monthly temperatures based on weather data collected over several decades."}, {"url": "http://www.holiday-weather.com/athens/averages/may/", "passage_text": "Weather lowdown. The month of May in Athens sees spring in full gear, along with the first signs of the summer heat. The average temperature this month is 20°C (68°F), while the average low is just 15°C (59°F), and the average high rises to 24°C (75°F). The beginning of May brings sunny days, with virtually no rain, and an average daily temperature of 17°C (63°F)."}, {"url": "https://weatherspark.com/averages/32181/5/Athens-Athina-Attica-Greece", "passage_text": "This report describes the typical weather at the Athens International Airport (Eleftherios Venizelos) (Athens (Athina), Greece) weather station over the course of an average May. It is based on the historical records from 2004 to 2012. Earlier records are either unavailable or unreliable."}, {"url": "http://traveltips.usatoday.com/average-temperature-athens-greece-14725.html", "passage_text": "June through August are the peak temperature times in Athens. The average daytime high ranges from 85 degrees in June to 90 degrees in August, according to Weather.com. The low temperatures are 68 degrees in June to 72 degrees in August."}]