[{"url": "https://en.wikipedia.org/wiki/International_waters", "passage_text": "Oceans, seas, and waters outside of national jurisdiction are also referred to as the high seas or, in Latin, mare liberum (meaning free sea). International waters can be contrasted with internal waters, territorial waters and exclusive economic zones."}, {"url": "https://en.wikipedia.org/wiki/Territorial_waters", "passage_text": "Territorial waters or a territorial sea as defined by the 1982 United Nations Convention on the Law of the Sea, is a belt of coastal waters extending at most 12 nautical miles (22.2 km; 13.8 mi) from the baseline (usually the mean low-water mark) of a coastal state. 1 In the Gulf of Finland, there is a strip of international waters regardless of the 12 nmi limit: the outer limit of the territorial sea shall at no place be closer to the midline than 3 nautical miles (5.6 km; 3.5 mi). 2  Bogskaer, bogskär a remote, island has only 3 nautical (miles.5 6; km.3 5) mi territorial.  waters"}, {"url": "http://worldoceanreview.com/en/wor-2/fisheries/deep-sea-fishing/catching-fish-in-international-waters/", "passage_text": "The fish catch in international waters outside the EEZ is regulated by the Regional Fisheries Management Organizations (RFMOs) and their member countries. These members include not only the bordering states, but also countries that are heavily involved in fishing in a given marine region. For example, China and Japan also fish in the northeast Atlantic. This is consistent with international maritime law and completely legitimate according to the principle of freedom of access to the high seas. The European countries, in turn, are represented in numerous RFMOs through the European Commission."}, {"url": "http://www.gc.noaa.gov/gcil_maritime.html", "passage_text": "The maritime zones recognized under international law include internal waters, the territorial sea, the contiguous zone, the exclusive economic zone, the continental shelf, the high seas and the Area. "}, {"url": "http://www.answers.com/Q/What_is_international_water_in_the_Gulf_of_Mexico", "passage_text": "Making the world better, one answer at a time. I believe that state waters in Florida, Texas, and Puerto Rico extend out to 9 miles with the exception of the Atlantic side of Florida where it ends at 3 miles. Federal waters end at 12 nautical miles offshore of the US. HOWEVER, there is a 24 mile US contiguous zone and a 200 mile exclusive economic zone in which some laws still do apply. If you are planning on doing something sketchy, go really far offshore or talk to a lawyer."}, {"url": "https://en.wikipedia.org/wiki/Territorial_waters", "passage_text": "The term territorial waters is also sometimes used informally to describe any area of water over which a state has jurisdiction, including internal waters, the contiguous zone, the exclusive economic zone and potentially the continental shelf. 1 In the Gulf of Finland, there is a strip of international waters regardless of the 12 nmi limit: the outer limit of the territorial sea shall at no place be closer to the midline than 3 nautical miles (5.6 km; 3.5 mi). 2  Bogskaer, bogskär a remote, island has only 3 nautical (miles.5 6; km.3 5) mi territorial.  waters"}, {"url": "http://legal-dictionary.thefreedictionary.com/International+Waterways", "passage_text": "In International Law, international waterways are straits, canals, and rivers that connect two areas of the high seas or enable ocean shipping to reach interior ports on international seas, gulfs, or lakes that otherwise would be land-locked. Customary international law has never granted equal access and rights to countries that share navigable rivers either as boundaries between them or as waterways that traverse them successively."}, {"url": "https://en.wikipedia.org/wiki/International_waters", "passage_text": "Ships sailing the high seas are generally under the jurisdiction of the flag state (if there is one); however, when a ship is involved in certain criminal acts, such as piracy, any nation can exercise jurisdiction under the doctrine of universal jurisdiction. International waters can be contrasted with internal waters, territorial waters and exclusive economic zones."}]