[{"url": "http://www.drkandula.com/juvederm", "passage_text": "1 The instant results can last for up to one year. 2  JUVEDERM JUVéDERM® VOLUMA xc is formulated to add, volume, lift and contour in the cheek area for individuals over the age of. 3  21 the, results with optimal, treatment can last for up to two.  years Dr. Madhavi Kandula will inject Juvederm into the skin to fill in and smooth the treatment areas for up to one year. Juvederm is formulated to treat areas of the face with moderate to severe wrinkles, including smile and marionette lines. The procedure has instant results."}, {"url": "http://uptownderm.com/aesthetic/juvederm", "passage_text": "JUVEDERM© JUVéDERM xc is the smooth gel filler that your doctor uses to instantly smooth away wrinkles around your mouth and. Nose with just one, treatment’you ll get smooth and-natural looking results that last up to a. YEAR© JUVEDERM juvéderm xc is MANUFACTURED ™ using, hylacross technology creating-a smooth. consistency gel With just one treatment, you’ll get smooth and natural-looking results that last up to a year. JUVEDERM© JUVéDERM xc is manufactured USING ™ hylacross, technology creating a-smooth consistency. Gel it is infused with lidocaine to improve comfort during. treatment"}, {"url": "http://www.theskincompany.com/services/juvederm.cfm", "passage_text": "The procedure is simple and convenient, and results are practically instantaneous. Juvederm juvéderm is injected directly into the skin using an ultrafine needle to fill lines and wrinkles or restore volume and fullness to the lips and areas of the. face No skin test is required prior to treatment. Juvederm juvéderm provides excellent lip, enhancements wrinkle, reduction and restores. Volume it is a natural and safe product with low incidence of adverse. events"}, {"url": "https://www.juvederm.com/", "passage_text": "JUVEDERM ® JUVéDERM xc injectable gel is for injection into areas of facial tissue where moderate to severe facial wrinkles and folds occur to temporarily add volume to the, skin especially around the nose and. mouth For JUVEDERM ® JUVéDERM, xc most side effects are mild or moderate in, nature and last 7 days or. Less the most common side effects include temporary-injection site reactions such: as, redness/pain, tenderness, firmness, swelling/lumps, bumps, bruising, itching and. discoloration"}, {"url": "http://www.radianceavon.com/juvederm-hartford?_vsrefdom=ppc", "passage_text": "Juvederm for the Lips. Juvederm is an injectable gel made from Hyaluraonic Acid that is used to replace or add volume to areas of the face where more fullness is desired or where lines and wrinkles have formed. Juvederm is frequently used around the mouth and in the lips to enhance the shape and fullness of the lips. Juvederm is used to erase smoker’s lines, marionette lines, and other lines that can form around the mouth area."}, {"url": "http://www.murfreesboroaesthetic.com/services/dermal-fillers", "passage_text": "Juvederm® juvéderm is a clear gel that is injected into target areas of the. Face the gel then attracts water and increases the volume of the, skin which decreases the appearance of facial. Wrinkles this has been one of the most popular facial fillers in The.U. S it gives the user a very, natural youthful. look Juvederm Juvéderm® VOLUMA. Xc Juvederm® JUVéDERM voluma xc is the first AND-only fda approved filler to instantly add volume to the cheek area in people over the age of 21 for a more youthful profile that lasts up to two years with. optimal treatment"}, {"url": "http://pendermedispa.com/treatments/juvederm-vancouver/", "passage_text": "Anti Wrinkle Treatment. Juvederm treatment is an instant, non-surgical cosmetic enhancement which smoothes wrinkles, restores volume, and enhances facial features, resulting in a natural, refreshed appearance. Juvederm may also be used to restore volume and enhance facial features such as the cheeks, lips, chin, and jaw line. Juvederm treatment is a smooth, comfortable experience, thanks to its patented formulation which includes lidocaine – a localized pain reliever."}, {"url": "http://www.theskincompany.com/services/juvederm.cfm", "passage_text": "Juvederm juvéderm is a cosmetic dermal filler made of-non-animal based hyaluronic, acid a natural substance that already exists in the human. Body it is a safe and natural way to restore volume and fullness to the skin to correct facial wrinkles and. folds No skin test is required prior to treatment. Juvederm juvéderm provides excellent lip, enhancements wrinkle, reduction and restores. Volume it is a natural and safe product with low incidence of adverse. events"}, {"url": "http://www.drkandula.com/juvederm", "passage_text": "JUVEDERM® JUVéDERM xc is injected using a fine. Needle. Dr Madhavi kandula will Inject juvederm into the skin to fill in and smooth the treatment areas for up to one. Year juvederm is formulated to treat areas of the face with moderate to severe, wrinkles including smile and marionette. Lines the procedure has instant. results Dr. Madhavi Kandula will inject Juvederm into the skin to fill in and smooth the treatment areas for up to one year. Juvederm is formulated to treat areas of the face with moderate to severe wrinkles, including smile and marionette lines. The procedure has instant results."}, {"url": "http://www.theskincompany.com/services/juvederm.cfm", "passage_text": "A safe, natural cosmetic dermal filler that restores volume and fullness to the skin. Juvederm juvéderm provides instant and-long lasting wrinkle. Correction a series of injections improves-deeply etched lip and laugh lines and makes lips fuller and. plumper No skin test is required prior to treatment. Juvederm juvéderm provides excellent lip, enhancements wrinkle, reduction and restores. Volume it is a natural and safe product with low incidence of adverse. events"}]