[{"url": "http://answers.webmd.com/answers/2000021/how-long-is-someone-with-the-flu-contagious", "passage_text": "A. THe CDC says 'Most healthy adults may be able to infect others beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick. Children may pass the virus for longer than 7 days.'. Remember that some people who get the flu may not have symptoms and can spread the virus too. 18 Followers. A. You may be able to pass on the flu to someone else before you know you are sick, as well as while you are sick. "}, {"url": "https://www.sharecare.com/health/swine-flu/how-long-h1n1-flu-contagious", "passage_text": "If you have H1N1 flu, or any other type of influenza, you are contagious for five to seven days after your symptoms first started. You are also contagious one day before you feel symptoms. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "You can be contagious from a few days up to two weeks or more, depending on which virus is causing your stomach flu (gastroenteritis). A number of viruses can cause gastroenteritis, including noroviruses and rotaviruses. 1 Some people may be contagious for up to two weeks after recovery. 2  Rotavirus. 3  Symptoms of rotavirus — the leading cause of viral gastroenteritis in infants and young children — usually appear one to three days after exposure."}, {"url": "http://health.howstuffworks.com/diseases-conditions/cold-flu/contagious.htm", "passage_text": "Most experts agree that adults with a cold or the flu start being contagious about a day before they start experiencing symptoms. For the flu, the contagious period then lasts five to seven days into the illness. For children, the contagious period for the flu can last up to two weeks after they start feeling sick, even if they start feeling better before that. The contagious period for a cold lasts about three to four days into the illness. As a general rule, people with a cold are most contagious about three days after their initial exposure to the virus. For more information on colds, influenza and related topics, check out the links on the next page."}, {"url": "http://www.cdc.gov/flu/about/disease/spread.htm", "passage_text": "The Flu Is Contagious. Most healthy adults may be able to infect other people beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick. Children may pass the virus for longer than 7 days. Symptoms start 1 to 4 days after the virus enters the body. That means that you may be able to pass on the flu to someone else before you know you are sick, as well as while you are sick. Some people can be infected with the flu virus but have no symptoms."}, {"url": "http://www.tandurust.com/communicable-diseases/how-long-flu-contagious-prevention.html", "passage_text": "The person who is suffering from flu can spread the infection one day before the beginning of the symptoms and remains contagious for five to six days after the flu symptoms develop. People who have weak immune system and children are known to remain contagious for more than a week. Flu is the most contagious disease. People suffering from flu can spread the infection even if the person is six feet away through droplet infection. Most experts believe the virus remains active in the droplet when the person suffering from it sneezes or coughs."}, {"url": "http://www.cdc.gov/flu/about/qa/disease.htm", "passage_text": "Children may pass the virus for longer than 7 days. Symptoms start 1 to 4 days after the virus enters the body. Information about how long a person is contagious is available at How Flu Spreads. Fever, chills, fatigue, body aches, sore throat, and headache are common symptoms of flu. Not everyone with flu will have a fever. The flu can cause mild to severe illness, and at times can lead to death. The flu is different from a cold."}, {"url": "http://www.healthline.com/health/cold-flu/contagious", "passage_text": "The flu is contagious a day before and five days to a week after its onset. Young children, people over 65, those with compromised immune systems, and people with a terminal illness are at risk of death from the flu. Pregnant women are also at greater risk. The flu can also cause premature birth. "}, {"url": "http://www.webmd.com/cold-and-flu/tc/influenza-cause", "passage_text": "When are you contagious? If you are infected with the flu, you are most likely to pass it to someone else from 1 day before symptoms start and up to 7 days after symptoms develop. Children may be infectious for longer than 7 days after symptoms start. Symptoms usually develop 1 to 4 days after you are infected. Because symptoms may not develop for a couple of days, you may pass the flu to someone before you know you have it."}, {"url": "http://www.medicinenet.com/how_long_is_a_cold_or_flu_contagious/article.htm", "passage_text": "However, the viruses that cause colds (for example, rhinoviruses) are not the same as those that cause the flu (influenza viruses). Although the typical incubation period for influenza is about one to four days, some adults can be contagious from about one day before onset of symptoms for up to two weeks. Other people who develop complications, such as pneumonia, may extend the contagious period for a week or two. For colds, most individuals become contagious about a day before cold symptoms develop and remain contagious for about five to seven days."}]