[{"url": "http://www.hollinfarms.com/pages/beef.html", "passage_text": "Pricing at a glance (Based on target live weight of 800 lbs) Quarter Half Whole Beef 83 lbs 165 lbs 330 lbs $ per lb $6.95 $6.75 $6.50 Next available slaughter date for beef is August 10, 2015. Click here to order beef and make a deposit Phone 540-592-3701 during business hours if you have a question. We have less of a markup for an order of a whole or half beef so we estimate combined prices per pound for a whole at about $6.50 and for a half or side at $6.75. Price will vary a few pennies of each side of this bench mark depending on the individual animal and how you cut your beef."}, {"url": "http://diemer45.drivehq.com/rrbeef/beefyield.html", "passage_text": "Brisket. Used for corned beef roast, stew, or ground for hamburger. One roast per half beef. Stew Meat Lean cubes of meat in approximately one pound packages. Approximately 6 packages per half beef. Short Ribs Ribs used for barbequing or boiling. Approximatelu 3-4 one and a half pound packages per half beef. (For a quarter beef cut the amount in half, for a whole beef double the yield shown.). Steak (standard thickness 3/4). T-Bone. Approximately 14 steak"}, {"url": "https://www.sauerfamilybeef.com/faqs/", "passage_text": "An average hanging weight for a half of a beef is 400 pounds. Standard-cut processing results in an approximately 38% yield loss. So if you have the beef “standard-cut”, you would expect to take home approximately 248 pounds of packaged meat. In a half of a beef, there are approximately 12 roasts, 14 t-bone steaks, 5 sirloin steaks, 5 sirloin tip steaks, 14 rib-eye steaks, 4 filet mignon and 6 round steaks. There are also short ribs, flank steak, stew meat, brisket and approximately 75# of ground beef."}, {"url": "http://www.hollinfarms.com/pages/beef.html", "passage_text": "How much will the beef cost me and how can I compare the Hollin price with that of others? We estimate a price of $6.50 per pound for a whole young beef, $6.75 per pound for a half or side, and $6.95 for a quarter (half of a half) beef for the cut weight (not the hanging weight). We have less of a markup for an order of a whole or half beef so we estimate combined prices per pound for a whole at about $6.50 and for a half or side at $6.75. Price will vary a few pennies of each side of this bench mark depending on the individual animal and how you cut your beef."}, {"url": "http://msue.anr.msu.edu/news/how_much_to_expect_when_buying_freezer_beef_part_one", "passage_text": "200. 140. 100. **Half of a half is when the cuts from the hind quarter (round and loin) are mixed with cuts from the forequarter (chuck and rib) for each customer. In terms of how much freezer space will be needed, the general rule is one cubic foot per 35-40 pounds of packaged meat. Estimated pounds of beef from a 600, 700 or 800 pound carcass purchased as a whole carcass, half of a carcass, half of a half and cut either with bone-in cuts (70 percent of carcass weight) or boneless cuts (50 percent of carcass weight) and ground beef."}, {"url": "http://diemer45.drivehq.com/rrbeef/beefyield.html", "passage_text": "Rock Ridge Beef Yield. If you order a half or whole beef you may have it cut and wrapped any way you prefer. This is what you can expect from a 300-325 pound half beef. (For a quarter beef cut the amount in half, for a whole beef double the yield shown.). Steak (standard thickness 3/4). T-Bone. Approximately 14 steaks per half beef."}, {"url": "http://www.edgewoodlocker.com/meat-processing/how-much-meat-are-we-getting/", "passage_text": "Meat from a typical half beef (from 1,000 – 1,200 lb. animal) consist of approximately: 12 T-Bone Steak (3/4” thick). 12 Ribeye Steak (3/4”). 7 Top Sirloin Steak (3/4”). 2 Sirloin Tip Roasts (3lb). 16 Round Steak (3/4”). "}, {"url": "http://www.cjgrassfed.com/frequently-asked-questions-when-ordering-bulk-beef", "passage_text": "So, here is a rough estimate of what a half of beef would cost. 250 lbs x $4.00 = $1000.00. 250 lbs x $0.59 = $147.50. $32.50. $10.00. Total: $1190.00. Of course this will vary with what the actual weight of the animal is. There is an additional fee for making hamburger patties, cubed steak, and rolled rump roast. "}, {"url": "http://www.newgrassfarm.com/ordering-quarters-halves-whole-beef", "passage_text": "When we take your order for a quarter/half or whole beef, we try to give you a date when it will go to the meat processor. When the steer goes to the processor we will call you to get your instructions for how you want your beef cut. Quarter: 120-160 lbs = approximately $450-600 for the meat, and about $75-100 for the processing. Half: 240-320 lbs = approximately $900-$1200 for the meat, and about $150-200 for the processing. Whole: 480-640 lbs = approximately $1800-2400 for the meat, and about $300-$35"}]