[{"url": "http://pcsupport.about.com/od/componentprofiles/p/ups_backup.htm", "passage_text": "A battery backup, or uninterruptible power supply (UPS), is primarily used to provide a backup power source to important desktop computer hardwar e components. In most cases, those pieces of hardware include the main computer housing and the monitor."}, {"url": "http://www.webopedia.com/TERM/U/UPS.html", "passage_text": "Short for uninterruptible power supply, a power supply that includes a battery to maintain power in the event of a power outage. Typically, a UPS keeps a computer running for several minutes after a power outage, enabling you to save data that is in RAM and shut down the computer gracefully."}, {"url": "http://www.computerspot.co.uk/what-does-a-ups-do/", "passage_text": "A UPS, or Uninterpretable Power Supply, is more than just a big battery that cuts in if you get a power cut. There are 2 different types of UPS, online and offline, the most common type is an online UPS which is what we will talk about."}, {"url": "http://searchdatacenter.techtarget.com/definition/uninterruptible-power-supply", "passage_text": "A UPS contains a battery that kicks in when the device senses a loss of power from the primary source. If you are using the computer when the UPS notifies you of the power loss, you have time to save any data you are working on and exit gracefully before the secondary power source (the battery) runs out. When all power runs out, any data in your computer's random access memory (RAM) is erased."}, {"url": "http://money.howstuffworks.com/ups.htm", "passage_text": "UPS can deliver to 80 percent of the planet within 48 hours, so if you live somewhere else, it's still pretty likely that UPS can find you to drop off or pick up packages. That's a lot of addresses -- and a lot of packages. In fact, in 2005, UPS delivered 3.75 billion packages and letters."}, {"url": "http://www.abbreviations.com/UPS", "passage_text": "Ups is an open source source-level debugger developed in the late 1980s for Unix and Unix-like systems, originally developed at the University of Kent by Mark Russell. It supports C and C++, and Fortran on some platforms. The last beta release was in 2003."}, {"url": "http://www.computerspot.co.uk/what-does-a-ups-do/", "passage_text": "Typically a UPS is purchased for a Server to protect it from power failures, but they do more than that. An online UPS will:-. 1  Power your Computer for a period of time if the mains fails. 2  Once the UPS battery hits a certain level it can, gracefully, shut the server down."}]