[{"url": "http://www.funtrivia.com/askft/Question12631.html", "passage_text": "1 vote Vote for this answer. Death Valley is 282 feet below sea level, so it is the lowest point not covered by water in the Western Hemisphere. The lowest in the world is the Turfan depression in central Asia, which is in the very westernmost part of China."}, {"url": "http://geology.com/records/continents-highest-mountains.shtml", "passage_text": "Mount Everest is the highest mountain on the Asian continent and the highest mountain in the world. Its summit is 29,035 feet (8,850 meters) above sea level. It is located on the border of Nepal and China. Image of Mount Everest copyright by iStockPhoto and Holger Mette."}, {"url": "http://www.funtrivia.com/askft/Question12631.html", "passage_text": "The Dead Sea shores are the lowest point at 400 meters below sea level and decreasing in each year. By the way Jericho is 250 meters below sea level (820 feet)."}, {"url": "http://www.answers.com/Q/What_is_the_highest_and_lowest_point_in_asia", "passage_text": "The lowest point in Asia (and the world) is the Dead Sea Shore. It  is 1369 feet below sea level. It is located in Jordan. 2 people found this useful."}, {"url": "http://www.infoplease.com/ipa/A0001763.html", "passage_text": "The following table lists the approximate land area, highest elevation, and lowest elevation of the world's continents, including Africa, Antarctica, Asia, Australia, Europe, North America, and South America, according to the World Atlas."}, {"url": "http://www.answers.com/Q/What_is_the_highest_and_lowest_point_in_asia", "passage_text": "Making the world better, one answer at a time. The highest point in Asia is Mt. Everest which is 8,850 meters above sea level. And Asia's lowest point is the Dead Sea which is 400 meters below"}, {"url": "http://geology.com/below-sea-level/", "passage_text": "The Bentley Subglacial Trench in Antarctica reaches 2555 meters below sea level. It is the lowest point on Earth that is not covered by ocean, although it is covered by ice. The trench is huge, roughly the size of Mexico. The deepest point on the ocean floors is -10,916 meters in the Mariana Trench."}]