[{"url": "https://en.wikipedia.org/wiki/Miami-Dade_County,_Florida", "passage_text": "Miami-Dade County (commonly called Dade County, Dade, Metro-Dade or Greater Miami) is a county located in the southeastern part of the State of Florida and is the southeasternmost county on the U.S. mainland. It is the only county in Florida that does not have an elected sheriff, or an agency titled Sheriff's Office.. Instead, the equivalent agency is known as the Miami-Dade Police Department, and its leader is known as the Metropolitan Sheriff and Director of the Miami-Dade Police Department."}, {"url": "http://miamicountyks.org/145/GIS", "passage_text": "Miami County real property information is available on a linked site. On this site you will find current year’s appraisal, current property characteristic information, the appraised value for the prior year, current year after June 15, and the most recent tax information. "}, {"url": "http://www.miamicountysheriff.org/", "passage_text": "The Miami County Sheriff has many responsibilities and in order to fulfill these responsibilities employs a wide range of personnel. The current staff at the sheriff’s office numbers approximately 120 and is divided into three main groups. The primary jail is downtown at the Miami County Safety Building and currently houses a maximum of 43 prisoners. The second jail (Miami County Incarceration Facility) is north of Troy and has the ability to house a maximum of 240 prisoners when fully funded and staffed."}, {"url": "https://en.wikipedia.org/wiki/Miami-Dade_County,_Florida", "passage_text": "As of the 2010 census, the county had a population of 2,496,435, making it the most populous county in Florida and the seventh-most populous county in the United States. It is also Florida's third-largest county in terms of land area, with 1,946 square miles (5,040 km 2). The county seat is Miami. It is the only county in Florida that does not have an elected sheriff, or an agency titled Sheriff's Office.. Instead, the equivalent agency is known as the Miami-Dade Police Department, and its leader is known as the Metropolitan Sheriff and Director of the Miami-Dade Police Department."}, {"url": "http://www.miamicountyin.gov/", "passage_text": "Welcome to the Official Website of Miami County, Indiana! Miami County Courthouse Hours: 8:00 AM to 4:00 PM 25 N. Broadway Monday thru Friday Peru, IN 46970 1-765-472-3901 Use of this website constitutes agreement with our terms and conditions of use. Not sure where to start? Don't have JavaScript enabled? Try our site map."}, {"url": "https://en.wikipedia.org/wiki/Miami_County,_Ohio", "passage_text": "Miami County is a county located in the U.S. state of Ohio. As of the 2010 census, the population was 102,506. Its county seat is Troy. The county is named for an Indian word of disputed meaning. Miami County is part of the Dayton, OH Metropolitan Statistical Area. Geography [edit]. According to the U.S. Census Bureau, the county has a total area of 410 square miles (1,100 km 2), of which 407 square miles (1,050 km 2) is land and 3.1 square miles (8.0 km 2) (0.8%) is water."}, {"url": "http://www.co.miami.oh.us/index.aspx?NID=134", "passage_text": "1 Court Services: The goal of the Miami County Municipal Court Services is to manage all services of the Court, under direction of the elected Judges, and through the Court Administrator. 2  Efficient, fair, and impartial public service remains a priority of the court. "}, {"url": "http://www.miamicountysheriff.org/sheriffsales", "passage_text": "Sheriff Sales. Click for List of Sales. Sheriff’s sales for foreclosure and tax delinquent properties will be held every Wednesday at 10:00 A.M. in the lobby of the Miami County Sheriff’s Office located at 201 W. Main Street, Troy, Ohio. (Please bring a completed buyer form with you to the auction. It can be found below.). "}, {"url": "http://www.miamicountysheriff.org/", "passage_text": "In Miami County we have two jails. The primary jail is downtown at the Miami County Safety Building and currently houses a maximum of 43 prisoners. The second jail (Miami County Incarceration Facility) is north of Troy and has the ability to house a maximum of 240 prisoners when fully funded and staffed. The Incarceration facility was reopened in July of 2013 after being closed for 3 1/2 years due to budget constraint"}]