[{"url": "http://www.ehow.com/about_6643498_difference-between-redwoods-sequoias.html", "passage_text": "Both the coastal redwood and the giant sequoia appear reddish from a distance, which is why both are of the redwood (Taxodiaceae) family. However, subtle variations in the coloration of the various barks distinguish the two."}, {"url": "http://www.gardenguides.com/97472-differences-between-redwood-sequoia-trees.html", "passage_text": "Both trees are members of the same plant family, Taxodiaceae, or bald cypress family. However, they are each categorized into a separate group, or genus: the California redwood or coastal redwood (Sequoia sempervirens) and the giant sequoia or giant redwood (Sequoiadendron giganteum)."}, {"url": "http://homeguides.sfgate.com/difference-between-sequoia-sempervirens-sequoia-giganteum-90373.html", "passage_text": "The giant sequoia and coast redwood differ in their size and shape. The coast redwood is the taller tree while the giant sequoia is the bigger tree. The tallest coast redwood, known as the Hyperion tree, is 379.7 feet tall. Old growth coast redwoods have a trunk circumference of around 75 feet and weight of a around 1.6 million pounds."}, {"url": "http://www.livescience.com/39461-sequoias-redwood-trees.html", "passage_text": "Among the places that preserve giant sequoias are Sequoia National Forest, Sequoia National Park, and Giant Sequoia National Monument. Redwoods. These tallest of trees reach heights of more than 350 feet (107 meters). The tallest tree in the world is named Hyperion, which reaches 379.7 feet (115.7 meters)."}, {"url": "http://www.ehow.com/about_6643498_difference-between-redwoods-sequoias.html", "passage_text": "Difference Between Redwoods and Sequoias. ... and coast redwood trees (Sequoia sempervirens) both belong to the redwood family, called Taxodiaceae. 1  The Different Species of Pine Cones."}, {"url": "http://www.visitsequoia.com/redwoods-and-sequoias.aspx", "passage_text": "Sequoias and giant redwoods are often referred to interchangeably, though they are two very different, though equally remarkable, species of tree. Both naturally occurring only in California, these two species share a distinctive cinnamon-colored bark and the proclivity for growing to overwhelming heights."}, {"url": "http://www.gardenguides.com/122104-differences-between-redwoods-sequoia-trees.html", "passage_text": "Size. Coastal redwoods are the tallest trees, but giant sequoias are the most massive. The tallest coastal redwood is 378 feet tall, according to the Sequoia National Park website. The largest giant sequoia grows to 310 feet tall but has a base diameter of 35 feet."}]