[{"url": "http://www.howmuchisit.org/speeding-ticket-cost/", "passage_text": "1 The cost of a speeding ticket will widely depending on how fast you were traveling. 2  The speeding ticket will be broken up in a few different categories. 3  These include 0-10 mph over, 11-15 mph over, 16 to 25mph over and 25+. 4  The faster the ticket was written for, the higher the fine can be."}, {"url": "http://auto.howstuffworks.com/under-the-hood/cost-of-car-ownership/cost-of-speeding-ticket.htm", "passage_text": "While the cost of a speeding ticket varies by region and offense, most sources say that the average cost of a speeding ticket is $150, including court fees [source: The Auto Insurance ]."}, {"url": "http://texas.drivinguniversity.com/speeding-tickets/speeding-ticket-fines", "passage_text": "$300. In San Antonio, the amount of your Texas speeding fine is determined by the following formula: $166.00 for the first 10 miles per hour over, and $5.00 for each additional mile per hour over that."}, {"url": "http://www.howmuchisit.org/speeding-ticket-cost/", "passage_text": "1 The average speeding ticket cost can be anywhere from $20 to as much as $1,000. 2  A speeding ticket in the San Diego area can cost anywhere from $273 to $250, while a speeding ticket in Vermont can cost as much as $1,000. 3  Generally, the faster you go, the more you’re going to pay."}, {"url": "http://www.speedingticketcentral.com/Texas-speeding-ticket.html", "passage_text": "Texas Speeding Ticket Cost. The fine for a Texas speeding ticket starts at $120.00 for 5mph over and there is a graduated scale up to $185.00 for 25mph over. Above 25mph you have to contact the court. Some courts may also be allowed to add surcharges so the only way to know exactly is to contact the clerk of court."}, {"url": "http://www.dmv.org/tx-texas/traffic-ticket-fines-and-penalties.php", "passage_text": "Texas Traffic Ticket Fines and Costs. Traffic ticket fines vary by county in Texas. For example, running a red light in Bexar County won't cost the same as running one in Travis County. Additionally, counties might charge various fees that differ throughout the state."}]