[{"url": "https://www.sharecare.com/health/walking/what-muscles-involved-walking", "passage_text": "The primary muscles involved in walking are the muscles of the lower leg (soleus, gastrocnemius, tibialis anterior/posterior, and peroneals), and the thigh/knee (vastus lateralis, medialis, obliques, and rectus femoris)."}, {"url": "http://www.answers.com/Q/What_muscles_are_used_during_a_pirouette", "passage_text": "The squat is nicknames 'the king of all exercises' as it involves so many muscles and requires all over body strength and power. The main muscles involved are the quads, hamst … rings, glutes, lower back and core, but many other muscles are used to a lesser extent."}, {"url": "http://healthyliving.azcentral.com/leg-muscles-engaged-during-ballet-pirouette-6210.html", "passage_text": "The classic ballet move, the pirouette, is a complete 360-degree turn performed on one leg. In a ballet, it is usually done more than one time, in a twirling motion. Leg muscles used in a pirouette are the calves, hamstrings and quadriceps. The surrounding muscles of the knees play a crucial role in balance and rotation during a pirouette."}, {"url": "http://www.answers.com/Q/What_muscles_are_used_during_a_pirouette", "passage_text": "The arm muscles are also involved in a pirouette; while spinning, a dancer brings the arms closer to her body in order to narrow the axis of rotation, which helps to gain speed in the rotations of the turn. A pirouette requires the use of almost all the muscle groups in the body."}, {"url": "http://www.answers.com/Q/What_are_the_main_muscles_used_during_gymnastics", "passage_text": "The arm muscles are also involved in a pirouette; while spinning, a dancer brings the arms closer to her body in order to narrow the axis of rotation, which helps to gain speed in the rotations of the turn. A pirouette requires the use of almost all the muscle groups in the body."}, {"url": "http://www.answers.com/Q/What_muscles_are_used_during_a_pirouette", "passage_text": "Confidence votes 169. The most important muscles engaged in a pirouette are not those in the legs, as many might think, but actually, the abdominal muscles. If a dancer's core is not engaged, it's easy to fall forward or backward out of a pirouette."}, {"url": "http://jabailyd.blogspot.com/", "passage_text": "Before Attempting a Pirouette ... Before attempting a pirouette all the muscles involved need to be strengthened and stretched. Here are some examples of what you can do: During a pirouette the stomach and core muscles act as stabilizers, so it is important to have a strong core."}]