[{"url": "http://www.ehow.com/how_18302_become-secret-service.html", "passage_text": "To become a Secret Service agent, you must be a U.S. citizen, between the ages of 21 and less than 37 years old at the time of appointment and possess a current driver's license. Your vision can be no worse than 20/60 uncorrected and correctable to 20/20 in each eye. Applicants with a master's degree or one year of specialized work experience equivalent to a GL-7 level will enter the Secret Service at level GL-9."}, {"url": "http://www.onlinemilitaryeducation.org/faq/how-do-you-become-a-secret-service-agent-as-former-military/", "passage_text": "It is easier to become a secret service agent as former military than it is as a civilian. If you have left the military and would like to pursue a position with the Federal Bureau of Investigations, you must go through the standard application process for consideration. "}, {"url": "http://www.howdoibecomea.net/secret-service-agent/", "passage_text": "To get a job as a secret service agent, you will simply need to submit an application to the appropriate government branch. You should be prepared to undergo a very rigorous application process. It can be very difficult to obtain a position as a secret service agent. It will be important for you to make sure that individuals do not pose a threat to government officials. You may have to work long hours as a secret service agent. When a politician is running for re-election, you may find that you have to work extended hours and accompany the politician to his or her campaign sites."}, {"url": "http://www.howdoibecomea.net/secret-service-agent/", "passage_text": "To become a secret service agent, you do not need to obtain any particular degree. It is helpful if you decide to pursue a degree in a field like government studies or criminology. Pursuing a degree in one of these fields will help you gain a formative understanding of the different functions of government. It will be important for you to make sure that individuals do not pose a threat to government officials. You may have to work long hours as a secret service agent. When a politician is running for re-election, you may find that you have to work extended hours and accompany the politician to his or her campaign sites."}, {"url": "http://work.chron.com/become-secret-service-agent-8820.html", "passage_text": "The first step to becoming a Secret Service agent is to excel in school and avoid getting into any trouble with the law. Because so many people want to become Secret Service agents and because of the sensitive nature of the work, any criminal activity on your record disqualifies you as an applicant. To apply for the Secret Service, you must be an American citizen between 21 and 37 years old, with uncorrected eyesight no worse than 20/60. If your eyesight is not 20/20 uncorrected, it must be correctable to 20/20. You must also possess a current driver's license. Related Reading: Secret Service Vs. Pay Grade Requirements. Secret Service agents are hired at one of two pay grades. To qualify for the GL-7 pay grade, you must have a bachelor's degree with a grade-point of average of at least 3.0, or 3.5 for your junior and senior years."}, {"url": "http://www.ehow.com/how_18302_become-secret-service.html", "passage_text": "Alternatively, you can have one full year of graduate education or one year of specialized work experience equivalent to a GL-5 level. Applicants with a master's degree or one year of specialized work experience equivalent to a GL-7 level will enter the Secret Service at level GL-9."}, {"url": "http://www.howdoibecomea.net/secret-service-agent/", "passage_text": "When you are a secret service agent, you will likely be on your feet all day. You may go with the president to his or her special functions for the day. It may be your job to protect the president’s children or spouse when they go out on the town. It will be important for you to make sure that individuals do not pose a threat to government officials. You may have to work long hours as a secret service agent. When a politician is running for re-election, you may find that you have to work extended hours and accompany the politician to his or her campaign sites."}, {"url": "http://www.secretservice.gov/join/careers/", "passage_text": "More than a job, a career with Secret Service offers one-of-a-kind training, a high level of responsibility and a future as you continuously apply new skills, making a positive impact in one of the nation’s most important federal law enforcement areas. The job of special agent offers qualified men and women a challenging and fulfilling career. The U.S. Secret Service recruits personnel of the highest caliber to carry out its integrated missions of investigation and protection."}, {"url": "http://www.ehow.com/how_18302_become-secret-service.html", "passage_text": "Tests & Evaluations. Applicants must pass the Treasury Enforcement Agent examination, a report writing test, polygraph examination, drug screening and extensive background investigation. You will also undergo a series of in-depth interviews and successfully obtain top secret security clearance. Applicants with a master's degree or one year of specialized work experience equivalent to a GL-7 level will enter the Secret Service at level GL-9."}]