[{"url": "https://en.wikipedia.org/wiki/Participle", "passage_text": "A participle is a form of a verb that is used in a sentence to modify a noun, noun phrase, verb, or verb phrase, and thus plays a role similar to that of an adjective or adverb. It is one of the types of nonfinite verb forms. "}, {"url": "http://www.grammar-monster.com/glossary/participles.htm", "passage_text": "Search. A participle is a word formed from a verb which can be used as an adjective. The two types of participles are the present participle (ending ing) and the past participle (usually ending-ed, -d, -t, -en, or-n). Here are some participles being used as adjectives: It is really common to see participles in participle phrases. A participle phrase also acts like an adjective"}, {"url": "https://owl.english.purdue.edu/owl/resource/627/02/", "passage_text": "A participial phrase is a group of words consisting of a participle and the modifier(s) and/or (pro)noun(s) or noun phrase(s) that function as the direct object(s), indirect object(s), or complement(s) of the action or state expressed in the participle, such as: Removing his coat, Jack rushed to the river. A participle is a verbal that is used as an adjective and most often ends in-ing or-ed. The term verbal indicates that a participle, like the other two kinds of verbals, is based on a verb and therefore expresses action or a state of being."}, {"url": "http://magoosh.com/gmat/2012/participle-phrases-on-the-gmat/", "passage_text": "The big idea is: participles and participial phrases are modifiers. They act as an adjective, modifying any noun in the sentence, or they can act as an adverb, modifying one of the main verbs of the sentence. By contrast, a participial phrase cannot usurp the role of the main verb of a sentence or clause. "}, {"url": "http://grammar.about.com/od/pq/g/partphraseterm.htm", "passage_text": "Definition. A participial phrase is a word group consisting of a present participle (also known as an-ing form) or past participle (also known as an-en form), plus any modifiers, objects, and complements. A participial phrase commonly functions as an adjective. See Examples and Observations below. "}, {"url": "http://www.testden.com/toefl/english-grammar-for-students/Perfect-Participle.html", "passage_text": "They are therefore perfect participles. A perfect participle is a participle that expresses an action or state as just finished. Point out the different kinds of participles in the follow-ing sentences, and tell what word each modifies: 1. Seeing the multitude, he went up into a mountain. 2"}, {"url": "http://www.chompchomp.com/terms/participlephrase.htm", "passage_text": "A participle phrase will begin with a present or past participle. If the participle is present, it will dependably end in ing. Likewise, a regular past participle will end in a consistent ed. Irregular past participles, unfortunately, conclude in all kinds of ways [although this list will help]. Don't mistake a present participle phrase for a gerund phrase. Gerund and present participle phrases are easy to confuse because they both begin with an ing word. The difference is the function that they provide in the sentence."}, {"url": "http://www.learnenglish.de/grammar/participleperfect.html", "passage_text": "The perfect participle indicates completed action. You form the perfect participle by putting the present participle having in front of the past participle. For example:-. having done, having finished, having read, having spoken. It can be used to form the passive voice."}]