[{"url": "http://www.gatlineducation.com/demo/Vet_Assist_DEMO/JSCTP/html/L21/L21CH02P01.html", "passage_text": "The most common sites I take blood samples from are the jugular vein, cephalic vein, and saphenous vein. The locations of the veins are the same in every dog and, for that matter, every cat. The picture below shows where these are. "}, {"url": "http://www.veindirectory.org/glossary/cephalic-vein", "passage_text": "The cephalic vein can also be used to withdraw blood for analysis. The cephalic vein is also used for the creation of an AV fistula (a connection between and artery and a vein). An AV fistula is used to dialyze patients with kidney failure. Blood clots: Sometimes a blood clot may form in the cephalic vein and cause mild pain. Unlike blood clots in the leg, cephalic vein blood clots do not migrate. The blood clots generally resolve on their own and do not require any specific medication."}, {"url": "http://www.knowyourbody.net/cephalic-vein-antecubital-vein.html", "passage_text": "Cephalic vein Location. It is located on the lateral side of the left and right arm that runs from the hand to the shoulder. It is not a deep or distal but a superficial vein and hence clearly visible through the skin. Cephalic vein Origin. It arises at the radial border of the dorsal venous network of the hand. Here, an accessory cephalic vein, which is a variable vein, passes along the radial border of the forearm to join the large blood vessel near the elbow."}, {"url": "https://en.wikipedia.org/wiki/Cephalic_vein", "passage_text": "In human anatomy, the cephalic vein (also known as the antecubital vein)is a superficial vein of the upper limb. It communicates with the basilic vein via the median cubital vein at the elbow and is located in the superficial fascia along the anterolateral surface of the biceps brachii muscle. The vein may be used for intravenous access, and is sometimes referred to as the 'House-man's Friend' because a large bore cannula may be easily placed. However, the cannulation of a vein as close to the radial nerve as the cephalic vein can sometimes lead to nerve damage."}, {"url": "http://www.gatlineducation.com/demo/Vet_Assist_DEMO/JSCTP/html/L21/L21CH03P01.html", "passage_text": "The cephalic vein is located on the front of the foreleg (the dorsal surface). The vein runs under the skin between the carpal (wrist) joint and the elbow. The image below shows the cephalic vein. In this case, I have put a tourniquet on the elbow so that the vein fills with blood and is easier to see."}, {"url": "https://en.wikipedia.org/wiki/Basilic_vein", "passage_text": "Near the region anterior to the cubital fossa, in the bend of the elbow joint, the basilic vein usually connects with the other large superficial vein of the upper extremity, the cephalic vein, via the median cubital vein (or median basilic vein). The layout of superficial veins in the forearm is highly variable from person to person, and there is a profuse network of unnamed superficial veins that the basilic vein communicates with."}, {"url": "https://en.wikipedia.org/wiki/Cephalic_vein", "passage_text": "The cephalic vein is often visible through the skin, and its location in the deltopectoral groove is fairly consistent, making this site a good candidate for venous access. Permanent pacemaker leads are often placed in the cephalic vein in the deltopectoral groove. The vein may be used for intravenous access, and is sometimes referred to as the 'House-man's Friend' because a large bore cannula may be easily placed. However, the cannulation of a vein as close to the radial nerve as the cephalic vein can sometimes lead to nerve damage."}, {"url": "http://www.answers.com/Q/Why_is_the_cephalic_vein_called_the_cephalic_vein", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Joshua Delamater. Confidence votes 2. Cephalic means something to do with the head.. hence the question concerning a vein in the arm with the name cephalic. I'm not sure but google says it was a poorly translated name. "}]