[{"url": "http://www.medicinenet.com/diseases_and_conditions/article.htm", "passage_text": "Find relevant and reliable medical information on diseases and conditions. Find your medical topic by using the comprehensive A-Z list above, click on the browse health centers below or one of our categorized listings of health and medical conditions. "}, {"url": "http://www.alz.org/alzheimers_disease_what_is_alzheimers.asp", "passage_text": "Alzheimer's and dementia basics. 1  Alzheimer's is the most common form of dementia, a general term for memory loss and other intellectual abilities serious enough to interfere with daily life. 2  Alzheimer's disease accounts for 60 to 80 percent of dementia cases. 1 But Alzheimer's is not just a disease of old age. 2  Up to 5 percent of people with the disease have early onset Alzheimer's (also known as younger-onset), which often appears when someone is in their 40s or 50s. 3  Learn more: Early Onset Alzheimer's and Risk Factors. 4  Alzheimer's worsens over time."}, {"url": "http://www.alz.org/alzheimers_disease_what_is_alzheimers.asp", "passage_text": "1 Alzheimer's is the most common form of dementia, a general term for memory loss and other intellectual abilities serious enough to interfere with daily life. 2  Alzheimer's disease accounts for 60 to 80 percent of dementia cases. 1 But Alzheimer's is not just a disease of old age. 2  Up to 5 percent of people with the disease have early onset Alzheimer's (also known as younger-onset), which often appears when someone is in their 40s or 50s. 3  Learn more: Early Onset Alzheimer's and Risk Factors. 4  Alzheimer's worsens over time."}, {"url": "https://en.wikipedia.org/wiki/Disease", "passage_text": "A disease is a particular abnormal condition, a disorder of a structure or function, that affects part or all of an organism. The causal study of disease is called pathology. The term disease broadly refers to any condition that impairs the normal functioning of the body. For this reason, diseases are associated with dysfunctioning of the body's normal homeostatic process."}, {"url": "http://www.webmd.com/heart-disease/guide/heart-disease-overview-facts", "passage_text": "Learn the facts about how the heart works -- and the causes and risk factors for heart disease. When you think of heart disease in men, usually people think of coronary artery disease (narrowing of the arteries leading to the heart), but coronary artery disease is just one type of heart disease. Women and Heart Disease. The risk of heart disease in women increases with age."}, {"url": "https://www.nia.nih.gov/alzheimers/publication/alzheimers-disease-fact-sheet", "passage_text": "Alzheimer’s disease is an irreversible, progressive brain disorder that slowly destroys memory and thinking skills, and eventually the ability to carry out the simplest tasks. In most people with Alzheimer’s, symptoms first appear in their mid-60s. The first symptoms of Alzheimer's vary from person to person. For many, decline in non-memory aspects of cognition, such as word-finding, vision/spatial issues, and impaired reasoning or judgment, may signal the very early stages of Alzheimer’s disease."}, {"url": "https://en.wikipedia.org/wiki/Disease", "passage_text": "In humans, disease is often used more broadly to refer to any condition that causes pain, dysfunction, distress, social problems, or death to the person afflicted, or similar problems for those in contact with the person. The term disease broadly refers to any condition that impairs the normal functioning of the body. For this reason, diseases are associated with dysfunctioning of the body's normal homeostatic process."}, {"url": "http://www.diseaseinfosearch.org/", "passage_text": "Youve come to the right place! Simply type in the name of a condition above and Disease InfoSearch will locate quality information from a database of more than 13,000 conditions and thousands of support groups and foundations. "}, {"url": "https://www.nia.nih.gov/alzheimers/publication/alzheimers-disease-fact-sheet", "passage_text": "Alzheimer's disease is currently ranked as the sixth leading cause of death in the United States, but recent estimates indicate that the disorder may rank third, just behind heart disease and cancer, as a cause of death for older people. Alzheimer’s is the most common cause of dementia among older adults. Dementia is the loss of cognitive functioning—thinking, remembering, and reasoning—and behavioral abilities to such an extent that it interferes with a person’s daily life and activities. The first symptoms of Alzheimer's vary from person to person. For many, decline in non-memory aspects of cognition, such as word-finding, vision/spatial issues, and impaired reasoning or judgment, may signal the very early stages of Alzheimer’s disease."}, {"url": "http://www.alz.org/alzheimers_disease_what_is_alzheimers.asp", "passage_text": "Help is available. If you or a loved one has been diagnosed with Alzheimer's or a related dementia, you are not alone. The Alzheimer's Association is the trusted resource for reliable information, education, referral and support to millions of people affected by the disease. 1 But Alzheimer's is not just a disease of old age. 2  Up to 5 percent of people with the disease have early onset Alzheimer's (also known as younger-onset), which often appears when someone is in their 40s or 50s. 3  Learn more: Early Onset Alzheimer's and Risk Factors. 4  Alzheimer's worsens over time."}]