[{"url": "http://health.costhelper.com/braces.html", "passage_text": "1 CostHelper readers with dental insurance coverage report out-of-pocket costs of $1,550 -$5,080, or an average cost of $2,570 for these braces. 2  Lingual braces, concealed behind the teeth, can cost $5,000 -$13,000 or more. 3  They must be custom ordered, require more skill to install and don't work well on small teeth. 1 Most orthodontists do not install lingual braces. 2  Expect to pay $3,000 -$8,000 or an average of $5,000 for Damon braces, an alternative teeth straightening system that uses a series of computer-fabricated clear plastic aligner trays that cover the teeth; the patient switches to a new tray about every two weeks."}, {"url": "http://www.invisalign.com/cost", "passage_text": "Many dental insurance plans cover Invisalign treatment just as they would other orthodontic treatments like metal braces. Plans may cover up to $3,500 of Invisalign treatment. Talk to your Invisalign-trained doctor or insurance provider to find out how much you’re covered for. After incurring eligible medical costs, you can then submit your receipt(s) for reimbursement. The annual maximum contribution is $2,500 for individuals (or $5,000 total for a married couple). Save by putting up to $2,500 of your pretax dollars toward"}, {"url": "http://www.bracesinfo.com/how-much-do-braces-cost.html", "passage_text": "Once you have picked out your orthodontist, your treatment plan including the cost of braces will be provided to you. The cost will depend on the type of braces and treatment plan. Here are some average estimates of the cost of braces in Miami, Florida as of 2012: Consultation Fee: $275. Metal Braces: $5,700. While this is the average across the United States, the range stems from $2,500 up to over $9,000 depending on the case. A light case of orthodontics could include closing small gaps on just the upper teeth. In this case braces may be applied to just the uppers and cost significantly less."}, {"url": "http://health.costhelper.com/braces.html", "passage_text": "1 Expect to pay $3,000 -$8,000 or an average of $5,000 for Damon braces, an alternative teeth straightening system that uses a series of computer-fabricated clear plastic aligner trays that cover the teeth; the patient switches to a new tray about every two weeks. 1 Most orthodontists do not install lingual braces. 2  Expect to pay $3,000 -$8,000 or an average of $5,000 for Damon braces, an alternative teeth straightening system that uses a series of computer-fabricated clear plastic aligner trays that cover the teeth; the patient switches to a new tray about every two weeks."}, {"url": "http://www.bracesinfo.com/how-much-do-braces-cost.html", "passage_text": "While “braces” is a broad word for general orthodontics, there are many types of braces that will affect the cost of which one you decide to go with for your treatment. As with anything, it is important to consider many factors when shopping for the best price. In short the average cost of braces in 2012 is $5,200. While this is the average across the United States, the range stems from $2,500 up to over $9,000 depending on the case. A light case of orthodontics could include closing small gaps on just the upper teeth. In this case braces may be applied to just the uppers and cost significantly less."}, {"url": "https://www.dentalinsurance.com/blog/resources/orthodontics/braces/adult-braces", "passage_text": "They are thus more convenient for eating as well as brushing and flossing. The price of braces depends on the type you choose. The typical cost ranges between $5,000 and $6,000. The average adult orthodontic patient wears braces for between one and two years, depending on both their age and the condition of their teeth. During this period, patients using any of the first three types of braces noted above make periodic visits to the orthodontist to have the braces tightened."}, {"url": "http://health.costhelper.com/braces.html", "passage_text": "1 CostHelper readers with insurance coverage for braces report paying $1,500 -$8,500 out of pocket for traditional metal braces, at an average out-of-pocket expense of $3,407. 2  Dental insurance may pay up to a specific amount for braces (typically $1,000 -$2,000) if the patient is 18 years old or younger. 1 Most orthodontists do not install lingual braces. 2  Expect to pay $3,000 -$8,000 or an average of $5,000 for Damon braces, an alternative teeth straightening system that uses a series of computer-fabricated clear plastic aligner trays that cover the teeth; the patient switches to a new tray about every two weeks."}, {"url": "https://www.deltadentalins.com/oral_health/adultBraces.html", "passage_text": "Braces can provide adults the same benefits children receive. However, treatment may take longer than it does for children. The average adult wears braces for 18 months to three years. As with children, adults may need to wear a retainer to maintain the results of treatment after braces are removed. The cost of braces depends on the type you select. On average, metal braces cost $5,000 to $6,000. Keep in mind that your out-of-pocket costs will likely be higher if you choose non-metal braces. Check your Evidence of Coverage, Summary Plan Description or Group Dental Service Contract to see if your dental plan covers orthodontic treatment for adults. "}, {"url": "http://budgeting.thenest.com/average-cost-braces-insurance-28642.html", "passage_text": "This is partly because she pays less for malpractice insurance. In a small town braces typically cost $3,000, according to a Costhelper report. In cities the average is $5,000, and the price can be as much as $10,000 depending upon the dentist and how much work is needed. Some orthodontists charge extra for removal, X-rays and retainers. This proprietary method costs $3,500 to $8,000, with a national average of $5,000. Invisalign can address many of the same problems as metal braces, but it's less capable of turning teeth that are pivoted in the wrong direction."}]