[{"url": "http://www.babynamespedia.com/meaning/Halen/m", "passage_text": "The name is of the meaning hollow. Halen is a widely used name; it has 25 variants. Variants include Haelan, Haelen, Haelin, Haelon, Haelun, Haelyn, Hailan, Hailen, Hailin, Hailon, Hailun, Hailyn, Halan, Halin, Hallen, Hallene, Halon, Halun, Halyn, Haylan, Haylen, Haylin, Haylon, Haylun, and Haylyn."}, {"url": "http://www.thinkbabynames.com/meaning/1/Halen", "passage_text": "Halen is an unusual given name for males but a very prominent last name for all people (#58130 out of 150436, Top 39%). (2000 U.S. Census). Displayed below is an analysis of the popularity of the boy name Halen and affiliated names. Hal is the only popular related form of Halen (not ranked) appearing in the Top 1000."}, {"url": "http://www.sheknows.com/baby-names/name/helen", "passage_text": "Greek Meaning: The name Helen is a Greek baby name. In Greek the meaning of the name Helen is: Shining light. The bright one. Helen of Troy, whose elopement with Paris sparked the Trojan War, was the daughter of Zeus and wife of Menelaus, King of Sparta."}, {"url": "http://www.sheknows.com/baby-names/name/helen", "passage_text": "The name Helen is an American baby name. In American the meaning of the name Helen is: Shining light. The bright one. Helen of Troy, whose elopement with Paris sparked the Trojan War, was the daughter of Zeus and wife of Menelaus, King of Sparta."}, {"url": "http://www.babynamespedia.com/meaning/Halen/m", "passage_text": "Halen is unusual as a baby name for boys. It is listed outside of the top 1000 names. Baby names that sound like Halen include Haelin, Haelyn, Hailin, Hailyn, Halam, Haleam, Haleem, Haleim, Halim, Halin, Hallam, Hallan, Hallem, Hallene, Hallim, Hallin, Hallym, Halon, Halun, and Haylin."}, {"url": "http://www.thinkbabynames.com/meaning/1/Halen", "passage_text": "Halen /ha-len/ [2 sylls.] as a name for boys is of Old English derivation, and the name Halen means hero; from the hall. Halen is a version of Hale (Old English): also a place name. Compare surname Hahlen. Kreatif forms: Hahalen, Halenha, Halenni."}, {"url": "http://www.thinkbabynames.com/meaning/0/Helen", "passage_text": "Helen /he-len/ [2 sylls.] as a girls' name is pronounced HEL-en. It is of Greek origin, and the meaning of Helen is sun ray. Mythology: the abduction of Zeus's mortal daughter, Helen of Troy, resulted in the Trojan War. Hers was the face that launched a thousand ships."}]