[{"url": "http://www.answers.com/Q/How_much_sugar_is_in_a_yellow_banana", "passage_text": "In a medium sized banana which is usually around 126g, there is at least 21g of sugar. Bananas raise are high enough in sugar and starch to contribute to high glucose levels … , especially since they are often consumed without other fats and proteins, which could at least slow the absorption of glucose. Not good. 12,23 grams per 100 grams of banana-in a yellow one. (plantains how ever have less) There are many types of bananas. Dark red, yellow, green, brown, - big and small."}, {"url": "http://healthyeating.sfgate.com/bananas-raise-blood-sugar-5388.html", "passage_text": "Carbohydrate Content. Carbohydrates are the type of macronutrient most likely to raise blood sugar levels. By weight, bananas are 23 percent carbohydrate, 75 percent water, 1 percent protein and 0.3 percent fat. Bananas are relatively high in carbohydrates, with each medium banana containing 27 grams of carbs. Of these carbohydrates, 3.1 grams consist of fiber, 14.43 grams are sugars and 6.35 grams are starch. Bananas range in size from 2.5 to 12 inches long depending on the type and are a good source of potassium, fiber, vitamin C and vitamin B-6. As they ripen, the starch they contain turns into sugars, with riper bananas containing more sugar than green bananas."}, {"url": "http://www.mnn.com/food/healthy-eating/stories/banana-nutrition-facts", "passage_text": "One medium-sized banana (approximately 7 inches long) contains 14 grams of sugar. Is 14 grams a lot? It depends what kind of sugar comprises the 14 grams and how quickly those sugars spike blood sugar levels. Blood sugar spike from eating bananas. According to the American Journal of Clinical Nutrition, an all-yellow ripe American banana has a glycemic load (GL) of only 13 on a scale of 100."}, {"url": "http://www.answers.com/Q/How_many_grams_of_sugar_are_in_a_banana", "passage_text": "Anywhere from 10g to 19g, depending on the size of the banana. Keep in mind these are natural sugars, so it is still a good idea to eat as much fruit as possible. There are approximately 12 G of naturally occurring sugar per every 100 G of weight which is generally the size of a small banana. 1 large is in the area of 17."}, {"url": "http://woman.thenest.com/grams-sugar-carbs-banana-7403.html", "passage_text": "Sugar. A medium banana contains almost 15 grams of sugar, meaning sugar makes up nearly 56 percent of the total amount of carbs. Bananas contain three types of sugar: glucose, fructose and sucrose. Approximately 20 percent, or 3 grams, of the sugar in a banana is sucrose. "}, {"url": "http://www.rocketswag.com/gardening/fruit-gardening/banana/How-Many-Grams-Of-Sugar-In-A-Banana.html", "passage_text": "While a small banana would contain about 12 grams of sugar, a medium one would contain around 14 grams, a large one would contain about 17 grams, and an extra large banana would contain about 19 grams of sugar. But this does not mean that diabetics cannot eat bananas. This is because the starch in the bananas converts into sugar only upon ripening. Usually once the banana starts ripening, it may have a sugar content of about 20 percent, while an unripe banana may have a sugar content of only 2 percent."}]