[{"url": "http://www.indeed.com/forum/job/Mortgage-Underwriter/Show-me-money/t341", "passage_text": "Knowing what to look for and how you can direct a loan to the right program, etc is key. An up cycle will last anywhere from 2 to 4 years (we just came off of a 4 year high) and a down cycle can last about 2 years. We are in a down cycle now. Im looking for a motivated DE underwriter. I'll pay $5,000 per month plus $50 per file that closes. (we close about 30-50 in house currently with the ability to underwrite files from other branches) You do not need to be located in Bakersfield but you must train for two weeks in Salt Lake city at headquarters."}, {"url": "http://www.ehow.com/info_8595016_much-do-mortgage-underwriters-make.html", "passage_text": "A mortgage underwriter decides whether a borrower receives a mortgage or building loan. The underwriter evaluates the real estate the home loan is covering and verifies the borrower's credit, assets, income and other factors influencing the loan, such as current employment. The underwriter uses this information to calculate the level of risk to the lender for the borrower's loan. Education. Employer educational requirements for a mortgage underwriter vary. Some mortgage underwriters hold a bachelor's or associate's degree in a business or financial field or an associate's in a specific mortgage banking curriculum."}, {"url": "http://www.indeed.com/forum/job/Mortgage-Underwriter/Show-me-money/t341", "passage_text": "I have been in underwriting for 23 years. A good Sr Underwriter should make no less than $8,500-$11,000 per month. You should start out as a processor or an underwriting assistant to learn the skills needed and get familiar with the guidelines, requirements, investor requirements, etc. Im looking for a motivated DE underwriter. I'll pay $5,000 per month plus $50 per file that closes. (we close about 30-50 in house currently with the ability to underwrite files from other branches) You do not need to be located in Bakersfield but you must train for two weeks in Salt Lake city at headquarters."}, {"url": "http://www.bls.gov/ooh/business-and-financial/insurance-underwriters.htm", "passage_text": "The median annual wage for insurance underwriters was $62,870 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $39,050, and the top 10 percent earned more than $109,900."}, {"url": "http://www1.salary.com/Mortgage-Underwriter-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Mortgage Underwriter I in the United States is $48,840 so 50% of the people who perform the job of Mortgage Underwriter I in the United States are expected to make less than $48,840. Source: HR Reported data as of October 2015. Median $48,840. May require a bachelor's degree in area of specialty and 0-2 years of experience in the field or in a related area. Familiar with standard concepts, practices, and procedures within a particular field. Relies on limited experience and judgment to plan and accomplish goals."}, {"url": "http://www.ehow.com/info_8595016_much-do-mortgage-underwriters-make.html", "passage_text": "Median Income. The median income for a mortgage underwriter is $65,900 annually, according to the Bureau of Labor Statistics (BLS) May 2010 report. The lower annual salary end is $30,930 each year, earned by less than 10 percent of underwriters. Education. Employer educational requirements for a mortgage underwriter vary. Some mortgage underwriters hold a bachelor's or associate's degree in a business or financial field or an associate's in a specific mortgage banking curriculum."}]