[{"url": "http://www.city-data.com/forum/austin/2037367-average-utility-bills-austin-area.html", "passage_text": "We are slowly settling down and looking to get a sense of our budget and spending. We are trying to especially understand how much on average we should budget for utilities. We are thinking $500 a month should be enough to include cell phone, landline, gas, electric, cable/internet, water/sewage/trash. We know some of the bills but not the others which are Austin specific."}, {"url": "http://austinenergy.com/wps/portal/ae/residential/rates", "passage_text": "Austin Energy electric bills consistently rank among the lowest in Texas for average residential users and also rank lower than national averages. Austin Energy customers use less electricity than customers in other utilities because of our emphasis on energy efficiency and protecting the environment."}, {"url": "http://www.numbeo.com/cost-of-living/city_result.jsp?country=United+States&city=Austin%2C+TX", "passage_text": "Your electric bill will be the same amount of tax as your usage. If you use $45.00 worth of electric, your tax on that will be approximately $40.00= $85.00. This is a young town. The average person is 18-34."}, {"url": "http://www.lowerelectricbilltoday.com/texas/average-texas-electric-bill.html", "passage_text": "So what exactly is the average Texas electricity bill cost? According to a January 2010 report by the Texas Public Utilities Commission, the average monthly electric bill for Texas residents using 1000 kWh of energy was approximately $93."}, {"url": "http://www.answers.com/Q/What_Average_Cost_of_Austin_One_Bedroom_Apartment", "passage_text": "The overall cost of living is 7% below the national average, and apartments for rent run at an average monthly cost of $750, with utilities averaging $90 per month. This varies greatly based location and age of the complex."}, {"url": "http://ohmyapt.apartmentratings.com/typical-utility-costs-in-austin.html", "passage_text": "Below is an estimation of typical monthly utility costs in Austin, Texas. Living in Austin. Because it is the capitol of Texas, the cost of living in Austin is higher than it is in other Texas cities. As it is a desirable place to live and a college town, demand for apartments is high, making rents high."}, {"url": "http://ohmyapt.apartmentratings.com/typical-utility-costs-in-austin.html", "passage_text": "Water. Of course, your water costs will vary depends on your usage. Water bills in Austin also include the cost of sewage and treatment. A single person running the dishwasher once a week, the shower daily and doing two loads of laundry a week will cost about $35.00 a month. Telephone, Cable and Internet."}]