[{"url": "http://guardianpoolfence.com/pool-fence-cost/", "passage_text": "1 The pool fence cost will also will also include the type of gate that you install depending on the choice of the homeowner. 2  Most homeowners prefer one self closing gate that is easy to operate even for the kids and the cost is pocket friendly. It is very difficult for us to give you a set price in here. The cost of a pool fence depends on various factors like the height of the fence, type, color and also durability. Pool fence contractors also come up with different cost."}, {"url": "http://www.allsafepool.com/pool-fences/", "passage_text": "The average cost for a pool fence is $1,500 – $2,500 which includes installation and materials. A common misconception is that the price is based solely on how many linear feet of fence is needed. "}, {"url": "http://www.improvenet.com/r/costs-and-prices/pool-fencing", "passage_text": "As a result, serious injury or death by drowning could occur. The cost of pool fencing can be as low as $100 or as much as $9,500. The average cost of a 40x40 glass pool fence fence ranges from $10,000 to $20,000. The cost of a wooden pool fence is typically between $5,000 and $10,000. Homeowners should expect to spend around $5,000 for an average-sized aluminum pool fence. "}, {"url": "http://home.costhelper.com/wrought-iron-fencing.html", "passage_text": "1 If the fence encloses a driveway, an ornamental driveway gate can cost $1,400-$9,000, depending on whether it's manual or automatic. 2  Wrought-Iron-style fence panels are available from home improvement centers like Home Depot and Lowe's. 1 With professional installation, the total cost for labor and materials for wrought iron fence panels can be $30-$300 or more per foot, depending on local rates and the height, style and complexity of the installation (installing metal fencing on a slope costs more)."}, {"url": "http://www.fixr.com/costs/swimming-pool-fence", "passage_text": "1 The average cost per gate (installed) is $325; 2  Removable-many styles of swimming pool fencing are easily removable for seasonal storage, but this would mean that the installation of a sturdy and reliable pool cover would be required once the fence is down. "}, {"url": "http://home.costhelper.com/wrought-iron-fencing.html", "passage_text": "1 A 100' fence with a basic walk-in gate can cost $2,500-$11,000 or more. 2  DIYNetwork provides instructions for installing a wrought iron fence and two gates to enclose a small courtyard, and estimates this moderate-to-hard project will take one day and cost $1,000-$2,500. 1 With professional installation, the total cost for labor and materials for wrought iron fence panels can be $30-$300 or more per foot, depending on local rates and the height, style and complexity of the installation (installing metal fencing on a slope costs more)."}, {"url": "http://www.inlandempirepoolfence.com/pricing.html", "passage_text": "The cost of Inland Empire Pool Guard pool-safety-fencing is very affordable, usually $12 to $20 per linear foot, and for large projects the cost-per-foot may be less. If your backyard ground slopes or there are less options for pool-fencing anchoring, the cost of your pool-safety-fencing could be higher. The larger your pool area, generally your overall cost will be higher, but typically it's around $1,200 for the complete pool-fence system and self-closing, child-proof lockable swimming pool gate. There is a difference in cost between a 4-foot and 5-foot child-protective swimming pool fencing."}, {"url": "http://www.howmuchisit.org/pool-safety-fence-cost/", "passage_text": "1 According to GuardianPoolFence.com, the average safety fence for a pool costs around $15 to $20 per foot. 2  A typical fence costs in the range of $1,200 to $2,000. 3  As per InlandEmpirePoolFence.com, the average cost of a removable safe pool fence is $1,200 to $1,500. 1 On average, plan on budgeting at least $12 to $22 per foot for a pool safety fence. 2  According to GuardianPoolFence.com, the average safety fence for a pool costs around $15 to $20 per foot. 3"}, {"url": "http://www.howmuchisit.org/pool-safety-fence-cost/", "passage_text": "1 As per InlandEmpirePoolFence.com, the average cost of a removable safe pool fence is $1,200 to $1,500. 2  Its installation services for removable swimming pool fences cost $15 to $19 a foot, depending on location and length of the backyard or area that needs to be fenced. 1 On average, plan on budgeting at least $12 to $22 per foot for a pool safety fence. 2  According to GuardianPoolFence.com, the average safety fence for a pool costs around $15 to $20 per foot. 3  A typical fence costs in the range of $1,200 to $2,000."}]