[{"url": "http://www.sciencemonster.com/earth-science/layers-of-the-earth-4.html", "passage_text": "Layers of the Earth-page 4 of 5. The mantle is 84% of the Earth's mass, making it the thickest layer of the earth. We said earlier that it's highly viscous, and it's temperature ranges from 500 degrees Celsius at the crust to 4,000 degrees near the outer core. "}, {"url": "https://quizlet.com/14485434/layers-of-the-earth-flash-cards/", "passage_text": "Mantle. the layer of the earth between the crust and the core; contains most of the earth's mass; composed mainly of more magnesium and less aluminum and silicon than the crust; temperatures range from 1,000 degrees to 3,700 degrees C."}, {"url": "http://www.zmescience.com/other/science-abc/thinnest-layer-earth/", "passage_text": "The Thinnest Layer of the Earth. January 16, 2015January 16, 2015 Mihai Andrei. The Earth can be divided into four main layers: the solid crust on the outside, the mantle, the outer core and the inner core. Out of them, the crust is the thinnest layer of the Earth, amounting for less than 1% of our planet’s volume."}, {"url": "http://volcano.oregonstate.edu/earths-layers-lesson-1", "passage_text": "The Earth's Crust is like the skin of an apple. It is very thin in comparison to the other three layers. The crust is only about 3-5 miles (8 kilometers) thick under the oceans(oceanic crust) and about 25 miles (32 kilometers) thick under the continents (continental crust). "}, {"url": "https://answers.yahoo.com/question/index?qid=20061012171227AAGH4Rl", "passage_text": "Report Abuse. The outermost layer of the Earth is the crust. In the oceans, it is about 4 miles thick. On the thickest continents, it extends some 40 miles into the Earth. Below the crust is the mantle, a layer of weaker, hotter rock some 1,800 miles thick. Beneath the mantle lies the outer core, a sea of liquid iron about 1,300 miles thick. Finally, at the center of the Earth is the solid iron core, a sphere some 1,500 miles across. "}, {"url": "http://www.forsyth.k12.ga.us/cms/lib3/GA01000373/Centricity/ModuleInstance/10440/Earth_Sci_Study_GuideANSWER_KEY.doc", "passage_text": "Describe the three main layers of the Earth. Crust: The thin, outer layer of the earth. Less than 1% of the Earth’s mass. Made of solid rock, broken into plates. Mantle: Molten rock on which plates float. Contains 67% of the earth’s mass. Core: Inner layer of the Earth. Made of both solid and liquid metals. Contains 33% of the earth’s mass. "}, {"url": "http://www.answers.com/Q/Which_layer_of_the_Earth_is_the_thinnest", "passage_text": "This depends on whether you treat the core as a single layer or split it into the outer and inner core. The Earth's core has a radius of approximately 3,470 km whereas the Ear … th's crust is on average only 60 km thick. This as a fraction is 60/3,470 which can be simplified to 1/58. That means that the core is approximately 58 times thicker than the crust. What are the four layers of the earth thinnest to thickest? Crust - 50 km thickInner Core - 1220 km thickOuter Core - 2250 km thickMantle - 2900 km thick *Note that the thicknesses of each of the layers are only approx."}, {"url": "http://katnissdiv1.weebly.com/the-layers-of-the-earth.html", "passage_text": "The Crust is the thinnest layer in the earth. The Mantle is very massive (huge) if you don't get huge imagine it takes up 80% of the earth now that is huge. The outer core is made of iron and nickel. The inner core is the most inner layer it is very solid. The outer core is the only liquid layer of the Earth. You could say that the outer core is basically a sea of iron and nickel. The outer core is 2100 miles and also is in an range of 200-300 kilometres thick. 7,200 to 9,000 degrees Fahrenheit (4,000 to 5,000 degrees Celsius)."}, {"url": "http://www.zmescience.com/other/science-abc/thickest-layer-earth-mantle/", "passage_text": "The thickest layer of the Earth. January 17, 2015January 15, 2015 Mihai Andrei. The Earth can be divided into four main layers: the solid crust on the outside, the mantle, the outer core and the inner core. Out of them, the mantle is the thickest layer, while the crust is the thinnest layer. "}]