[{"url": "http://www.wikihow.com/Defrost-Meat", "passage_text": "1 Plan ahead for defrosting meat in the refrigerator since it will take time. 2  Place wrapped or covered meat on a dish to catch any raw juice runoff. 3  Defrost the meat for a full 24 hours. 4  Large cuts of meat, such as whole birds or roasts, can take 24 hours for every 5 lbs. ( 5 2.3 kg) of meat."}, {"url": "http://www.wikihow.com/Defrost-Meat", "passage_text": "1 Place wrapped or covered meat on a dish to catch any raw juice runoff. 2  Defrost the meat for a full 24 hours. 3  Large cuts of meat, such as whole birds or roasts, can take 24 hours for every 5 lbs. ( 4 2.3 kg) of meat. 5  Cook ground or stew meat and poultry within 2 days of thawing for refrigerator defrosting."}, {"url": "http://web.extension.illinois.edu/meatsafety/thawing.cfm", "passage_text": "Meat can be safely thawed in cold, not hot, water. Be sure to thaw meat in a leak-proof package or bag. Submerge the bag in cold water, changing water every 30 minutes so that is stays cold. It is important to keep the meat out of the food spoilage temperature range of 70° to 100°F."}, {"url": "http://web.extension.illinois.edu/meatsafety/thawing.cfm", "passage_text": "After thawing in the refrigerator, ground meat should be used as soon as possible. Once meat has been frozen and thawed, it will deteriorate more rapidly than if it had never been frozen. Whole meat cuts (chops, roasts) will remain useable for another 3-5 days in the refrigerator before cooking."}, {"url": "http://stilltasty.com/articles/view/9", "passage_text": "Using this thawing method, small packages of frozen meat or poultry (about a pound) can defrost in one hour or less. For larger items, you should estimate about 30 minutes of defrosting time per pound of food. Once the food is thawed completely, you’ll need to cook it immediately."}, {"url": "http://www.huffingtonpost.com/2012/06/07/how-to-defrost-meat_n_1574315.html", "passage_text": "-After thawing in the fridge, poultry, ground meat and stew meat will stay good in the fridge for 1-2 days. Red meat cuts will stay good for up to 3-5 days. -You can refreeze meat thawed in the fridge. You may lose quality, but it will be safe for consumption."}, {"url": "http://web.extension.illinois.edu/meatsafety/thawing.cfm", "passage_text": "Freezing meat keeps bacteria in a dormant stage. However, once thawed, these bacteria can become active again. Never thaw meat on the counter or let it sit out of the refrigerator for more than two hours. In the summer, reduce this time to 1 hour. Never defrost meat in hot water."}, {"url": "http://askkaren.custhelp.com/app/answers/detail/a_id/502/~/how-long-does-it-take-for-beef-to-thaw%3F", "passage_text": "In the refrigerator, ground beef, stew meat, and steaks may thaw within a day. Bone-in parts and whole roasts may take 2 days or longer. Once the raw ground beef thaws, it will be safe in the refrigerator for 1 to 2 days."}]