[{"url": "https://en.wikipedia.org/wiki/Erosion", "passage_text": "In earth science, erosion is the action of exogenic processes (such as water flow or wind) which remove soil and rock from one location on the Earth's crust, then transport it to another location where it is deposited. Eroded sediment may be transported just a few millimetres, or for thousands of kilometres. Wind erosion is much more severe in arid areas and during times of drought. For example, in the Great Plains, it is estimated that soil loss due to wind erosion can be as much as 6100 times greater in drought years than in wet years."}, {"url": "http://www.edu.pe.ca/southernkings/erosiondd.htm", "passage_text": "Erosion is a natural process which is usually made by rock and soil being loosened from the earth's surface at one location and moved to another. Erosion changes the landscape by wearing down mountains, filling in valleys, and making rivers appear and disappear. It is usually a slow and gradual process that occurs over thousands or millions of years. But erosion can be speeded up by such human activities as farming and mining. Erosion begins with a process called weathering; in this process, environmental factors break rock and soil into smaller pieces, and loosen them from the earth's surface. When the wind whips up a dust storm that stings our eyes, its ability to move sand is very clear."}, {"url": "http://teacher.scholastic.com/dirt/erosion/whateros.htm", "passage_text": "Erosion is the process by which the surface of the Earth gets worn down. Erosion can be caused by natural elements such as wind and glacial ice. But anyone who has ever seen a picture of the Grand Canyon knows that nothing beats the slow steady movement of water when it comes to changing the Earth. To see what kind of effects water has on a model landscape, try my Science Lab."}, {"url": "https://en.wikipedia.org/wiki/Erosion", "passage_text": "Feedbacks are also possible between rates of erosion and the amount of eroded sediment that is already carried by, for example, a river or glacier. While erosion is a natural process, human activities have increased by 10-40 times the rate at which erosion is occurring globally. Wind erosion is much more severe in arid areas and during times of drought. For example, in the Great Plains, it is estimated that soil loss due to wind erosion can be as much as 6100 times greater in drought years than in wet years."}, {"url": "http://www.onegeology.org/eXtra/kids/earthProcesses/weathering.html", "passage_text": "Weathering and erosion. Weathering is the process where rock is dissolved, worn away or broken down into smaller and smaller pieces. There are mechanical, chemical and organic weathering processes. Organic weathering happens when plants break up rocks with their growing roots or plant acids help dissolve rock. Erosion happens when rocks and sediments are picked up and moved to another place by ice, water, wind or gravity. Mechanical weathering physically breaks up rock. One example is called frost action or frost shattering. Water gets into cracks and joints in bedrock."}, {"url": "http://www.omafra.gov.on.ca/english/engineer/facts/12-053.htm", "passage_text": "Soil erosion is a naturally occurring process that affects all landforms. In agriculture, soil erosion refers to the wearing away of a field's topsoil by the natural physical forces of water (Figure 1) and wind (Figure 2) or through forces associated with farming activities such as tillage."}, {"url": "http://www.answers.com/Q/What_is_erosion", "passage_text": "Erosion is the wearing away of the surface of the earth! Erosion is the process by which soil and rock are removed from the Earth's surface by natural processes such as wind or water flow, and then transported and deposited in other locations. The wearing away of land or soil by the action of wind, water, or ice. In hydrologic terms, wearing away of the lands by running water, glaciers,winds, and waves, can be subdivided into three process: Corrasion, Corrosion, and Transportation."}, {"url": "http://geology.about.com/od/glossaryofgeology/g/deferosion.htm", "passage_text": "By Andrew Alden. Definition: Erosion is the general name for the processes that break down rocks (weathering) and the processes that carry away the breakdown products (transportation). The physical processes of erosion are called corrasion or mechanical erosion; the chemical processes are called corrosion or chemical erosion. The agents of erosion are gravity, ice, water (eluvian erosion) and wind (eolian erosion). Erosion is sometimes restricted to transportation, excluding weathering. Erosion does not include mass wasting, unless erosion is being discussed in a tectonic context, in which case exhumation may be the better term."}, {"url": "http://www.geography4kids.com/files/land_erosion.html", "passage_text": "Erosion is the process that breaks things down. As far as we're concerned, erosion is the breakdown of the continents and the land around you. The overall effect of breaking down and weathering the land is called denudation. Denudation is the process of erosion. In nature, large things are broken down into smaller things"}, {"url": "https://en.wikipedia.org/wiki/Coastal_erosion", "passage_text": "Coastal erosion is the wearing away of land and the removal of beach or dune sediments by wave action, tidal currents, wave currents, drainage or high winds (see also beach evolution). "}]