[{"url": "http://whatis.techtarget.com/definition/character", "passage_text": "In this distinction, a character can be distinguished from other characters in terms of meaning and sound and a glyph is the graphic image used to portray the character. In different implementations, a character can have more than one possible glyph, and a glyph can represent more than one possibl"}, {"url": "http://whatis.techtarget.com/definition/character", "passage_text": "1) In information technology, a character is a printable symbol having phonetic or pictographic meaning and usually forming part of a word of text, depicting a numeral, or expressing grammatical punctuation."}, {"url": "http://whatis.techtarget.com/definition/character", "passage_text": "In information technology today, a character is generally one of a limited number of symbols, including the letters of a particular language's alphabet, the numerals in the decimal number system, and certain special symbols such as the ampersand (&) and atsign (@)."}, {"url": "http://fictionwriting.about.com/od/glossary/g/Character.htm", "passage_text": "The main character in a story is generally known as the protagonist; the character who opposes him or her is the antagonist. Character is revealed by how a character responds to conflict, by his or her dialogue, and through descriptions."}, {"url": "https://en.wikipedia.org/wiki/Moral_character", "passage_text": "Moral character primarily refers to the assemblage of qualities that distinguish one individual from another — although on a cultural level, the set of moral behaviors to which a social group adheres can be said to unite and define it culturally as distinct from others."}, {"url": "http://www.computerhope.com/jargon/c/charact.htm", "passage_text": "2. A character is a term used to describe a computer player who takes on the role of a fictitious player in a computer game. For example, while playing a game you are considered a character or PC in that game. If you encounter a character that is not controlled by another human, it is referred to as an NPC. The picture is an example of a game character in the World of Warcraft game."}, {"url": "https://en.wikipedia.org/wiki/Moral_character", "passage_text": "Moral character or character is an evaluation of a particular individual's stable moral qualities. The concept of character can imply a variety of attributes including the existence or lack of virtues such as empathy, courage, fortitude, honesty, and loyalty, or of good behaviors or habits."}]