[{"url": "http://www.wheelbearingreplacement.net/Wheel-Bearing-Replacement-Cost.html", "passage_text": "The cost of wheel bearings vary based upon the type of vehicle. Prices also vary based on whether you are replacing a front or rear bearing. For a Toyota Corolla, a front wheel bearing costs approximately $47.99, while a rear wheel bearing is a staggering $325.99."}, {"url": "http://www.howmuchisit.org/broken-axle-repair-cost/", "passage_text": "1 At Adrivingneed.com, the cost of repair for a broken axle is about $100. 2  Some other sources say that if the car is a front wheel drive and that its CV joint needed to be changed, a new axle with CV joint usually costs $100."}, {"url": "http://rimrenew.com/faq.html", "passage_text": "The cost of wheel repair can vary from $75 to $200 depending on the type of damage, its severity and the type of wheel. Additional services, such as needing tire removal and remounting necessary to complete the repair, may impact the final price."}, {"url": "http://repairpal.com/estimator/rear-wheel-bearing-replacement-cost", "passage_text": "Labor: $208 - $264. Parts: $109 - $176. The average cost for a wheel bearing replacement-rear is between $317 to $440. Labor costs are estimated between $208 to $264 while parts are priced between $109 to $176. Get a personalized estimate based on your location and specific car."}, {"url": "http://www.wheelbearingreplacement.net/Wheel-Bearing-Replacement-Cost.html", "passage_text": "A wheel bearing replacement can take anywhere from one to three hours depending on the type of vehicle you are driving. This means the cost of labor involved for this job can be anywhere from $30 to $270 in addition to the cost of parts."}, {"url": "http://www.howmuchisit.org/broken-axle-repair-cost/", "passage_text": "1 On average, the costs to repair an axle can range anywhere from $75 to $150 if you do it yourself; if you choose a professional mechanic, the costs can soar to $150 to $300 per axle. 2  At Adrivingneed.com, the cost of repair for a broken axle is about $100."}]