[{"url": "http://www.huffingtonpost.com/2014/12/04/spectre-james-bond_n_6266310.html", "passage_text": "James Bond has returned. Twenty-five months after Skyfall debuted, director Sam Mendes announced the title and cast of the 24th Bond film during a press conference at Pinewood Studios in England on Thursday. The next 007 adventure, Spectre, will arrive in theaters on Nov. 6, 2015."}, {"url": "https://en.wikipedia.org/wiki/Spectre_%282015_film%29", "passage_text": "Spectre will be the twenty-fourth James Bond film produced by Eon Productions. It will feature Daniel Craig in his fourth performance as James Bond, and Christoph Waltz as Franz Oberhauser, the film's antagonist."}, {"url": "https://en.wikipedia.org/wiki/Spectre_%282015_film%29", "passage_text": "The main cast were revealed in December 2014 at the 007 Stage at Pinewood Studios. Daniel Craig returns for his fourth appearance as James Bond, while Ralph Fiennes, Naomie Harris and Ben Whishaw reprise their roles as M, Eve Moneypenny and Q respectively, having been established in Skyfall."}, {"url": "http://www.huffingtonpost.com/2014/12/04/spectre-james-bond_n_6266310.html", "passage_text": "Daniel Craig will star again as James Bond, with help from new cast members Christoph Waltz, Andrew Scott, Dave Bautista, Lea Seydoux and Monica Bellucci. Ralph Fiennes, Ben Whishaw, Rory Kinnear and Naomie Harris will reprise their Skyfall roles. Mendes, of course, returns to direct."}, {"url": "http://www.mi6-hq.com/sections/bond24/", "passage_text": "SPECTRE (2015) :: James Bond 24. SPECTRE, the 24th James Bond film, will be the fourth outing for Daniel Craig as 007, and the second film to be directed by Sam Mendes. The new MI6 team of Ralph Fiennes (M), Naomie Harris (Moneypenny), Rory Kinnear (Tanner) and Ben Whishaw (Q) are all reprising their roles."}, {"url": "http://www.cnn.com/2014/12/04/showbiz/james-bond-spectre/index.html", "passage_text": "(CNN) -- The past is new again for agent 007: The next James Bond film will be called Spectre.. Director Sam Mendes announced the name of the 24th official Bond film Thursday at England's Pinewood Studios. Austrian actor Christoph Waltz will join Daniel Craig in the cast."}, {"url": "http://www.foxnews.com/entertainment/2014/12/04/new-james-bond-film-named-spectre/", "passage_text": "The next James Bond film will have a title that nods to the series' past: SPECTRE.. Director Sam Mendes announced the title Thursday, along with the identity of several new cast members and a new version of Bond's iconic Aston Martin car."}]