[{"url": "http://www.tattooseo.com/infinity-tattoo-meaning/", "passage_text": "Infinity Tattoo Meaning. Infinity tattoos are steadily on the rise with many people opting to get these in one form or another. The infinity symbol, often used in mathematics, represents a never-ending loop and is depicted as a number 8 on its side."}, {"url": "http://infinitytattoodesigns.com/infinity-symbol/", "passage_text": "Most probably, because of the interesting meaning behind the infinity symbol it is so often tattooed by great number and variety of people. Infinity symbol tattoo is attractive for its plain design and also for its limitless possibilities to make it look unique."}, {"url": "http://infinitytattoodesigns.com/infinity-symbol/", "passage_text": "Infinity symbol got its mathematical meaning in the 17 th century. It was first used by John Wallis in 1655. Wallis never explained why he chose to use exactly 8-on-its-side as a symbol for infinity. However, similar symbol was used by Romans to express “large number”."}, {"url": "http://www.factorydirectjewelry.com/blog/infinity-symbol-meaning/", "passage_text": "Brief History of the Infinity Symbol. The word infinity has been used in mathematics to describe sets or things that are uncountable. Similarly, in philosophy, infinity is a term used to describe the endless, immeasurable, and inconceivable."}, {"url": "http://infinitytattoodesigns.com/infinity-symbol/", "passage_text": "It is interesting that the very unearthly concept of infinity, endlessness and limitless opportunities is best presented by a mathematical symbol – infinity symbol. Infinity symbol, which is sometimes also called leminscate, has a shape of number 8 on its side."}, {"url": "http://www.truthperfected.com/2013/02/the-infinity-symbol-more-complex-than.html", "passage_text": "Often the simplest symbols are the ones with the richest meanings. The infinity sign, the figure of eight, and the mathematical lemniscate all refer to the same shape that contains a wealth of complex meaning within its fluid lines."}, {"url": "http://infinitytattoodesigns.com/infinity-symbol/", "passage_text": "Infinity symbol has been meaningful in the past and still conveys number of meanings for various people. Several sources indicate, that the symbol was used in ancient India and Tibet to represent perfection and dualism."}, {"url": "http://www.ancient-symbols.com/symbols-directory/infinity.html", "passage_text": "The Infinity Symbol Originating from the Latin infinitas which means “unboundedness”, infinity is the concept of endlessness or limitlessness most widely tackled in the fields of mathematics and physics."}, {"url": "http://www.rockofeden.com/infinity", "passage_text": "The Infinity Symbol. The infinity symbol refers to something without any limit, and is a concept known as unboundedness, itself derived from the Greek word apeiros, meaning endless. The infinity symbol is also known to represent the endless cycle of existence of birth, death and rebirth."}]