[{"url": "http://www.nytimes.com/health/guides/specialtopic/tetanus-vaccine/overview.html", "passage_text": "Tetanus immunization is generally required before starting school. Five doses of vaccine are recommended. DTaP or DT immunization is usually a series of injections given to children at ages 2 months, 4 months, 6 months, and 15 to 18 months. "}, {"url": "http://www.cdc.gov/Features/Tetanus/index.html", "passage_text": "See vaccine information statements (VIS). The DTaP (diphtheria, tetanus, and pertussis) vaccine is highly effective in preventing tetanus in young children. DTaP shots are recommended for babies at ages 2, 4, and 6 months, and again at 15 through 18 months of age. The Tdap vaccine is recommended for all 11 through 18 year olds, preferably at age 11 or 12 years. After getting the Tdap vaccine as a preteen or teen, adults need to get a Td (tetanus and diphtheria) booster shot every 10 years to stay protected."}, {"url": "http://www.wikihow.com/Know-when-You-Need-a-Tetanus-Shot", "passage_text": "1 Over time, protection from tetanus decreases, so older children need to get a booster shot. 2  It has a full dose of tetanus and lower amounts of diphtheria and pertussis. 3  All people between the ages of 11 and 18 are advised to get the booster, preferably around 11 or 12 years old. 1 Td. 2  If you're an adult, get a Td (tetanus and diphtheria) booster shot every 10 years to stay protected. 3  Since some people may lose the protective antibody levels after 5 years, a booster vaccination is recommended if you get a deep, contaminated wound and haven't had a vaccination in more than 5 years."}, {"url": "http://www.wikihow.com/Know-when-You-Need-a-Tetanus-Shot", "passage_text": "1 DTaP. 2  The diphtheria, tetanus, and pertussis (whooping cough) vaccine (DTaP) are usually given to babies at ages 2, 4, and 6 months, and again at 15 to 18 months old. 3  DTap is a very effective vaccine for small children. 4  Kids will need another booster between ages 4 and 6. 1 Td. 2  If you're an adult, get a Td (tetanus and diphtheria) booster shot every 10 years to stay protected. 3  Since some people may lose the protective antibody levels after 5 years, a booster vaccination is recommended if you get a deep, contaminated wound and haven't had a vaccination in more than 5 years."}, {"url": "http://www.webmd.com/children/vaccines/understanding-tetanus-prevention", "passage_text": "Children should next get a tetanus vaccine using the Tdap vaccine at age 11 or 12. Any adult who has not had a tetanus immunization within 10 years should get a single dose of Tdap. After Tdap, the Td vaccine is recommended every 10 years. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/tetanus/expert-answers/tetanus-shots/faq-20058209", "passage_text": "After the initial tetanus series, booster shots are recommended every 10 years. If you experience a puncture wound and it's been more than five years since your last tetanus shot — or you can't remember when you had your last tetanus shot — it's best to get the booster shot. With. James M. Steckelberg, M.D. "}, {"url": "http://www.wikihow.com/Know-when-You-Need-a-Tetanus-Shot", "passage_text": "1 The diphtheria, tetanus, and pertussis (whooping cough) vaccine (DTaP) are usually given to babies at ages 2, 4, and 6 months, and again at 15 to 18 months old. 2  DTap is a very effective vaccine for small children. 3  Kids will need another booster between ages 4 and 6. 1 Td. 2  If you're an adult, get a Td (tetanus and diphtheria) booster shot every 10 years to stay protected. 3  Since some people may lose the protective antibody levels after 5 years, a booster vaccination is recommended if you get a deep, contaminated wound and haven't had a vaccination in more than 5 years."}, {"url": "https://en.wikipedia.org/wiki/Tetanus_vaccine", "passage_text": "Before the vaccine there was an average of 580 annual cases of tetanus and 472 annual deaths from tetanus. But since the vaccine there is an average of 41 annual cases of tetanus and 4 annual deaths from tetanus. This is 93% reduction in occurrence of tetanus and a 99% reduction in fatalities resulting from tetanus. Tetanus has become uncommon in the United States, with an average of 29 reported cases per year from 1996 through 2009. Nearly all cases of tetanus are among those who have never received a tetanus vaccine, or adults who don't stay up to date on their 10-year booster shots."}, {"url": "http://www.cdc.gov/Features/Tetanus/index.html", "passage_text": "A DTaP booster is recommended for children ages 4 through 6 years old. Because our protection from tetanus decreases over time, older children need to get the Tdap vaccine. This booster shot contains a full dose of tetanus and lower doses of diphtheria and pertussis (whooping cough) vaccine. The Tdap vaccine is recommended for all 11 through 18 year olds, preferably at age 11 or 12 years. After getting the Tdap vaccine as a preteen or teen, adults need to get a Td (tetanus and diphtheria) booster shot every 10 years to stay protected."}]