[{"url": "http://study.com/academy/lesson/calculating-average-speed-formula-practice-problems.html", "passage_text": "The average speed of an object is the total distance traveled by the object divided by the elapsed time to cover that distance. It's a scalar quantity which means it is defined only by magnitude. A related concept, average velocity, is a vector quantity. A vector quantity is defined by magnitude and direction."}, {"url": "http://www.batesville.k12.in.us/Physics/PhyNet/Mechanics/Kinematics/AveSpeed.html", "passage_text": "She wishes to have an average speed of 60 miles/hour for the trip. Due to a traffic jam, however, she only has an average speed of 30 miles/hour for the first 30 miles. How fast does she need to go for the remaining 30 miles so that her average speed is 60 miles/hour for the whole trip?"}, {"url": "http://www.batesville.k12.in.us/Physics/PhyNet/Mechanics/Kinematics/AveSpeed.html", "passage_text": "Average Speed. The average speed of an object tells you the (average) rate at which it covers distance. If a car's average speed is 65 miles per hour, this means that the car's position will change (on the average) by 65 miles each hour. Average speed is a rate. In kinematics, a rate is always a quantity divided by the time taken to get that quantity (the elapsed time)."}, {"url": "http://physics.stackexchange.com/questions/29/how-to-calculate-average-speed", "passage_text": "60 miles per hour is 1 minute per mile, while 40 miles per hour is 1.5 minutes per mile. Since we travel the same number of miles at each speed, we can now take the mean of these two figures. That's 1.25 minutes per mile on average. For 240 miles total, 240miles*1.25minutes/mile = 300 minutes = 5 hours."}, {"url": "http://www.physicsclassroom.com/mmedia/kinema/trip.cfm", "passage_text": "Average speed is a measure of the distance traveled in a given period of time; it is sometimes referred to as the distance per time ratio. Suppose that during your trip to school, you traveled a distance of 5 miles and the trip lasted 0.2 hours (12 minutes)."}, {"url": "http://www.answers.com/Q/How_do_you_calculate_the_average_speed_of_an_object", "passage_text": "The average speed is the distance traveled divided by the time spent traveling. A car that travels 180 miles in 4 hours did so with an average speed of 180/4 = 45 miles per hour."}, {"url": "http://www.batesville.k12.in.us/Physics/PhyNet/Mechanics/Kinematics/AveSpeed.html", "passage_text": "In order to have an average speed of 60 miles/hour over a distance of 60 miles, you must complete the trip in 1 hour: But Susie has already taken an hour (it takes 1 hour to go 30 miles with an average speed of 30 miles/hour) - and she is only half way!"}, {"url": "http://study.com/academy/lesson/calculating-average-speed-formula-practice-problems.html", "passage_text": "Introduction-Average Speed in Action. You and your friend decided to take your brand-new red sports car out for a spin. Your car is capable of speeds up to 220 mph. You drove 45 miles in 1.25 hours. At the end of your trip, your friend tells you that your average speed during the trip is 36 miles per hour."}]