[{"url": "http://www1.salary.com/Six-Sigma-Black-Belt-salary.html", "passage_text": "For example the median expected annual pay for a typical Six Sigma Black Belt in the United States is $99,110 so 50% of the people who perform the job of Six Sigma Black Belt in the United States are expected to make less than $99,110. Source: HR Reported data as of October 2015. Median $99,110. 1  Salary."}, {"url": "http://www.salarylist.com/jobs/Lean-Six-Sigma-Black-Belt-Salary.htm", "passage_text": "Lean Six Sigma Black Belt average salary is $78,649, median salary is $77,896 with a salary range from $60,000 to $95,000. Lean Six Sigma Black Belt salaries are collected from government agencies and companies. Each salary is associated with a real job position."}, {"url": "http://smallbusiness.chron.com/salary-six-sigma-trainer-20098.html", "passage_text": "Earning the title of Master Six Sigma Black Belt can increase the average annual salary to $132,500. With 15 years of experience, the Master Six Sigma Black Belt can earn up to $202,500 annually. Salaries of these amounts are not guaranteed by Six Sigma and can vary due to location."}, {"url": "http://www.sixsigma.com/black-belt-salary/", "passage_text": "In the United States, Lean Six Sigma Black Belts working in the Western subregion reported the highest average salary at $95,648. 1  Those in the Northeast states earn $92,394 in annual pay. 2  Lean Six Sigma Black Belt working in the Central and Southern subregions reported an average salary of approximately $90,000 a year."}, {"url": "http://www.sixsigma.com/black-belt-salary/", "passage_text": "Lean Six Sigma Black Belts earn an average of $83,107 per year, not including bonuses. After several years of relatively flat numbers, the average worldwide Lean Six Sigma Black Belt salary rose to $83,107, up 5 percent over the previous year (Figure 4)."}, {"url": "http://www.sixsigma.com/black-belt-salary/", "passage_text": "Lean Six Sigma Black Belts employed in the United States and Europe earn average annual salaries of $92,157 and $76,944, respectively."}, {"url": "http://www1.salary.com/Six-Sigma-Black-Belt-salary.html", "passage_text": "The annual salary for someone with the job title Six Sigma Black Belt may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}]