[{"url": "http://www.google.com/patents/US4228144", "passage_text": "When the thus produced magnesium chloride hexammoniate is used for producing anhydrous magnesium chloride, the magnesium chloride hexahydrate contained in the hexammoniate causes the resultant anhydrous magnesium chloride to contain a considerable amount of magnesium oxide. Furthermore, in the process of Japanese Pat. However, after the recovery of the precipitated magnesium chloride hexammoniate, the remaining aqueous solution containing unreacted magnesium chloride, ammonium salt and ammonia, and having a low temperature, is discharged from the reaction system without recovering it."}, {"url": "http://www.apsu.edu/sites/apsu.edu/files/chemistry/SP12_1011_Separation_of_a_Mixture.pdf", "passage_text": "When chemicals are present in a mixture, these unique physical properties can be utilized to separate the chemicals into their pure states. This experiment will give you experience in separating the components in a three-compound mixture; ammonium chloride, sodium chloride (table salt), and silicon dioxide (sand). "}, {"url": "https://en.wikipedia.org/wiki/Magnesium_chloride", "passage_text": "Magnesium chloride is the name for the chemical compounds with the formulas MgCl 2 and its various hydrates MgCl 2 (H 2 O) x. These salts are typical ionic halides, being highly soluble in water. The hydrated magnesium chloride can be extracted from brine or sea water. In North America, magnesium chloride is produced primarily from Great Salt Lake brine. It is extracted in a similar process from the Dead Sea in the Jordan valley. Magnesium chloride, as the natural mineral bischofite, is also extracted (via solution mining) out of ancient seabeds; for example, the Zechstein seabed in northwest Europe."}, {"url": "http://www.google.com/patents/US4228144", "passage_text": "Usually, magnesium chloride hexahydrate is used for the reaction step. The concentration of the magnesium chloride hexahydrate in the reaction mixture is not limited to a special range. However, it is preferable that the concentration of magnesium chloride hexahydrate be in a range of from 2 to 20% by weight. However, after the recovery of the precipitated magnesium chloride hexammoniate, the remaining aqueous solution containing unreacted magnesium chloride, ammonium salt and ammonia, and having a low temperature, is discharged from the reaction system without recovering it."}, {"url": "https://answers.yahoo.com/question/index?qid=20091030074755AAViv5W", "passage_text": "A mixture of 41.0g of Mg (molar mass= 24.31g/mol) and 175g of iron(III) chloride (molar mass = 162.2 g/mol) is allowed to react/ Identify the limiting reactant and determine the mass of the excess reactant present present in the vessel when the reaction is complete. A 3.304 g sample of magnesium reacts with hydrochloric acid to form magnesium chloride and hydrogen gas."}, {"url": "http://www.cameochemicals.noaa.gov/chemical/17112", "passage_text": "A mixture of magnesium chloride and magnesium chlorate. A white crystalline solid. Forms very flammable mixtures with combustible materials. These mixtures may be explosive if the combustible material is very finely divided. "}, {"url": "http://www.google.com/patents/US4228144", "passage_text": "This reaction causes the content of magnesium oxide in the resultant anhydrous magnesium chloride to be increased. When the concentration of the magnesium chloride hexahydrate is larger than 70% by weight, a portion of the magnesium chloride hexahydrate may become difficult to dissolve in the reaction mixture. However, after the recovery of the precipitated magnesium chloride hexammoniate, the remaining aqueous solution containing unreacted magnesium chloride, ammonium salt and ammonia, and having a low temperature, is discharged from the reaction system without recovering it."}, {"url": "http://www.answers.com/Q/Is_magnesium_chloride_a_compound_or_mixture", "passage_text": "Because magnesium has a low electronegativity and chlorine has a high electronegativity, magnesium tends to lose an electron and chlorine tends to gain an electron when these … substances react. This results in the formation of magnesium and chloride ions. Thus, magnesium chloride is ionic. Yes, it is a mixture of sodium chloride (NaCl) and water (H2O). 4 people found this useful. Edit. Share to: 1  Interesting Facts About Holmium Holmium is an Earth element that was discovered by a Swedish chemist."}, {"url": "https://en.wikipedia.org/wiki/Magnesium_chloride", "passage_text": "In addition to the production of magnesium metal, magnesium chloride also is used for a variety of other applications: fertilizer, mineral supplement for animals, wastewater treatment, wallboard, artificial seawater, feed supplement, textiles, paper, fireproofing agents, cements and refrigeration brine. It is extracted in a similar process from the Dead Sea in the Jordan valley. Magnesium chloride, as the natural mineral bischofite, is also extracted (via solution mining) out of ancient seabeds; for example, the Zechstein seabed in northwest Europe."}, {"url": "http://www.answers.com/Q/Is_magnesium_chloride_a_compound_or_mixture", "passage_text": "Sodium chloride is a compound and not a mixture because it is a pure substance which cannot be separated physically. Mixtures contain components which are not chemically bonde … d, and thus can typically be separated by nonchemical means. Yes, it is a mixture of sodium chloride (NaCl) and water (H2O). 4 people found this useful. Edit. Share to: 1  Interesting Facts About Holmium Holmium is an Earth element that was discovered by a Swedish chemist."}]