[{"url": "http://www.rfcafe.com/references/electrical/pim.htm", "passage_text": "Passive Intermodulation (PIM). Passive Intermodulation (PIM) occurs when two or more signals are present in a passive device (cable, connector, isolator, switch, etc.) that exhibits a nonlinear response. The nonlinearity is caused by dissimilar metals, dirty interconnects, or other anodic effects. Loose connections are another source. Hear It. Passive Intermodulation (PIM) occurs when two or more signals are present in a passive device (cable, connector, isolator, switch, etc.) that exhibits a nonlinear response."}, {"url": "http://www.rfcafe.com/references/electrical/pim.htm", "passage_text": "Sitemap. Passive Intermodulation (PIM) occurs when two or more signals are present in a passive device (cable, connector, isolator, switch, etc.) that exhibits a nonlinear response. The nonlinearity is caused by dissimilar metals, dirty interconnects, or other anodic effects. Loose connections are another source. Hear It. Passive Intermodulation (PIM) occurs when two or more signals are present in a passive device (cable, connector, isolator, switch, etc.) that exhibits a nonlinear response."}, {"url": "http://www.radio-electronics.com/info/rf-technology-design/passive-intermodulation-pim/basics-tutorial.php", "passage_text": "Causes of passive intermodulation, PIM products. Passive intermodulation effects occur as the result of a non-linearity being experienced by two or more signals. A whole variety of instances can give rise to a non-linearity that can cause PIM effects."}, {"url": "http://www.radio-electronics.com/info/rf-technology-design/passive-intermodulation-pim/basics-tutorial.php", "passage_text": "The nature of passive intermodulation, PIM is that it occurs in elements that would otherwise be expected to operate in a linear fashion. Typically any mixing or multiplication in diode components in circuits is not termed PIM as the mixing is generally wanted and the diodes are expected to be in place. Passive intermodulation effects occur as the result of a non-linearity being experienced by two or more signals. A whole variety of instances can give rise to a non-linearity that can cause PIM effects."}, {"url": "https://en.wikipedia.org/wiki/Intermodulation", "passage_text": "Visible intermodulation products are seen as small spurs at 280 MHz and 265 MHz. Intermodulation (IM) or intermodulation distortion (IMD) is the amplitude modulation of signals containing two or more different frequencies, caused by nonlinearities in a system. A linear system cannot produce intermodulation. If the input of a linear time-invariant system is a signal of a single frequency, then the output is a signal of the same frequency; only the amplitude and phase can differ from the input signal."}, {"url": "http://www.radio-electronics.com/info/rf-technology-design/passive-intermodulation-pim/testing-equipment.php", "passage_text": "As passive intermodulation is a parameter that is key to the operation of many systems including cellular base stations, satellite systems and many other radio systems were duplex operation is required, passive intermodulation, PIM testing is required. 1 PIM testing: PIM testing specifically looks for the presence of passive intermodulation products within the item under test. 2  It cannot detect losses or reflections."}, {"url": "http://www.keysight.com/main/redirector.jspx?action=ref&cname=COLLECTION&ckey=2127060&cc=US&lc=eng", "passage_text": "Passive Intermodulation (PIM) Measurement. Passive intermodulation (PIM) is a form of intermodulation distortion that occurs in passive components such as antennas, cables, connectors, or duplexers with two or more high-power input signals. PIM in the transmission path degrades quality of the wireless communication system. Innovative Passive Intermodulation (PIM) and S-parameter Measurement Solution with the ENA. This application note introduces the solution that combines PIM and S-parameter measurements by using the vector network analyzer."}, {"url": "http://www.radio-electronics.com/info/rf-technology-design/passive-intermodulation-pim/basics-tutorial.php", "passage_text": "The passive intermodulation products caused by the non-linearity follow exactly the same principles of those of wanted modulation products in a mixer. It is found that the various harmonics of the input frequencies mix together to form products that can remain within the required operational band. Passive intermodulation effects occur as the result of a non-linearity being experienced by two or more signals. A whole variety of instances can give rise to a non-linearity that can cause PIM effects."}, {"url": "http://www.radio-electronics.com/info/rf-technology-design/passive-intermodulation-pim/basics-tutorial.php", "passage_text": "Passive intermodulation, PIM is a form of intermodulation distortion that can occur even when no active components are present. Passive intermodulation effects occur as the result of a non-linearity being experienced by two or more signals. A whole variety of instances can give rise to a non-linearity that can cause PIM effects."}]