[{"url": "http://www.ehow.com/about_4745245_what-urethane-paint.html", "passage_text": "Urethane paint is paint created by mixing pigment with polyurethanes, which act as the binder to hold the pigment molecules together. Many brands of urethane paint are available to consumers today. Advantages. Urethane paint was first created in the mid-1960s, utilizing the newly-developed plastics technology of that era, to be superior to enamel paint in terms of durability. It also has the advantage of being a surface that can be applied over enamel if the enamel-painted surface is prepared first."}, {"url": "http://www.ehow.com/about_4618228_polyurethane-paint.html", "passage_text": "Choosing a Polyurethane. Polyurethane is applied with a brush to flat surfaces and with a cloth to contoured surfaces. The aerosol spray form is used for hard-to-reach areas. The paint is available in a gloss, semi-gloss and satin finish."}, {"url": "http://www.carsdirect.com/car-maintenance/urethane-car-paint-understanding-the-pros-and-cons", "passage_text": "However, most pros will tell you that lacquer shouldn't be sprayed over urethane paint. Since lacquer paints are more expensive than urethane paints, consider getting your car painted with urethane paints. Urethane is also better than enamel paint, since it provides a good finish and doesn't run lines. Apart from this, urethane paint dries off quickly; it's resistant to chipping and doesn't fade easily. If the car exteriors are maintained well, urethane car paints will last for more than 10 years. "}, {"url": "http://www.diynetwork.com/how-to/skills-and-know-how/painting/whats-the-difference-between-polyurethane-varnish-shellac-and-lacquer", "passage_text": "Both oil-and water-based polyurethane can be applied to latex/acrylic paint; however, oil-based polyurethane will create a yellow or amber hue, especially to light colors. To add durability without affected color, use a water-based finish. Essentially a plastic in the form of a liquid until it dries, polyurethane is available in both water-and oil-based options, and comes in varieties from satin to glossy. Water-based polyurethane is popular because of its low odor and low toxicity."}, {"url": "http://www.wisegeek.org/what-is-polyurethane.htm", "passage_text": "Polyurethane is a resilient, flexible and durable manufactured material that can take the place of paint, cotton, rubber, metal or wood in thousands of applications across virtually all fields. It can be hard like fiberglass, squishy like upholstery foam, protective like varnish, bouncy like rubber or sticky like glue. "}, {"url": "http://www.ehow.com/about_4618228_polyurethane-paint.html", "passage_text": "Thanks to its polyurethane content, polyurethane paint is similar to liquid plastic when wet. Use this type of paint to protect a variety of craft projects, including decoupage and woodcraft, from scratches and dents. Polyurethane paint comes in three types: water-based, oil-based and oil-modified water-based. Polyurethane is applied with a brush to flat surfaces and with a cloth to contoured surfaces. The aerosol spray form is used for hard-to-reach areas. The paint is available in a gloss, semi-gloss and satin finish."}, {"url": "https://en.wikipedia.org/wiki/Polyurethane", "passage_text": "Polyurethane synthesis, wherein the urethane groups — NH-(C=O)-O-link the molecular units. Polyurethane (PUR and PU) is a polymer composed of organic units joined by carbamate (urethane) links. Non-isocyanate based polyurethanes (NIPUs) have recently been developed as a new class of polyurethane polymers to mitigate health and environmental concerns. Polyurethane products often are simply called “urethanes”, but should not be confused with ethyl carbamate, which is also called urethane."}, {"url": "https://en.wikipedia.org/wiki/Polyurethane", "passage_text": "While most polyurethanes are thermosetting polymers that do not melt when heated, thermoplastic polyurethanes are also available. Polyurethane polymers are traditionally and most commonly formed by reacting a di-or poly isocyanate with a polyol. Non-isocyanate based polyurethanes (NIPUs) have recently been developed as a new class of polyurethane polymers to mitigate health and environmental concerns. Polyurethane products often are simply called “urethanes”, but should not be confused with ethyl carbamate, which is also called urethane."}, {"url": "http://www.ehow.com/about_4618228_polyurethane-paint.html", "passage_text": "Water-based polyurethane is available in clear for interiors and as a spar urethane for exteriors. Use a synthetic-filament brush or buy the aerosol spray to apply three coats of either clear polyurethane and spar urethane. Clear polyurethane takes two hours to dry between coats, while spar urethane takes four hours. Polyurethane is applied with a brush to flat surfaces and with a cloth to contoured surfaces. The aerosol spray form is used for hard-to-reach areas. The paint is available in a gloss, semi-gloss and satin finish."}]