[{"url": "http://www.webmd.com/drugs/2/drug-11495/duratears-ophthalmic/details", "passage_text": "Eye lubricants keep the eye moist, help to protect the eye from injury and infection, and decrease symptoms of dry eyes such as burning, itching, and feeling as if something is in the eye. How to use Duratears ophthalmic. If your doctor has directed you to use this medication, remember that he or she has judged that the benefit to you is greater than the risk of side effects. Many people using this medication do not have serious"}, {"url": "http://fdb.rxlist.com/drugs/drug-11495-Duratears+Opht.aspx?drugid=11495&drugname=Duratears+Opht", "passage_text": "How to use Duratears ophthalmic. This medication is used to relieve dry, irritated eyes. Common causes for dry eyes include wind, sun, heating/air conditioning, computer use/reading, and certain medications. If using an ointment once a day, it may be best to use it at bedtime. To apply eye ointment/drops/gels: Wash hands first. To avoid contamination, be careful not to touch the dropper or top of the ointment tube or let it touch your eye. Always replace the cap tightly after each use."}, {"url": "http://www.webmd.com/drugs/2/drug-11495/duratears-ophthalmic/details", "passage_text": "If using an ointment once a day, it may be best to use it at bedtime. To apply eye ointment/drops/gels: Wash hands first. To avoid contamination, be careful not to touch the dropper or top of the ointment tube or let it touch your eye. Always replace the cap tightly after each use. If your doctor has directed you to use this medication, remember that he or she has judged that the benefit to you is greater than the risk of side effects. Many people using this medication do not have serious"}, {"url": "http://www.nps.org.au/medicines/eye/artificial-tears/paraffin-liquid-paraffin-white-soft-wool-fat/duratears-lubricating-eye-ointment", "passage_text": "Duratears Lubricating Eye Ointment is a brand of medicine containing the active ingredients paraffin, liquid-paraffin, white soft-wool fat. Find out more about active ingredients. Your doctor can discuss with you the risks and benefits involved. Remove contact lenses before using DURATEARS® Eye Ointment. This product is not to be used with contact lenses. If you have not told your doctor about any of the above, tell them before you start using DURATEARS® Lubricating Eye Ointment."}, {"url": "http://www.mydr.com.au/medicines/cmis/duratears-lubricating-eye-ointment", "passage_text": "DURATEARS® Lubricating Eye Ointment is a multi-use preservative free ointment that has been specially formulated for the symptomatic treatment of dry eye conditions. The ointment forms a smooth, comfortable protective film when applied to the eyes. It is particularly effective for use while sleeping and in patients who are sensitive to preservatives or where the use of preservatives is considered inappropriate. What is in this leaflet. Please read this leaflet carefully before you start using DURATEARS® Lubricating Eye Ointment. This leaflet answers some common questions about DURATEARS® Lubricating Eye Ointment. It does not contain all the available information."}, {"url": "http://www.webmd.com/drugs/2/drug-11495/duratears-ophthalmic/details", "passage_text": "Follow all directions on the product package. If you are uncertain about any of the information, consult your doctor or pharmacist. Do not use a solution that has changed color or is cloudy. Certain brands (containing glycerin with polysorbates, among other ingredients) may have a milky appearance. If your doctor has directed you to use this medication, remember that he or she has judged that the benefit to you is greater than the risk of side effects. Many people using this medication do not have serious"}, {"url": "http://www.nps.org.au/__data/cmi_pdfs/CMR10654.pdf", "passage_text": "Keep this leaflet with the medicine. You mayneed to read it again. What DURATEARS® Eye Ointment isused for DURATEARS® Lubricating Eye Ointment is amulti-use preservative free ointment that has beenspecially formulated for the symptomatictreatment of dry eye conditions. How to use DURATEARS® EyeOintment How much to use A ribbon of ointment (1-1.5 cm) How to use 1. Remove cap from tube. Gently pull lowereyelid down.2. Squeeze a ribbon of ointment (1-1.5 cm) intothe lower portion of the eye.3."}, {"url": "http://drug-info.in/duratears-lanolin-oil-alcon/", "passage_text": "Duratears – Alcon. Categories: Drug List D. The drug brand named Duratears contains generic salt-Lanolin Oil and is manufactured by Alcon. Duratears is mainly associated with symptoms and indications-The International Classification of Diseases (ICD)- S01XA20-Artificial Tears and other indifferent preparations. Generic Salts. Lanolin Oil"}, {"url": "http://www.medhelp.org/tags/show/178710/duratears", "passage_text": "Drug Name: EYE LUBRICANT-OPHTHM. Uses: This medication is used to relieve dry, irritated eyes. Common causes for dry eyes include wind, sun, heating/air conditioning, computer use/reading, and certain medications."}]