[{"url": "https://en.wikipedia.org/wiki/Sporophyte", "passage_text": "Young sporophytes of the common moss Tortula muralis. In mosses, the gametophyte is the dominant generation, while the sporophytes consist of sporangium-bearing stalks growing from the tips of the gametophytes. A sporophyte (/spɔːroʊˌfaɪt/) is the diploid multicellular stage in the life cycle of a plant or alga. In flowering plants the gametophytes are very reduced in size, and are represented by the pollen and the embryo sac. The sporophyte produces spores (hence the name) by meiosis, a process also known as reduction division that reduces the number of chromosomes in each spore mother cell by half."}, {"url": "http://www.biology-questions-and-answers.com/angiosperms.html", "passage_text": "The pollen grain is the male gametophyte. When pollination occurs and the pollen grain makes contact with the stigma (the apex of the pistil), the tube cell elongates its cytoplasm, forming the pollen tube that grows towards the ovary. The generative cell divides to form two sperm nuclei (male gametes), which then migrate through the pollen tube. 13. A typical seed is composed of the embryo, endosperm and shell. Within seeds of angiosperms, there are one or two cotyledons (seed leaves, one in monocots, two in dicots). The endosperm is the tissue within the seed that has the function of nourishing the embryo."}, {"url": "https://quizlet.com/5278897/ap-biology-chapter-30-flash-cards/", "passage_text": "1. sporophyte 2. microspores 3. microsporangia 4. pollen cone 5. pollen nuclei A) 1, 4, 3, 2, 5 B) 1, 4, 2, 3, 5 C) 1, 2, 3, 5, 4 D) 4, 1, 2, 3, 5 E) 4, 3, 2, 5, 1. 1. cells of sporangium 2. cells in the interior of a subterranean root 3. epidermal cells of sporophyte megaphylls 4. cells of a gametophyte A) 3, 4, 1, 2 B) 3, 4, 2, 1 C) 3, 1, 4, 2 D) 3, 2, 1, 4 E) 3, 1, 2, 4."}, {"url": "http://wps.aw.com/bc_campbell_essentials_4_oa/144/36967/9463671.cw/content/index.html", "passage_text": "In pines, the female gametophyte contains _____, each of which contains a(n) _____. A stamen consists of _____. stigma and anther. stigma and style. stigma and filament. ovary and sepal. anther and filament. In angiosperms, pollination is the transfer of pollen grain to the _____ of a flower on the same plant or another plant of the same species."}, {"url": "https://en.wikipedia.org/wiki/Gametophyte", "passage_text": "Pine gametophyte (outside) surrounding the embryo (inside). A gametophyte is the haploid multicellular stage in the alternation of generations life cycle of plants and algae. It develops from a spore by mitotic cell division. Spores are the products of meiosis in sporophytes. Gametophytes produce haploid gametes by mitosis. In some types of plants and algae (e.g. Ulva) gametes are isogamous --that is, the gametes are all of one size, shape and general morphology. In land plants, Anisogamy is universal. As in animals, female and male gametes are called, respectively, eggs and sperm"}, {"url": "https://en.wikipedia.org/wiki/Sporophyte", "passage_text": "In flowering plants, the sporophyte comprises the whole multicellular body except the pollen and embryo sac. Bryophytes (mosses, liverworts and hornworts) have a dominant gametophyte phase on which the adult sporophyte is dependent for nutrition. The embryo sporophyte develops by cell division of the zygote within the female sex organ or archegonium, and in its early development is therefore nurtured by the gametophyte. In flowering plants the gametophytes are very reduced in size, and are represented by the pollen and the embryo sac. The sporophyte produces spores (hence the name) by meiosis, a process also known as reduction division that reduces the number of chromosomes in each spore mother cell by half."}, {"url": "https://quizlet.com/5278897/ap-biology-chapter-30-flash-cards/", "passage_text": "A) decrease in the size of the leaf B) reduction of the gametophyte phase of the life cycle C) elimination of sperm cells or sperm nuclei D) increasing reliance on water to bring sperm and egg together E) replacement of roots by rhizoids. 1. cells of sporangium 2. cells in the interior of a subterranean root 3. epidermal cells of sporophyte megaphylls 4. cells of a gametophyte A) 3, 4, 1, 2 B) 3, 4, 2, 1 C) 3, 1, 4, 2 D) 3, 2, 1, 4 E) 3, 1, 2, 4."}, {"url": "http://wps.aw.com/bc_campbell_essentials_4_oa/144/36967/9463671.cw/content/index.html", "passage_text": "The male gametophytes of flowering plants are also referred to as _____. megaspores. pollen grains. endosperm. embryo sacs. male sporophytes. In flowering plants the integuments of the ovule develop into a(n) _____. A stamen consists of _____. stigma and anther. stigma and style. stigma and filament. ovary and sepal. anther and filament. In angiosperms, pollination is the transfer of pollen grain to the _____ of a flower on the same plant or another plant of the same species."}, {"url": "https://answers.yahoo.com/question/index?qid=20090219151024AAQrZ2T", "passage_text": "Answers. Best Answer: pine tree represents the diploid sporophyte generation. By meiosis, the pine eventually produces male and female gametophytes. The male gametophytes of the pine are smallthey are the pollen grains released by male cones to be dispersed to female cones. The larger female gametophytes remain within the ovules of the female cones of the pine and are dependent on the surrounding sporophyte tissues for their nutrition. Source(s):"}]