[{"url": "https://answers.yahoo.com/question/index?qid=20100911150243AAFkhNC", "passage_text": "A chromosome is made up of tightly-packed structures called DNA. Each DNA is made up of nucleotides. Each nucleotide is made up of a sugar, a phosphate, and a base (adenine, cytosine, guanine, and thymine). In the nucleus of each cell, the DNA molecule is packaged into thread-like structures called chromosomes. Each chromosome is made up of DNA tightly coiled many times around proteins called histones that support its structure. yash · 4 months ago."}, {"url": "http://www.genomenewsnetwork.org/resources/whats_a_genome/Chp1_4_1.shtml", "passage_text": "DNA. DNA is the molecule that is the hereditary material in all living cells. Genes are made of DNA, and so is the genome itself. A gene consists of enough DNA to code for one protein, and a genome is simply the sum total of an organism's DNA. DNA is long and skinny, capable of contorting like a circus performer when it winds into chromosomes. DNA is a very large molecule, made up of smaller units called nucleotides that are strung together in a row, making a DNA molecule thousands of times longer than it is wide. Each nucleotide has three parts: a sugar molecule, a phosphate molecule, and a structure called a nitrogenous base"}, {"url": "http://www.livescience.com/37247-dna.html", "passage_text": "DNA structure. DNA is made up of molecules called nucleotides. Each nucleotide contains a phosphate group, a sugar group and a nitrogen base. The four types of nitrogen bases are adenine (A), thymine (T), guanine (G) and cytosine (C). The order of these bases is what determines DNA's instructions, or genetic cod"}, {"url": "http://www.answers.com/Q/What_is_a_chromosome_made_of", "passage_text": "Confidence votes 1.9K. Chromosomes are made of a single strand of DNA. There are also some proteins that are bound to this DNA in order to manage it and keep it coiled, these are also sometimes referred to as part of the chromosome. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100911150243AAFkhNC", "passage_text": "Chromosomes are made of a single strand of DNA. There are also some proteins that are bound to this DNA in order to manage it and keep it coiled, these are also sometimes referred to as part of the chromosome. SEE http://ghr.nlm.nih.gov/handbook/basics/c... In the nucleus of each cell, the DNA molecule is packaged into thread-like structures called chromosomes. Each chromosome is made up of DNA tightly coiled many times around proteins called histones that support its structure. yash · 4 months ago."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/gene", "passage_text": "Alleles are forms of the same gene with small differences in their sequence of DNA bases. These small differences contribute to each person’s unique physical features. Genes are made up of DNA. Each chromosome contains many genes. A gene is the basic physical and functional unit of heredity. Genes, which are made up of DNA, act as instructions to make molecules called proteins. In humans, genes vary in size from a few hundred DNA bases to more than 2 million bases. "}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/chromosome", "passage_text": "DNA and histone proteins are packaged into structures called chromosomes. In the nucleus of each cell, the DNA molecule is packaged into thread-like structures called chromosomes. Each chromosome is made up of DNA tightly coiled many times around proteins called histones that support its structure. Chromosomes are not visible in the cell’s nucleus—not even under a microscope—when the cell is not dividing. "}, {"url": "http://www.yourgenome.org/facts/what-is-dna", "passage_text": "1 Your genome is made of a chemical called deoxyribonucleic acid, or DNA for short. 2  DNA contains four basic building blocks or ‘ bases ’: adenine (A), cytosine (C), guanine (G) and thymine (T). 3  The order, or sequence, of these bases form the instructions in the genome. 4  DNA is a two-stranded molecule. "}]