[{"url": "http://study.com/academy/lesson/tragedy-in-drama-classical-to-modern.html", "passage_text": "Lesson Summary. In conclusion, a tragedy is a type of drama that focuses on human suffering. The main character, the tragic hero, suffers through the story, but in the end, learns something about himself and his place in the world, a lesson that makes the suffering worth his while. Characteristics of Tragedy. But a tragedy is more than just a play about suffering. In The Poetics, Aristotle explains that the plot in a tragedy is more than just the story itself; it is the arrangement of the incidents, or chain reaction of cause-and-effect events, that happen in the story."}, {"url": "http://www.pbs.org/empires/thegreeks/background/24c.html", "passage_text": "Greek statuette. Two strolling actors with comedy masks in the Louvre, Paris. The Ancient Greeks took their entertainment very seriously and used drama as a way of investigating the world they lived in, and what it meant to be human. The three genres of drama were comedy, satyr plays, and most important of all, tragedy. Comedy: The first comedies were mainly satirical and mocked men in power for their vanity and foolishness. The first master of comedy was the playwright Aristophanes. The three great playwrights of tragedy were Aeschylus, Sophocles, and Euripides. Aristotle argued that tragedy cleansed the heart through pity and terror, purging us of our petty concerns and worries by making us aware that there can be nobility in suffering."}, {"url": "http://www.ancient.eu/Greek_Tragedy/", "passage_text": "In the Roman world, tragedy plays were translated and imitated in Latin, and the genre gave rise to a new art form from the 1st century BCE, pantomime, which drew inspiration from the presentation and subject matter of Greek tragedy. Euripides (c. 484-407 BCE) was one of the greatest authors of Greek tragedy. In 5th century BCE Athens his classic works such as Medeia cemented his reputation for clever dialogues, fine choral lyrics and a gritty realism in both his text and stage presentations."}, {"url": "https://en.wikipedia.org/wiki/Greek_tragedy", "passage_text": "Greek tragedy is a form of theatre from Ancient Greece and Asia Minor. It reached its most significant form in Athens in the 5th century BC. Greek tragedy is an extension of the ancient rites carried out in honor of Dionysus, and it heavily influenced the theatre of Ancient Rome and the Renaissance. Tragic plots were most often based upon myths from the oral traditions of archaic epics."}, {"url": "http://www.ancient.eu/Greek_Tragedy/", "passage_text": "Sophocles of Kolōnos (c. 496 - c. 406 BCE) was one of the most famous and celebrated writers of tragedy plays in ancient Greece and his surviving works, written throughout the 5th century BCE, include such classics as Oedipus the King, Antigone, and Women of Trachis. Euripides (c. 484-407 BCE) was one of the greatest authors of Greek tragedy. In 5th century BCE Athens his classic works such as Medeia cemented his reputation for clever dialogues, fine choral lyrics and a gritty realism in both his text and stage presentations."}, {"url": "http://www.ancient.eu/Greek_Tragedy/", "passage_text": "The most famous playwrights of the genre were Aeschylus, Sophocles, and Euripides and many of their works were still performed centuries after their initial premiere. Greek tragedy led to Greek comedy and, together, these genres formed the foundation upon which all modern theatre is based. Euripides (c. 484-407 BCE) was one of the greatest authors of Greek tragedy. In 5th century BCE Athens his classic works such as Medeia cemented his reputation for clever dialogues, fine choral lyrics and a gritty realism in both his text and stage presentations."}, {"url": "http://novaonline.nvcc.edu/eli/spd130et/typetrag.htm", "passage_text": "Return to Types of Drama Menu. T ypes of Drama / Plays: Tragedy. Resource: Wilson/Goldfarb, Chapter 8. The Six Elements of a Tragedy / Play are present in all plays, but some standard forms can be discerned. Verisimilitude -- the illusion of truth -- the method of achieving it changes. Form: the shape given to something so it may serve a useful purpose."}, {"url": "https://en.wikipedia.org/wiki/Tragedy", "passage_text": "Tragedy (from the Greek: τραγῳδία, tragōidia) is a form of drama based on human suffering that invokes in its audience an accompanying catharsis or pleasure in the viewing. 1 For a work to be tragic, it need not have a tragic ending. 2  Although Aristotle says that catharsis (purgation of emotion) should be the goal of tragedy, this is only an ideal. 3  In conformity with the moral codes of the period, plays should not show evil being rewarded or nobility being degraded."}, {"url": "https://en.wikipedia.org/wiki/Tragedy", "passage_text": "In the wake of Aristotle's Poetics (335 BCE), tragedy has been used to make genre distinctions, whether at the scale of poetry in general (where the tragic divides against epic and lyric) or at the scale of the drama (where tragedy is opposed to comedy). 1 For a work to be tragic, it need not have a tragic ending. 2  Although Aristotle says that catharsis (purgation of emotion) should be the goal of tragedy, this is only an ideal. 3  In conformity with the moral codes of the period, plays should not show evil being rewarded or nobility being degraded."}]