[{"url": "http://healing.about.com/od/chakratheseven/a/study7chakras.htm", "passage_text": "The third chakra is referred to as the solar plexus chakra. It is located two inches below the breastbone in the center behind the stomach. The third chakra is the center of personal power, the place of ego, of passions, impulses, anger and strength. "}, {"url": "http://www.2012-spiritual-growth-prophecies.com/chakra-symbols.html", "passage_text": "The heart chakra is the integration point for the seven chakras of the body, because it holds the sacred spark of the divine and the intuition of the Mother. When the heart chakra symbol is open, we are able to forgive, our lungs are clear and our immune systems are healthy. The 6th Ray of Devotion governs this chakra. This chakra symbol connects us with the energy to take action and is the seat of self-esteem and expressing our personal power. Our relationship to the world around us, and our beliefs about our place within it come from this the third of the seven chakras."}, {"url": "http://www.mindbodygreen.com/0-91/The-7-Chakras-for-Beginners.html", "passage_text": "SHARES. The 7 Chakras are the energy centers in our body in which energy flows through. Blocked energy in our 7 Chakras can often lead to illness so it's important to understand what each Chakra represents and what we can do to keep this energy flowing freely. Here's our quick summary: 7 Chakras for Beginners: Healing, Balancing, Opening Chakras: Exercises, Foods, Colors"}, {"url": "https://en.wikipedia.org/wiki/Chakra", "passage_text": "In some Indian religions, a chakra (Sanskrit cakra, wheel) is thought to be an energy point or node in the subtle body. Chakras are believed to be part of the subtle body, not the physical body, and as such, are the meeting points of the subtle (non-physical) energy channels called nadi. Nadi are believed to be channels in the subtle body through which the life force (prana) (non-physical) or vital energy (non-physical) moves. Various scriptural texts and teachings present a different number of chakras. It's believed that there are many chakras in the subtle human body, according to the tantric texts, but there are seven chakras that are considered to be the most important ones."}, {"url": "http://www.zenlama.com/the-7-chakras-a-beginners-guide-to-your-energy-system/", "passage_text": "The 7 Chakras are the energy centers in our body in which energy flows through. The word ‘chakra’ is derived from the sanskrit word meaning ‘wheel’. Literally translated from the Hindi it means ‘Wheel of spinning Energy’. The seven major chakras are in the centre of the body and are aligned with this vertical “power line. ”. Chakras connect your spiritual bodies to your physical one. They regulate the flow of energy throughout the electrical network (meridians) that runs through the physical body."}, {"url": "http://www.expressionsofspirit.com/yoga/chakras.htm", "passage_text": "William J.D. Doran. The Chakras System, Chakra is a Sanskrit word literally meaning wheel.. These centers were named as such because of the circular shape to the spinning energy centers which exist in our subtle etheric body, the non-material energetic counterpart to our physical body. There are seven main chakras and they are located along the spine extending out the front and back of the body."}, {"url": "http://visual.ly/seven-chakras-human-body", "passage_text": "The Seven Chakras of the Human Body. Crown Chakra. Connection to the divine. Located at the crown of your head, it deals with your connection to the divine within you and all around you. Physically, it supports your central nervous system and deep brain functions. 3 comments. Chakra chart describing the seven chakras of the human body: Crown Chakra, Third Eye Chakra, Throat Chakra, Heart Chakra, Solar Plexus Chakra, Sacral Chakra, Root Chakra."}, {"url": "http://www.2012-spiritual-growth-prophecies.com/chakra-symbols.html", "passage_text": "These seven chakra symbols are vital to our health. Negative feelings hamper the spin of these chakras, resulting in sickness and disease. A chakra is a vital energy center that resides in our bodies, that is not detectable by most modern medical means. The 6th Ray of Devotion governs this chakra. This chakra symbol connects us with the energy to take action and is the seat of self-esteem and expressing our personal power. Our relationship to the world around us, and our beliefs about our place within it come from this the third of the seven chakras."}, {"url": "http://www.chopra.com/ccl/what-is-a-chakra", "passage_text": "To visualize a chakra in the body, imagine a swirling wheel of energy where matter and consciousness meet. This invisible energy, called Prana, is vital life force, which keeps us vibrant, healthy, and alive. Fifth Chakra: The Vishuddha chakra is the fifth chakra, located in the area of the throat. This is our source of verbal expression and the ability to speak our highest truth. The fifth chakra includes the neck, thyroid, and parathyroid glands, jaw, mouth, and tongue."}]