[{"url": "http://www.foodsafetynews.com/2010/09/common-foodborne-pathogens-and-toxins-in-the-us/", "passage_text": "Symptoms include nausea, projectile vomiting, diarrhea, abdominal cramps, body aches, headache, and fatigue lasting for 24 to 72 hours. The incubation period is between 10-96 hours. Medical professionals diagnose Norovirus infection by analyzing stool samples or environmental swabs. Diarrhea, bloody diarrhea, abdominal cramps, fever and headache begin after an average 2-5 day incubation period, but can take up to 10 days. Most cases of Campylobacter require only supportive care and rehydration fluids."}, {"url": "http://www.medicinenet.com/norovirus_infection/page3.htm", "passage_text": "Norovirus may have a prolonged infection period that starts even before a patient gets sick. There is a short lag or incubation period (up to two days) between the time that people acquire the virus and the time they get symptoms. People may be contagious during this period. All people are contagious while they are having symptoms."}, {"url": "http://www.netmums.com/coffeehouse/woman-504/sex-contraception-48/135393-sickness-diarrhea-bug.html", "passage_text": "Symptoms. The incubation period is usually 24 to 48 hours but less often it may be down to 12 hours. There is fever, nausea and vomiting that may be projectile along with watery diarrhoea without blood."}, {"url": "http://www.wales.nhs.uk/sitesplus/863/page/50698", "passage_text": "Although a relatively mild infection, Norovirus infection can occur at any age because even if you have it once, you are not immune. The incubation period for Norovirus is anything from 24 hours to three days, and symptoms usually last 12-60 hours. The onset is sudden, and those affected often feel very nauseous and can start vomiting. "}, {"url": "http://www.netmums.com/coffeehouse/woman-504/sex-contraception-48/135393-sickness-diarrhea-bug.html", "passage_text": "8,493. It's called the Norovirus: Symptoms The incubation period is usually 24 to 48 hours but less often it may be down to 12 hours. There is fever, nausea and vomiting that may be projectile along with watery diarrhoea without blood. Abdominal cramps are common. Symptoms last between 12 and 60 hours."}, {"url": "http://www.foodsafetynews.com/2010/09/common-foodborne-pathogens-and-toxins-in-the-us/", "passage_text": "The incubation period averages 8-12 hours, after which diarrhea and abdominal cramps begin. C. perfringens symptoms usually persist for one day. A severe complication, necrotic enteritis (also known as pig-bel syndrome), can develop if large numbers of bacteria are ingested. Diarrhea, bloody diarrhea, abdominal cramps, fever and headache begin after an average 2-5 day incubation period, but can take up to 10 days. Most cases of Campylobacter require only supportive care and rehydration fluids."}, {"url": "http://emedicine.medscape.com/article/775277-clinical", "passage_text": "As an example, norovirus is usually diagnosed by history. The incubation period for the norovirus is between 12 and 48 hours. Some of the early symptoms include nausea, a sudden onset of vomiting, moderate diarrhea, headache, fever (~50%), chills, and myalgia and will last 12-60 hours. "}, {"url": "http://diarrhea.emedtv.com/stomach-flu/stomach-flu-incubation-period.html", "passage_text": "In people with stomach flu, the incubation period may range from 4 hours to 1 to 2 days, depending on the type of virus that is causing the infection. When a person becomes infected with stomach flu, the virus begins to multiply within the small intestine. After approximately 1 to 2 days, depending on the virus, stomach flu symptoms can appear. This period between the stomach flu transmission and the start of symptoms is the stomach flu incubation period.."}, {"url": "http://diarrhea.emedtv.com/norovirus-gastroenteritis/norovirus-incubation-period.html", "passage_text": "A person is not usually contagious during the norovirus incubation period. People infected with norovirus are usually contagious from the moment they begin feeling ill to at least 3 days after recovery. Some people may be contagious for as long as 2 weeks after recovery. When a person becomes infected with norovirus, the virus begins to multiply within the small intestine. After approximately 1 to 2 days, norovirus symptoms can appear. This period between the norovirus transmission and the start of norovirus symptoms is known as the norovirus incubation period."}]