[{"url": "http://medical-dictionary.thefreedictionary.com/Biofield+healing", "passage_text": "Biofield healing. A general term for a group of alternative therapies based on the belief that the human body is surrounded by an energy field (or aura) that reflects the condition of the person's body and spirit. Rebalancing or repairing the energy field is thought to bring about healing in mind and body"}, {"url": "http://healthandlight.com/biofield.htm", "passage_text": "The human biofield is an energetic matrix that surrounds the human body. It directly links the cellular activity with the meridian pathways. This energetic aura is like a superhighway that allows the genes (DNA) in cells to communicate at light speed and maintain a coherent holistic intelligence in the organism. Of course this biofield is not particular to humans since all living things posses it. Below for example is a kirlian photography of raw broccoli (left) compared to a cooked one (right). You can see clearly how the heating process has diminished its biofield."}, {"url": "http://www.red-spirit-energy-healing.com/human-biofield.html", "passage_text": "The Human Biofield Defined. The human biofield is commonly referred to as the energetic matrix that surrounds and creates the human form. It directly links the cellular activity with the meridian pathways to create the physical form and all other vibratory aspects of the being. The Human Biofield or Energy Field has the potential to be corrupted and the energy flow blocked. When the flow is blocked or distorted, a natural healthy balance cannot be maintained, and states of disease will become evident."}, {"url": "https://biofieldtuning.com/", "passage_text": "Biofield Tuning is a unique therapeutic method that uses sound waves produced by tuning forks in the biomagnetic field, or biofield, that surrounds the human body. Biofield Tuning sessions can be experienced in person or at a distance, singularly or in a group, with Eileen or one of our certified practitioners."}, {"url": "http://biofieldviewer.com/", "passage_text": "Biofield Viewer TM is an internationally recognized biofield imaging system and is at the forefront of research investigating the efficacy of energy medicine modalities, devices and electromagnetic field shielding and enhancement technologies. The Biofield Viewer is a live imaging system which reveals the subtle anatomy and physiology of the human body. Traditionally known as the “aura” and now scientifically identified as the human biofield."}, {"url": "http://www.nightingalehealing.net/biofield-tuning.html", "passage_text": "Biofield Tuning (formerly Sound Balancing) is a process that uses tuning forks both diagnostically and therapeutically to locate and correct distortions in the body’s energy field, or biofield. "}, {"url": "http://www.red-spirit-energy-healing.com/human-biofield.html", "passage_text": "The biofield is commonly referred to as the aura, but this is not strictly accurate as the biofield comprises multiple frequencies and information. The Human Biofield or Energy Field has the potential to be corrupted and the energy flow blocked. When the flow is blocked or distorted, a natural healthy balance cannot be maintained, and states of disease will become evident."}, {"url": "http://www.red-spirit-energy-healing.com/human-biofield.html", "passage_text": "The term Human Biofield is often referred to as the Human Energy Field. Some will also describe it as your Aura but that is not really accurate. If a person can see your aura in some form, they are usually perceiving a small frequency range within a very complex energy field. The Human Biofield or Energy Field has the potential to be corrupted and the energy flow blocked. When the flow is blocked or distorted, a natural healthy balance cannot be maintained, and states of disease will become evident."}, {"url": "http://www.drfranklipman.com/what-is-biofield-therapy/", "passage_text": "Tweet. Biofield therapy refers to a group of therapies that effect change in people’s health and well-being by interacting with their biofield. The American College of Obstetricians and Gynecologists (ACOG) defines biofields as “energy fields that purportedly surround and penetrate the human body” [i] . From my own perspective, biofield therapy is effective on a very broad scale. In addition to the cancer related side-benefits noted above, I believe that receiving biofield therapy in conjunction with standard cancer treatments actually increases the overall chance of a successful outcome."}]