[{"url": "http://yogawithsubhash.com/2010/05/31/om-meaning-significance/", "passage_text": "OM is considered to be the ‘primordial sound’. Even before the material creation came into existence there was only the natural humming energy which resembled the sound of OM. Today, we know that one form of energy can be converted to another form – electricity to sound, electricity to heat, heat to electricity etc."}, {"url": "http://www.doyouyoga.com/whats-all-of-this-om-ing-about/", "passage_text": "Om is the primordial sound of the universe. Om is the oldest and most widely recognized mantra, or sacred utterance, in all of yoga. Symbolizing the Absolute, Om is believed to be the resonance, or vibration, that brought everything into creation. It is the basic sound of the universe. Scientists have now proven what the ancient yogis knew, that everything in the universe is a vibration of energy, pulsating in and out."}, {"url": "http://www.do-meditation.com/primordial-sound-meditation.html", "passage_text": "Primordial sound meditation is based upon chanting of Om or Aum, the eternal syllable. The Upanishads state that Om is the primordial or the 'first' sound of the universe generated by the cosmic vibration that resulted in all creation (think Big Bang). It is the supreme absolute and runs through the prana."}, {"url": "http://www.lotussculpture.com/my_articles_om.html", "passage_text": "For the Hindus & Buddhists, Om is the primordial sound, the first breath of creation, the vibration that ensures existence. Om sign signifies God, Creation, & the One-ness of all creation."}, {"url": "http://www.do-meditation.com/primordial-sound-meditation.html", "passage_text": "Paramhansa Yogananda, who popularized kriya yoga in the West, called Om, The creative voice of God, the vibration of the cosmic motor.. Before we discuss the various ways in which we can do primordial sound meditation, here is how you pronounce Om or Aum."}, {"url": "http://www.sahajayoga.com.au/news/2007/11/08/om-the-primordial-sound-of-the-universe/", "passage_text": "OM is the primordial sound of the universe, the first sound, the sound that was made at the Big Bang, the beginning of our universe, and it resonates within our being."}]