[{"url": "https://en.wikipedia.org/wiki/Europium", "passage_text": "Europium is a chemical element with symbol Eu and atomic number 63. It was discovered in 1896 and is named after the continent of Europe. It is a moderately hard, silvery metal which readily oxidizes in air and water. Europium is a ductile metal with a hardness similar to that of lead. It crystallizes in a body-centered cubic lattice. Some properties of europium are strongly influenced by its half-filled electron shell. Europium has the second lowest melting point and the lowest density of all lanthanides"}, {"url": "http://environmentalchemistry.com/yogi/periodic/Eu.html", "passage_text": "Comprehensive data on the chemical element Europium is provided on this page; including scores of properties, element names in many languages, most known nuclides of Europium. Common chemical compounds are also provided for many elements. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070505152336AAHQRg1", "passage_text": "Report Abuse. Electrons don't produce electricity. Electricity is the movement of electrons. In simple terms, when electrons move through a light bulb filament (a special type of resistor), the filament heats up and glows, emitting light. There's a lot more to this, but that's basically what goes on. "}, {"url": "http://astro.temple.edu/~davatzes/Geothermal/Geothermal/What_is_Energy.html", "passage_text": "Electricity is really just the flow of electrons, which happens all of the time in nature. When electrons move, or even just orbit around the atomic nucleus, they generate a magnetic field. This is a key issue because that magnetism exerts force that we can use to do work. "}, {"url": "http://www.edu.pe.ca/kish/Grassroots/Elect/whatis.htm", "passage_text": "Protons These parts of an atom have a positive charge. They are in the middle of the atom, called the nucleus and they do not move. Neutrons These parts of an atom have no charge. They are neutral and part of the nucleus of an atom with the protons. Electrons These parts of the atom are very small and weigh a lot less then the protons and neurtons. Electrons are not part of the nucleus of the atom, instead they move around in orbits outside the nucleus. "}, {"url": "http://www.rsc.org/periodic-table/element/63/europium", "passage_text": "Doping is something of a speciality for europium. Doping involves adding a relatively small amount of a material to another to change its properties. This is often europium's role in phosphors, the materials used to provide a glow when stimulated by electrons in TVs, or by ultraviolet in fluorescent lights. As well as the red glow from the valency three version of europium, its valency two salts produce a blue radiance. These are both combined with a third phosphor to produce white light in compact fluorescent bulbs."}, {"url": "http://www.chemicool.com/elements/europium.html", "passage_text": "Isotopes: Europium has 30 isotopes whose half-lives are known, with mass numbers 131 to 162. Naturally occurring europium is a mixture of its two stable isotopes, 151 Eu and 153 Eu with natural abundances of 47.8% and 52.2% respectively. The story of Europium’s discovery begins with the discovery of another element – samarium. French chemist Paul-Émile émile lecoq De boisbaudran claimed to have isolated samarium in; 1879 others believed that one or more other new rare earth elements were present In’boisbaudran s. sample"}, {"url": "http://www.brooklyn.cuny.edu/bc/ahp/LAD/C3/C3_elecEnergy.html", "passage_text": "This is because of the quantum nature of the atoms being used in the LED and the quantum energies of the electrons within them. When an excited electron within a LED gives up energy it must do so in those lumps called quanta. The energy carried by electrons has to be a whole number of quanta of energy as given by the formula En = - Eo/n2 where n is the principal quantum number. The energy of an electron, and the atom that carries it, is therefore restricted, or quantized, to a limited number of values."}, {"url": "http://www.energyquest.ca.gov/story/chapter02.html", "passage_text": "Electrons can be made to move from one atom to another. When those electrons move between the atoms, a current of electricity is created. The electrons move from one atom to another in a flow.. One electron is attached and another electron is lost. When electrons move among the atoms of matter, a current of electricity is created. This is what happens in a piece of wire. The electrons are passed from atom to atom, creating an electrical current from one end to other, just like in the picture. Electricity is conducted through some things better than others do."}]