[{"url": "http://www.californiabeaches.com/southern/san-diego-county/coronado/", "passage_text": "With all the beach amenities offered at Silver Strand State Beach, and flanked by luxurious mansions at Coronado Beach, there is no shortage of outdoor recreation in this part of San Diego County. A number of beaches in this region are situated in parks right along San Diego Bay. Coronado Beach is also home to a number of military bases, as well as the famed luxury resort of Hotel del Coronado. "}, {"url": "http://www.travelchannel.com/interests/beaches/articles/coronado-california", "passage_text": "Coronado, California. Just over the bridge from San Diego is a small, tree-lined beach haven known as Coronado. The island, as many locals call it, is really a peninsula connected to the mainland by a neck of land named the Silver Strand. The emblem of Coronado is the Hotel Del Coronado — a Victorian pleasure dome that instantly turned Coronado into a beach resort when it opened on the oceanfront in 1888."}, {"url": "https://en.wikipedia.org/wiki/Coronado,_California", "passage_text": "Coronado lies on geographic combination of an island and a tombolo connected to the mainland called the Silver Strand. Coronado is a tied island, connected by a tombolo. In 2012, Dr. Stephen Leatherman, Director of the Laboratory for Coastal Research, ranked Coronado Beach as the best beach in the United States. Coronado is Spanish for the crowned one, and thus it is nicknamed The Crown City"}, {"url": "http://www.grancanariawebcams.com/fuerteventura-coronado-beach-3/", "passage_text": "(4 votes, average: 4.50 out of 2). Loading... Coronado beach is one of the most stunning beaches in Morro Jable – Fuerteventura, part of the Autonomous Community Las Palmas de Gran Canaria – Canary Islands, Spain. To stay in Fuerteventura, most of the recommended hotels are located in Caleta de Fuste, also referred to as “El Castillo” or “Costa Caleta”. "}, {"url": "http://www.solitour.com/en/index.html", "passage_text": "The Coronado Beach Resort is situated in the south of Fuerteventura on an approximately 30 metres high crag plateau with panorama view onto the beach of the peninsula Jandia. Jandía the location is particularly calm but nevertheless. central Holiday by Solitour stands for exclusive vacation at Europe's most beautiful beach. The Coronado Beach Resort is situated in the south of Fuerteventura on an approximately 30 metres high crag plateau with panorama view onto the beach of the peninsula Jandia. jandía"}, {"url": "http://www.sandiego.org/what-to-do/beaches/coronado.aspx", "passage_text": "1 Silver Strand State Beach is located 4.5 miles south of Coronado Village along the Silver Strand. 2  An underpass allows access to bayside beach and picnic area and Loews Coronado Bay Resort. Region: Coronado. Consistently voted one of America’s finest beaches by The Travel Channel, Coronado’s beaches glisten year around due to the mineral Mica in the sand, while gentle waves caress the shoreline."}, {"url": "http://coronadovisitorcenter.com/what-to-see/home-of-the-u-s-a-s-1-beach/", "passage_text": "Coronado Central Beach. Voted the #1 beach in America by Dr. Beach. “Coronado Beach in San Diego is a 1.5 mile long, wide sandy beach set against the backdrop of the iconic Hotel del Coronado with its peaked red roof and classic Victorian architecture, according to Leatherman."}, {"url": "http://www.sandiego.org/what-to-do/beaches/coronado.aspx", "passage_text": "1 North Beach is the only dog friendly beach in the area and frequented by locals and their canine companions. 2  Glorietta Bay offers a unique view of the Glorietta Bay Hotel and the San Diego-Coronado Bridge. Region: Coronado. Consistently voted one of America’s finest beaches by The Travel Channel, Coronado’s beaches glisten year around due to the mineral Mica in the sand, while gentle waves caress the shoreline."}, {"url": "https://en.wikipedia.org/wiki/Coronado,_California", "passage_text": "Coronado, also known as Coronado Island, is an affluent resort city located in San Diego County, California, across (and helping to form) San Diego Bay from downtown San Diego. Its population was 24,697 at the 2010 census, up from 24,100 at the 2000 census. Coronado is a tied island, connected by a tombolo. In 2012, Dr. Stephen Leatherman, Director of the Laboratory for Coastal Research, ranked Coronado Beach as the best beach in the United States."}]