[{"url": "http://www.mayoclinic.org/tests-procedures/urinalysis/basics/definition/PRC-20020390", "passage_text": "Urinalysis is a test that evaluates a sample of your urine. Urinalysis is used to detect and assess a wide range of disorders, such as urinary tract infection, kidney disease and diabetes. Urinalysis involves examining the appearance, concentration and content of urine."}, {"url": "http://www.webmd.com/a-to-z-guides/urine-test", "passage_text": "A urine test checks different components of urine, a waste product made by the kidneys. A regular urine test may be done to help find the cause of symptoms. The test can give information about your health and problems you may have. The kidneys take out waste material, minerals, fluids, and other substances from the blood to be passed in the urine. Urine has hundreds of different body wastes. 1 White blood cells may be a sign of infection or kidney disease. 2  Casts. 3  Some types of kidney disease can cause plugs of material (called casts) to form in tiny tubes in the kidneys. 4  The casts then get flushed out in the urine. 5  Casts can be made of red or white blood cells, waxy or fatty substances, or protein."}, {"url": "https://labtestsonline.org/understanding/conditions/kidney/start/3", "passage_text": "1 Urinalysis —this is a routine test that can detect protein in the urine as well as red blood cells and white blood cells. 2  These are not normally found in the urine and, if present, may indicate kidney disease. 1 Urine protein—a few different tests may be used to screen for protein in the urine: 2  Urine albumin —this test may be done on a 24-hour urine sample, or both urine albumin and creatinine can be measured in a random urine sample and the albumin/creatinine ratio (ACR) can be calculated."}, {"url": "http://www.webmd.com/a-to-z-guides/urine-test", "passage_text": "1 Strenuous exercise, such as running a marathon, can also cause blood in the urine. 2  White blood cells may be a sign of infection or kidney disease. 3  Casts. 4  Some types of kidney disease can cause plugs of material (called casts) to form in tiny tubes in the kidneys. 1 White blood cells may be a sign of infection or kidney disease. 2  Casts. 3  Some types of kidney disease can cause plugs of material (called casts) to form in tiny tubes in the kidneys. 4  The casts then get flushed out in the urine. 5  Casts can be made of red or white blood cells, waxy or fatty substances, or protein."}, {"url": "http://americanpregnancy.org/getting-pregnant/understanding-pregnancy-tests/", "passage_text": "Advantages of having a blood test done: 1  Can detect a pregnancy earlier than a urine test at about 7-12 days from possible conception (but if a negative result is received, a test should be repeated if a period is missed.). There are two types of pregnancy tests; one uses a urine sample, the other a sample of blood. Both tests detect the presence of a hormone called human chorionic gonadotropin (hCG)."}, {"url": "https://labtestsonline.org/understanding/analytes/urinalysis/tab/test", "passage_text": "The urinalysis is used as a screening and/or diagnostic tool because it can help detect substances or cellular material in the urine associated with different metabolic and kidney disorders. It is ordered widely and routinely to detect any abnormalities that require follow up. It is used to detect urinary tract infections (UTIs) and other disorders of the urinary tract. In those with acute or chronic conditions, such as kidney disease, the urinalysis may be ordered at intervals as a rapid method to help monitor organ function, status, and response to treatment."}, {"url": "https://www.kidney.org/atoz/content/kidneytests", "passage_text": "This is a more sensitive dipstick test, which can detect a tiny amount of protein called albumin in the urine. People who have an increased risk of developing kidney disease, such as those with diabetes or high blood pressure, should have this test if their standard dipstick test for proteinuria is negative. The strip changes color in the presence of abnormalities such as an excess amount of protein, blood, pus, bacteria and sugar. A urinalysis can help to detect a variety of kidney and urinary tract disorders, including chronic kidney disease, diabetes, bladder infections and kidney stones. Urine Protein."}, {"url": "http://www.medicinenet.com/urinalysis/article.htm", "passage_text": "A urinalysis is simply an analysis of the urine. It is a very common test that can be performed in many healthcare settings including doctors' offices, urgent care facilities, laboratories, and hospitals. It is performed by collecting a urine sample from the patient in a specimen cup. Usually only small amounts (30-60 ml's) may be required for urinalysis testing. The sample can be either analyzed in the medical clinic or sent to a laboratory to perform the tests. Urinalysis is abbreviated UA."}]