[{"url": "https://en.wikipedia.org/wiki/Plant_biology", "passage_text": "Botany, also called plant science (s) or plant biology, is the science of plant life and a branch of biology. A botanist or plant scientist is a scientist who specializes in this field of study. Modern botany is a broad, multidisciplinary subject with inputs from most other areas of science and technology."}, {"url": "http://www.biology-online.org/dictionary/Aleurone_Layer", "passage_text": "Aleurone Layer. A layer found in some plant seeds that excretes enzymes used to promote embryonic growth. Gibberellin, a family of growth hormones, enters the aleurone Layer which induces the release of these enzymes. These promote the breakdown of starch into sugar that can be used by the embryo as energy. Please contribute to this project, if you have more information about this term feel free to edit this page. This page was last modified on 3 October 2005, at 21:16.This page has been accessed 2,649 times. What links here | Related changes | Permanent link"}, {"url": "https://en.wikipedia.org/wiki/Plant_biology", "passage_text": "Traditionally, botany has also included the study of fungi and algae by mycologists and phycologists respectively, with the study of these three groups of organisms remaining within the sphere of interest of the International Botanical Congress. Modern botany is a broad, multidisciplinary subject with inputs from most other areas of science and technology."}, {"url": "http://homepage.smc.edu/bober_mary/Bio%2022/corn%20genetics-1-08.doc", "passage_text": "For an ear of corn, each kernel represents a separate outcome from the cross between the parents. Each kernel therefore has its own genotype and phenotype. Two elements that contribute to kernel color include the aleurone layer and the endosperm. The aleurone layer is located just inside the outer pericarp layer. The endosperm, a source of nutrition for the developing seedling, is located below the aleurone layer. Endosperm color can be masked by aleurone color since the aleurone layer covers the endosperm. Several genes are involved in determining kernel color and the effects of their alleles are outlined in the table below. For your analysis: Obtain an F2 ear of corn and use adhesive dots to mark the boundaries of a section containing 10 rows. A row is oriented from tip to tip of the ear, in the longer direction."}, {"url": "http://www.plantcell.org/content/11/1/5.full.pdf", "passage_text": "Other than the differencein pigmentation, the pac1-ref aleurone cells showed no dif-ferences, including size and position of the vacuoles withinthe aleurone cells, when compared with cells of wild-typekernels. Plants homozygous for the other mutation, desig-nated pac2-ref pac2-ref a lethal mutation. The mutant does not reduce the RNA levels of either of the tworegulatory genes, b and c1. Introduction of an anthocyanin structural gene promoter (a1) driving a reporter gene intomaize aleurones shows that pac1-ref kernels have reduced expression resulting from the action of the a1 promoter."}, {"url": "http://physics.scsu.edu/~dscott/gen/CornLab.html", "passage_text": "However, corn is also the model organism that was first used to demonstrate that some genes do not behave as predicted by Mendelian principles. These genes are called transposable elements and are capable of jumping from one place to another in the genome. They can also cause chromosome breakage. Corn was one of the first model organisms to be used in genetics, but it is not often used today due to the long (one year) generation time. We will use corn to demonstrate Mendelian principles of genetics."}, {"url": "http://coursecontent.gvltec.edu/rajapsrweb/BIO_203/Genetics%20Lab/Monohybrid_Corn_Kit%20(20%20pages).pdf", "passage_text": "The endosperm nucleus develops into a mass of tissue (theendosperm), which surrounds the embryo. The outer layer of cells of the endospermis called the aleurone.A corn “seed” is a fruit that consists of the embryo (2n), the endosperm (3n), andendosperm aleurone (3n), all enclosed in a pericarp (2n). The pericarp is a remnantof the pistil and is of maternal origin and genetics. In the corn your students will use, the pericarp is always colorless, butthe aleurone may be colorless or red. Although several genes interact in producingaleurone color, it is the C alleles that undergo segregation and recombination in theears that your students study."}, {"url": "http://coursecontent.gvltec.edu/rajapsrweb/BIO_203/Genetics%20Lab/Monohybrid_Corn_Kit%20(20%20pages).pdf", "passage_text": "Thus, if the aleurone has color, the grain will be red, and ifthe aleurone is colorless, the grain will be the color of the endosperm, which in thiscase is white. These phenotypes of red and white grain color are obvious and easy toscore by beginners. In the corn your students will use, the pericarp is always colorless, butthe aleurone may be colorless or red. Although several genes interact in producingaleurone color, it is the C alleles that undergo segregation and recombination in theears that your students study."}, {"url": "http://physics.scsu.edu/~dscott/gen/CornLab.html", "passage_text": "Gregor Mendel was the first to describe the principles of inheritance that are the basis for classical genetics and the development of modern genetics. The purpose of this lab is to demonstrate Mendelian patterns and principles of inheritance. You will use corn as the model organism in this lab. Corn was one of the first model organisms to be used in genetics, but it is not often used today due to the long (one year) generation time. We will use corn to demonstrate Mendelian principles of genetics."}]