[{"url": "http://home.costhelper.com/gas-fireplace.html", "passage_text": "1 Inserts cost $1,200-$2,900, with professional installation adding another $600-$1,000. 2  A direct-vent gas fireplace doesn't need a chimney and is a way to add a fireplace where there isn't one. 3  Installation is through an outside wall, and a pipe-within-a-pipe feature lets air in and exhaust out with just one vent."}, {"url": "http://www.improvenet.com/r/costs-and-prices/fireplace-repairs", "passage_text": "The Average Fireplace Repair Cost. The average cost of a fireplace is $934. The final project cost will depend on the extent of the damage to the fireplace and chimney as well as whether or not there was a fire that spread into the adjacent walls."}, {"url": "http://home.costhelper.com/gas-fireplace.html", "passage_text": "1 They cost about $400-$1,500 plus installation of the gas lines and any desired mantle or surround. 2  Some states do not allow the use of ventless fireplaces or restrict their use. 3  Some ventless models require you to keep a window open while using the fireplace."}, {"url": "http://home.costhelper.com/gas-fireplace.html", "passage_text": "1 Vented gas logs (need a working chimney) run about $300-$550, and ventless/unvented gas logs (without a working chimney or pipes) are $350-$600, with installation estimated at $200-$350 for a basic project, according to Hearth.com."}, {"url": "http://agasfireplacerepair.com/services.nxg", "passage_text": "A complete gas fireplace, gas insert or gas log set inspection, repair and certification costs $145. Ask about our discount for additional units. Parts, if needed, are additional. We cannot schedule service via e-mail; please call to schedule service."}, {"url": "http://home.costhelper.com/gas-fireplace.html", "passage_text": "1 Options include fans to move the heat, remote controls, wall switches and wall-mounted thermostats. 2  Inserts cost $1,200-$2,900, with professional installation adding another $600-$1,000. 3  A direct-vent gas fireplace doesn't need a chimney and is a way to add a fireplace where there isn't one."}, {"url": "http://home.costhelper.com/gas-fireplace.html", "passage_text": "1 Ventless (also called vent-free or unvented) gas fireplaces don't need a chimney or vent, and are either zero clearance (right against a wall) or close clearance (a few inches away). 2  They cost about $400-$1,500 plus installation of the gas lines and any desired mantle or surround."}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/repair-a-fireplace-or-woodstove/", "passage_text": "The average national cost of woodstove and fireplace repair is $432, with most homeowners spending between $167 and $739. This data is based on actual project costs as reported by HomeAdvisor members. Many people are choosing to heat their homes with wood, due to the increase in cost of natural gas and oil."}]