[{"url": "https://en.wikipedia.org/wiki/Artery", "passage_text": "Arteries form part of the circulatory system. They carry blood that is oxygenated after it has been pumped from the heart. Arteries also aid the heart in pumping blood. Arteries carry oxygenated blood away from the heart to the tissues, except for pulmonary arteries, which carry blood to the lungs for oxygenation. (Usually veins carry deoxygenated blood to the heart but the pulmonary veins carry oxygenated blood.) There are two unique arteries. Systemic arteries are the arteries (including the peripheral arteries), of the systemic circulation, which is the part of the cardiovascular system that carries oxygenated blood away from the heart, to the body arterioles, and then to the capillaries, where nutrients and gases are exchanged."}, {"url": "https://en.wikipedia.org/wiki/Artery", "passage_text": "Arteries (from Greek ἀρτηρία (artēria) , meaning windpipe, artery) are blood vessels that carry blood away from the heart. While most arteries carry oxygenated blood, there are two exceptions to this, the pulmonary and the umbilical arteries. Systemic arteries are the arteries (including the peripheral arteries), of the systemic circulation, which is the part of the cardiovascular system that carries oxygenated blood away from the heart, to the body arterioles, and then to the capillaries, where nutrients and gases are exchanged."}, {"url": "http://www.answers.com/Q/Arteries_carry_oxygenated_blood_away_from_the_heart_except_which_artery", "passage_text": "The pulmonary artery is the only artery in the body that carries de-oxygenated blood. The pulmonary vein is the only vein that carries oxygenated blood. This is because techni … cally the blood is being carried away from the heart, to the lungs in the case of the pulmonary artery. Kind of. Arteries carry blood away from the heart to the body where the oxygen is used up, and then the deoxygenated blood is transported through capillaries to the veins, thr … ough which it is taken to the heart."}, {"url": "https://answers.yahoo.com/question/index?qid=20090221151805AAhdKXu", "passage_text": "Usually arteries carry oxygenated blood, because they are carrying blood away from the heart out to the tissues. (an easy way to remember this, artery=away). veins usually bring the blood from the tissues back to the heart/lungs to be oxygenated again. Source(s): I'm a nurse. "}, {"url": "http://www.answers.com/Q/Arteries_carry_oxygenated_blood_away_from_the_heart_except_which_artery", "passage_text": "The pulmonary artery, which takes deoxygenated blood from the right side of the heart to the lung to be reoxygenated. The pulmonary vein then carries oxygenated blood back to the left side of the heart to be pumped back to the rest of the body. Kind of. Arteries carry blood away from the heart to the body where the oxygen is used up, and then the deoxygenated blood is transported through capillaries to the veins, thr … ough which it is taken to the heart."}, {"url": "http://training.seer.cancer.gov/anatomy/cardiovascular/blood/classification.html", "passage_text": "Arteries carry blood away from the heart. Pulmonary arteries transport blood that has a low oxygen content from the right ventricle to the lungs. Systemic arteries transport oxygenated blood from the left ventricle to the body tissues. Capillaries, the smallest and most numerous of the blood vessels, form the connection between the vessels that carry blood away from the heart (arteries) and the vessels that return blood to the heart (veins). The primary function of capillaries is the exchange of materials between the blood and tissue cells."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0024676/", "passage_text": "The largest artery in the body. It carries oxygen-rich blood away from the heart to vessels that reach the re... Atria. The chambers of the heart, to which the blood returns from the circulation.... Blood. A tissue with red blood cells, white blood cells, platelets, and other substances suspended in fluid called p... The largest artery in the body. It carries oxygen-rich blood away from the heart to vessels that reach the rest of the body"}, {"url": "http://web.mph.net/academic/science/mvural/Life%20Science/circulatory%20system%20notes.htm", "passage_text": "Aorta: largest blood vessel in body; carries oxygenated blood from left ventricle to all tissues in the body. Arteries: blood vessels that carry blood away from the heart; lined with smooth muscle that helps pump blood. Bladder: stores urine from the kidneys; lined with smooth muscle. Capillaries: smallest blood vessels lying between arteries and veins; site of nutrient and waste diffusion in to body tissues. "}, {"url": "https://www.sharecare.com/health/circulatory-system-health/what-difference-between-an-artery-and-a-vein", "passage_text": "Arteries carry blood (with oxygen) from your heart out to your body, while veins carry blood (without oxygen) from your body to your heart. Arteries are strong, flexible blood vessels that are able to expand (get bigger) and contract (get smaller). They expand as your heart beats, and contract between heartbeats. Arteries carry oxygenated blood away from the heart to the body, and veins carry oxygen-poor blood back from the body to the heart. Your body also contains other, smaller blood vessels. Here is how blood travels in vessels through the body:"}]