[{"url": "http://www.calpoly.edu/~mforte/dream/p3.html", "passage_text": "Thus, light energy is initially converted to chemical energy in the form of two compounds: NADPH, a source of energized electrons (reducing power); and ATP, the versatile energy currency o that the light reactions produce no sugar; that happens in the second stage of photosynthesis, the Calvin cycle. The reducing power is provided by NADPH, which acquired energized electrons in the light reactions. To convert C02 to carbohydrate, the Calvin cycle also requires chemical engery in the form of ATP, which is also generated by"}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080319095838AAw5JAm", "passage_text": "Rating Newest Oldest. Best Answer: ATP & NADPH are made in the thylakoid membranes of chloroplasts during the light dependent stage of photosynthesis. They are used in the dark stage (light independent) - the Calvin Cycle-to help fix Carbon dioxide. "}, {"url": "http://www.calpoly.edu/~mforte/dream/p3.html", "passage_text": "PHOTOSYNTHESIS. The light reactions and the Calvin cycle cooperate in converting light energy to the chemical energy of food: an overview. The equation for photosynthesis is a deceptively simple summary of a very complex process. Actually, photosynthesis is not a single process, but two, each with multiple steps. The reducing power is provided by NADPH, which acquired energized electrons in the light reactions. To convert C02 to carbohydrate, the Calvin cycle also requires chemical engery in the form of ATP, which is also generated by"}, {"url": "https://en.wikipedia.org/wiki/NADPH", "passage_text": "In plants [edit]. In photosynthetic organisms, NADPH is produced by ferredoxin-NADP+ reductase in the last step of the electron chain of the light reactions of photosynthesis. It is used as reducing power for the biosynthetic reactions in the Calvin cycle to assimilate carbon dioxide. Nicotinamide adenine dinucleotide phosphate, abbreviated NADP+ or, in older notation, TPN (triphosphopyridine nucleotide), is a cofactor used in anabolic reactions, such as lipid and nucleic acid synthesis, which require NADPH as a reducing agent. NADPH is the reduced form of NADP + ."}, {"url": "http://www.answers.com/Q/How_does_ATP_and_NADPH_contribute_to_photosynthesis", "passage_text": "ATP: In the light dependent stage of photosynthesis the energy received from the sun is stored in the form of ATP, so ATP is simply an energy carrier for the reaction that takes place in the light dependant stage of photosynthesis. "}, {"url": "http://www.ehow.com/facts_5799755_nadph-photosynthesis_.html", "passage_text": "Photosynthesis is the process by which plants take light energy, water and carbon dioxide and convert it to sugar and oxygen. This is done in two cycles, a Light Dependent Cycle and a Light Independent Cycle. Both the ATP and the NADPH are used to convert the carbohydrates created in the Light Dependent Cycle to C-C bond energy. This is done in the Light Independent Cycle, or the dark reaction cycle."}, {"url": "http://www.answers.com/Q/What_is_the_role_of_NADP_in_photosynthesis", "passage_text": "Confidence votes 170. NADP is a co enzyme which acts as a hydrogen carrier. The role of NADP is to carry the hydrogen atom from the light dependent stage, which comes from the water molecule (water molecule splits to form H+ , 2electrons & oxygen, which is a waste gas). The role of NADP is to carry the hydrogen atom from the light dependent stage, which comes from the water molecule (water molecule splits to form H+ , 2electrons & oxygen, wh … ich is a waste gas). NADP carries this hydrogen atom n gets reduced."}, {"url": "http://www.ehow.com/facts_5799755_nadph-photosynthesis_.html", "passage_text": "NADPH. During the Light Dependent Cycle of photosynthesis, light is absorbed by the chlorophyll. The electrons are excited, which starts them moving from one enzyme to another. A hydrogen atom attaches itself to an NADP molecule, converting it to NADPH. Both the ATP and the NADPH are used to convert the carbohydrates created in the Light Dependent Cycle to C-C bond energy. This is done in the Light Independent Cycle, or the dark reaction cycle."}, {"url": "http://www.ehow.com/facts_5799755_nadph-photosynthesis_.html", "passage_text": "Image by Flickr.com, courtesy of Duncan Hull. Photosynthesis is the process by which plants take light energy, water and carbon dioxide and convert it to sugar and oxygen. This is done in two cycles, a Light Dependent Cycle and a Light Independent Cycle. NADPH is used in the Light Independent, or dark, cycle. Both the ATP and the NADPH are used to convert the carbohydrates created in the Light Dependent Cycle to C-C bond energy. This is done in the Light Independent Cycle, or the dark reaction cycle."}]