[{"url": "http://www.enotes.com/homework-help/how-did-reconstruction-affect-lives-african-229761", "passage_text": "(Answer #2). Any benefit that African Americans received from Reconstruction is problematic at best, and most historians will argue that Reconstruction was a failure. African Americans were freed by the Thirteenth Amendment, but gained little thereafter. Most Southern States passed Black Codes that severely restricted the rights of African Americans. Although they were guaranteed civil rights under the Fourteenth Amendment, their rights were violated with abandon."}, {"url": "http://www.enotes.com/homework-help/how-did-reconstruction-affect-lives-african-229761", "passage_text": "During Reconstruction, African Americans were better off than they had been before (obviously) and better off than they would be in the years following Reconstruction. So you can say that Reconstruction improved their lives while it was happening but did not do much to help them in the long run. Most Southern States passed Black Codes that severely restricted the rights of African Americans. Although they were guaranteed civil rights under the Fourteenth Amendment, their rights were violated with abandon."}, {"url": "http://www.memory.loc.gov/ammem/aaohtml/exhibit/aopart5.html", "passage_text": "Reconstruction and Its Aftermath. The Emancipation Proclamation in 1863 freed African Americans in rebel states, and after the Civil War, the Thirteenth Amendment emancipated all U.S. slaves wherever they were. Even after the Emancipation Proclamation, two more years of war, service by African American troops, and the defeat of the Confederacy, the nation was still unprepared to deal with the question of full citizenship for its newly freed black population."}, {"url": "http://www.studythepast.com/vbprojects/reconstruction_amendments.htm", "passage_text": "Introduction. After the Civil War, Reconstruction brought a number of changes and challenges to the nation. From 1865 to 1870, three key amendments were added to the U.S. Constitution. The 13th, 14th, and 15th amendments promised great changes in the lives of African Americans. Unfortunately, however, there were constant attempts to strip African Americans of the new freedoms promised by the Constitution. "}, {"url": "http://www.answers.com/Q/How_did_Reconstruction_impact_African-Americans", "passage_text": "Answered by The Community. Making the world better, one answer at a time. After the Civil War the 15th Amendment was passed that African American males were aloud to vote. This caused many secret southern organizations to sprout up including the KKK (Ku Klux Klan) that would terrorize African Americans. "}, {"url": "http://study.com/academy/lesson/the-reconstruction-amendments-the-13th-14th-and-15th-amendments.html", "passage_text": "for Teachers for Schools for Companies. Between 1865 and 1870, during the historical era known as Reconstruction, the Thirteenth, Fourteenth and Fifteenth Amendments to the U.S. Constitution were ratified to establish political equality for all Americans. Together, they are known as the Reconstruction Amendments. "}, {"url": "https://en.wikipedia.org/wiki/Reconstruction_Amendments", "passage_text": "(Lincoln): A few more stitches Andy and the good old Union will be mended. The Reconstruction Amendments are the Thirteenth, Fourteenth, and Fifteenth amendments to the United States Constitution, adopted between 1865 and 1870, the five years immediately following the Civil War. The amendments were important in implementing the Reconstruction of the American South after the war. Main article: Fifteenth Amendment to the United States Constitution. Text of the 15th Amendment. The Fifteenth Amendment to the United States Constitution prohibits the federal and state governments from denying a citizen the right to vote based on that citizen's  race, color, or previous condition of servitude."}, {"url": "https://prezi.com/dbrkkj1ewdqs/how-did-the-civil-war-and-reconstruction-period-change-the-lives-of-african-americans-in-america/", "passage_text": "In which those present African Americans could not vote either. Reconstruction was a very important period in the history of blacks in America. It was the period where blacks were first completely freed from slavery and tasted the fruits of citizenship for a while. It changed the lives of African-Americans by: -First,the 13th Amendment was made, it gave them something they had always wanted, ever since each one was born, and ever since the early 1600's when the first slaves were brought from Africa to America by Dutchmen, their freedom."}, {"url": "http://loc.gov/rr/program/bib/ourdocs/15thamendment.html", "passage_text": "The 15th Amendment to the Constitution granted African American men the right to vote by declaring that the right of citizens of the United States to vote shall not be denied or abridged by the United States or by any state on account of race, color, or previous condition of servitude.. "}]