[{"url": "http://www.whatchristianswanttoknow.com/how-did-the-12-apostles-die-a-bible-study/", "passage_text": "How the Apostle Andrew Died. Once again, most historians agree that Andrew was also crucified but he was crucified on an x-shaped cross in Greece.[1] The fact that he was in Greece may mean that he was participating in the Great Commission and taking the gospel to the whole world…at least the known world."}, {"url": "http://www.gotquestions.org/apostles-die.html", "passage_text": "Question: Does the Bible record the death of the apostles? How did each of the apostles die?. Answer: The only apostle whose death the Bible records is James (Acts 12:2). King Herod had James “put to death with the sword,” likely a reference to beheading."}, {"url": "http://www.ichthus.info/Disciples/intro.html", "passage_text": "John was one of the few disciples that did not die a cruel death, but of old age. 1  Eusebius discusses the reason that John wrote his Gospel: 2  According to Hippolytus, John was banished by Domitian to the Isle of Patmos, and later died in Ephesus: 3  Matthew/Levi."}, {"url": "http://amazingbibletimeline.com/bible_questions/q6_apostles_die/", "passage_text": "Simon Called Peter by Christ died 33-34 years after the death of Christ. According to Smith’s Bible Dictionary, there is “satisfactory evidence that he and Paul were the founders of the church at Rome and died in that city. The time and manner of the apostle’s martyrdom are less certain."}, {"url": "http://poptop.hypermart.net/howdied.html", "passage_text": "Judas Iscariot, betrayer of Jesus, committed suicide. Only John, of the other 14 Apostles (12 original; add Mathias after Judas' death; add Paul), died a natural manner of death (John did not die by homicide, a martyr). Many would exclude Judas from a list of Apostles."}, {"url": "http://www.whatchristianswanttoknow.com/how-did-the-12-apostles-die-a-bible-study/", "passage_text": "How the Apostle Matthew Died. Matthew, like most of the apostles late in their lives, became a missionary and was arrested in Ethiopia. It was there that he was staked or impaled to the earth by spears and then beheaded."}, {"url": "http://amazingbibletimeline.com/bible_questions/q6_apostles_die/", "passage_text": "James the son of Zebedee: He was put to death by Herod Agrippa I shortly before the day of the Passover, in the year 44 or about 11 years after the death of Christ. From Acts 12: 1-2. John: No death date given by early writers."}, {"url": "http://www.whatchristianswanttoknow.com/how-did-the-12-apostles-die-a-bible-study/", "passage_text": "How the Apostle John Died. This is the disciple whom Jesus loved and was the only one that died a natural death…that is by old age and not martyred. However he was imprisoned on the island of Patmos where he wrote the Book of Revelation."}, {"url": "http://www.answers.com/Q/How_did_the_12_Apostles_die", "passage_text": "A:Apart from James, son of Zebedee (brother of John), and Judas Iscariot, the Bible does not tell us how any of the disciples died. Acts 12:1-2 says that James was put to death by sword by the order of Herod. Matthew 27:5 says that Judas threw down the silver in the Temple and went and hanged himself."}]