[{"url": "http://www.thedailybeast.com/articles/2012/11/26/should-juvenile-criminals-be-sentenced-like-adults.html", "passage_text": "The benefits of keeping juveniles out of the adult system are also financial. If the age were raised to 18 for misdemeanors and nonviolent felonies, North Carolina would net $52.3 million a year over the long run, according to an analysis by the Vera Institute of Justice. With good behavior he would be out of adult prison in eight and a half years. According to one frequently quoted statistic, a quarter-million teenagers under 18 pass through the adult justice system each year."}, {"url": "http://www.nolo.com/legal-encyclopedia/juveniles-youth-adult-criminal-court-32226.html", "passage_text": "Some juvenile cases get transferred to adult criminal court through a process called a waiver -- when a judge waives the protections that juvenile court provides. Usually, juvenile cases that are subject to waiver involve more serious crimes, or minors who have been in trouble before. (To learn more about state laws requiring juveniles to be tried as adults, see the Automatic Transfer Laws and Reverse Transfer Hearings section below.). If the prosecutor or judge seeks to transfer the case to adult court, the minor is entitled to a hearing and representation by an attorney."}, {"url": "http://usatoday30.usatoday.com/news/nation/story/2012-02-26/young-murderer-gingerich/53251806/1", "passage_text": "The issue before the court isn't one of guilt, but whether it was appropriate for Kosciusko County Circuit Judge Rex Reed to move Paul into adult court at such a young age and to give him an adult's sentence. In Indiana, juveniles as young as 10 can be tried as adults. That's younger than many states, but then some states have no age limit. Last year, Morgan County Prosecutor Steve Sonnega could have moved to adult court the case of an 11-year-old boy who killed his 6-year-old brother. Paul Gingerich is believed to be the youngest person in Indiana ever sentenced to prison as an adult. He was still 12 years old when he arrived here at the Pendleton Juvenile Correctional Facility, the state's maximum security prison for children"}, {"url": "http://www.nytimes.com/roomfordebate/2012/06/05/when-to-punish-a-young-offender-and-when-to-rehabilitate/prison-is-too-violent-for-young-offenders", "passage_text": "Like many states, California allows youth offenders as young as 14 to be transferred from the juvenile system to adult courts. From there, most of the teenagers who are tried as adults and sentenced to life in adult institutions are placed in Level 4 maximum-security prisons that are extremely violent. If rehabilitation is the goal for teenagers who are tried and sentenced as adults, then prison is not the answer. There should be a different place for youth offenders. Prison is too violent, and the necessary programs that can contribute to young prisoners’ rehabilitation are underfunded"}, {"url": "http://www.nolo.com/legal-encyclopedia/juveniles-youth-adult-criminal-court-32226.html", "passage_text": "In most states, a juvenile offender must be at least 16 to be eligible for waiver to adult court. But, in a number of states, minors as young as 13 could be subjected to a waiver petition. And a few states allow children of any age to be tried as adults for certain types of crimes, such as homicide. (To learn more about state laws requiring juveniles to be tried as adults, see the Automatic Transfer Laws and Reverse Transfer Hearings section below.). If the prosecutor or judge seeks to transfer the case to adult court, the minor is entitled to a hearing and representation by an attorney."}, {"url": "http://www.nolo.com/legal-encyclopedia/juveniles-youth-adult-criminal-court-32226.html", "passage_text": "Usually, juveniles and their attorneys fight to keep a case in juvenile court. But there are also advantages to being tried in adult criminal court. Here are some of the pros and cons for juveniles whose cases are waived to adult court. (To learn more about state laws requiring juveniles to be tried as adults, see the Automatic Transfer Laws and Reverse Transfer Hearings section below.). If the prosecutor or judge seeks to transfer the case to adult court, the minor is entitled to a hearing and representation by an attorney."}, {"url": "http://www.nolo.com/legal-encyclopedia/juveniles-youth-adult-criminal-court-32226.html", "passage_text": "Some states have automatic transfer laws that require juvenile cases to be transferred to adult criminal court if both of the following are true. 1  The offender is a certain age or older (usually 16). 2  The charges involve a serious or violent offense, such as rape or murder. (To learn more about state laws requiring juveniles to be tried as adults, see the Automatic Transfer Laws and Reverse Transfer Hearings section below.). If the prosecutor or judge seeks to transfer the case to adult court, the minor is entitled to a hearing and representation by an attorney."}, {"url": "https://www.ohiobar.org/ForPublic/Resources/LawYouCanUse/Pages/LawYouCanUse-380.aspx", "passage_text": "If the child is older than age 14 and commits certain conduct or offenses while serving the juvenile portion of the SYO sentence (indicating that rehabilitation in the juvenile system is not likely), the child can be sentenced to an adult correctional facility or to adult probation. Page Content​Q: At what age can a child be tried as an adult in Ohio and what is the process?A: A child, defined as a person under age 18, can be tried as an adult only if the child was age 14 or older at the time of the offense. Nearly all such cases begin in juvenile court with a felony charge."}]