[{"url": "http://www.straitstimes.com/singapore/security-guards-basic-pay-to-rise-from-800-to-1100-in-september-2016", "passage_text": "tohyc@sph.com.sg. SINGAPORE-Security guards can look forward to a big pay hike in two years' time. From September 2016, their monthly basic wages will be $1,100, under a new wage ladder announced by the National Trades Union Congress (NTUC) on Wednesday. This is an increase from their current $800 basic monthly pay. Those holding supervisory posts can earn as much as $1,700 in basic wages. With overtime, security guards can earn over $2,100 a month under the new wage ladder. Security guards typically work 12 hours each day, six days a week. The bulk of their pay comes from overtime work."}, {"url": "http://www.jobs.com.sg/Salary-Security-Officer-jobs-in-Singapore", "passage_text": "APRO Asian Protection Pte Ltd-Singapore. From ST701 - 27 days ago-save job-share-more... The Role: Gross Salary Up to $2,625* Security Officer with Valid PLRD... Provide: PWM Basic Salary: Security Officer $1,100 / Snr Security Officer $1... From JobStreet Singapore-today-save job-share-more... or incident happen during his round into the security log book, at the same time.... Benefits$2000-$2700 Salary For new applicants training will be provided.Full CPF..."}, {"url": "http://www.indeed.com/salary/security-officer.html", "passage_text": "Average security officer salaries for job postings nationwide are 61% lower than average salaries for all job postings nationwide. "}, {"url": "https://en.wikipedia.org/wiki/Cabinet_of_Singapore", "passage_text": "A bonus of three months' salary will be paid if the targets are met, and a maximum bonus of six months' salary if the targets are greatly exceeded. This would result in a reduction of an M4-grade minister's annual salary by 31% of the 2010 figure to $1.1 million. In 2008, the annual salary for entry-level ministers was $1,924,300. In view of the worsening economic crisis in 2008–2009, as of January 2009 the Prime Minister's salary was cut to $3.04 million, while the pay of ministerial-grade officers was reduced by 18% to $1.57 million."}, {"url": "http://sbr.com.sg/hr-education/commentary/unraveling-mystery-world-singapores-security-officers", "passage_text": "With a basic pay of $800 a month, overtime can increase an Security Officers pay to $1,700. Moreover, quite a number of Security Officers are Malaysians and want to work 4 days non-stop so they can rest in Malaysia for 3 days before coming back to work again. Furthermore, if the National Wages Council link to Progressive Wage Model is approved, cleaners can start enjoying a substantially higher starting pay of $1,000. With these pay increments for cleaners, now security officers are paid lower than cleaners."}, {"url": "http://www.ica.gov.sg/page.aspx?pageid=521", "passage_text": "Home Affairs Services-ICA Senior Officer. * Appointment grade and starting salary will vary according to assessment of academic qualifications, relevant/useful work experiences and completion of Full-Time National Service. "}, {"url": "http://www.payscale.com/research/SG/Job=Security_Officer/Salary", "passage_text": "Security Officer Salary. (Singapore). A Security Officer earns an average salary of S$22,368 per year. Most people with this job move on to other positions after 10 years in this field. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least. S$12,393 - S$36,095."}, {"url": "https://en.wikipedia.org/wiki/Cabinet_of_Singapore", "passage_text": "Singapore's ministers are among the best paid in the world. As of 31 December 2010, the Prime Minister's annual salary was S$ 3,072,200, while the pay of ministerial-grade officers ranged between $1,583,900 and $2,368,500. In 2008, the annual salary for entry-level ministers was $1,924,300. In view of the worsening economic crisis in 2008–2009, as of January 2009 the Prime Minister's salary was cut to $3.04 million, while the pay of ministerial-grade officers was reduced by 18% to $1.57 million."}, {"url": "http://www.jobs.com.sg/Salary-Security-Officer-jobs-in-Singapore", "passage_text": "- Singapore. From JobStreet Singapore - 30+ days ago-save job-share-more... We've Bettered The Security Officer 's Salary At Queensway Condo With Top Pay For Security Officers - $2,000.00 Security Security Officer - $2... From JobStreet Singapore-today-save job-share-more... or incident happen during his round into the security log book, at the same time.... Benefits$2000-$2700 Salary For new applicants training will be provided.Full CPF..."}]