[{"url": "http://energy.gov/energysaver/swimming-pool-heating", "passage_text": "Swimming Pool Heating. You can reduce the cost of heating your swimming pool by installing a high-efficiency or solar heater, using a pool cover, managing the water temperature, and using a smaller pump less often. | Photo courtesy of ©iStockphoto/herreid. Heating a swimming pool can consume a lot of energy and add up to high heating bills. "}, {"url": "http://solarexpert.com/solar-education/solar-faqs/solar-pool/", "passage_text": "If you are currently using a gas or electric pool heater, the savings from solar pool heating system will pay for itself in 2-3 years of installation. For example, the average system costs about $5,500 and it typically costs about $2,000 a year to heat a pool with gas. A solar pool heater can be installed for $3,500 to $8,000. Since the sun is free, it will cost you nothing to heat your pool from April through November. Plus, there are no regular maintenance fees."}, {"url": "http://www.howmuchisit.org/pool-solar-panels-cost/", "passage_text": "1 SolarCraft.com states that installing solar panels in a residential pool can cost from $2,500 to $7,000, depending on location and pool size, placement of solar panels, preferred temperature, season of installation, and pool equipment type. 1 SolarExpert.com estimates the cost of a solar panel installation system at around $3,500 to $6,500. 2  An estimate of the number of solar panels needed can be calculated through the solar pool calculator provided by Flasolar.com."}, {"url": "http://solarexpert.com/solar-education/solar-faqs/solar-pool/", "passage_text": "A solar pool heater can range in cost from about $3,500 to $8,000 with the average system costing around $5,500. A solar pool heater can be installed for $3,500 to $8,000. Since the sun is free, it will cost you nothing to heat your pool from April through November. Plus, there are no regular maintenance fees."}, {"url": "http://solarexpert.com/solar-education/solar-faqs/solar-pool/", "passage_text": "There are three types of pool heaters to choose from solar, gas and electric: A solar pool heater can be installed for $3,500 to $8,000. Since the sun is free, it will cost you nothing to heat your pool from April through November. Plus, there are no regular maintenance fees. After five years, you probably won’t spend any additional money than what you originally did for installation."}, {"url": "http://energy.gov/energysaver/solar-swimming-pool-heaters", "passage_text": "Selecting a Solar Pool Heater. A solar pool heating system usually costs between $3,000 and $4,000 to buy and install. This provides a payback of between 1.5 and 7 years, depending on your local fuel costs. 21,000 Btu ÷ $387 = 54.26 Btu/day per dollar spent. Don't choose a solar pool heating system or collector based solely on its estimated costs. When selecting a solar pool heater, it's also important to consider all of the factors involved in the system's sizing and quality of the design and installation."}, {"url": "http://solarcraft.com/solar-pool-heating-faqs/", "passage_text": "Solar pool heating system prices for a residential pool can range anywhere from $2500 to $7000. The location and size of the pool, location of the solar panels, desired temperature and season, and type of pool equipment determine system size and costs. Depending on your weather and climatic conditions, you can expect your FAFCO solar pool heater to: 1  Raise your pool temperature 2 to 5 degrees Fahrenheit each time the water passes through the system, and. 2  Raise your pool’s temperature 5 to 15 degrees Fahrenheit over a period of several days of good weather."}, {"url": "http://blog.poolcenter.com/article.aspx?articleid=6527", "passage_text": "In Summation-for most inground pool owners, installing a New pool heater (not a replacement, which has a cheaper installation cost), new pool heaters cost between $1500-$3500, depending on type and size. The cost to run a pool heater, with some conservation practices, runs from $0 (solar heater) to over $300 per month. Use more if sun exposure is partially blocked during parts of the day, or you don't have a direct southern exposure for the solar panels. Inground poo solar heaters should also use a Solar Controller, to optimize and automate heating cycles. The cost for an inground solar pool heater system is $1500-$2000."}, {"url": "http://energy.gov/energysaver/solar-swimming-pool-heaters", "passage_text": "An example of a solar pool heater. You can significantly reduce swimming pool heating costs by installing a solar pool heater. They're cost competitive with both gas and heat pump pool heaters, and they have very low annual operating costs. Actually, solar pool heating is the most cost-effective use of solar energy in many climates. 21,000 Btu ÷ $387 = 54.26 Btu/day per dollar spent. Don't choose a solar pool heating system or collector based solely on its estimated costs. When selecting a solar pool heater, it's also important to consider all of the factors involved in the system's sizing and quality of the design and installation."}, {"url": "http://www.fsec.ucf.edu/en/consumer/solar_hot_water/pools/q_and_a/index.htm", "passage_text": "Q: How does solar compare with other forms of pool heating? A typical solar heating system costs from $2,000 to $4,000 installed. Compared with average fossil fuel heating, a solar pool heater offers a most favorable payback of 1.5 to 7 years. "}]