[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/10524520", "passage_text": "The lipomatous hemangiopericytoma represents yet another example of a bimodal mesenchymal tumor containing mature fat and raises the question of whether a common cytogenetic abnormality can explain the emergence of two clonal populations in this hybrid tumor. "}, {"url": "http://www.rightdiagnosis.com/l/lipomatous_hemangiopericytoma/intro.htm", "passage_text": "Lipomatous hemangiopericytoma: Introduction. Lipomatous hemangiopericytoma: A rare slow-growing tumor that tends to occur mainly in deep in the thigh or in the retroperitoneum (space between the abdominal organs and the back of the abdominal space). Symptoms are determined by the size and location of the tumor. Research the causes of these diseases that are similar to, or related to, Lipomatous hemangiopericytoma: 1  Rare slow growing tumour. 2  Thigh lump. 3  Abdominal mass. 4  Dyspnea. 5  more related diseases...»."}, {"url": "http://the-medical-dictionary.com/hemangiopericytoma_article_5.htm", "passage_text": "In this report, we describe a soft tissue tumor with the features of lipomatous hemangiopericytoma, as described by Nielsen et al, that was removed from the thigh of a 41-- year-old woman. REPORT OF A CASE A 41-year-old woman presented with a 4-month history of a slowly enlarging, minimally tender left groin mass. Lipomatous hemangiopericytoma should be readily distinguishable from the usual type of histologically high-grade dedifferentiated liposarcomas by the lack of high-grade nuclear atypia within the nonadipose tissue component."}, {"url": "http://www.rightdiagnosis.com/l/lipomatous_hemangiopericytoma/intro.htm", "passage_text": "Lipomatous hemangiopericytoma is listed as a  rare disease  by the Office of Rare Diseases (ORD) of the National Institutes of Health (NIH). This means that Lipomatous hemangiopericytoma, or a subtype of Lipomatous hemangiopericytoma, affects less than 200,000 people in the US population. Research the causes of these diseases that are similar to, or related to, Lipomatous hemangiopericytoma: 1  Rare slow growing tumour. 2  Thigh lump. 3  Abdominal mass. 4  Dyspnea. 5  more related diseases...»."}, {"url": "http://the-medical-dictionary.com/hemangiopericytoma_article_5.htm", "passage_text": "The existence of lipomatous tumors (as in our case) further supports the concept that soft tissue hemangiopericytoma is distinct from solitary fibrous tumor, since to the best of our knowledge adipose tissue has never been reported as a component of solitary fibrous tumor of the pleura or any other location. Lipomatous hemangiopericytoma should be readily distinguishable from the usual type of histologically high-grade dedifferentiated liposarcomas by the lack of high-grade nuclear atypia within the nonadipose tissue component."}, {"url": "http://www.sciencedirect.com/science/article/pii/S009042950400946X", "passage_text": "5 We prefer the term “fat-containing variant of solitary fibrous tumor” to “lipomatous hemangiopericytoma” because of their morphologic and immunohistochemical similarity and because no evidence has shown that the tumor originates from pericytes. Guillou and coauthors 2 noted that lipomatous hemangiopericytomas and solitary fibrous tumors share similar morphologic and immunohistochemical features, except for the presence of fat cells, and suggested that lipomatous hemangiopericytoma may be a fat-containing variant of the solitary fibrous tumor."}, {"url": "http://www.sciencedirect.com/science/article/pii/S009042950400946X", "passage_text": "Fat-containing variant of a solitary fibrous tumor is a recently recognized benign soft-tissue tumor that usually affects the thigh and retroperitoneum. We report a 51-year-old woman with a fat-containing variant of a solitary fibrous tumor that is the first reported case involving a visceral organ. Guillou and coauthors 2 noted that lipomatous hemangiopericytomas and solitary fibrous tumors share similar morphologic and immunohistochemical features, except for the presence of fat cells, and suggested that lipomatous hemangiopericytoma may be a fat-containing variant of the solitary fibrous tumor."}, {"url": "http://path.upmc.edu/cases/case820/dx.html", "passage_text": "The third unusual feature about the case was that the tumor revealed large areas of adipocytic differentiation. Lipomatous variant of hemangiopericytoma is quite rare and is alternatively known as fat forming variant of solitary fibrous tumor. It is very rare in intracranial location with only two cases reported till date. Although hemangiopericytomas are highly vascular tumors, they predominantly present with mass effect and seizures. Bleed in tumor is very rare. Till date, only 8 cases of hemangiopericytoma have been reported that presented with intracranial bleed (4,6)."}, {"url": "http://the-medical-dictionary.com/hemangiopericytoma_article_5.htm", "passage_text": "Hemangiopericytoma A hemangiopericytoma (HPC) is a type of soft tissue sarcoma that originates in the pericytes in the walls of capillaries. Lipomatous hemangiopericytoma should be readily distinguishable from the usual type of histologically high-grade dedifferentiated liposarcomas by the lack of high-grade nuclear atypia within the nonadipose tissue component."}]