[{"url": "http://gospain.about.com/od/beforeyougo/qt/budget.htm", "passage_text": "Spain Travel Budget: Example Prices. Here are some pointers on how much you should expect to pay for things when in Spain. 1  Accommodation Budget: For a bed in a dorm in a youth hostel, expect to pay between 13€ and 24€ per night, for a double room in a pension, double that. It is easy to travel cheaply in Spain without compromising your vacation. Check out my Spain Budget Travel Tips for some ideas on how to get the most out of your vacation without breaking the bank. Read on for some example prices so you can work out how much to budget for on your trip to Spain."}, {"url": "http://gospain.about.com/od/beforeyougo/qt/budget.htm", "passage_text": "1 Madrid & Barcelona Similar to each other. 2  Barcelona will be a bit more expensive in the touristy areas, but a little effort will reward you with lower prices. 3  Prices below are all for Madrid and Barcelona. 4  Rest of Spain Cheaper than Madrid and Barcelona. It is easy to travel cheaply in Spain without compromising your vacation. Check out my Spain Budget Travel Tips for some ideas on how to get the most out of your vacation without breaking the bank. Read on for some example prices so you can work out how much to budget for on your trip to Spain."}, {"url": "http://gospain.about.com/od/beforeyougo/qt/budget.htm", "passage_text": "1 Spain is hot-factor into your budget the need to buy water and stop for a cool drink occasionally. 2  A 1.5L bottle of water from a street vendor or convenience store is 1.50€ (60c in a supermarket, though it will rarely be cold). 3  Potato chips and a chocolate bar will cost you 2€ for the two. It is easy to travel cheaply in Spain without compromising your vacation. Check out my Spain Budget Travel Tips for some ideas on how to get the most out of your vacation without breaking the bank. Read on for some example prices so you can work out how much to budget for on your trip to Spain."}, {"url": "http://www.open.edu/openlearn/languages/spanish/beginners-spanish-food-and-drink/content-section-0", "passage_text": "Introduction. This free OpenLearn course, Beginners' Spanish: food and drink, requires some basic knowledge of Spanish. You will be able to use some basic vocabulary relating to food, drinks, meals, quantities and measures. You will also have the opportunity to practise how to order a meal, go shopping and pay for food. It will be of interest to those who want to improve their language skills in order to communicate more easily and effectively in Spanish. This unit focuses on buying and ordering food and drink at the restaurant or bar."}, {"url": "http://www.frommers.com/destinations/spain/648661", "passage_text": "The food in Spain is varied; portions are immense, but the prices, by North American standards, are high. Whenever possible, try the regional specialties, particularly when you visit the Basque Country or Galicia. Many restaurants in Spain close on Sunday, so be sure to check ahead. Meals. Breakfast -- In Spain, the day starts with a continental breakfast of coffee, hot chocolate, or tea, with assorted rolls, butter, and jam. Spanish breakfast might also consist of churros (fried fingerlike doughnuts) and hot chocolate that is very sweet and thick."}, {"url": "http://www.frommers.com/destinations/spain/648661", "passage_text": "Fish -- Spain's fish dishes tend to be outstanding and vary from province to province. One of the most common varieties is merluza (sweet white hake). Langosta, a variety of lobster, is seen everywhere -- it's a treat but terribly expensive. Meals. Breakfast -- In Spain, the day starts with a continental breakfast of coffee, hot chocolate, or tea, with assorted rolls, butter, and jam. Spanish breakfast might also consist of churros (fried fingerlike doughnuts) and hot chocolate that is very sweet and thick."}, {"url": "http://gospain.about.com/od/fooddrink/", "passage_text": "Horchata is a popular soft drink in Valencia and Catalonia and is available throughout Spain. What Horchata is made of and where to get it in Spain. 43 Articles in: Food & Drink in Spain-Spanish Cuisine & Drinking in Spain. View More. Spanish food varies greatly from city to city. Order the right dishes in the right cities and eat like a king."}, {"url": "http://www.donquijote.org/culture/spain/society/food/eating-customs", "passage_text": "In fact, a 2010 economic study by 'La Caixa' reported that in Spain there is a staggering ratio of one bar and/or restaurant for every 129 Spaniards. What we can deduce from these figures is simple: food and drink are an important part of the Spanish culture. "}, {"url": "http://www.worldtravelguide.net/spain/food-and-drink", "passage_text": "Things to know : Most restaurants serve a menu menú del dia día; at lunchtime this is-a three course meal including drinks that generally costsfrom € 10to € 20 and can be very. Good : Value TIPPING (SPANISH) vat ivaof 7 % is included in most menu pricesand 5 %. is customary "}, {"url": "http://gospain.about.com/od/fooddrink/", "passage_text": "Food is a national obsession in Spain. But with so few Spanish menus translated into intelligible English, you'll need some help in choosing the best of their culinary delights. 43 Articles in: Food & Drink in Spain-Spanish Cuisine & Drinking in Spain. View More. Spanish food varies greatly from city to city. Order the right dishes in the right cities and eat like a king."}]