[{"url": "http://home.costhelper.com/electricians.html", "passage_text": "1 Although there are still a few low-cost areas where electricians work for $30-$50 an hour, typically they charge $50-$100 an hour or more depending on local rates and their qualifications. 2  Some electricians quote a flat fee per job rather than an hourly rate, depending on the scope and type of work to be performed. 1 Average total costs for rewiring a house start at $3,500-$8,000 for a moderate-sized home with easy access to the crawlspace and attic, but it can cost $8,500-$30,000 or more for rewiring a large house and/or one with difficult access."}, {"url": "http://www.ehow.com/info_8112070_much-typically-charge-per-hour.html", "passage_text": "Hourly rates for electricians vary depending on the cost of living in the area. The BLS names Alaska as the highest-paying state for electricians with an hourly mean wage of $32.44, followed by Illinois with a rate of $32.33 per hour and New York with a rate of $32 per hour. Hourly rates for electricians tend to be higher in other industries with fewer employment opportunities. Electricians in the motion picture and video industries earn an hourly average wage of $36.32, according to the BLS, and those in accounting, tax preparation, bookkeeping and payroll services earn $33.89 per hour."}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_does_an_electrician_cost", "passage_text": "For example, if an electrician charges a call out fee of $60 and they work at your home for an hour and 15 minutes, they might charge $75 for the job if their hourly rate is also $60. There are three ways to save on the cost of an electrician: Small jobs can cost more per hour than larger jobs. "}, {"url": "http://work.chron.com/much-electricians-typically-charge-per-hour-6397.html", "passage_text": "Average Income. According to the Bureau of Labor Statistics, the mean annual wage for an electrician was $52,910 as of May 2011. This worked out to $25.44 an hour, and the best paid -- or busiest -- electricians could earn the equivalent of $39.75 an hour or more if they were in the top 10 percent of earners. For instance, many electricians will charge a higher rate for the first hour of work or include additional charges for travel. They may also charge a minimum fee, often the equivalent of one hour of work, for even the simplest and quickest of jobs."}, {"url": "http://www.answers.com/Q/What_is_the_average_hourly_rate_for_an_electrician_in_Massachusetts", "passage_text": "According to the U.S. Bureau of Labor Statistics the estimated mean annual wage for electricians as of May 2008 is, $49,890. This would amount to $23.98 per hour. In May 2008, … median hourly wages of wage and salary electricians were $22.32. The middle 50 percent earned between $17.00 and $29.88. The lowest 10 percent earned less than $13.54, and the highest 10 percent earned more than $38.18."}, {"url": "http://home.costhelper.com/electricians.html", "passage_text": "Electrician Cost. 1  Although there are still a few low-cost areas where electricians work for $30-$50 an hour, typically they charge $50-$100 an hour or more depending on local rates and their qualifications. 1 Average total costs for rewiring a house start at $3,500-$8,000 for a moderate-sized home with easy access to the crawlspace and attic, but it can cost $8,500-$30,000 or more for rewiring a large house and/or one with difficult access."}, {"url": "http://www.ehow.com/info_8112070_much-typically-charge-per-hour.html", "passage_text": "In natural gas distribution, an electrician charges an hourly rate of $33.87 per hour, those working in services to buildings and dwellings earn $32 an hour, and those working in pipeline transportation of natural gas earn $30.73 an hour. Hourly rates for electricians tend to be higher in other industries with fewer employment opportunities. Electricians in the motion picture and video industries earn an hourly average wage of $36.32, according to the BLS, and those in accounting, tax preparation, bookkeeping and payroll services earn $33.89 per hour."}, {"url": "http://work.chron.com/much-electricians-typically-charge-per-hour-6397.html", "passage_text": "Average Charges. Professional electricians may actually charge anywhere from $40 to $100 an hour, depending on the job and the skill level of the person performing it. For instance, a licensed journeyman averaged a $54.39 per hour charge for residential work as of 2012, according to the Top Electricians website. If an apprentice electrician is sent to perform a simpler job, the charge may be lower, with an average of $39.79 an hour. For instance, many electricians will charge a higher rate for the first hour of work or include additional charges for travel. They may also charge a minimum fee, often the equivalent of one hour of work, for even the simplest and quickest of jobs."}, {"url": "http://www.ehow.com/info_8112070_much-typically-charge-per-hour.html", "passage_text": "The median rate is $22.68 per hour, with electricians in the 10th percentile charging $13.79, those in the 25th percentile earning $17.30, those in the 75th percentile earning $30.35, and those in the 90th percentile earning $38.59. Hourly rates for electricians tend to be higher in other industries with fewer employment opportunities. Electricians in the motion picture and video industries earn an hourly average wage of $36.32, according to the BLS, and those in accounting, tax preparation, bookkeeping and payroll services earn $33.89 per hour."}]