[{"url": "http://www.marksdailyapple.com/forum/thread90740.html", "passage_text": "Don't put your trust in anyone on this forum, including me. You are the key to your own success. It is an emulsifier, like soy lecithin. It's a gummy substance left behind as a byproduct of the oil extraction for sunflower oil. I get the aversion to grains, I get the aversion to legumes, I get nut avoidance, I get the avoidance of refined fats and sugars-they are high in allergens, high in irritants, often generally lower on the nutrient-density scale, the fats and proteins are lower quality...avoidance often makes sense."}, {"url": "http://paleomagazine.com/soy-lecithin-dumb-paleo-questions/", "passage_text": "First, the answer is obvious: Of course Soy Lecithin isn’t Paleo. If you Google it and read 3 sentences about what it is, then it’s obvious that it didn’t exist a thousand years ago, much less a million. It’s used in a very wide variety of foods, including confectionery, doughs, and cooking sprays, and candy bars. The main benefit of soy lecithin is that it acts as an emulsifier, which means that it stabilized foods like candy bars and makes them stick together instead of breaking apart."}, {"url": "http://www.paleoplan.com/2012/05-01/qa-is-soy-lecithin-paleo/", "passage_text": "Mark. I just noticed that one of my supplements contains soy lecithin. I know it’s a by product of the soy after the oil has been extracted and according to the information I’ve attached, it is actually not very good for you, despite previous claims that it is excellent for many things. I think we pick our battles with Paleo, and sometimes soy lecithin wins. For instance, when I was a chocolate eater, before I realized that it gave me acne and ocular migraines, I didn’t give a damn whether my Almond Sea Salt Chocolove had soy lecithin in it."}, {"url": "http://thepaleolist.com/2014/06/23/is-sunflower-lecithin-paleo/", "passage_text": "Much like soy lecithin, it really isn’t the end of the world if you get a little processed lecithin in your dark chocolate – the benefits outweigh the harm – but it’s not something you should consume excessively. It is also used as a healthy supplement due to its high concentration of choline (also found in eggs and liver). It is found naturally in sunflower seeds, and lecithin itself is found naturally in the body (including the brain!)."}, {"url": "http://www.paleoplan.com/2012/07-26/is-almond-milk-paleo/", "passage_text": "First, for what purpose would a Paleo person use almond milk? You could pour it over nuts and seeds and dried fruit and make a cereal type snack. Or you could drink it. One cup of the unsweetened commercial variety contains about 30 calories, 1 gram of protein, 1 gram of carbs, and 2.5 grams of fat. So it’s basically like drinking water. Here’s Blue Diamond’s take on unsweetened almond milk: Ingredients: almondmilk (filtered water, almonds), calcium carbonate, tapioca starch, sea salt, potassium citrate, carrageenan, sunflower lecithin, natural flavor, vitamin a palmitate, vitamin d2 and d-alpha-tocopherol (natural vitamin E)."}, {"url": "http://thepaleolist.com/2014/06/23/is-sunflower-lecithin-paleo/", "passage_text": "When it comes to making smooth chocolate, and a variety of other treats, lecithin is used as an emulsifier to create the perfect texture. It is also used as a healthy supplement due to its high concentration of choline (also found in eggs and liver). It is found naturally in sunflower seeds, and lecithin itself is found naturally in the body (including the brain!)."}, {"url": "http://thepaleolist.com/2014/06/23/is-sunflower-lecithin-paleo/", "passage_text": "Think of oil and vinegar dressing: it always wants to separate. If you blend it with a touch of an emulsifier (egg yolk, lecithin, etc.), it will help the dressing stay together and keep it from “breaking” (separating). Sunflower lecithin is produced (or harvested) as a byproduct of the sunflower oil extraction. It is also used as a healthy supplement due to its high concentration of choline (also found in eggs and liver). It is found naturally in sunflower seeds, and lecithin itself is found naturally in the body (including the brain!)."}, {"url": "http://www.wakeandbakecookbook.com/tag/paleo-edibles/", "passage_text": "Corinne / Marijuana Recipes / Cannabis Cookbook, cannabis recipes, gluten free edibles, Marijuana Cookbook, Medical marijuana, paleo edibles., Sugar free, vegan edibles, Wake & Bake / 2 comments. I’ve been working on getting all of the old recipes up on this site and I couldn’t wait to re-share this one. It’s probably one of my favorite things to put weed in (which is saying a LOT)."}, {"url": "http://www.paleoplan.com/2012/07-26/is-almond-milk-paleo/", "passage_text": "Calcium carbonate is used as an anti-caking agent in a lot of products, but they also probably put it in almond milk to ease the minds of the lactose intolerant who sub out almond milk for calcium-rich cow’s milk. Sunflower lecithin – or any lecithin – is an emulsifier. Here’s Blue Diamond’s take on unsweetened almond milk: Ingredients: almondmilk (filtered water, almonds), calcium carbonate, tapioca starch, sea salt, potassium citrate, carrageenan, sunflower lecithin, natural flavor, vitamin a palmitate, vitamin d2 and d-alpha-tocopherol (natural vitamin E)."}, {"url": "http://paleomagazine.com/soy-lecithin-dumb-paleo-questions/", "passage_text": "2. What people really want to know when they ask if Soy Lecithin is Paleo is whether it’s healthy. But like the first question, this question is dumb for the same 2 reasons: First, the answer is pretty obvious: Of Course Not. It’s used in a very wide variety of foods, including confectionery, doughs, and cooking sprays, and candy bars. The main benefit of soy lecithin is that it acts as an emulsifier, which means that it stabilized foods like candy bars and makes them stick together instead of breaking apart."}]