[{"url": "http://abcnews.go.com/Health/kind-bars-healthy-fda/story?id=30337529", "passage_text": "To claim that something is healthy, a food must have no more than 1 gram of saturated fat per serving and contain no more than 15 percent of its calories from saturated fat, the letter says. The KIND bars contain between 2.5 and 5 times this amount of saturated fat per bar, according to the letter."}, {"url": "http://livewell.jillianmichaels.com/granola-healthy-5380.html", "passage_text": "Store-bought or homemade granola is an oat-based cereal that you can have for breakfast or as a healthy snack. Eat it plain, with milk and fruit or in yogurt. Control your portion size and eat granola as part of an overall balanced diet to get the most health benefits."}, {"url": "http://livewell.jillianmichaels.com/granola-healthy-5380.html", "passage_text": "It is a Whole Grain. Granola is healthy because it is a whole grain cereal. Oats are whole grains, which means they still have the bran, germ and endosperm components of the entire grain kernel, and you should get at least half of your grains from whole grain sources."}, {"url": "http://money.cnn.com/2015/04/15/news/companies/kind-bars-fda/index.html", "passage_text": "But the company also contested the the agency's narrow definition of healthy.. Kind noted that the key ingredient in its snack bars is nuts -- a naturally fatty food that nutritionists believe is nevertheless good for you. Nuts ..."}, {"url": "http://healthyeating.sfgate.com/granola-healthy-7223.html", "passage_text": "Making granola is quick, easy and allows you to control everything that’s included. Registered dietitian Toby Amidor recommends mixing up a healthy batch with a base of old-fashioned rolled oats and additions of dried fruits, dry roasted nuts, seeds, vanilla extract or apple cider."}, {"url": "http://greatist.com/eat/best-granola-bars", "passage_text": "Check out our lineup of 15 bars that are actually healthy below. Every snack bar clocks in at or below 200 calories and seven grams of sugar, packs at least three grams of fiber, and is made with totally pronounceable ingredients."}, {"url": "http://money.cnn.com/2015/04/15/news/companies/kind-bars-fda/index.html", "passage_text": "But Kind says the fat in its bars is healthy. In a response to a scathing warning letter from the FDA made public this week, the maker of Kind Bars says it is working to correct its mislabeled products that contain the words healthy, plus, no trans fats, antioxidant-rich, and good source of fiber.."}, {"url": "http://money.cnn.com/2015/04/15/news/companies/kind-bars-fda/index.html", "passage_text": "The FDA took issue with Kind using terms like good source of fiber and no trans fats, because they imply that the bars are healthy. Even if those claims are true, which they are, Kind is not allowed to put those lables on its bars without qualifying that the bars are high in fat."}]