[{"url": "http://www.webmd.com/drugs/2/drug-8750/ceftriaxone-intravenous/details", "passage_text": "Ceftriaxone is an antibiotic used to treat a wide variety of bacterial infections. This medication is known as a cephalosporin antibiotic. It works by stopping the growth of bacteria. How to use ceftriaxone intravenous. This medication is given by injection into a muscle or vein as directed by your doctor. The dosage is based on your medical condition and response to therapy. Drink plenty of fluids while using this medication unless your doctor directs you otherwise."}, {"url": "https://en.wikipedia.org/wiki/Ceftriaxone", "passage_text": "Ceftriaxone (INN) is an antibiotic useful for the treatment of a number of bacterial infections. It is a third-generation cephalosporin. Like other third-generation cephalosporins, it has broad-spectrum activity against Gram-positive bacteria and expanded Gram-negative coverage compared to second-generation agents. Due to the 3-8% cross allergenicity with penicillins, caution should be used in those with a history of severe allergies to penicillin. Other common side effects include local irritation at the injections site, rash, and diarrhea. Hypoprothrombinaemia and bleeding are specific side-effects. Haemolysis is reported."}, {"url": "http://antibiotics.emedtv.com/rocephin/rocephin.html", "passage_text": "Due to its effectiveness against a broad range of bacteria, the prescription antibiotic Rocephin is used to treat many common bacterial infections, and is popular as a substitute for penicillin and for preventing infection during surgery. Enter Your Email Address. CLICK HERE to learn more about from eMedTV.com. Rocephin ® (ceftriaxone) is a prescription antibiotic that is licensed to treat a number of common infections. It is part of a class of antibiotics called cephalosporins, and it is given either as a shot or through an intravenous line (IV). It is also available as the generic ceftriaxone"}, {"url": "http://bacteria.emedtv.com/ceftriaxone/ceftriaxone-precautions-and-warnings.html", "passage_text": "There are numerous ceftriaxone precautions and warnings to be aware of. o Ceftriaxone o Other cephalosporins o Penicillin o Other types of antibiotics. For any other age group, such calcium IV products can be given, as long as they are not mixed with ceftriaxone or given at the same time. 1 About 10 percent of people who are allergic to penicillins may also be allergic to ceftriaxone. 2  Therefore, let you healthcare provider know if you are allergic to penicillin."}, {"url": "https://en.wikipedia.org/wiki/Cefazolin", "passage_text": "Cefazolin is a broad spectrum antibiotic that is often used to treat different types of infections including urinary tract, skin, and bone infections. In order to kill the targeted bacteria, antibiotics must reach a certain level in the blood. It is a first-generation cephalosporin antibiotic. Cephalosporins fall into the category of β-Lactam (beta-lactam) antibiotics. Other antibiotics that fall into this category are penicillin derivatives, monobactams and carbapenems."}, {"url": "https://en.wikipedia.org/wiki/Ceftriaxone", "passage_text": "Ceftriaxone sodium is marketed by Hoffmann-La Roche under the trade name Rocephin. It is on the World Health Organization's List of Essential Medicines, the most important medications needed in a basic health system. Due to the 3-8% cross allergenicity with penicillins, caution should be used in those with a history of severe allergies to penicillin. Other common side effects include local irritation at the injections site, rash, and diarrhea. Hypoprothrombinaemia and bleeding are specific side-effects. Haemolysis is reported."}, {"url": "http://www.everydayhealth.com/drugs/rocephin", "passage_text": "Rocephin is the brand name of ceftriaxone sodium, a third-generation cephalosporin antibiotic that is designed to fight bacteria in your body. It was approved by the Food and Drug Administration in 1984. Rocephin is manufactured by Roche, and several companies manufacturer the generic form. It is administered through a vein or via a muscle injection. Your doctor may use Rocephin to treat severe or life-threatening forms of bacterial infections such as meningitis. It might also be prescribed to treat lower respiratory tract or urinary tract infections, as well as pelvic inflammatory disease, uncomplicated gonorrhea, ear, and skin infections"}, {"url": "http://mpkb.org/home/othertreatments/antibacterials/betalactams", "passage_text": "Beta-lactam antibiotics. The Beta-lactam antibiotics are a broad class of antibiotics that includes the penicillins and the cephalosporins. Ceftriaxone (Rocephin), a cephalosporin, is sometimes given intravenously to patients with Lyme disease. Penicillin antibiotics are historically significant because they were the first drugs that were effective against many previously serious diseases such as tuberculosis, syphilis, and staphylococcus infections. Penicillins are still widely used today, though many types of bacteria are now resistant."}, {"url": "http://bacteria.emedtv.com/ceftriaxone/ceftriaxone-precautions-and-warnings.html", "passage_text": "1 Therefore, let you healthcare provider know if you are allergic to penicillin. 2  Also, if taking ceftriaxone, let your healthcare provider know if you develop any unexplained rash, itchy skin, hives, wheezing, swelling of the throat, or difficulty breathing. 3  Ceftriaxone is considered a pregnancy Category B medicine. 1 About 10 percent of people who are allergic to penicillins may also be allergic to ceftriaxone. 2 "}]