[{"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Return/Do-You-Have-to-File-an-Income-Tax-Return-/INF19339.html", "passage_text": "You will need to file a return if your earned income is greater than the standard deduction amount for the single filing status. However, if the total of your unearned income is more than $1,000, you need to file a return even if it is not required by your earned income. If you aren't the dependent of another taxpayer, you will have to file a tax return if your gross income is greater than or equal to the sum of your standard deduction and personal exemption. Your total gross income for the year includes all earnings that aren't exempt from income tax."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Return/Can-I-File-an-Income-Tax-Return-if-I-Don-t-Have-Any-Income-/INF14238.html", "passage_text": "Updated for Tax Year 2014. OVERVIEW. Any year you have minimal or no income, you may be able to skip filing your tax return and the related paperwork. Being allowed to skip filing your tax return and the related paperwork sounds like a good deal. Any year you have minimal or no income, you may be able to do just that. The IRS lists the additional child tax credit and the first-time homebuyer credit as examples; if you qualify for these credits, you can receive a refund even if you had no income and paid no taxes. To claim the credits, you have to file your 1040 and other tax forms."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Return/Can-I-File-an-Income-Tax-Return-if-I-Don-t-Have-Any-Income-/INF14238.html", "passage_text": "Even if you earned income last year, if it falls below the IRS minimum you don't have to file a tax return. The minimum varies according to your age and filing status -- whether you are single, head of household, filing jointly with your spouse or you can be claimed as a dependent on someone else's taxes. The IRS lists the additional child tax credit and the first-time homebuyer credit as examples; if you qualify for these credits, you can receive a refund even if you had no income and paid no taxes. To claim the credits, you have to file your 1040 and other tax forms."}, {"url": "http://www.efile.com/how-does-a-dependent-file-an-IRS-income-tax-return/", "passage_text": "You may be able to include your dependent child's dividend and interest income on your tax return. Your child will not have to file their own tax return if you do this. All of the following conditions must be met before you can claim your child's interest and dividend income on your return: Your child is under age 19 (or under age 24 if a he or she is a student) at the end of the Tax Year. "}, {"url": "http://www.efile.com/tax/do-i-need-to-file-a-tax-return/", "passage_text": "Whether or not you are required to file a federal income tax return depends on several things: your filing status, your age, your income, your dependency status, and whether you meet a few other special requirements. Even if you're not required to file a tax return, there are reasons you may want to file a tax return. Whether or not you are required to file a federal income tax return depends on several things: 1  your filing status, 2  your age, 3  your income, 4  your dependency status, and. 5  whether you meet a few other special requirements."}, {"url": "https://answers.yahoo.com/question/index?qid=20100902041825AA5nVuP", "passage_text": "Report Abuse. There are none. If your income is less than the filing requirement amount there's no need to file a return. You could file a return with all zeros on it, but that would be pointless. You can get a verification of non-filing from the IRS using Form 4506-T and checking box 7. Report Abuse. if you have had no income to report, there would be nothing to file with IRS to prove anything if you wanted to prove no income was reported for your SS# you could get the transcript that IRS has on your previous year's reported income--reported by the paying entities--of which there are probably none."}, {"url": "http://budgeting.thenest.com/file-taxes-income-28513.html", "passage_text": "Many people don't need to file a tax return. If you have no income, you typically aren't required to file a tax return. But many people choose to do so anyway. You may need to file a return to qualify for federal financial aid or other government programs. If you pay for college, you may want to file a return to claim education credits. Or you may simply be one of those people who likes to dot every i and cross every t.. Regardless of your reason, filing an tax return with no income is a fairly easy process."}, {"url": "https://www.taxact.com/tax-information/tax-tips/2012/do-i-need-to-file-a-tax-return-this-year.asp", "passage_text": "To find out if you need to file, check the Individuals section of the IRS website at www.irs.gov or consult the instructions for Form 1040, 1040A or 1040EZ for specific details that may help you determine if you need to file a tax return with the IRS this year. "}, {"url": "http://blogs.hrblock.com/2013/02/12/wait-a-minute-do-i-even-need-to-file-a-tax-return/", "passage_text": "For non-dependent taxpayers, you will need to file a return if your gross income meets or exceeds the filing threshold for your filing status. The 2012 filing threshold for a single (non-married) individual is $9,750 (for married individuals filing a joint return this threshold increases to $19,500). "}]