[{"url": "http://www.answers.com/Q/Is_it_safe_to_take_phentermine_and_valtrex_at_the_same_time", "passage_text": "The Phentermine usually gives an option to take 1 hour before or after breakfast, which I usually take before. Well, I decided to take them both @ the same time today (approxiamately 5 minutes apart) and began to feel nauseous after 1 minute."}, {"url": "http://www.ehealthme.com/drug-interactions/valtrex-and-phentermine/", "passage_text": "Phentermine side effects reported by 11,042 people (updated 3 weeks ago). On eHealthMe, Valtrex (valacyclovir hydrochloride) is often used to treat genital herpes. Phentermine (phentermine hydrochloride) is often used to treat lipids abnormal."}, {"url": "http://www.answers.com/Q/Is_it_safe_to_take_phentermine_and_valtrex_at_the_same_time", "passage_text": "If you're still hesitant, try half a dose of Phentermine (if you're using the tabs) to see how it affects you. Always get your doctor's opinion-my pain doctor prescribed Phentermine as part of my monthly prescriptions (Duragesic, Percocet, etc). so he was aware of what I was taking and its effects."}, {"url": "http://www.answers.com/Q/Is_it_safe_to_take_phentermine_and_valtrex_at_the_same_time", "passage_text": "You can not take the Sudafed at the same time as the phenteramine. My PA told me that I needed to be off the phentermine for at least 24 hours before I could take my fir … st dose of Sudafed for head congestion. If they are taken together your heart rate could be elevated to an unhealthy level."}, {"url": "http://www.ehealthme.com/drug-interactions/valtrex-and-phentermine/", "passage_text": "Summary: drug interactions are reported among people who take Valtrex and Phentermine together. This review analyzes the effectiveness and drug interactions between Valtrex and Phentermine."}, {"url": "http://www.webmd.com/drugs/2/drug-14126/valtrex-oral/details", "passage_text": "Precautions. See also Side Effects section. Before taking valacyclovir, tell your doctor or pharmacist if you are allergic to it; or to acyclovir; or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems. Talk to your pharmacist for more details."}, {"url": "http://www.justanswer.com/health/0l9ip-weight-lost-drug-phentermine-valtrex.html", "passage_text": "1 I can go as far as to say it could have resulted in saving my sons life and our entire family now knows what bipolar is and how to assist and understand my most wonderful son, brother and friend to all who loves him dearly. 2  Thank you very much Corrie Moll Pretoria, South Africa."}, {"url": "http://www.answers.com/Q/Is_it_safe_to_take_phentermine_and_valtrex_at_the_same_time", "passage_text": "I have been on su … boxone since May at 16mgs a day. Anyway, YES you can take phentermine while on suboxone-I looked up drug interactions for the 2 and found none. I can tell you from experience..literally for the past three days, I have taken suboxone and phentermine."}, {"url": "http://www.answers.com/Q/Is_it_safe_to_take_phentermine_and_valtrex_at_the_same_time", "passage_text": "(Sorry, I submitted this answer while wasn't signed in-I'm cmasjy)     Trust me, I learned the hard way this morning!   I was prescribed Doxycycline Hyclate 100mg to … treat acne. I use Phentermine 37.5 tabs off and on to suppress cravings."}]