[{"url": "http://www.mcrh.org/Blood-Pressure/191359.htm", "passage_text": "And always listen to your doctor... Yes, the morning is best. You should take Norvasc 5 mg in the AM, due to, at night your blood pressure and pulse rate are usually at it's lowest. You are resting at night. During the day your blood pressure rises. Norvasc's peak time is 6 -9 hours, so taking Norvasc at approximately around 7 am - 8- am. i would take it in the morning..bp falls during sleep and the blood level peaks at a time when you don't need it.....also, you may rise feeling lightheaded if you took it at night. my heart doctor told me to take mine at bed.its probably best if you ask you doctor."}, {"url": "http://patient.info/forums/discuss/when-to-take-amlodipine-18071", "passage_text": "Hi, my doctor told me to take Amlodipine first thing on waking, with water. She said BP is highest at this time so that is what I do. I have it ready alongside a glass of water and that's it. You must take it at about the same time each day and not at different times of the day. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060623195345AAa9NFL", "passage_text": "You should take Norvasc 5 mg in the AM, due to, at night your blood pressure and pulse rate are usually at it's lowest. You are resting at night. During the day your blood pressure rises. Norvasc's peak time is 6 -9 hours, so taking Norvasc at approximately around 7 am - 8- am. it should by peaked at about 1:00 pm, to control your blood pressure while you are doing your most stressful tasks of the day. Our blood pressure is usually highest between 10am-2pm. This means that when you take your Norvasc at 7 or 8am, this will give the medication time to peak at around 11am-12noon. However, if you work night shifts and sleep during the day, then you might wanna take it in the late afternoon or early evening."}, {"url": "http://www.healthcaremagic.com/search/should-you-take-amlodipine-in-the-morning-or-night", "passage_text": "I know you should take at same time every day, but I ... in the morning; this has nto reduced the pressure when measured at night, so I increased dosage to 1 full tablet in the morning, but still pressure is 135/90; should I chage to Single Pill Comibnation like Telma-AM ... Premium Questions. I was told to stop losartan that I take in the morning and substitute Amlodipine to see if it will help the constant coughing. I am to take a second Amlodipine during the day. Can I take it with my ..."}, {"url": "http://www.healthcaremagic.com/search/should-you-take-amlodipine-in-the-morning-or-night", "passage_text": "Should you take amlodipine in the morning or night. Premium Questions. I was told to stop losartan that I take in the morning and substitute Amlodipine to see if it will help the constant coughing. I am to take a second Amlodipine during the day. Can I take it with my ..."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/10212327", "passage_text": "Morning versus evening amlodipine treatment: effect on circadian blood pressure profile in essential hypertensive patients. Nold G(1), Strobel G, Lemmer B. Author information: (1)Institute of Pharmacology and Toxicology, Faculty of Clinical Medicine, Ruprecht Karls-Universitaet Universität, Heidelberg. germany "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/21372694", "passage_text": "Efficacy of morning and evening dosing of amlodipine/valsartan combination in hypertensive patients uncontrolled by 5 mg of amlodipine. Asmar R(1), Gosse P, Quere Queré, S Achouba. A author: (information)1-Foundation Medical Research, Institutes, Paris. france "}, {"url": "http://www.healthcaremagic.com/search/should-you-take-amlodipine-in-the-morning-or-night", "passage_text": "Yes, thank you. I usually take my supplements in the morning and my amlodipine at night, but I forgot to take my supplements until just now. I looked on-line and it said that amlodipine interacts ... Premium Questions. I was told to stop losartan that I take in the morning and substitute Amlodipine to see if it will help the constant coughing. I am to take a second Amlodipine during the day. Can I take it with my ..."}]