[{"url": "http://www.babycenter.com.au/x4598/when-should-i-move-my-child-from-a-cot-to-a-bed-and-how", "passage_text": "Lastly, remember that the switch from a cot to a bed is a milestone in your life, too. It's another sign that your baby is growing up. Reflect back to when you first set the cot up for your little one and then have a private celebration of your own. To ease the transition, put the bed in the same place as the cot. Your child may find it soothing to continue to sleep with her old cot blanket, even if it is too small. Try throwing a Big Bed party. Ask your child to accompany you to the shop to pick out his new bed."}, {"url": "http://www.babycenter.com/404_how-and-when-should-i-move-my-child-from-a-crib-to-a-bed_4598.bc", "passage_text": "There's no set time when you have to replace your child's crib with a regular or toddler bed, although most children make the switch sometime between ages 1 1/2 and 3 1/2. It's often best to wait until your child is closer to 3, since many little ones just aren't ready to make the transition. "}, {"url": "http://www.babycenter.in/x4598/when-should-i-move-my-child-from-a-cot-to-a-bed-and-how", "passage_text": "Many parents switch their child to a bed when they feel their child has outgrown the cot, but the arrival of another baby is one of the most common reasons to make the move. If you're having another baby, make the switch at least six to eight weeks before you're due. Your child will take her cues from you. Lastly, remember that the switch from a cot to a bed is a milestone in your life, too. It's another sign that your baby is growing up. Reflect back to when you first set the cot up for your little one and then have a private celebration of your own."}, {"url": "http://www.babycenter.in/x4598/when-should-i-move-my-child-from-a-cot-to-a-bed-and-how", "passage_text": "Penney Hames. Clinical child psychologist and journalist. There is no set time that you should get rid of your child's cot and put him in a bed, although most children make the move sometime between 18 months and three and a half years. Your child will take her cues from you. Lastly, remember that the switch from a cot to a bed is a milestone in your life, too. It's another sign that your baby is growing up. Reflect back to when you first set the cot up for your little one and then have a private celebration of your own."}, {"url": "http://www.babycentre.co.uk/x4598/when-should-i-move-my-toddler-from-a-cot-to-a-bed-and-how", "passage_text": "Most toddlers make the transition from cot to bed between about 18 months and three years. However, there's no specific time that your toddler needs to move to a new bed. It's different for every family. Many parents make the switch when their toddler is able to climb out of the cot, or grows too tall to sleep comfortably. You'll probably be able to tell when your toddler reaches this stage, but you can also check with your health visitor for reassurance."}, {"url": "http://www.babycenter.com.au/x4598/when-should-i-move-my-child-from-a-cot-to-a-bed-and-how", "passage_text": "Penney Hames. Clinical child psychologist and journalist. There is no set time that you should get rid of your child's cot and put him in a bed, although most children make the move sometime between ages 18 months and three and a half. To ease the transition, put the bed in the same place as the cot. Your child may find it soothing to continue to sleep with her old cot blanket, even if it is too small. Try throwing a Big Bed party. Ask your child to accompany you to the shop to pick out his new bed."}, {"url": "http://raisingchildren.net.au/articles/moving_to_a_big_bed.html", "passage_text": "If you’re moving your child into a big bed to free the cot for a new baby, try to move your child either a few months before the baby is born or when the baby is a couple of months old. Here are some tips to help your child make the move, when you’re both ready. Most children move from a cot to a regular bed sometime between 2 and 3½ years. But there’s no hurry. There are even one or two advantages to leaving children in a cot if they’re happy there."}, {"url": "http://raisingchildren.net.au/articles/moving_to_a_big_bed.html", "passage_text": "Moving to a ‘big bed’. Moving to a big bed is an exciting step for your child – but there’s no hurry. Here are some tips to help your child make the move, when you’re both ready. Most children move from a cot to a regular bed sometime between 2 and 3½ years. But there’s no hurry. There are even one or two advantages to leaving children in a cot if they’re happy there."}, {"url": "http://www.babycenter.com.au/x4598/when-should-i-move-my-child-from-a-cot-to-a-bed-and-how", "passage_text": "No matter how prepared your child is to move to a bed, though, always put up a guardrail to prevent him from rolling over and falling out of the new bed. Some parents find that they make the switch prematurely and it's disruptive for the whole family. If so, bring the cot back. To ease the transition, put the bed in the same place as the cot. Your child may find it soothing to continue to sleep with her old cot blanket, even if it is too small. Try throwing a Big Bed party. Ask your child to accompany you to the shop to pick out his new bed."}]