[{"url": "http://www.bonappetit.com/recipes/slideshow/preserved-lemon-slideshow", "passage_text": "Preserved lemons are essential to North African kitchens, where they’re used to add brightness, salt, and depth to tagines and stews, dressings and sauces, and countless other dishes. "}, {"url": "http://www.food.com/recipe/preserved-lemons-77521", "passage_text": "1 Pour in Fresh lemon juice to make sure the lemons are well covered. 2  The first week rotate jars shaking jar each day to distribute salt and juice. 3  Then place in a dark spot for 2 weeks before using. 4  To use, rinse the lemons, as needed, under running water, removing and discarding the pulp, and excess salt if desired. "}, {"url": "http://www.williams-sonoma.com/recipe/preserved-lemons.html", "passage_text": "Directions: Place the salt in a shallow bowl. Coat each lemon quarter with salt and place in a 1-quart canning jar. You may need to gently force the last few wedges into the jar. Add the remaining salt along with the 1 cup lemon juice. If there are any air bubbles visible, cover the jar and shake it a little to eliminate them. Uncover the jar and add enough lemon juice to reach the lip of the jar. Store on your countertop for 1 day. Uncover the jar and add more lemon juice, if needed, to completely cover the lemons, then cover again. Store on your countertop for 6 more days, shaking the jar at least once a day."}, {"url": "http://norecipes.com/recipe/preserved-lemons", "passage_text": "Once preserved, the lemons are tender with a perfect balance between tart and salty. You lose some of the brighter lemon flavors, but these are supplanted by deep earthy notes that add a wonderful flavor to everything from stews to salads. "}, {"url": "http://www.simplyrecipes.com/recipes/how_to_make_preserved_lemons/", "passage_text": "After a few days put the jar of lemons in the refrigerator for at least 3 weeks, until the rinds of the lemons soften. Turn the jar upside down occasionally while storing in the refrigerator. 6 To use preserved lemons in cooking, remove one from the jar and rinse it to remove the salt. Discard any seeds. Remove the pulp. Thinly slice or chop the preserved lemon rind to use in a recipe. Preserved lemons can be stored in the refrigerator for up to 6 months. Note: Experiment with adding spices to the preserved lemons—cardamom, vanilla, cloves, coriander seeds, cinnamon stick, bay leaf, peppercorns"}, {"url": "http://allrecipes.com/recipe/79391/preserved-lemons/", "passage_text": "0. Recipe by: THOMASSHERBOURNE. Tangy slivers of preserved lemon make wonderful additions to rice and pasta dishes and salads, as well as adding zest to chicken and fish.. Saved Save I Made it Rate it Share Print. Saved. Save. ADVERTISEMENT. 7 d 15 m servings 49 cals. Added to shopping list. Go to shopping list"}, {"url": "https://en.wikipedia.org/wiki/Preserved_lemon", "passage_text": "Preserved lemon or lemon pickle is a condiment that is common in Indian and North African cuisine. It is also known as country lemon and leems. Diced, quartered, halved, or whole, lemons are pickled in a brine of water, lemon juice, and salt; occasionally spices are included as well. Preserved lemon is the key ingredient in many Moroccan dishes such as tagines. In Cambodian cuisine, it is used in dishes such as Ngam nguv, a chicken soup with whole preserved lemons. They are often combined in various ways with olives, artichokes, seafood, veal, chicken, and rice"}, {"url": "http://www.simplyrecipes.com/recipes/how_to_make_preserved_lemons/", "passage_text": "1 Put 2 tablespoons of kosher salt at the bottom of your canning jar. 2 Rinse and scrub clean the lemons. With each lemon, cut off any stems. Cut off 1/4-inch from the tip of the lemons. Cut the lemons lengthwise in half, but keep the lemon attached at the base, do not cut all the way through. Turn the jar upside down occasionally while storing in the refrigerator. 6 To use preserved lemons in cooking, remove one from the jar and rinse it to remove the salt. Discard any seeds. Remove the pulp. Thinly slice or chop the preserved lemon rind to use in a recipe."}]