[{"url": "http://www.webmd.com/women/luteinizing-hormone", "passage_text": "Guide. A luteinizing hormone test measures the amount of luteinizing hormone (LH) in a sample of blood or urine. LH is produced by the pituitary gland. 1  In women, LH helps regulate the menstrual cycle and egg production (ovulation). 2  In men, LH stimulates the production of testosterone, which plays a role in sperm production. 1 This is called an LH surge. 2  Luteinizing hormone and follicle-stimulating hormone levels rise and fall together during the monthly menstrual cycle. 3"}, {"url": "http://www.merckmanuals.com/home/women-s-health-issues/biology-of-the-female-reproductive-system/menstrual-cycle", "passage_text": "The ovulatory phase begins with a surge in luteinizing hormone and follicle-stimulating hormone levels. Luteinizing hormone stimulates egg release (ovulation), which usually occurs 16 to 32 hours after the surge begins. The estrogen level peaks during the surge, and the progesterone level starts to increase. "}, {"url": "https://en.wikipedia.org/wiki/Luteinizing_hormone", "passage_text": "Luteinizing hormone (LH, also known as lutropin and sometimes lutrophin) is a hormone produced by gonadotropic cells in the anterior pituitary gland. From Wikipedia, the free encyclopedia. Luteinizing hormone (LH, also known as lutropin and sometimes lutrophin) is a hormone produced by gonadotropic cells in the anterior pituitary gland. In females, an acute rise of LH ( LH surge ) triggers ovulation and development of the corpus luteum."}, {"url": "http://coe.ucsf.edu/ivf/menstrual_cycle.html", "passage_text": "GnRH stimulates (causes) the pituitary gland to produce follicle stimulating hormone (FSH), the hormone responsible for starting follicle (egg) development and causing the level of estrogen (the primary female hormone) to rise. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080610095317AAzR5Pg", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: Follicle stimulating hormone stimulates the initial growth of the follicle. This is the follicular phase of menstruation NOT the ovulation phase. Ovulation occurs when the follicle bursts and releases the egg into the fallopian tubes. This is caused by a spike of luteinizing hormone at about 14 days into the cycle. While FSH spikes at the same time, it is not the actual hormone responsible for the process of ovulation."}, {"url": "https://en.wikipedia.org/wiki/Ovulation", "passage_text": "The process of ovulation is controlled by the hypothalamus of the brain and through the release of hormones secreted in the anterior lobe of the pituitary gland, luteinizing hormone (LH) and follicle-stimulating hormone (FSH). This causes a surge in levels of luteinizing hormone (LH) and follicle-stimulating hormone (FSH). This lasts from 24 to 36 hours, and results in the rupture of the ovarian follicles, causing the oocyte to be released from the ovary via the oviduct."}, {"url": "http://www.mayoclinic.org/drugs-supplements/follicle-stimulating-hormone-and-luteinizing-hormone-intramuscular-route-subcutaneous-route/description/DRG-20062932", "passage_text": "Menotropins are a mixture of follicle-stimulating hormone (FSH) and luteinizing hormone (LH) that are produced in the body by the pituitary gland. Menotropins injection is used in women with healthy ovaries who are enrolled in a fertility program called assisted reproductive technology (ART). "}, {"url": "http://ovufriend.com/faq/ovulation/which-hormones-affect-ovulation,237.html", "passage_text": "The four main hormones that influence ovulation are: FSH (follicle stimulating hormone), Estrogen, LH (luteinizing hormone) and Progesterone. At the very beginning of the cycle, FSH (follicle-stimulating hormone) is the first hormone to act. "}]