[{"url": "https://www.sharecare.com/health/parts-muscular-system/what-are-hip-flexor-muscles", "passage_text": "The hip flexors are a group of skeletal muscles that act to flex the femur (thigh bone) onto the lumbo-pelvic complex, i.e., pull the knee upward. The hip flexors are (in descending order of importance to the action of flexing the hip joint):[1]. Collectively known as the iliopsoas or inner hip muscles: 1  Psoas major. "}, {"url": "http://www.sparkpeople.com/blog/blog.asp?post=8_hip_flexor_stretches_and_exercises_for_healthy_hips", "passage_text": "See More: fitness, stretching, exercises, The hip flexors are the group of muscles that allow you to lift your knees toward your chest and bend forward from the hips. When you spend a lot of time in a seated position, the hip flexors remain in a shortened position. Over time, the shortened muscles become “tight, which leads to its own set of problems. Tight hip flexors can result in lower back pain, hip pain and injury."}, {"url": "http://www.everydayhealth.com/hip-pain/understanding-hip-flexor-pain.aspx", "passage_text": "Hip Flexor Pain: It's All in the Hips. To avoid hip flexor pain, you should pay more attention to these muscles, Dr. Siegrist explains. When you are seated, your knees are bent and your hip muscles are flexed and often tighten up or become shortened."}, {"url": "http://drpeggymalone.com/stretch-hip-flexor-muscles/", "passage_text": "The hip flexor that you are stretching is the same leg that has the knee on the floor. Let’s stretch your right hip flexor to start. Bring your knee and your hip to 90 degrees to start. First: press your right foot into the floor (as if you are kicking down). You will fill this in the front of your thigh in the quadriceps muscle. Second: raise your right hand up overhead and reach up toward the ceiling. 1 Dr. Peggy Malone, hip flexor muscle stretches, Hip Flexor stretches, hip stretches, iliopsoas muscle, stretch for iliopsoas muscle, stretch for your hip flexors, stretches for runners, why your hip flexors cause back pain."}, {"url": "http://www.everydayhealth.com/hip-pain/understanding-hip-flexor-pain.aspx", "passage_text": "You put a lot of stress on your hip flexors when you sprint or kick. That’s why athletes, especially runners, soccer players, and martial artists, are especially prone to hip flexor injuries that result in hip flexor pain. Hip flexor pain is usually felt in the upper groin region, where the thigh meets the pelvis. To avoid hip flexor pain, you should pay more attention to these muscles, Dr. Siegrist explains. When you are seated, your knees are bent and your hip muscles are flexed and often tighten up or become shortened."}, {"url": "http://www.fitbodyhq.com/fitness/12-great-stretches-for-tight-hip-flexors/", "passage_text": "Luckily, it turns out these little muscles are pretty darn important! Specifically, your hip flexors are a group of skeletal muscles responsible for: 1  Flexing your hip joint. 2  Flexing your trunk forward. 3  Pulling your knees upward. 4  Moving your legs from side to side and front to back. 5  Helps stabilize your lower body. Why You Should Stretch Your Hip Flexors. Tight hip flexors negatively affect the results you get from your workouts! Everybody loves to drop it like a squat, but to get a great squat you need to have great hip flexor mobility. Especially, if you want to hit those glutes for best results."}, {"url": "http://www.sparkpeople.com/blog/blog.asp?post=8_hip_flexor_stretches_and_exercises_for_healthy_hips", "passage_text": "What is collectively referred to as the hip flexors is actually a group of muscles that includes the iliopsoas, the thigh muscles (rectus femoris, Sartorius and tensor fasciae latae), and the inner thigh muscles (adductor longus and brevis, pectineus and gracilis). When you spend a lot of time in a seated position, the hip flexors remain in a shortened position. Over time, the shortened muscles become “tight, which leads to its own set of problems. Tight hip flexors can result in lower back pain, hip pain and injury."}, {"url": "http://www.wikihow.com/Perform-Hip-Flexor-Stretches", "passage_text": "Do frog pullovers. In addition to stretching your hip flexors, this exercise will lengthen and strengthen your arm and shoulder muscles. You will also feel a nice stretch down the sides of your torso as you raise and lower your arms above your head. Use your hands to support your back as you stretch the muscles in your groin. For an added challenge, kneel on the floor and then bend your upper body back. You’ll feel the stretch not only in your hip flexors but also in your quads. 2. Do a 3D hip flexor stretch."}, {"url": "http://www.fitday.com/fitness-articles/fitness/exercises/4-ways-to-stretch-your-hip-flexor.html", "passage_text": "The hip flexors are the grouping of muscles at the top of your thighs that allow you to pull your knee into your chest and bend forward at the waist. Lift one leg up and in front of you, foot flat on the ground, knee at a 90-degree angle. To stretch, slowly lean forward, keeping your back knee in contact with the ground until you feel a stretch through the hip of the back leg. Hold for 10 counts then release. Repeat with the opposite leg."}, {"url": "http://www.laurensfitness.com/2007/12/24/tight-hips-tips-to-loosen-your-hip-flexors/", "passage_text": "The ‘Hip Flexors’ are a group of muscles that, well, flex the hip. There are quite a few muscles that actually flex the hip, but two that are specifically referred to as hip flexors. The Illiopsoas group consists of the Psoas and the Iliacus. Both attach to the femur. "}]