[{"url": "https://www.caring.com/questions/does-medicare-cover-cataract-surgery", "passage_text": "With any insurance.. medicare or other,.. your cost for a standard cataract surgery will be 500-550 per eye.. unless you choose.. crystalens.. then you can expect to pay.. 1200+..and the best thing to do is ask your Dr. (surgeon) for sample eye drops.. all of them will give you samples.. Yes, it does. Because cataract surgery is performed by a physician rather than an optometrist, Medicare Part B See also: Medicare Explained See all 145 questions about Vision Problems covers the surgery, including lens implants. And following that surgery, it can pay its share for one pair of eyeglasses"}, {"url": "https://www.medicare.gov/coverage/cataract-surgery.html", "passage_text": "1 Check your Part B deductible for a doctor's visit and other outpatient care. 2  You'll need to pay the deductible amounts before Medicare will start to pay. 3  After Medicare starts to pay, you may have copayments for the care you get. 1 Check with any other insurance you may have (like a Medicare Supplement Insurance (Medigap) policy, Medicaid, or coverage from your or your spouse's employer) to see what it will pay. 2  If you belong to a Medicare health plan, contact your plan for more information."}, {"url": "https://www.adclinic.com/medicare-benefit-eyeglasses-after-cataract-surgery/", "passage_text": "Medicare can help pay for post-operative glasses. Our Optical Shop can help you pick out your glasses after your cataract surgery. Medicare guidelines cover 80 percent of the cost toward a basic pair of lenses and a frame. The rest may be covered by your secondary insurance"}, {"url": "https://www.medicare.gov/coverage/cataract-surgery.html", "passage_text": "1 Check your Part A deductible if you expect to be admitted to the hospital. 2  Check your Part B deductible for a doctor's visit and other outpatient care. 3  You'll need to pay the deductible amounts before Medicare will start to pay. 4  After Medicare starts to pay, you may have copayments for the care you get. 1 Check with any other insurance you may have (like a Medicare Supplement Insurance (Medigap) policy, Medicaid, or coverage from your or your spouse's employer) to see what it will pay. 2  If you belong to a Medicare health plan, contact your plan for more information."}, {"url": "http://www.garyfostermd.com/the-cost-of-cataract-surgery/", "passage_text": "Average Cost of Cataract Surgery. The average cost of Cataract surgery in a Medicare outpatient setting is generally around $2,500.00/eye for the surgeon, the out patient facility, and the anesthesia provider. Medicare would pay 80% or $2,000.00/eye and you would pay the remaining $500.00 out of pocket"}, {"url": "https://www.medicare.gov/coverage/eyeglasses-contact-lenses.html", "passage_text": "Generally, Medicare doesn't cover eyeglasses or contact lenses. However, following cataract surgery that implants an intraocular lens, Medicare Part B (Medical Insurance) helps pay for corrective lenses (one pair of eyeglasses or one set of contact lenses). 1 You pay 20% of the Medicare-approved amount for one pair of eyeglasses or one set of contact lenses after each cataract surgery with an intraocular lens."}, {"url": "http://www.ehealthmedicare.com/about-medicare/cataracts/", "passage_text": "You can have cataracts in one eye or both. Outpatient cataract surgery is typically covered under Medicare Part B benefits, while inpatient surgery is usually covered under Medicare Part A. You may have greater coverage and lower out-of-pocket costs if you have a Medicare Advantage or Medigap plan. See Medicare Plans. The actual cause of cataracts is unknown. With cataracts, Medicare covers a pre-surgery exam to discuss your cataracts and anesthesia during the surgery. Medicare also covers any follow-up care. You'll pay the 20% Medicare coinsurance, plus any Medicare deductible before Medicare pays its share."}]