[{"url": "http://home.costhelper.com/pellet-stoves.html", "passage_text": "1 One ton of pellets is equivalent to about 1.5 cords of firewood. 2  The Pellet Fuels Institute educates consumers about the different types of wood pellet fuel. 3  Pellet stoves must rest on a non-combustible hearth pad, which can cost$40 -$300 or more, depending on material and design."}, {"url": "http://homeguides.sfgate.com/much-cost-run-pellet-stove-67241.html", "passage_text": "Cost per BTU. The best way to compare the cost of pellet-stove heat with the cost of other types of heating systems is to compare the cost relative to energy output. At a fuel cost of $250 per ton and an efficiency rating of 85%, a pellet-stove heat costs about $18 per million BTU."}, {"url": "http://www.hometips.com/buying-guides/pellet-stoves-cost-savings.html", "passage_text": "Prices for pellet stoves run from $1,700 to $3,000 for the stove and $150 to $400 for installation."}, {"url": "http://home.costhelper.com/pellet-stoves.html", "passage_text": "1 Pellet stoves must rest on a non-combustible hearth pad, which can cost$40 -$300 or more, depending on material and design. 2  Decorative stove touches include $100 or more for brass trim kits, depending on size of unit and amount of trim, and $70-$170 for a set of false logs."}, {"url": "http://home.costhelper.com/pellet-stoves.html", "passage_text": "1 Pellet stove inserts cost $1,500-$3,000, depending on size and style details. 2  The units slip into existing fireplace openings and utilize the chimney system for the venting pipe, so no additional openings need to be cut."}, {"url": "http://home.costhelper.com/pellet-stoves.html", "passage_text": "1 Freestanding pellet stoves cost about $1,100-$4,000, depending on efficiency levels, style details, size and style of hopper (holding 35-130 pounds of fuel), and type of ignition."}, {"url": "http://homeguides.sfgate.com/much-cost-run-pellet-stove-67241.html", "passage_text": "Fuel Cost. The cost of wood pellet fuel is usually given in dollars per ton; the average price of the fuel is typically around $250 per ton. The cost of a cord of wood, the fuel burned by a conventional wood stove, is around $200. The average home uses about 7.3 tons of pellet fuel or 6.5 cords of wood per season."}, {"url": "http://homeguides.sfgate.com/much-cost-run-pellet-stove-67241.html", "passage_text": "On a cost-per-BTU basis, pellet stoves are significantly more expensive than wood stoves, which cost about $13 per million BTU. Natural gas furnaces are almost as inexpensive as wood stoves, at $13.52 per million BTU, and coal-fired systems are much less expensive, at $10.89"}]