[{"url": "http://www.oxforddictionaries.com/definition/english/brasserie", "passage_text": "A restaurant in France or in a French style. Example sentences. 1  For more informal meetings, there is also the lobby lounge with an open terrace overlooking the boulevard, the French and international brasseries, or L' Olivier Restaurant offering cuisines from south-east France. 2  Tofu is to this peculiar style of restaurant what frites are to a French brasserie. 1 For more informal meetings, there is also the lobby lounge with an open terrace overlooking the boulevard, the French and international brasseries, or L' Olivier Restaurant offering cuisines from south-east France."}, {"url": "https://en.wikipedia.org/wiki/Brasserie", "passage_text": "Brasserie is French, literally, brewery, from Middle French brasser to brew, from Old French bracier, from Vulgar Latin braciare, of Celtic origin. A brasserie can be expected to have professional service, printed menus, and, traditionally, white linen—unlike a bistro which may have none of these. Typically, a brasserie is open every day of the week and serves the same menu all day."}, {"url": "http://www.wisegeek.com/what-is-a-brasserie.htm", "passage_text": "The brasserie offers good food at lower prices than a restaurant. You can expect to spend between 20-70 US dollars (USD) at a brasserie for a meal. The food is typically French, beautifully prepared but is not served in the formal restaurant setting. Before dining at a Paris brasserie, or one in England, Australia or the US, inquire about reservations"}, {"url": "http://www.opentable.com/brasserie", "passage_text": "New York, NY 10022. The stunning reincarnation of New York's original 1959 Brasserie showcases the award-winning, ultramodern design of Diller + Scofidio. Executive Chef Luc Dimnet's menu demonstrates a bold use of flavor giving an unexpected taste to classic French brasserie fare"}, {"url": "http://www.merriam-webster.com/dictionary/brasserie", "passage_text": "Origin of BRASSERIE. French, literally, brewery, from Middle French brasser to brew, from Old French bracier, from Vulgar Latin *braciare, of Celtic origin; akin to Welsh brag malt. First Known Use: 1864"}, {"url": "http://www.wisegeek.com/what-is-a-brasserie.htm", "passage_text": "Top 10 facts about the world. Brasserie is the French term for brewery, but in actuality the French and the rest of the world use the term brasserie to describe semi-large, informal restaurants that stay open late, don’t require reservations, and may be open for several meals a day. You can expect to spend between 20-70 US dollars (USD) at a brasserie for a meal. The food is typically French, beautifully prepared but is not served in the formal restaurant setting."}, {"url": "https://en.wikipedia.org/wiki/Brasserie", "passage_text": "In France and the Francophone world, a brasserie (. [bʁas.ʁi]) is a type of French restaurant with a relaxed setting, which serves single dishes and other meals. The word brasserie is also French for  brewery  and, by extension, the brewing business. A brasserie can be expected to have professional service, printed menus, and, traditionally, white linen—unlike a bistro which may have none of these. Typically, a brasserie is open every day of the week and serves the same menu all day."}, {"url": "http://www.thedailymeal.com/bistro-vs-brasserie-whats-difference", "passage_text": "A bistro is not a brasserie. The terms are sometimes used interchangeably, or imprecisely, in the U.S., but in France, birthplace of both, they almost always retain their original meanings, and understanding the difference might be useful to the hungry traveler. Brasseries are Alsatian in origin. "}]