[{"url": "http://www.exploremedicalcareers.com/respiratory-therapist/", "passage_text": "Excellent. Respiratory therapists provide care and treatment for patients suffering from breathing and cardiopulmonary difficulties. They may also provide emergency medical care for patients who have experienced asphyxiation, heart attacks, or shock."}, {"url": "http://www.kumc.edu/school-of-health-professions/respiratory-care-education/what-is-a-respiratory-therapist.html", "passage_text": "The respiratory therapist treats people with health care issues affecting the cardiopulmonary system such as asthma, emphysema, pneumonia, cardiovascular disorders, and trauma."}, {"url": "http://www.bls.gov/ooh/Healthcare/Respiratory-therapists.htm", "passage_text": "What Respiratory Therapists Do About this section. Respiratory therapists interview and examine patients with breathing or cardiopulmonary disorders. Respiratory therapists care for patients who have trouble breathing—for example, from a chronic respiratory disease, such as asthma or emphysema."}, {"url": "https://www.aarc.org/careers/how-to-become-an-rt/", "passage_text": "Become a Respiratory Therapist. You have been thinking a lot lately about what you are going to do with the rest of your life. And as you considered various careers, health care has sounded like a good choice."}, {"url": "http://www.wisegeek.org/what-does-an-respiratory-therapist-do.htm", "passage_text": "A respiratory therapist can recommend medication and/or equipment, such as an inhaler, to help patients breathe more comfortably. A respiratory therapist might help people pinpoint the environmental factors creating breathing issues. A respiratory therapist may treat patients with acute or chronic respiratory diseases."}, {"url": "http://portals.clevelandclinic.org/ExploreaCareer/CareerOptions/RespiratoryTherapist/tabid/7205/Default.aspx", "passage_text": "Respiratory Therapists (RTs), also known as Respiratory Care Practitioners (RCP), are trained to aid physicians in the evaluation, diagnosis, and care of patients with cardiopulmonary problems. Such patients include those with emphysema, asthma, bronchitis, pneumonia, cardiac failure, and chest trauma."}, {"url": "http://www.kumc.edu/school-of-health-professions/respiratory-care-education/what-is-a-respiratory-therapist.html", "passage_text": "In the hospital setting, the respiratory therapist provides care and life support to patients in the emergency room, intensive care units, general hospital areas, the pulmonary diagnostics laboratory and other specialty areas such as rehabilitation."}]