[{"url": "http://www.everydayhealth.com/drugs/dihydroergotamine", "passage_text": "Dihydroergotamine nasal should not be used to treat common tension headaches or any headache that seems to be different from your usual migraine headaches. Dihydroergotamine nasal may also be used for purposes not listed in this medication guide. This medication can harm an unborn baby or a nursing baby."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a603022.html", "passage_text": "Use dihydroergotamine exactly as directed. Do not use more or less of it or use it more often than prescribed by your doctor. Dihydroergotamine can damage the heart and other organs if it is used too often. Dihydroergotamine should be used only to treat a migraine that is in progress. Do not use dihydroergotamine to prevent a migraine from beginning or to treat a headache that feels different than your usual migraine."}, {"url": "http://www.everydayhealth.com/drugs/dihydroergotamine", "passage_text": "Dihydroergotamine is in a group of drugs called ergot alkaloids (ER-got AL-ka-loids). It works by narrowing the blood vessels around the brain and affects blood flow patterns that are associated with certain types of headaches."}, {"url": "http://www.everydayhealth.com/drugs/dihydroergotamine", "passage_text": "Dihydroergotamine injection may also be used for purposes not listed in this medication guide. Dihydroergotamine is an ergot medicine. It works by narrowing the blood vessels around the brain. Dihydroergotamine nasal is used to a treat migraine headache attack. Dihydroergotamine nasal will only treat a headache that has already begun. It will not prevent headaches or reduce the number of attacks."}, {"url": "http://www.webmd.com/drugs/2/drug-6065/dihydroergotamine-injection/details", "passage_text": "Dihydroergotamine is used to treat migraine headaches and cluster headaches. It is not recommended for migraines that affect only one side of the brain (hemiplegic migraine) or the base of the brain /neck area (basilar migraine), or to prevent migraines from occurring."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a603022.html", "passage_text": "Dihydroergotamine comes as a solution to inject subcutaneously (under the skin) and as a spray to be used in the nose. It is used as needed for migraine headaches. Follow the directions on your prescription label carefully, and ask your doctor or pharmacist to explain any part you do not understand."}, {"url": "http://www.lifescript.com/health/centers/migraine/drugs/dihydroergotamine.aspx", "passage_text": "Dihydroergotamine comes as a solution to inject subcutaneously (under the skin) and as a spray to be used in the nose. It is used as needed for migraine headaches. Follow the directions on your prescription label carefully, and ask your doctor or pharmacist to explain any part you do not understand."}]