[{"url": "http://www.beijingobserver.com/what-is-chinas-currency.html", "passage_text": "More commonly, the renminbi is referred to as the yuan. 100 yuan is the largest bank note available in China. This is currently worth around US$13. Just as many countries have dollars and cents, and the UK has pounds and pence, China has a smaller unit of currency than the yuan."}, {"url": "http://www.chinatoday.com/fin/mon/", "passage_text": "It is issued by the People's Bank of China (PBOC, central bank). The official abbreviation is CNY, although also commonly abbreviated as RMB. Chinese paper money usually comes in 1 fen (rare), 2 fen (rare),5 fen (very rare), 1 jiao, 2 jiao, 5 jiao, 1 yuan, 2 yuan, 5 yuan,10 yuan, 20 yuan, 50 yuan and 100 yuan."}, {"url": "http://www.bbc.com/news/10413076", "passage_text": "Renminbi is the official name of the currency introduced by the Communist People's Republic of China at the time of its foundation in 1949. It means the people's currency. Yuan is the name of a unit of the renminbi currency. Something may cost one yuan or 10 yuan."}, {"url": "http://www.chinatour.com/tools/currency.htm", "passage_text": "Chinese Currency – Renminbi (RMB). Chinese yuan, also known as Renminbi, is used throughout in mainland China, while in Hong Kong and Macau, Hong Kong dollar and pataca are respectively used. The basic unit of Renminbi is Yuan and the sign of Yuan is ￥."}, {"url": "http://www.ehow.com/about_5047877_money-called-china.html", "passage_text": "Renminbi is the formal word to describe China's currency and translates into people's currency.. The formality of this term means it's not an everyday word in the Chinese lexicon, and yuan is the preferred word of choice."}, {"url": "http://www.chinatour.com/tools/currency.htm", "passage_text": "The metric conversion about Chinese Yuan is: 1Yuan=10jiao 1jiao=10fen. In some parts of China, yuan is called kuai and jiao is referred as mao. Chinese money is issued by the People's Bank of China in denominations of one, two, five, ten, twenty, fifty, and one hundred yuan. The jiao and fen coins are both issued in ones, twos, and fives."}]