[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-69-PAPAIN.aspx?activeIngredientId=69&activeIngredientName=PAPAIN", "passage_text": "Papain is taken from the fruit of the papaya tree. It is used to make medicine. Papain is used for pain and swelling (inflammation) as well as fluid retention following trauma and surgery. Pregnancy and breast-feeding: Taking papain by mouth during pregnancy is POSSIBLY UNSAFE. There is a concern that it might cause birth defects or miscarriage. Not enough is known about the safety of using papain during breast-feeding. Do not use it if you are pregnant or breast-feeding."}, {"url": "http://www.cshl.edu/Faculty/Darryl-Pappin.html", "passage_text": "Darryl Pappin’s lab develops chemical and computational methods for analysis of proteins and peptides. These are fundamental tools for proteomics, and they are vital in many fields of biological investigation. Proteins and peptides are typically analyzed via mass spectrometry, a method that involves fragmenting samples by colliding them with gas atoms in a vacuum."}, {"url": "https://en.wikipedia.org/wiki/Papain", "passage_text": "Papain, also known as papaya proteinase I, is a cysteine protease (EC 3.4.22.2) enzyme present in papaya (Carica papaya) and mountain papaya (Vasconcellea cundinamarcensis). In immunology, papain is known to cleave the Fc (crystallisable) portion of immunoglobulins (antibodies) from the Fab (antigen-binding) portion. Papain is a relatively heat-resistant enzyme, with an optimal temperature range of 60 and 70 °C."}, {"url": "http://www.urbandictionary.com/define.php?term=poppin", "passage_text": "Poppin'. 1. verb A greeting, commonly preceeded by what's, meaning essentially the same as 'what's up'. 2. verb To be shooting groups of 2 or more people; to 'pop' them. 3. verb Usually proceeded by 'pussy', this can be abbreviated to mean the same thing. Pussy Poppin' is the art of a woman bending over during a dance to reveal her vagina, so that her dance partner can effectivley 'pop' it. 1."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-69-PAPAIN.aspx?activeIngredientId=69&activeIngredientName=PAPAIN", "passage_text": "It is used as a digestive aid and for treating parasitic worms, inflammation of the throat and pharynx, shingles (herpes zoster) symptoms, ongoing diarrhea, hay fever, runny nose, and a skin condition called psoriasis. Pregnancy and breast-feeding: Taking papain by mouth during pregnancy is POSSIBLY UNSAFE. There is a concern that it might cause birth defects or miscarriage. Not enough is known about the safety of using papain during breast-feeding. Do not use it if you are pregnant or breast-feeding."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-69-PAPAIN.aspx?activeIngredientId=69&activeIngredientName=PAPAIN", "passage_text": "It can cause irritation of the throat and stomach. Taking large amounts of papain by mouth is POSSIBLY UNSAFE. In excessive doses, papain can cause severe throat damage. Also, applying raw papain to the skin is POSSIBLY UNSAFE. Pregnancy and breast-feeding: Taking papain by mouth during pregnancy is POSSIBLY UNSAFE. There is a concern that it might cause birth defects or miscarriage. Not enough is known about the safety of using papain during breast-feeding. Do not use it if you are pregnant or breast-feeding."}, {"url": "https://en.wikipedia.org/wiki/Papain", "passage_text": "Papain is usually produced as a crude, dried material by collecting the latex from the fruit of the papaya tree. The latex is collected after scoring the neck of the fruit, where it may either dry on the fruit or drip into a container. This latex is then further dried. In immunology, papain is known to cleave the Fc (crystallisable) portion of immunoglobulins (antibodies) from the Fab (antigen-binding) portion. Papain is a relatively heat-resistant enzyme, with an optimal temperature range of 60 and 70 °C."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-69-PAPAIN.aspx?activeIngredientId=69&activeIngredientName=PAPAIN", "passage_text": "Papain is LIKELY SAFE when taken by mouth in amounts commonly found in foods. It is POSSIBLY SAFE when taken by mouth in medicinal amounts and when applied the skin as a solution in appropriate amounts. Pregnancy and breast-feeding: Taking papain by mouth during pregnancy is POSSIBLY UNSAFE. There is a concern that it might cause birth defects or miscarriage. Not enough is known about the safety of using papain during breast-feeding. Do not use it if you are pregnant or breast-feeding."}, {"url": "https://en.wikipedia.org/wiki/Papain", "passage_text": "Papain belongs to a family of related proteins with a wide variety of activities, including endopeptidases, aminopeptidases, dipeptidyl peptidases and enzymes with both exo-and endo-peptidase activity. In immunology, papain is known to cleave the Fc (crystallisable) portion of immunoglobulins (antibodies) from the Fab (antigen-binding) portion. Papain is a relatively heat-resistant enzyme, with an optimal temperature range of 60 and 70 °C."}]