[{"url": "https://en.wikipedia.org/wiki/Spore", "passage_text": "In biology, a spore is a unit of asexual reproduction that may be adapted for dispersal and for survival, often for extended periods of time, in unfavorable conditions. By contrast, gametes are units of sexual reproduction. Spores form part of the life cycles of many plants, algae, fungi and protozoa. Heterosporous plants, such as seed plants, spikemosses, quillworts, and some aquatic ferns produce spores of two different sizes: the larger spore (megaspore) in effect functioning as a female spore and the smaller (microspore) functioning as a male."}, {"url": "https://answers.yahoo.com/question/index?qid=20130303004823AAzT0h0", "passage_text": "Best Answer: B Gametes are produced during the process gametogenesis, which is part of the larger reproductive cycle in plants. Extra info: The gametes are formed by meiotic cell division (which is meiosis since there is a mixing of genes) from a diploid (2 copies of chromosome) sporophytic cells. The plant life cycle produces gametes by ________ and spores are produced by _______. Answer a. meiosis, mitosis b. gametogenesis, sporogenesis c. fertilization, germination d. mitosis, meiosis. Follow. 3 answers 3."}, {"url": "http://herbarium.usu.edu/fungi/FunFacts/Dispersal.htm", "passage_text": "Spore release in mushrooms is not completely understood. Cells called basidia produce spores, which cover the surface of the gills or pores on the underside of a mushroom's cap. Mushrooms and other fungi that possess basidia are known as Basidiomycetes. Bird's nest fungi produce spore-containing eggs in a splash cup. When raindrops hit the cup, its shape causes the spores to be splashed out and away from it. Truffles are an example of passive dispersal by animals. Truffles are produced below ground, so they have to be unearthed to be dispersed."}, {"url": "https://en.wikipedia.org/wiki/Spore", "passage_text": "Spores are usually haploid and unicellular and are produced by meiosis in the sporangium of a diploid sporophyte. Under favourable conditions the spore can develop into a new organism using mitotic division, producing a multicellular gametophyte, which eventually goes on to produce gametes. Heterosporous plants, such as seed plants, spikemosses, quillworts, and some aquatic ferns produce spores of two different sizes: the larger spore (megaspore) in effect functioning as a female spore and the smaller (microspore) functioning as a male."}, {"url": "https://en.wikipedia.org/wiki/Sporogenesis", "passage_text": "Dormant spores are formed, for example by certain fungi and algae, primarily in response to unfavorable growing conditions. Most eukaryotic spores are haploid and form through cell division, though some types are diploid or dikaryons and form through cell fusion. In flowering plants, microspores are produced in the anthers of flowers. Each anther contains four pollen sacs, which contain the microsporocytes. After meiosis, each microspore undergoes mitotic cell division, giving rise to multicellular pollen grains (six nuclei in gymnosperms, three nuclei in flowering plants)."}, {"url": "https://en.wikipedia.org/wiki/Spore", "passage_text": "The spores of seed plants, however, are produced internally and the megaspores, formed within the ovules and the microspores are involved in the formation of more complex structures that form the dispersal units, the seeds and pollen grains. Heterosporous plants, such as seed plants, spikemosses, quillworts, and some aquatic ferns produce spores of two different sizes: the larger spore (megaspore) in effect functioning as a female spore and the smaller (microspore) functioning as a male."}, {"url": "https://wikis.engrade.com/plants18", "passage_text": "1. The spores of seedless plants grow into plants that produce sex cells. 2. All nonvascular and some vascular plants are seedless. B. Moss plants have a life cycle that illustrates typical sexual reproduction in nonvascular seedless plants. 1. For these types of plants, the fertilization process occurs after, rather than before, the spores are dispersed. When the air outside becomes dry, pressure builds up inside the plant. The pressure then forces the plant to eject thousands of small cells, known as spores, into the air."}, {"url": "https://en.wikipedia.org/wiki/Sporogenesis", "passage_text": "Sporogenesis is the production of spores in biology. The term is also used to refer to the process of reproduction via spores. Reproductive spores were found to be formed in eukaryotic organisms, such as plants, algae and fungi, during their normal reproductive life cycle. In flowering plants, microspores are produced in the anthers of flowers. Each anther contains four pollen sacs, which contain the microsporocytes. After meiosis, each microspore undergoes mitotic cell division, giving rise to multicellular pollen grains (six nuclei in gymnosperms, three nuclei in flowering plants)."}, {"url": "https://answers.yahoo.com/question/index?qid=20130303004823AAzT0h0", "passage_text": "After this meiotic division occurs there is mitotic division (making of copies) to create a multicellular gametophyte. Spores, then, are produced during sporogenesis and this process also uses meiotic cell division (meiosis), which is why answers A and B are incorrect. The plant life cycle produces gametes by ________ and spores are produced by _______. Answer a. meiosis, mitosis b. gametogenesis, sporogenesis c. fertilization, germination d. mitosis, meiosis. Follow. 3 answers 3."}]