[{"url": "http://www.maremmaguide.com/merry-christmas-in-italian.html", "passage_text": "and other Italian Christmas phrases. How to say Merry Christmas in Italian and a Happy New Year, together with all the other Italian christmas card messages or phrases you need to know to see you through the festive season and into New Year's day."}, {"url": "http://www.answers.com/Q/What_is_the_phrase_'Merry_Christmas_and_Happy_New_Year'_in_Italian", "passage_text": "Buon Natale e Felice Anno Nuovo is an Italian equivalent of 'Merry Christmas and Happy New Year'. In the word by word translation, the masculine adjective 'buon' means 'good'. The masculine gender noun 'Natale' means 'Nativity'. The conjunction 'e' means 'and'."}, {"url": "http://www.answers.com/Q/What_is_the_phrase_'Merry_Christmas_and_Happy_New_Year'_in_Italian", "passage_text": "Buon Natale and Felice Anno Nuovo may be Italian equivalents of 'Merry Christmas' and 'Happy New Year'. In the word by word translation, the masculine adjective 'buon' means ' … good'. The masculine gender noun 'Natale' means 'Nativity'. The adjective 'felice' means 'happy'."}, {"url": "http://www.maremmaguide.com/merry-christmas-in-italian.html", "passage_text": "How to say Happy Christmas or Merry Christmas in Italian and more... Simple, for both Happy Christmas and Merry Christmas it is: Buon Natale! . Or, Merry Christmas and a Happy New Year is Buon Natale e un Felice Anno Nuovo . Or, more generally, Happy Holidays is Buone Feste ."}, {"url": "http://dictionary.reverso.net/english-italian/Best%20wishes", "passage_text": "* Merry Christmas and a happy New Year Buon Natale e Felice Anno Nuovo. * With season's greetings and very best wishes from Auguri di Buone Feste da. * May I send you all our very best wishes for 1995 i nostri migliori auguri per un felice 1995."}, {"url": "http://www.infoplease.com/ipa/A0923039.html", "passage_text": "Ways to say Happy New Year in such languages as Arabic, Chinese (Cantonese and Mandarin), French, Hebrew, Korean, Swedish, Vietnamese, and more. See also Names for Santa Around the World, Greetings Around the World, Thank You Around the World, and Saying “Merry Christmas” or “Season's Greetings”Around the World."}, {"url": "http://www.answers.com/Q/What_is_the_phrase_'Merry_Christmas_and_Happy_New_Year'_in_Italian", "passage_text": "Merry Christmas and Happy New Year to you and your family! in  English means Buon Natale e felice anno nuovo a te ed alla tua  famiglia! or Buon Natale e felice anno nuovo … a te e alla tua  famiglia! in Italian."}]