[{"url": "http://www.buzzle.com/articles/scandium-uses.html", "passage_text": "Scandium Uses. Scandium is a transition metal element, which was discovered in 1879. It has since found various applications in different fields. Find out more about its uses, and also some interesting facts about this metal, in this article. Scandium-46, which is a radioactive isotope of the element, is used in oil refineries, where it plays the role of a tracing agent. The compound scandium triflate acts as a catalyst in organic chemistry. Scandium can also be used for the purpose of polishing glass."}, {"url": "http://www.buzzle.com/articles/scandium-uses.html", "passage_text": "Scandium is a light metal, and it has a soft and smooth texture. Here are some interesting facts about this element: Important Uses. The use of scandium started only in the 1970s,(;) this was mainly due to the fact that, it was not readily available. Scandium-46, which is a radioactive isotope of the element, is used in oil refineries, where it plays the role of a tracing agent. The compound scandium triflate acts as a catalyst in organic chemistry. Scandium can also be used for the purpose of polishing glass."}, {"url": "https://en.wikipedia.org/wiki/Scandium", "passage_text": "The main application of scandium by weight is in aluminium-scandium alloys for minor aerospace industry components. These alloys contain between 0.1% and 0.5% of scandium. They were used in the Russian military aircraft, specifically the MiG-21 and MiG-29. The properties of scandium compounds are intermediate between those of aluminium and yttrium. A diagonal relationship exists between the behavior of magnesium and scandium, just as there is between beryllium and aluminium."}, {"url": "http://education.jlab.org/itselemental/ele021.html", "passage_text": "Metallic scandium was first produced in 1937 and the first pound (0.45 kilograms) of pure scandium was produced in 1960. Scandium is a soft, light metal that might have applications in the aerospace industry. With a cost of $270 per gram ($122,500 per pound), scandium is too expensive for widespread use. Alloys of scandium and aluminum are used in some kinds of athletic equipment, such as aluminum baseball bats, bicycle frames and lacrosse sticks. It is expected that scandium-aluminum alloys will be important in the manufacture of fuel cells"}, {"url": "http://www.buzzle.com/articles/scandium-uses.html", "passage_text": "One of its most important uses is for preparing aluminum-scandium alloy, which is used in the aerospace industry during the manufacturing of aircraft. When added in a trace amount (about 0.1% to 0.5%) to aluminum, it increases the strength of aluminum manifold, without increasing its weight. Scandium-46, which is a radioactive isotope of the element, is used in oil refineries, where it plays the role of a tracing agent. The compound scandium triflate acts as a catalyst in organic chemistry. Scandium can also be used for the purpose of polishing glass."}, {"url": "http://www.chemicool.com/elements/scandium.html", "passage_text": "Uses of Scandium. Scandium is used in aluminum-scandium alloys for aerospace industry components and for sports equipment such as bicycle frames, fishing rods, golf iron shafts and baseball bats. (1) . Scandium is used in aluminum-scandium alloys for aerospace industry components and for sports equipment such as bicycle frames, fishing rods, golf iron shafts and baseball bats. Scandium iodide is used in mercury vapor lamps, which are used to replicate sunlight in studios for the film and television industry. Scandium oxide (scandia), is used to make high intensity “stadium” ligh"}, {"url": "http://wanttoknowit.com/uses-of-scandium/", "passage_text": "Worldwide production remains low, which reduces the applications of this chemical element. Uses of scandium. Scandium is added to aluminum to create a very strong alloy that is used in the aerospace industry. The Russian military aircraft MiG-21 and MiG-29 utilized this material. Due to the high cost, alloys of titanium are much more commonly used in aircraft. 16 Aug, 2011 uses 0. Scandium is the 21st element on the periodic table and is represented by the symbol Sc. It was discovered by Lars Fredrik Nilson in 1879. In its pure form it is silvery-white material and is solid at room temperature. It is commonly produced as a by-product during the extraction of uranium and iron"}, {"url": "https://en.wikipedia.org/wiki/Scandium", "passage_text": "Scandium is a chemical element with symbol Sc and atomic number 21. A silvery-white metallic d-block element, it has historically been sometimes classified as a rare earth element, together with yttrium and the lanthanoids. The properties of scandium compounds are intermediate between those of aluminium and yttrium. A diagonal relationship exists between the behavior of magnesium and scandium, just as there is between beryllium and aluminium."}]