[{"url": "http://www.chka.org/what-is-kenpo/", "passage_text": "Kenpo is a karate style that utilizes circular movements in rapid succession to overwhelm one’s opponent. We emphasize the use of hands and legs equally. The word Kenpo in Japanese means “fist law”."}, {"url": "http://www.sandovalkarate.net/kenpo-5-0-popular/", "passage_text": "Kenpo refers to a number of Japanese martial arts and is known for being a very open system of fighting; as a result, its techniques vary depending on the preferences of the instructor and practitioner. Ed Parker famously created American kenpo after honing his skills under the legendary William Chow."}, {"url": "http://www.urbandictionary.com/define.php?term=Kenpo", "passage_text": "Kenpo is a Japanese Martial Arts form. However, unlike Karate, its origins are linked back to China and still have very strong influences from Chinese systems. The name, kenpo, also sometimes spelled kempo, is derived from the Japanese pronunciation of the Chinese character chuan and fa.."}, {"url": "http://www.qwhatis.com/what-is-kenpo/", "passage_text": "Kenpo is a Japanese type of martial arts but with Chinese origins. “Kenpo”, or sometimes “kempo”, came about as a Japanese way of pronouncing “chuan fa”, a Chinese character."}, {"url": "http://www.qwhatis.com/what-is-kenpo/", "passage_text": "Kenpo’s literal meaning is “method of fist or hand” which is why it is also referred to as a type of “karate”. But because of influences from both Japanese and Chinese techniques, Kenpo evolved into a form of martial arts with a lot of variations."}, {"url": "http://www.bellaonline.com/articles/art29128.asp", "passage_text": "Kenpo is an interesting style of Martial Arts in that it shows how cultures can merge and benefit with learning from one another. Kenpo is a Japanese Martial Arts form. However, unlike Karate, its origins are linked back to China and still have very strong influences from Chinese systems."}, {"url": "http://www.urbin.net/EWW/MA/KF/3D.html", "passage_text": "The following FAQ is for the Kempo/Kenpo arts in general and is not specific to one particular Kempo/Kenpo school. Most of the history and information has a focus towards Kempo systems descending from James Mitose's Kosho-Ryu Kempo."}, {"url": "http://www.bellaonline.com/articles/art29128.asp", "passage_text": "Many people have studied Kenpo, one of the most famous is Elvis Presley, the King. Presley became acquainted with Ed Parker in 1960 and formed a friendship that lasted his lifetime. This was not Presley's first exposure to Martial Arts, nor would it be his last."}, {"url": "http://kenpokarate.com/", "passage_text": "Kenpo Karate was once known as the Ed Parker system because many of the Kenpo instructors trained directly under that great martial artists. However, the founder of Kenpo Karate was not Ed Parker but rather his instructor, Professor William (Willie) K. S. Chow, who began calling his system Kenpo Karate in 1949."}]