[{"url": "http://www.dailymail.co.uk/health/article-24565/What-eating-lunch.html", "passage_text": "This is because women need between 400-600 calories for lunch as fuel to sustain us through a hectic working day. On the other hand, if you're tempted to overeat beware. If we eat too many calories-more than 800 - we can become sluggish, and even fall asleep. "}, {"url": "http://www.nhs.uk/Livewell/Goodfood/Pages/eat-less.aspx", "passage_text": "If you need to lose weight, aim to lose about 0.5-1kg (1lb-2Ib) a week until you reach a healthy weight for your height. You should be able to lose this amount if you eat and drink about 500kcal to 600kcal fewer a day than you need. An important part of a healthy diet is eating the right amount of calories, so that you balance the energy you put into your body with the energy you use. As a guide, men need around 2,500kcal (10,500kJ) a day to maintain a healthy body weight, and women need around 2,000kcal a day (8,400kJ)."}, {"url": "http://www.livestrong.com/article/333407-how-many-calories-should-i-eat-at-lunch/", "passage_text": "Crunching the Numbers. On average, a woman needs 2,000 calories per day, while men need 2,500 calories. Removing 300 calories for snacks -- a rough estimate -- you're left with about 1,700 meal calories for females, and 2,200 meal calories for males. Dividing those numbers by three, the average woman should eat about 565 calories per meal, while the average man should eat about 735 calories per meal. If you eat more snacks, have smaller meals, and vice versa. These numbers work for weight maintenance; if you eat more calories than you burn, you'll gain weight"}, {"url": "https://answers.yahoo.com/question/index?qid=20090811110900AAvMIIe", "passage_text": "lunches should ideally be the biggest meal of the day. It really depends on how much you're eating the rest of the day... breakfast- 400 cal midmorning snack- 100 cal lunch- 500 cal snack- 200 cal dinner- 400 caI Im not sure about fat grams though, so I can't help you on that. This adds up to 1800 calories. Best Answer: Lunches should be around 500 calories or less for girls, not to sound sexist. For example you can get a six inch turkey sandwich at subway that has 28"}, {"url": "http://www.eatingwell.com/blogs/diet_blog/what_does_a_1200_calorie_day_look_like", "passage_text": "Losing weight is about calories in versus calories out. To lose weight, you need to eat fewer calories than you burn each day through exercise and general living. How much you need to eat each day varies based on your height, weight and activity level. Breakfast: Aim for 250 to 300 calories. Think about getting some dairy and fruit at breakfast—the protein from the dairy and fiber in the fruit will keep you feeling full longer. This creamy Banana Spice Smoothie clocks in at 283 calories. Lunch: Aim for 300 to 35"}, {"url": "http://www.eatingwell.com/blogs/diet_blog/what_does_a_1200_calorie_day_look_like", "passage_text": "(Find out how many calories you should be eating each day for weight loss by using this formula: [Your weight x 12] – 500 = Your daily calorie goal.) But most people will lose weight on a 1,200-calorie diet, which is also the lowest you really can go calorie-wise each day while still getting all the nutrients you need. Breakfast: Aim for 250 to 300 calories. Think about getting some dairy and fruit at breakfast—the protein from the dairy and fiber in the fruit will keep you feeling full longer. This creamy Banana Spice Smoothie clocks in at 283 calories. Lunch: Aim for 300 to 35"}, {"url": "http://www.eatingwell.com/nutrition_health/weight_loss_diet_plans/what_does_a_1500_calorie_day_look_like", "passage_text": "Most people will lose weight on a daily diet of 1,500 calories, which is the total calorie count for all the food pictured above. If you want to be even more precise about cutting calories, this simple calculation will give you a daily calorie goal that can help you lose a healthy 1 to 2 pounds per week. Most people will lose weight on a 1500 calorie diet, some on an even higher caloric level. The best gauge for whether you're at the right level is how satisfied you feel (you shouldn't be hungry all day!) and whether you're losing weight. If you're losing weight on 1800 a day and you feel great, stick with that."}, {"url": "https://answers.yahoo.com/question/index?qid=20090613075251AAYjSPr", "passage_text": "Report Abuse. Big breakfast, about 350 calories. Snacks, light snacks in between if you're hungry. Lunch should be about 300. Dinner is about 600. Remember to have snacks, light ones to boost up your metabolism. So that's like 1500 a day if you are counting your snacks."}, {"url": "http://www.popsugar.com/fitness/How-Many-Calories-Should-You-Eat-Lunch-32096199", "passage_text": "Self breaks down the calories, carbs, and everything else that should be in your brown bag. In Self 's October issue, we begged you to give lunch some love — because nearly 85 percent of your eat your desk while multitasking, a habit that leaves you feeling less satisfied and more likely to pig out later. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090811110900AAvMIIe", "passage_text": "this is a good calculator for roughly how many calories you need per day: 655 + (4.3 x weight in lbs) + (4.7 x height in inches) - (4.7 x age) = ____ calories This will keep you at your current weight-- obviously eating less and exercising is how lose weight-- or eating more will make you gain weight. Best Answer: Lunches should be around 500 calories or less for girls, not to sound sexist. For example you can get a six inch turkey sandwich at subway that has 280 calories."}]