[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001141/", "passage_text": "About TB. TB is a contagious and often severe airborne disease caused by infection with Mycobacterium tuberculosis (Mtb). TB typically affects the lungs, but it also can affect any other organ of the body. It is usually treated with a regimen of drugs taken for 6 months to 2 years depending on the type of infection. Tuberculosis (TB). A disease caused by a specific type of bacteria that spreads from one person to another through the air. Tuberculosis can affect many parts of the body, but most often affects the lungs."}, {"url": "http://www.medicinenet.com/tuberculosis_tb_facts/page2.htm", "passage_text": "Tuberculosis (TB) is a multisystemic infectious disease caused by Mycobacterium tuberculosis, a rod-shaped bacterium. TB is the most common cause of infectious disease-related mortality worldwide (about 1.1 million to 1.7 million people die from it each year worldwide). "}, {"url": "https://en.wikipedia.org/wiki/Tuberculosis", "passage_text": "Tuberculosis, MTB, or TB (short for tubercle bacillus), in the past also called phthisis, phthisis pulmonalis, or consumption, is a widespread, infectious disease caused by various strains of mycobacteria, usually Mycobacterium tuberculosis. The classic symptoms of active TB infection are a chronic cough with blood-tinged sputum, fever, night sweats, and weight loss (the last of these giving rise to the formerly common term for the disease, consumption). Infection of other organs causes a wide range of symptoms."}, {"url": "http://www.nhs.uk/Conditions/Tuberculosis/Pages/Causes.aspx", "passage_text": "Causes of tuberculosis. Tuberculosis (TB) is caused by a type of bacterium called Mycobacterium tuberculosis. The condition is spread when a person with an active TB infection in their lungs coughs or sneezes and someone else inhales the expelled droplets, which contain TB bacteria. "}, {"url": "http://www.cdc.gov/tb/topic/basics/default.htm", "passage_text": "Tuberculosis (TB) is caused by a bacterium called Mycobacterium tuberculosis. The bacteria usually attack the lungs, but TB bacteria can attack any part of the body such as the kidney, spine, and brain. If not treated properly, TB disease can be fatal. TB is spread through the air from one person to another. The TB bacteria are put into the air when a person with TB disease of the lungs or throat coughs, sneezes, speaks, or sings. People nearby may breathe in these bacteria and become infected."}, {"url": "http://www.niaid.nih.gov/topics/tuberculosis/Understanding/Pages/cause.aspx", "passage_text": "Bacterium. Mycobacterium tuberculosis bacteria, the cause of TB. Credit: NIAID. Tuberculosis is caused by the infectious agent known as Mycobacterium tuberculosis (Mtb). This rod-shaped bacterium, also called Koch's bacillus, was discovered by Dr. Robert Koch in 1882. This causes an Mtb infection. However, not everyone infected with TB bacteria becomes sick. The bacteria can remain dormant (asleep) for years and not cause any TB disease. This is called latent TB infection. People who have latent TB infection do not get sick and do not spread the bacteria to others."}, {"url": "http://www.who.int/features/qa/08/en/", "passage_text": "A: Tuberculosis (TB) is caused by bacteria (Mycobacterium tuberculosis) that most often affect the lungs. Tuberculosis is curable and preventable. TB is spread from person to person through the air. When people with lung TB cough, sneeze or spit, they propel the TB germs into the air. "}, {"url": "http://www.who.int/mediacentre/factsheets/fs104/en/", "passage_text": "Tuberculosis (TB) is caused by bacteria (Mycobacterium tuberculosis) that most often affect the lungs. Tuberculosis is curable and preventable. TB is spread from person to person through the air. When people with lung TB cough, sneeze or spit, they propel the TB germs into the air. "}, {"url": "http://www.healthgrades.com/conditions/tuberculosis", "passage_text": "Tuberculosis is a serious disease caused by a bacterial infection of the lungs but can also affect other parts of the body, such as the brain, kidneys and bones. Tuberculosis, commonly known as TB, is caused by the bacterium Mycobacterium tuberculosis (M. tuberculosis) . "}, {"url": "http://www.cdc.gov/tb/publications/faqs/qa_introduction.htm", "passage_text": "Tuberculosis (TB) is a disease caused by bacteria called Mycobacterium tuberculosis. The bacteria usually attack the lungs. But TB bacteria can attack any part of the body such as the kidney, spine, and brain. "}]