[{"url": "https://technet.microsoft.com/en-us/library/dd351188(v=exchg.141).aspx", "passage_text": "Remove Windows PowerShell on Windows Server 2003 and Windows XP. In Control Panel, open Add or Remove Programs. Uninstall any instances of Windows PowerShell that appear in the installed programs list or the installed updates list. Windows PowerShell might be listed as a Windows update with the Knowledge Base article number KB926139. Remove Windows PowerShell on Windows Vista. You need to be assigned permissions before you can perform this procedure. To see what permissions you need, see the PowerShell and WinRM installation entry in the Exchange and Shell Infrastructure Permissions topic. In Control Panel, in Programs, open Programs and Features."}, {"url": "https://support.microsoft.com/en-us/kb/950376", "passage_text": "1 Click Start, click Run, type appwiz.cpl, and then click OK. 2  Click to select the Show updates check box. 3  In the Currently installed programs and updates list, click Windows PowerShell(TM) 1.0, and then click Remove. 4  Follow the instructions to uninstall Windows PowerShell 1.0. 1 Follow the instructions to uninstall Windows PowerShell 1.0. 2  Note If you disable Windows PowerShell by using the Turn Windows Features on or off option, this does not satisfy the Compatibility Check process. 3  You must uninstall Windows PowerShell."}, {"url": "https://support.microsoft.com/en-us/kb/950376", "passage_text": "Windows XP. 1  Click Start, click Run, type appwiz.cpl, and then click OK. 2  Click to select the Show updates check box. 3  In the Currently installed programs and updates list, click Windows PowerShell(TM) 1.0, and then click Remove. 4  Follow the instructions to uninstall Windows PowerShell 1.0. 1 Follow the instructions to uninstall Windows PowerShell 1.0. 2  Note If you disable Windows PowerShell by using the Turn Windows Features on or off option, this does not satisfy the Compatibility Check process. 3  You must uninstall Windows PowerShell."}, {"url": "https://support.microsoft.com/en-us/kb/926139", "passage_text": "How to uninstall Windows PowerShell in Windows XP. 1  Click Start, click Run, type appwiz.cpl, and then click OK. 2  Click to select the Show updates check box. 3  In the Currently installed programs list, click Windows PowerShell(TM) 1.0, and then click Remove. 1 Click Start, click Run, type appwiz.cpl, and then click OK. 2  Click to select the Show updates check box. 3  In the Currently installed programs and updates list, locate the entry for the hotfix that installed Windows PowerShell 1.0."}, {"url": "https://social.technet.microsoft.com/Forums/systemcenter/en-US/f004588e-bf93-40fd-a78d-ad7fc8e5d767/action?threadDisplayName=systemcenter&forum=configmgrswdist", "passage_text": "text/html 1/14/2010 7:39:38 PM BigPappaJ 0. I am attempting to do an uninstall of a piece of software as the first step in a program deployment using Powershell. I have the script as well as the .msi file needed in a package on the server. The script simply checks Win32_software to see if the program exists, and if so runs msiexec /uninstall QTAlt-176.msi /qn to uninstall the software. When run locally on the machine, it uninstalls the software fine. When run from PS on the machine with a UNC path to the share on the server, it runs fine."}, {"url": "https://support.microsoft.com/en-us/kb/926139", "passage_text": "How to uninstall Windows PowerShell in Windows Server 2003. 1  Click Start, click Run, type appwiz.cpl, and then click OK. 2  Click to select the Show updates check box. 3  In the Currently installed programs and updates list, locate the entry for the hotfix that installed Windows PowerShell 1.0. 1"}, {"url": "http://techibee.com/powershell/powershell-uninstall-software-on-remote-computer/1400", "passage_text": "It’s time to uninstall a application using powershell. This post is continuation to Powershell: Script to query softwares installed on remote computer where I discussed about procedure to query installed applications on remote computer without using Win32_Product WMI class. The one advantage with Win32_Product WMI class is it’s uninstall() function using which we can trigger uninstallation of softwares on local or remote computer. In this post, I am going to provide a powershell script which provides same functionality as uninstall() function of"}, {"url": "https://support.microsoft.com/en-us/kb/926139", "passage_text": "1 Click Start, click Run, type appwiz.cpl, and then click OK. 2  Click to select the Show updates check box. 3  In the Currently installed programs list, click Windows PowerShell(TM) 1.0, and then click Remove. 4  Follow the instructions to remove the following entry: . 1 Click Start, click Run, type appwiz.cpl, and then click OK. 2  Click to select the Show updates check box. 3  In the Currently installed programs and updates list, locate the entry for the hotfix that installed Windows PowerShell 1.0."}, {"url": "http://lifeofageekadmin.com/how-to-uninstall-programs-using-powershell/", "passage_text": "How To Uninstall Programs Using PowerShell. PowerShell is just one of those tools for Windows that continues to get better and better in uses you find on a day to day basis. One such tedious task is uninstalling programs. Open a PowerShell session and type the following command. This can take awhile to get back results. Get-WmiObject-Class Win32_Product | Select-Object-Property Name. Now that we have a list of the programs installed find the one you want to remove and move on to the next step. Individually uninstalling programs. At this point you can use your favorite editor and create a script or use the PowerShell ISE to test out your command"}]