[{"url": "http://chemistry.about.com/od/waterchemistry/f/Is-Water-A-Compound.htm", "passage_text": "Answer: Yes, water is a compound. A compound forms whenever two or more atoms form chemical bonds with each other. The chemical formula for water is H 2 O, which means each molecule of water consists of one oxygen atom chemically bonded to two hydrogen atoms. Thus, water is a compound. It's also a molecule, which is any chemical species formed by two or more atoms chemically bonded to each other. The terms molecule and compound mean the same thing and can be used interchangeably"}, {"url": "https://en.wikipedia.org/wiki/Chemical_compound", "passage_text": "A chemical element bonded to an identical chemical element is not a chemical compound since only one element, not two different elements, is involved. Examples are the diatomic molecule hydrogen (H 2) and the polyatomic molecule sulfur (S 8). For example, the molecule of the compound water is composed of hydrogen and oxygen in a ratio of 2:1.water. In addition, compounds have a definite set of properties, and the elements that comprise a compound do not retain their original properties."}, {"url": "http://www.answers.com/Q/Is_water_a_compound", "passage_text": "Water is H2O so it is made of 2 different elements-Hydrogen and oxygen. Hydrogen is made out of two atoms hence the subscript number 2. Yes, it has molecules consisting of two hydrogen atoms bonded to one oxygen atom. Water is a compound,because it contains oxygen and hydrogen which are chemically combined in proportion."}, {"url": "http://www.answers.com/Q/Is_water_an_element_compound_or_mixture", "passage_text": "Water itself is a compound. It contains two elements. Because it only contains the one type of particle (i.e. water molecules) it is not a mixture. Water is a compound, H2O. (Not assuming you don't know this.. … .) Salt is also a compound, NaCl. It is made up of Na+ (Sodium) and Cl- (Chloride) ions. Hence its scientific name is Sodium Chloride. When Salt is put in water, it exists in separate Na+ and Cl-ions, not as a whole NaCl molecule."}, {"url": "http://www.answers.com/Q/Is_water_a_compound", "passage_text": "Water is a compound because its molecules are formed of chemically combined elements (hydrogen and oxygen) in a fixed proportion. A mixture is a combination of separate atom … s, molecules, or particles that are not chemically bonded or in any fixed proportion. 2 people found this useful. Alexe Santos. 1 Contribution. Yes, it has molecules consisting of two hydrogen atoms bonded to one oxygen atom. Water is a compound,because it contains oxygen and hydrogen which are chemically combined in"}, {"url": "http://www.answers.com/Q/Is_water_an_element_compound_or_mixture", "passage_text": "It is a mixture. Tap water is mostly water (H2O), which is a compound, but it contains dissolved gases (N2 and O2) and various dissolved mineral salts. The most abundant miner … al in drinking water is usually calcium carbonate. Water is a compound, H2O. (Not assuming you don't know this.. … .) Salt is also a compound, NaCl. It is made up of Na+ (Sodium) and Cl- (Chloride) ions. Hence its scientific name is Sodium Chloride. When Salt is put in water, it exists in separate Na+ and Cl-ions, not as a whole NaCl molecule."}, {"url": "http://education.jlab.org/qa/molecule_01.html", "passage_text": "A molecule is what you get when any atoms join together. A compound is what you get when atoms of two or more different elements join together. All compounds are molecules, but not all molecules are compounds. Water is a molecule because it is made from atoms that have been chemically combined. It is also a compound because the atoms that make water are not all the same-some are oxygen and some are hydrogen. Oxygen in the atmosphere is a molecule because it is made from two atoms of oxygen. It is not a compound because it is made from atoms of only one element-oxygen. This type of molecule is called a diatomic molecule, a molecule made from two atoms of the same type."}, {"url": "https://answers.yahoo.com/question/index?qid=20060830173315AAMjXM5", "passage_text": "A compound, such as water, is made up of hydrogen and oxygen, but these elements do not retain any of the properties they had in isolated form; essentially they form a whole new material. If you apply this defintion, water is a pure compound, not a mixture. Report Abuse. Water is a mixture because it is made up of molecules that are composed of two atoms of hydrogen and one atom of oxygen. An atom is the smallest particle of a pure substance (element) that has all the properties of that substance. A molecule is made up of a number of atoms bonded together"}]