[{"url": "http://money.usnews.com/money/blogs/my-money/2014/06/27/3-ways-to-increase-your-credit-card-spending-limit", "passage_text": "Of the many methods you can use to improve your credit score, increasing your credit limits is one you can employ today. You can usually ask for a credit limit increase after the first six months of opening a credit card. However, plenty of people don’t act to boost their spending limits. See how you can increase your credit limits and how each method can affect your credit score: 1. This usually means a hard pull on your credit reports, which will hurt your credit score. 3. Card limit transfers. The first two methods of getting a credit limit increase are the standard approaches that credit card users take to increase their spending limits. If those two fail, there is one more way – but it is a little more tedious and could negatively affect your credit score"}, {"url": "http://www.creditcards.com/credit-card-news/how-raise-credit_limit-1267.php", "passage_text": "One good reason is to improve your credit score. Lowering your credit utilization ratio, the percentage of your available credit that you are using, can boost your credit score substantially as credit utilization accounts for a big chunk -- 30 percent -- of your FICO score. In general, you should aim to keep your spending far below 30 percent of your credit limit. In other words, if you're spending $1,500 or less a month using a card with a $5,000 limit, you're OK -- though the highest credit scores go to those with spending levels below 10 percent of their limit. "}, {"url": "https://www.freecreditscore.com/blog/rejected-credit-increase-affect-credit/", "passage_text": "Use Less Credit. While you can lower your credit utilization by increasing your credit limit, you can also attack the other side of the issue. If you have 40 percent utilization due to a $1,000 balance and a $2,500 limit, spending or owing less on your credit card will have the same impact as raising your credit limit. Generally, getting denied for a credit increase won’t directly affect your credit report or your credit score. However, while the denial itself doesn’t make a difference, the process leading up to it can. Also, by not getting a credit increase, you’re missing out on the benefits of having additional credit."}, {"url": "http://budgeting.thenest.com/increased-credit-limit-hurt-credit-score-26274.html", "passage_text": "For example, if you have a $10,000 credit line and carry a balance of $4,000, your credit utilization is 40 percent. Your credit score will suffer if your credit utilization is high. The amount you owe on your credit cards plays a role in determining your FICO score. Along with credit utilization, the amount of debt you carry makes up 30 percent of your total score. With an increased credit limit, you may end up incurring more debt, raising the amount that you owe."}, {"url": "http://www.bankrate.com/finance/credit/will-credit-limit-increase-hurt-score.aspx", "passage_text": "Say you are charging that same $600 balance, but your limit is only $1,500. Then, you have a 40 percent utilization rate. If your issuer bumps the limit to $3,000, now your utilization rate has fallen to 20 percent and helps your credit score. This, of course, only works if you can resist the urge to spend more on your card with a bigger credit limit. View your credit report for free at myBankrate. If your issuer finds that you have been using other credit cards and paying those bills on time, they may give you a credit-limit increase to entice you to use their card over others in your wallet."}, {"url": "http://www.bankrate.com/finance/credit/will-credit-limit-increase-hurt-score.aspx", "passage_text": "The lower the rate, the more it boosts your credit score. The goal is to keep the rate below 20 percent. For example, if you have a credit card that has a $3,000 credit limit, ideally you should only charge up to $600, or 20 percent of the limit. View your credit report for free at myBankrate. If your issuer finds that you have been using other credit cards and paying those bills on time, they may give you a credit-limit increase to entice you to use their card over others in your wallet."}, {"url": "https://blog.creditkarma.com/credit-101/credit-questions-answers/credit-qa-series-how-do-credit-limit-increases-affect-my-score/", "passage_text": "1 Receiving a limit increase can help lower your credit utilization rate. 2  If you have $1000 of debt and your limit is only $2000 you are at 50 percent of your utilization. 3  But if you can add another $2000 to your limit you’ll be at 25 percent. 1 Another important part of your credit score is your credit history. 2  For example if you have had a credit card that you opened when you were 18 and you are now 30, that card has 12 years of credit history."}, {"url": "http://www.ehow.com/about_5315218_increased-limit-hurt-credit-score.html", "passage_text": "If you request a credit line increase, you should ask the lender whether it will result in your credit report being pulled. If it does, this will show up as an inquiry on your report and generally remains on your credit report for two years. Too many inquiries can lower your credit score. As a general rule, your credit score will be higher if you keep your credit usage at 30% of your total available credit or less. An increase in your credit limit will lower your debt to credit ratio, provided you do not increase your debt proportionally."}]