[{"url": "http://www.nola.com/saints/index.ssf/2015/08/new_orleans_saints_patriots.html", "passage_text": "Follow @Julie_Boudwin Tweet to @Julie_Boudwin. The 2015 preseason continues Saturday night with the New Orleans Saints (0-1) playing host to the New England Patriots (0-1) at 6:30 p.m. at the Mercedes-Benz Superdome. The game can be seen locally on WVUE-FOX 8."}, {"url": "http://www.patriots.com/news/2012/07/24/patriots-preseason-tv-network", "passage_text": "The Patriots' games on Aug. 9, Aug. 24 and Aug. 29 can be seen live on the Patriots Preseason Television Network, available in all six New England states and Hawaii. Affiliates are listed below. All games will be televised live."}, {"url": "http://www.syracuse.com/sports/index.ssf/2015/01/afc_championship_game_tv_channel_colts_patriots_live_stream_time.html", "passage_text": "AFC Championship Game: Colts-Patriots TV channel information, live stream and kickoff time. Tom Brady. New England Patriots quarterback Tom Brady (12) shouts as he takes the field at Gillette Stadium before an NFL football game against the Denver Broncos on Sunday, Nov. 2, 2014, in Foxborough, Mass."}, {"url": "http://www.patriots.com/news/2012/07/24/patriots-preseason-tv-network", "passage_text": "@patriots. The Patriots' games on Aug. 9, Aug. 24 and Aug. 29 can be seen live on the Patriots Preseason Television Network, available in all six New England states and Hawaii. Affiliates are listed below. All games will be televised live. Read. -Massachusetts-. Boston, Mass. - WBZ-TV Channel 4 (Flagship)."}, {"url": "http://www.syracuse.com/sports/index.ssf/2015/01/afc_championship_game_tv_channel_colts_patriots_live_stream_time.html", "passage_text": "Comments. The Indianapolis Colts will head to New England to take on the Patriots with a trip to the Super Bowl on the line. The AFC Championship Game kicks off at 6:30 p.m. Sunday on CBS. Andrew Luck has carried the Colts this far, but Tom Brady and the Patriots are coming off an impressive offensive effort against the Baltimore Ravens."}]