[{"url": "http://www.jobs-salary.com/bank-of-america-salary.htm", "passage_text": "Bank Of America Salary. A total of 5,369 real salary data listed for Bank Of America."}, {"url": "http://www1.salary.com/Banking-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Banking category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Banking jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K. Browse Banking jobs by salary range: , $30K-$50K, $50K-$80K, $80K-$100K, or. Search by: Keyword Category. Search. Jobs by Salary Ranges: Click a salary category to find jobs in your target salary range. 1  Six Figure Income jobs ($100,000+). 2  High Income jobs ($80,000 - $100,000). 3  Upper Middle Income jobs ($50,000 - $80,000). 4  Middle Income jobs ($30,000 - $50,000)"}, {"url": "http://www.salarylist.com/company/Bank-Of-America-Salary.htm", "passage_text": "Bank of America Salary. Bank of America average salary is $91,006, median salary is $87,547 with a salary range from $24,660 to $400,000. Bank of America salaries are collected from government agencies and companies. Each salary is associated with a real job position"}, {"url": "http://www.indeed.com/salary/Bank-of-America.html", "passage_text": "Average Bank of America salaries for job postings nationwide are 77% higher than average salaries for all job postings nationwide. "}, {"url": "http://www.indeed.com/salary/Edward-Jones-(boa).html", "passage_text": "Average Edward Jones (boa) salaries for job postings nationwide are 56% lower than average salaries for all job postings nationwide. "}, {"url": "http://www.salary.com/", "passage_text": "Timing is a key factor in your job search as well. Of course, people are hired or fired every single day of the year, and companies hold reviews all the time: at the end of the calendar year, end of the fiscal year, the anniversary of your … Read more... The 10 Most Searched Jobs. "}, {"url": "http://careers.bankofamerica.com/us/working-here/benefits-advantages.aspx", "passage_text": "Benefits & Advantages. At Bank of America, our most important asset is our people. Our benefits programs are designed to meet the diverse needs of our employees at every stage of their life and help them plan for tomorrow. 1  Health & Insurance Benefits. 2  Life Management Benefits. Retirement Benefits. Whether our employees are just starting out or well along the way to planning for retirement, Bank of America offers retirement benefits and the tools and resources to help employees meet their future financial goals."}, {"url": "http://www.payscale.com/research/US/Employer=Bank_of_America_Corp._(BOFA)/Salary", "passage_text": "bank of america, Bank of America Corp, Bank Of America Corp., Bankofamerica. About: Bank of America Corporation is an American multinational banking and financial services corporation headquartered in Charlotte, North Carolina. It is the second-largest bank holding company in the United States by assets."}]