[{"url": "https://en.wikipedia.org/wiki/Stepping_(African-American)", "passage_text": "Stepping may also draw from elements of gymnastics, break dance, tap dance, march, or African and Caribbean dance, or include semi-dangerous stunts as a part of individual routines. The speed of the step depends on the beat and rhythm the performer wants it to sound. Though stepping may be performed by an individual, it is generally performed by groups of three or more, often in arrangements that resemble military formations."}, {"url": "https://en.wikipedia.org/wiki/Step_dance", "passage_text": "Limb movements and styling are either restricted or considered irrelevant. Tap dancing is probably the most popular form of step dancing taking its influence from a variety of older step-forms. A traditional form of individual step dancing is still found in certain areas of England such as East Anglia and Dartmoor. This style of dance is commonly performed informally in pubs to traditional folk tunes, with dancers often bringing a wooden board to dance on. Step-dancing can also be found in other countries such as Malambo from Argentina and Zapateado from Mexico. Another form of step dancing, Stepping, has been popularized by National Pan-Hellenic Council. This step dance has African roots and is an African American tradition as well as part of Black History. "}, {"url": "https://en.wikipedia.org/wiki/Stepping_(African-American)", "passage_text": "Stepping or step-dancing is a form of percussive dance in which the participant's entire body is used as an instrument to produce complex rhythms and sounds through a mixture of footsteps, spoken word, and hand claps. Though stepping may be performed by an individual, it is generally performed by groups of three or more, often in arrangements that resemble military formations."}, {"url": "https://www.createspace.com/239497", "passage_text": "Chicago Steppin' Instructional DVD/Video Level I entitled, Learn the fundamentals of Chicago-style Steppin'. Chicago-style Steppin' is an improvisational form of partner dancing originating from the Chicago area, the mecca and Steppin' capitol. The dance form evolved from the early Lindy Hop and Jitterbug Eras in the 1930's & 1940's, and can also be traced back to the ritualistic dances in African culture. By the 1960's, Steppin' was known as the Bop, which evolved into a style all its own called Steppin' as we know it today. Steppin' has a basic dance step that revolves around either a six-count or an eight-count beat to musical sounds of R&B, Jazz, Soul, Neo-Soul or Rap Music."}, {"url": "http://www.wikihow.com/Two-Step", "passage_text": "The two-step, also called the Texas two-step or the country two-step, is a fast traveling dance popular with dancers who enjoy country music. It's danced to music in 2/4 or 4/4 time with a tempo of about 170 beats per minute, and consists of steps that are not much different from an ordinary walking step. "}, {"url": "http://www.stepafrika.org/company/what-is-stepping/", "passage_text": "Step Afrika!, as the first professional dance company dedicated to the tradition of stepping, is evolving the dance form to include other styles, such as Tap, Modern and Hip Hop, and introducing stepping to new audiences around the world. In addition to step shows and competitions on college campuses, today stepping can also be found in schools, churches and community organizations around the country. The form is also spreading its wings to new venues and participants, such as Latino and Asian American Greek-letter organizations."}, {"url": "http://www.steppershistory.org/main.htm", "passage_text": "You can add your definition by using the form below. View Definitions Terms Index. View the Definition index View the Timeline. View Personal Recollections of Steppers. Chicago Style Stepping. Steppin' (stepping)-- a social dance done in time to music that occurs on a steady recognizable 'downbeat'. The ability to take steps to the downbeat and still come back in time with your partner is widely accepted as steppin. "}, {"url": "http://www.wikihow.com/Do-the-Country-Two-Step", "passage_text": "1. Watch videos of people dancing the Country Two-Step. The Country Two-Step, or Texas Two-Step, is a fairly simple dance to learn, but you should get familiar with the types of movements you'll be making. The dance itself is modeled on shuffle-step footwork with minimal upper body movement. There are two dances called the two step: a Country Two-Step and a Nightclub Two-Step. This article will focus on the former. Country Two-Step has its roots in swing and is the most popular country dance among partner dancers."}, {"url": "http://www.stepafrika.org/company/what-is-stepping/", "passage_text": "1 Stepping has been highlighted in motion pictures such as Stomp The Yard, School Daze, Mac and Me, Drumline, and How She Move. 2  Historian Jacqui Malone calls stepping “one of the most exciting dance forms to evolve in the Twentieth Century” in Steppin’ on the Blues, Chicago: University of Illinois Press, 1996. In addition to step shows and competitions on college campuses, today stepping can also be found in schools, churches and community organizations around the country. The form is also spreading its wings to new venues and participants, such as Latino and Asian American Greek-letter organizations."}, {"url": "http://www.stepafrika.org/company/what-is-stepping/", "passage_text": "Stepping is a rising art form and an important part of America’s artistic and cultural heritage. In stepping, the body is used as an instrument to create intricate rhythms and sounds through a combination of footsteps, claps and the spoken word. In addition to step shows and competitions on college campuses, today stepping can also be found in schools, churches and community organizations around the country. The form is also spreading its wings to new venues and participants, such as Latino and Asian American Greek-letter organizations."}]