[{"url": "http://www.infoplease.com/encyclopedia/world/quebec-province-canada-geography.html", "passage_text": "Another industrial center is the region of Jonquiere jonquière And, chicoutimi on The Saguenay river north Of quebec. City in the southeast are The Appalachian, highlands which run parallel to The. St. Lawrence The Gaspe, gaspé peninsula on the south Of. The, st lawrence extends Into the Gulf. Of. st lawrence The Gaspe Gaspé, peninsula on the south of The. St, lawrence extends into The gulf Of. St. Lawrence'quebec s climate is generally, temperate with variations among the. Regions tourism is important throughout the province during the summer, season and in the winter The Laurentian. mts attract. skiers"}, {"url": "http://geography.about.com/od/canadamaps/a/Quebec-City-Facts.htm", "passage_text": "Its 2006 population of 491,142 makes it Quebec's second most populous city (Montreal is the largest) and the tenth most populous city in Canada. 6) Today, Quebec City is one of Canada's largest cities. Most of the economy is based on transportation, tourism, the service sector and defense. A large portion of the city's jobs are also through the provincial government since it is the capital city."}, {"url": "http://www.infoplease.com/encyclopedia/world/quebec-province-canada-geography.html", "passage_text": "Quebec is bounded on the N by Hudson Strait and Ungava Bay, on the E by the Labrador area of Newfoundland and Labrador and the Gulf of St. Lawrence, on the S by New Brunswick and the United States, and on the W by Ontario, James Bay, and Hudson Bay. The Gaspe Gaspé, peninsula on the south of The. St, lawrence extends into The gulf Of. St. Lawrence'quebec s climate is generally, temperate with variations among the. Regions tourism is important throughout the province during the summer, season and in the winter The Laurentian. mts attract. skiers"}, {"url": "https://en.wikipedia.org/wiki/Quebec", "passage_text": "Quebec is Canada's second most populous province, after Ontario. Most inhabitants live in urban areas near the Saint Lawrence River between Montreal and Quebec City, the capital. Approximately half of Quebec residents live in the Greater Montreal Area, including the Island of Montreal. "}, {"url": "http://www.quebec-guidetouristique.travel/geography.aspx", "passage_text": "Quebec is the largest of the 10 Canadian provinces and is located in the north-east corner of the North American continent. It’s the second most populated province in Canada after Ontario. It covers 1 667 441 km2, which represents three times the size of France, five times that of Italy and 54 times the size of Belgium. That’s why the province is the most important producer of pulp and paper in Canada. It’s one of the most important industries for Quebec’s economy. The maple syrup industry is also very important, since Quebec is the world’s largest maple syrup producer. Come see for yourself all the largeness of Quebec’s territory."}, {"url": "http://quebecproject4.weebly.com/physical-features.html", "passage_text": "The waterways that are in Quebec is the St. Lawrence River. It is one of the most important waterways in North America. It crosses southern Quebec west to east covering 1,000 km. It is the main river route in North America. It flows through a vast estuary and the Gulf of Saint Lawrence to the Atlantic. In the far-north, there are mountains such as the Torngat Mountains, the Laruentian Mountains, and the Chic-Choc Mountains. These are just a few mountains in Quebec. There aren't any designs of physical features on the Canadian quarter. The geographical area/region that Quebec is in i s called the Canadian Shield."}, {"url": "https://en.wikipedia.org/wiki/Geography_of_Quebec", "passage_text": "Gulf of St. Lawrence Lowland Forests. Quebec, Canada 's largest province, occupies a vast territory (nearly three times the size of France), most of which is very sparsely populated. More than 90 percent of Quebec's area lies within the Canadian Shield, and includes the greater part of the Labrador Peninsula. The territory of Quebec is extremely rich in resources in its coniferous forests, lakes, and rivers— pulp and paper, lumber, and hydroelectricity are still some of the province's most important industries."}, {"url": "https://en.wikipedia.org/wiki/Geography_of_Quebec", "passage_text": "The far north of the province, Nunavik, is subarctic or arctic and is mostly inhabited by Inuit. The most populous region is the Saint Lawrence River valley in the south, where the capital, Quebec City, and the largest city, Montreal, are situated. The territory of Quebec is extremely rich in resources in its coniferous forests, lakes, and rivers— pulp and paper, lumber, and hydroelectricity are still some of the province's most important industries."}, {"url": "http://www.worldtravelguide.net/canada/quebec/weather-climate-geography", "passage_text": "Geography. The province of Quebec québec is in the east Of, canada with coasts on The North atlantic And hudson And James. Bays The St Lawrence, seaway the major shipping channel of The canadian east, coast cuts through the populous; south the cities Of quebec Québec (And'montreal montréal-canada s) second largest city. stand beside it The province of Quebec québec is in the east Of, canada with coasts on The North atlantic And hudson And James. bays"}, {"url": "https://en.wikipedia.org/wiki/Geography_of_Quebec", "passage_text": "Quebec is bordered by the province of Ontario, James Bay and Hudson Bay (including the circular Nastapoka arc) to the west, the provinces of New Brunswick and Newfoundland and Labrador to the east, the United States (Maine, New Hampshire, Vermont and New York) to the south, and Hudson Strait and Ungava Bay to the north. The territory of Quebec is extremely rich in resources in its coniferous forests, lakes, and rivers— pulp and paper, lumber, and hydroelectricity are still some of the province's most important industries."}]