[{"url": "http://www.wikihow.com/Diagnose-a-Slipping-Clutch-in-Your-Car", "passage_text": "3. Push down on the clutch pedal. Your clutch may need to be replaced if it takes only a little of the pedal movement to disengage it. In this case you should try to adjust it first and make sure that there is about an inch or two (2 to 4 cm) of free movement of the pedal before the clutch starts to disengage. 1 Another way to establish if your clutch needs repair is to test it in a parking lot. 2  With it stopped but running, put the car in 2nd or 3rd gear and let out the clutch. 3  If it does not stall, but the RPMs go up and the vehicle does not move, the clutch is bad and needs to be replaced."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20131208181639AAQGuia", "passage_text": "If your clutch is slipping, engine RPM will rise but your speed does not increase at the same rate. If your clutch is NOT slipping, then engine RPM will increase in sync with your vehicle speed. If it gets really bad, you can push your clutch, rev your engine, and POP your clutch. Your car will slowly increase speed. I looked it up because performance clutch's aren't supposed to slip as much and the two things I got were-Its the same as riding the clutch and Its when you rev your car up and don't go anywhere The only one that makes sense to me is the second one, which would mean the clutch is going..."}, {"url": "http://www.ehow.com/facts_5042902_clutch-slip-drag.html", "passage_text": "Shares & Saves. Save. Clutch slipping and clutch drag are two problems that can occur as clutches wear out. They are opposite problems that can occur with any clutch on any type of vehicle and require some type of repair to remedy the problem lest the clutch system become damaged. Defintion: Slip. When the clutch pedal is pushed, the clutch responds by slipping to prevent jolts to the vehicle or damage to the transmission; however, once the pedal is released, the clutch should not slip. Slip occurs when the drive disk rotates at a different speed than the driven ditch"}, {"url": "http://www.ehow.co.uk/facts_5042902_clutch-slip-drag.html", "passage_text": "When the clutch pedal is pushed, the clutch responds by slipping to prevent jolts to the vehicle or damage to the transmission; however, once the pedal is released, the clutch should not slip. Slip occurs when the drive disk rotates at a different speed than the driven ditch. In addition to general wear and tear, clutch slip can be caused by excess oil on the clutch or problems with the master cylinder, release system or cable adjuster."}, {"url": "http://www.ehow.co.uk/facts_5042902_clutch-slip-drag.html", "passage_text": "Written by faith davies. Clutch slipping and clutch drag are two problems that can occur as clutches wear out. They are opposite problems that can occur with any clutch on any type of vehicle and require some type of repair to remedy the problem lest the clutch system become damaged. In addition to general wear and tear, clutch slip can be caused by excess oil on the clutch or problems with the master cylinder, release system or cable adjuster."}, {"url": "https://en.wikipedia.org/wiki/Clutch_control", "passage_text": "With the clutch pedal completely pressed or a motorcycle's lever pulled entirely towards you, there is no direct link between the engine and the driveshaft, so no power can pass from the engine to the driveshaft and wheels. Slipping the clutch is a popular term in drag racing culture and is done when launching a car, usually in a drag race. Some contend that slipping the clutch is the best way to launch a front-wheel drive (FWD) car as it prevents Torque steering that many FWD cars experience when too much power is put to the front wheels."}, {"url": "https://answers.yahoo.com/question/index?qid=20090924154553AAB7W01", "passage_text": "Don't slip the clutch! When you let off of the clutch and give it gas in first gear, dont rev the motor up and let off of the clutch slowly, do it relativaly quickly. This will keep the clutch between your engine and transmission from 'slipping' and getting too hot. Which leads to premature wear. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070223002139AAdm25r", "passage_text": "Best Answer: NO NO NO!! When you push the clutch to the floor you are disengaging the clutch, as you bring the clutch pedal back to the top with the car in gear you will feel it begin to engage and the car begin to move. If you hold it at this point the clutch plate is slipping on the flywheel. This will prematurely wear the clutch and glaze the fibers of the plate. It has nothing to do with the gears the only thing this is bad for is the clutch plate and flywheel."}]