[{"url": "https://en.wikipedia.org/wiki/Clostridium_tetani", "passage_text": "Clostridium tetani is a rod-shaped, anaerobic bacterium of the genus species Clostridium. Tetanus toxin is a potent neurotoxin. On the basis of weight, tetanospasmin is one of the most potent toxins known (based on tests conducted on mice). The estimated minimum human lethal dose is 2.5 nanograms per kilogram of body weight, or 175 nanograms in a 70 kg (154 lb) human."}, {"url": "http://www.austincc.edu/microbio/2993s/ct.htm", "passage_text": "(1). Etiologic agent and generally characteristics: Clostridium tetani is the specific bacterium that causes the disease Tetanus. (9) This is a comparatively large, anaerobic, spore forming bacterium which stains Gram-positive and is rod shaped. (1). Key tests for identification: Tetanus does not have a specific lab test for diagnosis. In order to identify the disease or diagnose a patient, a doctor generally does a physical examination and obtains medical and vaccination history, while checking for specific signs and symptoms of tetanus."}, {"url": "https://en.wikipedia.org/wiki/Clostridium_tetani", "passage_text": "C. tetani is found as spores in soil or in the gastrointestinal tract of animals. C. tetani produces a potent biological toxin, tetanospasmin, and is the causative agent of tetanus, a disease characterized by painful muscular spasms that can lead to respiratory failure and, in up to 40% of cases, death. Tetanus toxin is a potent neurotoxin. On the basis of weight, tetanospasmin is one of the most potent toxins known (based on tests conducted on mice). The estimated minimum human lethal dose is 2.5 nanograms per kilogram of body weight, or 175 nanograms in a 70 kg (154 lb) human."}, {"url": "http://ideas.health.vic.gov.au/bluebook/tetanus.asp", "passage_text": "Identification. Clinical features. Tetanus is an acute, potentially fatal disease caused by tetanus bacilli multiplying at the site of an injury. These produce an exotoxin that reaches the central nervous system and causes muscle stimulation. Initial features are increased muscle rigidity"}, {"url": "https://en.wikipedia.org/wiki/Clostridium_tetani", "passage_text": "Tetanolysin serves no known benefit to C. tetani. Tetanospasmin is a neurotoxin that causes the clinical manifestations of tetanus. Tetanus toxin is generated in living bacteria, and is released when the bacteria lyse, such as during spore germination or vegetative growth. Tetanus toxin is a potent neurotoxin. On the basis of weight, tetanospasmin is one of the most potent toxins known (based on tests conducted on mice). The estimated minimum human lethal dose is 2.5 nanograms per kilogram of body weight, or 175 nanograms in a 70 kg (154 lb) human."}, {"url": "http://www.answers.com/Q/What_are_the_identifying_characteristics_of_tetanus", "passage_text": "Tetanus [TET-nus] is a condition that affects the nervous system and causes painful, uncontrolled muscle spasms. It is an anaerobic bacterium, Clostridium tetani. It can prod … uce muscle spasms (lockjaw), severe illness or even death, if contracted. Tetanus [TET-nus] is a condition that affects the nervous system and causes painful, uncontrolled muscle spasms. tetanus has killed over 1 million new born babies The onl … y way you can prevent is to get a booster shot once every five years. found this useful."}, {"url": "http://www.cdc.gov/tetanus/about/causes-transmission.html", "passage_text": "Tetanus is an infection caused by bacteria called Clostridium tetani. Tetanus bacteria are everywhere in the environment, including soil, dust and manure. "}, {"url": "https://en.wikipedia.org/wiki/Clostridium_tetani", "passage_text": "Seen here is a diagram depicting the bacterium, Clostridium tetani, which causes the tetanus infection known for its symptoms of muscle spasms and lockjaw. This bacterium is strongly durable due to its endospores, which can carry the infection's DNA even when the bacterium is dead. Tetanus toxin is a potent neurotoxin. On the basis of weight, tetanospasmin is one of the most potent toxins known (based on tests conducted on mice). The estimated minimum human lethal dose is 2.5 nanograms per kilogram of body weight, or 175 nanograms in a 70 kg (154 lb) human."}, {"url": "http://web.uconn.edu/mcbstaff/graf/Student%20presentations/C%20tetani/Ctetani.html", "passage_text": "Clostridium tetani is the bacteria responsible for the often fatal disease tetanus. The word tetanus comes from the Greek word tetanos which means to ‘stretch’. Tetanus is characterized by rigidity and convulsive spasms of skeletal muscle. It wasn’t until 1884 that the cause of the disease was discovered by Carle and Rattone. Transmission is primarily by contaminated wounds. The typical example is stepping on a rusty nail. Tetanus is not contagious from person to person but is infectious as acquired through environmental exposure. Only vaccine-preventable disease that is infectious but not contagious."}, {"url": "https://www.health.ny.gov/diseases/communicable/tetanus/fact_sheet.htm", "passage_text": "Tetanus, commonly called lockjaw, is a serious bacterial disease that affects muscles and nerves. It is characterized by muscle stiffness that usually involves the jaw and neck that then progresses to involve other parts of the body. Death can result from severe breathing difficulties or heart abnormalities. It is contained in the DTP (diphtheria, tetanus, pertussis), DT (diphtheria, tetanus), DTaP (diphtheria, tetanus, acellular pertussis), Tdap (tetanus, diphtheria and acellular pertussis), and Td (tetanus and diphtheria) vaccines."}]