[{"url": "http://body-motion.co.uk/injuries/mid-back-pain/intercostal-muscle-strain/", "passage_text": "The intercostal muscles consists of several groups of muscles ((internal and external intercostals and subcostal and transverse thoracic muscles) which are located between the ribs and function to move and stabilise the chest wall. "}, {"url": "http://www.wisegeek.org/what-are-intercostal-muscles.htm", "passage_text": "10 most extreme places on Earth. The intercostal muscles are the muscle bands that surround and span between the ribs that alternately lift and compress the rib cage in order to permit respiration. There are two distinct muscle groups: the external and the internal intercostals. The intercostal muscles expand and compress the rib cage to allow your body to breath. The intercostal muscles are those muscle bands that surround the ribs. Intercostal muscles respond to the contraction of the diaphragm. The external intercostal muscles are found in the rib cage."}, {"url": "https://en.wikipedia.org/wiki/Intercostal_muscle", "passage_text": "Intercostal muscles are several groups of muscles that run between the ribs, and help form and move the chest wall. The intercostal muscles are mainly involved in the mechanical aspect of breathing. These muscles help expand and shrink the size of the chest cavity to facilitate breathing. 1 The external intercostals are responsible for the elevation of the ribs and bending them more open, thus expanding the transverse dimensions of the thoracic cavity. 2  Internal intercostal muscles aid in forced expiration (quiet expiration is a passive process)."}, {"url": "http://www.home-remedies-for-you.com/articles/2448/diseases-and-ailments/intercostal-muscle-sprain.html", "passage_text": "The intercostal muscles are located between the ribs. There are eleven intercostal muscles that are located on each side of the rib cage. They function to move and stabilize the chest wall. Intercostal muscles connect one rib to another and aid in breathing by expanding and contracting the ribs effectively. Intercostal muscles play a vital role in the movement of the ribs. When the muscles contract, the ribs move up, and when the muscles relax, they moves down. When breathing, these muscles force air in and out of the chest."}, {"url": "http://www.medguidance.com/thread/Intercostal-Muscles.html", "passage_text": "The intercostal muscles contract during inhalation or deep inspiration to support breathing. The external intercostal muscles contract and elevate the ribs during inspiration while the internal and subcostal (innermost) muscles lower your ribs during forced exhalation. There are two types of intercostal muscles: the internal and the external intercostal muscles. These muscles have blood vessels and nerves, which are also found in the intercostal space between ribs."}, {"url": "http://www.medguidance.com/thread/Intercostal-Muscles.html", "passage_text": "The muscles found between your ribs are called intercostal muscles. Together with other chest muscles, the internal and external intercostal muscles allow movement and stabilize your chess wall. However, they can be strained during sports or other conditions when sudden twisting of upper body occurs. Read this article for full understanding of intercostal muscles and its strain. There are two types of intercostal muscles: the internal and the external intercostal muscles. These muscles have blood vessels and nerves, which are also found in the intercostal space between ribs."}, {"url": "http://www.healthline.com/human-body-maps/intercostal-muscles", "passage_text": "The three layers are: external intercostal muscles, internal intercostal muscles, and the innermost intercostal muscles. These muscles are innervated and supplied with blood by the intercostal nerves, intercostal veins, and intercostal arteries. They raise the ribs and expand the chest cavity, and originate from ribs one through 11, with insertion from ribs two to 12. The internal intercostal muscles are responsible for forced exhalation. They depress the ribs and decrease space in the chest cavity."}, {"url": "https://en.wikipedia.org/wiki/Intercostal_muscle", "passage_text": "1 External intercostal muscles aid in quiet and forced inhalation. 2  They originate on ribs 1-11 and have their insertion on ribs 2-12. 3  The external intercostals are responsible for the elevation of the ribs and bending them more open, thus expanding the transverse dimensions of the thoracic cavity. 1 The external intercostals are responsible for the elevation of the ribs and bending them more open, thus expanding the transverse dimensions of the thoracic cavity. 2  Internal intercostal muscles aid in forced expiration (quiet expiration is a passive process)."}, {"url": "http://www.healthline.com/human-body-maps/intercostal-muscles", "passage_text": "Intercostal muscles are muscle groups that are situated in between the ribs that create and move the chest wall. The muscles are broken down into three layers, and are primarily used to assist with the breathing process. They raise the ribs and expand the chest cavity, and originate from ribs one through 11, with insertion from ribs two to 12. The internal intercostal muscles are responsible for forced exhalation. They depress the ribs and decrease space in the chest cavity."}]