[{"url": "http://health.cvs.com/GetContent.aspx?token=f75979d3-9c7c-4b16-af56-3e122a3f19e3&chunkiid=535597", "passage_text": "Symptoms TOP. Withdrawal symptoms are different based on what you used. Symptoms may include: 1  Marijuana—loss of appetite, chills, weight loss, trouble sleeping or sleeping too much, irritability, feeling restless or nervous. 2  Alcohol—shaking, hallucinations, seizures, confusion, anxiety, sweating, nausea. 1 Marijuana—loss of appetite, chills, weight loss, trouble sleeping or sleeping too much, irritability, feeling restless or nervous. 2  Alcohol—shaking, hallucinations, seizures, confusion, anxiety, sweating, nausea. 3  Barbiturates—weakness, tremors, hallucinations, lack of appetite, seizures."}, {"url": "http://www.nytimes.com/health/guides/disease/alcohol-withdrawal", "passage_text": "Back to Top Symptoms. Alcohol withdrawal symptoms usually occur within 8 hours after the last drink, but can occur days later. Symptoms usually peak by 24 - 72 hours, but may persist for weeks. Back to Top Causes. Alcohol withdrawal occurs most often in adults, but it may occur in teenagers or children. The more you drink every day, the more likely you are to develop alcohol withdrawal symptoms when you stop drinking. You may have more severe withdrawal symptoms if you have certain other medical problems."}, {"url": "http://www.alcoholic.org/research/alcohol-withdrawal-treatment/", "passage_text": "Symptoms of Withdrawal from Alcohol. Alcoholics may experience symptoms of withdrawal as soon as five to 10 hours after the last time they consumed alcohol. These symptoms may persist for several weeks after withdrawal has begun. In most cases, the worst symptoms of withdrawal are experienced two to three days after withdrawal. "}, {"url": "http://umm.edu/health/medical/ency/articles/alcohol-withdrawal", "passage_text": "Symptoms. Alcohol withdrawal symptoms usually occur within 8 hours after the last drink, but can occur days later. Symptoms usually peak by 24 - 72 hours, but may persist for weeks. Common symptoms include: 1  Anxiety or nervousness. 2  Depression. Alcohol withdrawal occurs most often in adults, but it may occur in teenagers or children. The more you drink every day, the more likely you are to develop alcohol withdrawal symptoms when you stop drinking."}, {"url": "http://www.treatment4addiction.com/treatment/withdrawal/", "passage_text": "Withdrawal is caused by the separation of oneself from something else. In this case; withdrawal refers to the discontinuation using of mind-altering substances such as prescription medications, recreational drugs or alcohol. Withdrawal symptoms can occur after prolonged usage of a substance suddenly stops."}, {"url": "http://coordinatedhealth.com/condition/alcohol-withdrawal/", "passage_text": "Symptoms. Alcohol withdrawal symptoms usually occur within 8 hours after the last drink, but can occur days later. Symptoms usually peak by 24 – 72 hours, but may persist for weeks. Common symptoms include: 1  or nervousness. Alcohol withdrawal occurs most often in adults, but it may occur in teenagers or children. The more you drink every day, the more likely you are to develop alcohol withdrawal symptoms when you stop drinking. You may have more severe withdrawal symptoms if you have certain other medical problems."}, {"url": "http://www.treatment4addiction.com/addiction/alcohol/withdrawal/", "passage_text": "Severe alcohol withdrawal symptoms include: In extreme cases, alcohol withdrawal symptoms can be so severe in nature that they become fatal. It is recommended that alcoholics undergo a medical detox when symptoms are considered moderate, severe, or a combination of both. Severe symptoms of alcohol withdrawal are usually experienced by people who have been drinking for a long period of time and acquired a tolerance for alcohol. Thus, their bodies have started to require higher and higher doses in order to feel the same effects of alcohol"}, {"url": "http://www.choosehelp.com/topics/alcoholism/alcohol-abuse-and-stomach-pain-its-probably-gastritis.html", "passage_text": "In the chronic phase, the pain tends to be ever present but dull, and the other symptoms can include a loss of appetite and bloated feelings. Alcohol is an irritant, as are coffee and cigarettes. Certain medications such as aspirin and non steroidal anti-inflammatory drugs like ibuprofen may also cause gastritis. "}]