[{"url": "http://www.campusexplorer.com/college-advice-tips/221E2361/How-Long-Does-It-Take-to-Get-a-Bachelor-s-Degree/", "passage_text": "Know your options before beginning your bachelor’s degree program. Print. It’s a common misconception that bachelor’s degrees always take four years to complete. Four years is the traditional amount of time many students take to earn a bachelor’s degree, but it’s different for non-traditional adult students. Online bachelor’s degree programs typically take between three and five years, depending on the amount of time you have to devote to your studies. The required courses are similar to a campus-based program, but are completed either mostly or entirely on the computer."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_earn_a_bachelor's_degree_in_part_time_studies", "passage_text": "How long it will take as a part-time student will be dependent on how many credits you register for per semester. Part-time is classified as less than 12 credit hours per semester. This means anywhere from 1 to 11 credits. It would take four years at a four year college or university to earn a BSN (Bachelor of Science in Nursing). Many colleges have RN to BSN transition programs. Those nurses earn an associate degree, work in the filed for a few years, then come back to finish the bachelor's."}, {"url": "https://answers.yahoo.com/question/index?qid=20080731092733AAKFSLM", "passage_text": "Rating Newest Oldest. Best Answer: * Associates - 2 years (60 hours) * Bachelor's - 4 years (120 hours) - Associates degree classes may transfer into the bachelor's degree. * Master's - 1-2 years (30-45 hours) Most full-time students do 30 hours per year. If you attend part-time then it will take longer"}, {"url": "http://www.brighthub.com/education/college/articles/87753.aspx", "passage_text": "An undergraduate degree, also known as a bachelors degree, is an entry level requirement for many jobs. Most undergraduate degrees take about 4 years to complete. There are many factors that affect how long it takes to get a bachelors degree. slide 1 of 6. It usually takes 4 years to get an undergraduate degree. Some undergraduate degree programs take as little as 3 years and some take as long as 4 years to complete"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_a_bachelor's_degree_as_part_time_student", "passage_text": "Well an associates degree is a two year degree while a bachelors is four. Not all major will transfer from an associates to a bachelors. For example you can get an assoc … iates in nursing and go on later to get your bachelors and it only be about two more years. all bachelors degrees take 4 years at an accredited university. this could be longer or shorter (+/- 1 year) depending on whether you are transferring in AP or other col … lege credits, and if you go to school full or part time."}, {"url": "http://www.mcmaster.ca/parttime/top-10-Questions-FAQ.html", "passage_text": "3. How long will it take me to do a degree part-time? A three-level degree program usually takes three years to complete on a full-time basis. On a part-time basis, without interruption, it can take six-seven years to complete a three-level program. This may be shorter or longer depending on how many units you can complete each year. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_earn_a_bachelor's_degree_in_part_time_studies", "passage_text": "The bachelors degree is designed as a four year program of study as a full-time student with an average credit load of 15 credit hours per semester (for institutions that operate on a regular two semester academic year). It would take four years at a four year college or university to earn a BSN (Bachelor of Science in Nursing). Many colleges have RN to BSN transition programs. Those nurses earn an associate degree, work in the filed for a few years, then come back to finish the bachelor's."}, {"url": "http://learn.org/articles/How_Long_Do_Undergraduate_Degrees_Take_to_Earn.html", "passage_text": "Completion Time for Bachelor's Degrees. It generally takes full-time students four years to earn a bachelor's degree. Degree completion for part-time students depends on the number of courses taken per semester, and times can vary greatly. Some colleges also offer fast-track programs that enable students to earn their degrees in an accelerated time period. The length of time it takes to earn an undergraduate degree depends on the level of degree you're pursuing and whether you attend college part-time or full-time. However, other factors come in to play. The following article explains how long it may take to earn different undergraduate degrees."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_a_bachelor's_degree_as_part_time_student", "passage_text": "Answer     It usually takes about four years to get a Bachleor's in Ed. but it can be done in less time if your that dedicated.       General … ly it takes 5 years to complete a Bachelor's degree in Education, this includes your student teaching. all bachelors degrees take 4 years at an accredited university. this could be longer or shorter (+/- 1 year) depending on whether you are transferring in AP or other col … lege credits, and if you go to school full or part time."}]