[{"url": "https://en.wikipedia.org/wiki/Chimpanzee%E2%80%93human_last_common_ancestor", "passage_text": "The chimpanzee–human last common ancestor, or CHLCA, is the last species shared as a common ancestor by humans and chimpanzees; it represents the node point at which the line to genus Homo split from genus Pan. In effect, there is now no a priori reason to presume that human-chimpanzee split times are especially recent, and the fossil evidence is now fully compatible with older chimpanzee–human divergence dates [7 to 10 Ma..."}, {"url": "https://answers.yahoo.com/question/index?qid=20060921030836AAiqQ2b", "passage_text": "Direct from source: 1. Humans and other apes are descended from a common ancestor whose population split to become two (and more) lineages. The question is rather like asking, If many Americans and Australians are descended from Europeans, why are there still Europeans around?. Apes are still around because humans evolved into humans as we are now and apes evolved into different apes better suited to their environments. thats why there are so many different types of apes, from gorilla to marmasett. jonny Atlantis · 9 years ago."}, {"url": "http://www.livescience.com/32503-why-havent-all-primates-evolved-into-humans.html", "passage_text": "View full size image. Humans did not evolve from apes, gorillas or chimps. We are all modern species that have followed different evolutionary paths, though humans share a common ancestor with some primates, such as the African ape. The timeline of human evolution is long and controversial, with significant gaps."}, {"url": "http://www.amnh.org/exhibitions/permanent-exhibitions/human-origins-and-cultural-halls/anne-and-bernard-spitzer-hall-of-human-origins/understanding-our-past/dna-comparing-humans-and-chimps", "passage_text": "So Much Alike... Human and chimp DNA is so similar because the two species are so closely related. Humans, chimps and bonobos descended from a single ancestor species that lived six or seven million years ago. As humans and chimps gradually evolved from a common ancestor, their DNA, passed from generation to generation, changed too. In fact, many of these DNA changes led to differences between human and chimp appearance and behavior. © AMNH Exhibitions."}, {"url": "http://science.howstuffworks.com/life/evolution/humans-descended-from-apes.htm", "passage_text": "One of the most persistent myths, however, concerns the relationship of humans to great apes, a group of primates that includes the gorilla, orangutan and chimpanzee. Someone who believes the myth will say, If evolution exists, then humans must be descended directly from apes. That's not to say humans and apes aren't related, but the relationship can't be traced backward along a direct line of descent, one form morphing into another. It must be traced along two independent lines, far back into time until the two lines merge."}, {"url": "https://answersingenesis.org/genetics/dna-similarities/what-about-the-similarity-between-human-and-chimp-dna/", "passage_text": "This, of course, does not mesh with Genesis 1–2. Evolutionists frequently assert that the similarity in DNA sequences provides evidence that all organisms (especially humans and chimps) are descended from a common ancestor. However, DNA similarity could just as easily be explained as the result of a common Creator. "}, {"url": "http://scienceblogs.com/gregladen/2010/06/25/falsehood-humans-evolved-from/", "passage_text": "Yes and no. Humans descend from a population of primates from which other apes also descended (minimally the two species of living chimps) and which was part of the panoply of late Miocene forms, all related to each other, that we call apes. So yes, humans evolved from apes. There are people who don’t believe that. Humans descend from a population of primates from which other apes also descended (minimally the two species of living chimps) and which was part of the panoply of late Miocene forms, all related to each other, that we call apes. So yes, humans evolved from apes"}]