[{"url": "http://solutions.letstruck.com/Answers/View/728/cost+to+run+truck+per+mile", "passage_text": "Maintenance cost per mile is excellent, something has to be wrong with your fuel cost per mile calculation. In the worst case scenario a truck getting 4 mpg and paying $4/gallon for fuel would have a cost per mile of: $1.00 per mile. On the other extreme a truck getting 8mpg and an average fuel cost of $3.80/gallon would have a fuel cost per mile of: .47 cents per mile. You should be somewhere in between."}, {"url": "http://www.smart-trucking.com/trucking-cost-per-mile.html", "passage_text": "Knowing your trucking cost per mile for your business as an owner operator, is critical to your success. I am going to show you how to determine the operating costs per mile for your truck. A trucker needs to understand the costs of operating his rig, in order to turn a good profit in his business. $3,272.82 is the fuel subsidy paid, for a total gross income of $15,544.18, again for 28 days 2, 2 week pay periods, 7904 miles. There are 2 types of operating costs. Fixed operating costs: these are expenses which are paid every month, whether the truck turns a mile or not."}, {"url": "http://businessecon.org/2014/03/cost-per-mile-the-basic-formula/", "passage_text": "The first part is the fixed cost component and the second part is the variable cost component. You add these two together. For this example, the cost per mile to run the cube truck as shown in the image is fixed ($.5649) plus variable ($.31382) or $.87872 per mile. That’s 87.872 cents per mile. For this example, I used estimated number of miles to calculate fixed costs and actual number of miles to calculate variable costs. Fixed costs for a cube truck are approximately 56.49 cents per mile. This is normal for a working truck of this size. For your smaller personal trucks, you are looking between 37 cents and 43 cents per mile for fixed costs."}, {"url": "http://www.thetruckersreport.com/infographics/cost-of-trucking/", "passage_text": "So we are paying .115 per mile compared to your scenario of .02 per mile. You also need to figure in a cost for your overhead. This includes your building, energy, phones, internet, computers, office support, etc. We usually figure a number of $150 per day per truck, which equates to roughly .31 per mile. Tires – Retreading is less expensive than new tires and is a large portion of this cost. Although mere pennies per mile, an average tire can cost over $250 and annual tire expenses can exceed $4,000 ($0.03 per mile), enough to purchase 16 new tires annually, but still not enough to replace every tire of an 18-wheeler."}, {"url": "http://quicktransportsolutions.com/blog/calculating-the-real-cost-of-trucking-per-mile/", "passage_text": "A single truck can cost over $180,000 to keep on the road each year. Over the average mileage of a commercial truck, usually around 130,000 miles, this equates to about $1.38 per mile, but the costs that make up this figure are varied. Truck and driver. The cost of this fuel per mile, depending on efficiency of the truck, is around $0.54. Around $0.07 of this figure goes on fuel taxes, which is a fairly small sum, especially when you compare US trucks to those in Europe, who often pay 60% tax on their diesel. Repairs and maintenance."}, {"url": "http://www.thetruckersreport.com/infographics/cost-of-trucking/", "passage_text": "So if a driver is paid .42 per mile, our real cost of the driver is .56 per mile. Tolls vary from state to state. Our fleet is based in upstate NY – where we have tolls everywhere! We average $900/mo per truck for tolls which equates to roughly .09/mile! Plus the .025/mile for licensing and IFTA taxes. Tires – Retreading is less expensive than new tires and is a large portion of this cost. Although mere pennies per mile, an average tire can cost over $250 and annual tire expenses can exceed $4,000 ($0.03 per mile), enough to purchase 16 new tires annually, but still not enough to replace every tire of an 18-wheeler."}, {"url": "http://www.thetruckersreport.com/infographics/cost-of-trucking/", "passage_text": "$1.38 The average per mile operating cost for the trucking industry. $180,000 The average total yearly cost of operating a commercial truck. The largest operating expense is diesel fuel. A commercial truck can easily consume more than $70,000 of diesel fuel per year. Tires – Retreading is less expensive than new tires and is a large portion of this cost. Although mere pennies per mile, an average tire can cost over $250 and annual tire expenses can exceed $4,000 ($0.03 per mile), enough to purchase 16 new tires annually, but still not enough to replace every tire of an 18-wheeler."}, {"url": "http://quicktransportsolutions.com/blog/calculating-the-real-cost-of-trucking-per-mile/", "passage_text": "Salaries vary, but typically the cost of driver per mile is around $0.36, which means the cost of the truck, cab and driver normally equates to around 42% of the total running costs of keeping trucks on the road, or $0.60 per mile. Fuel. Perhaps the largest expense for any trucking company is the cost of fuel. The cost of this fuel per mile, depending on efficiency of the truck, is around $0.54. Around $0.07 of this figure goes on fuel taxes, which is a fairly small sum, especially when you compare US trucks to those in Europe, who often pay 60% tax on their diesel. Repairs and maintenance."}]