[{"url": "https://scs.fidelity.com/webxpress/help/topics/learn_contributing_ira.shtml", "passage_text": "1 The minimum amount for a brokerage account transfer is $10. 2  The minimum amount for a mutual fund account transfer is $250. 3  The amount must be a whole number (e.g., 1000, not 1000.50). 4  The amount you entered may result in an overcontribution to your IRA for the specified tax year. 1 You can sell a Fidelity mutual fund in a mutual fund account and contribute the cash amount to a brokerage IRA. 2  You can use cash from a brokerage account to contribute to a mutual fund IRA and buy a Fidelity mutual fund. 3  You can contribute cash from a brokerage acc"}, {"url": "https://www.bankofamerica.com/deposits/manage/faq-iras.go", "passage_text": "An IRA is an individual Retirement Account that may provide either a tax-deferred or tax-advantage way for you to save for retirement. There are many different types of IRAs but Roth, Traditional, and Rollover IRAs are the most common. An IRA is simply an account. "}, {"url": "http://finance.zacks.com/much-money-can-rollover-roth-ira-another-retirement-account-1247.html", "passage_text": "Taxable Event. There's no limit on the amount you can roll to a Roth from another retirement account. However, a Roth rollover is a taxable event. Traditional IRAs, 401k plans, 403b plans and 457 plans are typically composed of pretax dollars. Roth IRA contributions come from after-tax dollars. So when you effect the rollover, you have to pay taxes on the money that was originally in a pretax account. You can move money from nearly any retirement account into a Roth. The list of eligible account types includes the 401k, 403b, 457 plan, traditional IRA, SIMPLE IRA and SEP-IRA. You can even roll money from your employee profit-sharing, money purchase and defined benefit plans."}, {"url": "https://scs.fidelity.com/webxpress/help/topics/learn_contributing_ira.shtml", "passage_text": "The maximum amount of an annual IRA contribution for a specified tax year and whether or not your contribution is tax deductible varies depending on a number of factors related to eligibility rules. 1 You can sell a Fidelity mutual fund in a mutual fund account and contribute the cash amount to a brokerage IRA. 2  You can use cash from a brokerage account to contribute to a mutual fund IRA and buy a Fidelity mutual fund. 3  You can contribute cash from a brokerage acc"}, {"url": "https://www.betterment.com/resources/retirement/401ks-and-iras/roth-ira-rules-smart-ways-to-avoid-taxes-on-a-conversion/", "passage_text": "Good news: Roth IRA rules allow you to get around this restriction if you rollover funds from a 401k or traditional IRA to a Roth. There are no income limits for rolling over to a Roth, and no limit on the amount you can roll over. And Betterment is engineered to make any IRA or 401k rollover as seamless as possible. You want to open a Roth IRA to take advantage of those tax-free withdrawals in retirement. But your income is too high (over $129,000 if you’re single or $191,000 if you’re married filing jointly for 2014)."}, {"url": "https://investor.vanguard.com/401k-rollover/ira-choices", "passage_text": "ROTH IRA. Yes, but the amount of your contribution can't exceed the amount of income you earned that year (or that your spouse earned, if you're not working anymore). You're also subject to annual Roth IRA limits ($5,500 for the 2015 tax year, $6,500 if you're age 50 or older)."}, {"url": "https://investor.vanguard.com/401k-rollover/ira-choices", "passage_text": "Also, the amount of your contribution can't exceed the amount of income you earned that year (or that your spouse earned, if you're not working anymore). In addition, you're subject to annual traditional IRA limits ($5,500 for the 2015 tax year, $6,500 if you're age 50 or older). Yes, but the amount of your contribution can't exceed the amount of income you earned that year (or that your spouse earned, if you're not working anymore). You're also subject to annual Roth"}, {"url": "http://www.rothirarules.net/roth-IRA-Rollover.htm", "passage_text": "A Roth IRA has an annual limit on how much can be contributed. However, when it comes to rollovers there is actually no limit at all on how much you can transfer across, or roll over into a standard Roth IRA. The transfer is entirely tax free, and involves the transfer of assets from one retirement plan to another. "}, {"url": "https://www.fidelity.com/retirement-ira/ira-rules-faq", "passage_text": "There are income limits for Roth IRAs. As a single filer, you can make a full contribution to a Roth IRA if your income is less than $114,000 ($114,000 - $129,000 for a partial contribution) in 2014 and $116,000 ($116,000 - $131,000 for a partial contribution) in 2015."}]