[{"url": "http://www.petplace.com/article/cats/behavior-training/normal-behavior/sleep-behavior-of-cats", "passage_text": "There's no doubt about it: cats sure know how to sleep. Although the amount of time spent napping varies from cat to cat, and depends on the cat's age and personality, felines spend an average of 13 to 16 hours each day curled up in slumber. Only the opossum and the bat sleep more – napping away almost 20 hours a day. Nobody is sure why cats sleep so much."}, {"url": "http://www.care2.com/greenliving/how-much-do-cats-sleep.html", "passage_text": "Anywhere from 16 to 20 hours a day, typically. For very young and very old cats, it’s near the upper end of the range, and newborns sleep almost 24/7. While cats do spend at least two-thirds of their lives asleep, they’re not “asleep” in quite the same way humans are."}, {"url": "https://answers.yahoo.com/question/index?qid=20080620095227AAEtAkJ", "passage_text": "It really depends on the age and condition of that cat. A healthy, full grown cat should sleep about 14-16 hours a day. A full grown cat with an illness usually sleeps about 18 hours. Almost all kittens sleep about 17-20 hours a day. Newborn kittens are the ones who sleep for 23"}, {"url": "https://answers.yahoo.com/question/index?qid=20080620095227AAEtAkJ", "passage_text": "Cats sleep a lot and it is perfectly normal. In fact an average house cat will sleep the majority of its life away. It's one of their most favorite activities and they are really good at it. Most cats will sleep about 16 hours a day, and some even more than that. Whoever said it's a dog's life, obviously never spent time with a cat."}, {"url": "http://catfactsblog.info/how-much-do-cats-sleep", "passage_text": "In sleep, as in all things, cats are highly individual. Some cats sleep less than 16 hours a day and some sleep more; some spend as much as thirty or forty percent of their sleep time in a deep sleep cycle (this is particularly true of older cats)."}]