[{"url": "http://www.mayoclinic.org/healthy-lifestyle/fitness/in-depth/exercise-intensity/art-20046887?pg=2", "passage_text": "The basic way to calculate your maximum heart rate is to subtract your age from 220. For example, if you're 45 years old, subtract 45 from 220 to get a maximum heart rate of 175. For example, say your age is 45 and you want to figure out your target heart rate zone for vigorous intensity exercise. Subtract 45 from 220 to get 175 — this is your maximum heart rate. To get the lower end of your target zone, multiply 175 by 0.7 to get 123. To get the higher end, multiply 175 by 0.85 to get 149."}, {"url": "http://goaskalice.columbia.edu/answered-questions/minimum-and-maximum-heart-rate-aerobic-exercise", "passage_text": "Maximum workout heart rate =. (220 - age) X percent of maximum heart rate. (220 - 24) X .60 = 117. (220 - 24) X .80 = 157. According to this formula, Devon should maintain a target heart rate between 117 and 157 bpm to reach 60 to 80 percent of maximum heart rate while working out."}, {"url": "http://www.cdc.gov/physicalactivity/basics/measuring/heartrate.htm", "passage_text": "This maximum rate is based on the person's age. An estimate of a person's maximum age-related heart rate can be obtained by subtracting the person's age from 220. For example, for a 50-year-old person, the estimated maximum age-related heart rate would be calculated as 220 - 50 years = 170 beats per minute (bpm). The 50% and 70% levels would be: 1  50% level: 170 x 0.50 = 85 bpm, and. For example, for a 35-year-old person, the estimated maximum age-related heart rate would be calculated as 220 - 35 years = 185 beats per minute (bpm). The 70% and 85% levels would be: 1  70% level: 185 x 0.70 = 130 bpm, and."}, {"url": "http://www.cdc.gov/physicalactivity/basics/measuring/heartrate.htm", "passage_text": "To calculate this range, follow the same formula as used above, except change 50 and 70% to 70 and 85%. For example, for a 35-year-old person, the estimated maximum age-related heart rate would be calculated as 220 - 35 years = 185 beats per minute (bpm). The 70% and 85% levels would be: 1  70% level: 185 x 0.70 = 130 bpm, and."}, {"url": "http://www.topendsports.com/testing/heart-rate-max.htm", "passage_text": "The maximum heart rate can be estimated using the commonly used formula of 220 minus your age in years (220-age), or a more accurate formula 208 - 0.7 x age (Tanaka et al., 2001). These formula only give an estimation of maximum heart rate-ideally you should measure it. See the discussion on maximum heart rate. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/fitness/in-depth/exercise-intensity/art-20046887?pg=2", "passage_text": "If you're aiming for a target heart rate of 70 to 85 percent, which is in the vigorous range, you would calculate it like this: 1  Subtract your age from 220 to get your maximum heart rate. 2  Multiple that number by 0.7 (70 percent) to determine the lower end of your target heart rate zone. For example, say your age is 45 and you want to figure out your target heart rate zone for vigorous intensity exercise. Subtract 45 from 220 to get 175 — this is your maximum heart rate. To get the lower end of your target zone, multiply 175 by 0.7 to get 123. To get the higher end, multiply 175 by 0.85 to get 149."}, {"url": "http://www.livestrong.com/article/345752-maximum-heart-rate-vs-age/", "passage_text": "By Gender. For men, a simple formula for calculating your maximum heart rate is to subtract your age from 220. If you are 70 years old, this formula would tell you your MHR is 150 beats per minute. Women should use a slightly different calculation based on a 16-year study that tracked women working out on the treadmill. "}, {"url": "http://goaskalice.columbia.edu/answered-questions/minimum-and-maximum-heart-rate-aerobic-exercise", "passage_text": "(220 - age-resting heart rate) X percent of maximum heart rate + resting heart rate. (220 - 24 - 65) X .60 + 65 = 144. (220 - 24 - 65) X .80 + 65 = 170. According to this formula, Devon should maintain a target heart rate between about 140 and 170 bpm to reach 60 to 80 percent of maximum heart rate while working out. (220 - age) X percent of maximum heart rate. (220 - 24) X .60 = 117. (220 - 24) X .80 = 157. According to this formula, Devon should maintain a target heart rate between 117 and 157"}, {"url": "http://my.clevelandclinic.org/services/heart/prevention/exercise/pulse-target-heart-rate", "passage_text": "The maximum heart rate is the highest heart rate achieved during maximal exercise. One simple method to calculate your predicted maximum heart rate, uses this formula: 220 - your age = predicted maximum heart rate. Example: a 40-year-old's predicted maximum heart rate is 180 beats/minute. There are other formulas that take into account the variations in maximal heart rate with age and gender"}]