[{"url": "http://www.mikeblaber.org/oldwine/bch5425/lect13/lect13.htm", "passage_text": "1 The ampicillin resistance gene (ampr) codes for an enzyme (b-lactamase) that is secreted into the periplasmic space of the bacterium where it catalyzes hydrolysis of the b-lactam ring of the ampicillin. "}, {"url": "http://department.monm.edu/chemistry/chemistry330/fall2005/hhawkins/amp_arab_note.htm", "passage_text": "Ampicillin is an antibiotic, normally E. Coli cannot survive in its presence. However, cells that have absorbed the pGLO plasmid can survive in an ampicillin environment. This is because the particular plasmid has a gene that codes for ampicillin resistance. Arabinose is a simple sugar molecule that turns on the gene that codes for GFP production."}, {"url": "https://en.wikipedia.org/wiki/Ampicillin", "passage_text": "Ampicillin is an antibiotic used to prevent and treat a number of bacterial infections. This includes respiratory tract infections, urinary tract infections, meningitis, salmonella infections, and endocarditis. It may also be used to prevent group B streptococcal infection in newborns. "}, {"url": "http://www.answers.com/Q/What_is_the_purpose_of_an_ampicillin_resistance_gene_in_cloning", "passage_text": "The function of a selectable marker gene is to provide the host containing the plasmid a certain property that is not inherently present in the host. For example, the AmpR gene codes for a protein that makes cells containing this gene resistant to the antibiotic ampicillin. If antibiotic resistance is added to the gene being cloned, antibiotics can be used to isolate the transformed bacteria (ones with the gene being cloned) by killing off all no … n-transformed bacteria, that don't have the antibiotic resistance."}, {"url": "http://www.biotech.iastate.edu/publications/lab_protocols/DNA_Transformation_Amp.html", "passage_text": "Genes can be transfered from one bacteria to another on the plasmid by a process known as transformation. In this experiment, a plasmid with a gene (DNA) for resistance to the antibiotic ampicillin will be used to transfer the resistance gene into a susceptible strain of the bacteria. The same technique is used to transfer genes (DNA) for production of insulin, growth hormones, and other proteins into bacteria. 1 The plasmid DNA used in the laboratory has a gene for ampicillin resistance. 2  The plasma DNA is obtained from the supplier in a concentrated solution, which has to be diluted to 0.005 ug/ul for the DNA transformation experiment. 3  The DNA should be distributed to the students in tubes kept on ice."}, {"url": "https://answers.yahoo.com/question/index?qid=20111027072434AAXyQyL", "passage_text": "Best Answer: It confers ampicillin resistance to the cell that has the plasmid carrying the amp^r gene. The gene works by encoding a subunit of the enzyme, beta lactamase, that breaks down ampicillin. This subunit combines with a subunit already present in the bacterial cells to form a working enzyme which breaks down the ampicillin and allows the bacteria to survive. The enzyme responsible for degrading ampicillin is called beta-lactamase, in reference to the beta-lactam structure of ampicillin and related drugs Antibiotic resistance is an important tool for genetic engineering."}, {"url": "http://www.answers.com/Q/What_is_the_purpose_of_an_ampicillin_resistance_gene_in_cloning", "passage_text": "Split and merge into it. Answer by Acid36. Confidence votes 5.0K. The ampicillin resistance gene (AmpR) is called a selectable marker gene and is incorporated into several plasmids that are commonly used in a wide range of genetic engineering and molecular biology experiments. If antibiotic resistance is added to the gene being cloned, antibiotics can be used to isolate the transformed bacteria (ones with the gene being cloned) by killing off all no … n-transformed bacteria, that don't have the antibiotic resistance."}, {"url": "https://answers.yahoo.com/question/index?qid=20111027072434AAXyQyL", "passage_text": "· just now. Report Abuse. amp^ r----•a gene (ampr)conferring resistance to the antibiotic ampicillin (a relative of penicillin) An ampicillin resistance gene (abbreviated bla) is commonly used as a selectable marker in routine biotechnology. The enzyme responsible for degrading ampicillin is called beta-lactamase, in reference to the beta-lactam structure of ampicillin and related drugs Antibiotic resistance is an important tool for genetic engineering."}]