[{"url": "http://legal-dictionary.thefreedictionary.com/Amendment+17", "passage_text": "Seventeenth Amendment. The Seventeenth Amendment to the U.S. Constitution reads: The Senate of the United States shall be composed of two Senators from each State, elected by the people thereof for six years; and each Senator shall have one vote."}, {"url": "http://www.answers.com/Q/Which_amendment_changed_the_way_senators_are_elected", "passage_text": "In History of the United States. The Seventeenth Amendment to the U.S. Constitution, ratified in 1913, proficed for United States Senators to be elected directly by the people rather than by their state legis … lators."}, {"url": "http://study.com/academy/lesson/what-is-the-17th-amendment-definition-summary-history.html", "passage_text": "Consequently, the Constitution was changed with the 17th Amendment so that the Senate of the United States shall be composed of two Senators from each State, elected by the people thereof, for six years... This meant that senators would now be freely elected."}, {"url": "http://www.archives.gov/exhibits/charters/constitution_amendments_11-27.html", "passage_text": "Note: Article I, section 3, of the Constitution was modified by the 17th amendment. The Senate of the United States shall be composed of two Senators from each State, elected by the people thereof, for six years; and each Senator shall have one vote."}, {"url": "http://www.answers.com/Q/Which_Amendment_to_the_US_Constitution_changed_the_way_that_US_Senators_were_elected", "passage_text": "The 17th Amendment to the U.S. Constitution, ratified on April 8,  1913, changed who elects U.S. Senators. From 1788 until 1912, each  U.S. Senator was elected by the state … legislature. Since 1914, each  U.S. Senator is directly elected by the people of the state."}, {"url": "http://www.archives.gov/legislative/features/17th-amendment/", "passage_text": "17th Amendment to the U.S. Constitution: Direct Election of U.S. Senators. Americans did not directly vote for senators for the first 125 years of the Federal Government. The Constitution, as it was adopted in 1788, stated that senators would be elected by state legislatures."}, {"url": "http://constitution.findlaw.com/amendment17.html", "passage_text": "Seventeenth Amendment-U.S. Constitution. Clause 1. The Senate of the United States shall be composed of two Senators from each State, elected by the people thereof, for six years; and each Senator shall have one vote. The electors in each State shall have the qualifications requisite for electors of the most numerous branch of the State legislatures."}]