[{"url": "http://www.enotes.com/homework-help/why-did-slavery-start-how-long-did-last-131453", "passage_text": "Slavery started in what is now the United States in 1619. In that year, a load of slaves was dropped off in Jamestown, the first settlement in what is now the United States. Slavery would continue to exist in the United States until the end of the Civil War, which was in 1865."}, {"url": "http://www.bbc.co.uk/history/british/abolition/africa_article_01.shtml", "passage_text": "Beginnings. From the middle of the 15th century, Africa entered into a unique relationship with Europe that led to the devastation and depopulation of Africa, but contributed to the wealth and development of Europe. From then until the end of the 19th century, Europeans began to establish a trade for African captives. The African Slave Trade from 15th to the 19th Centuries (UNESCO Reports and Papers (2), 1999). How Europe Underdeveloped Africa by Walter Rodney (Bogle l'Ouverture, 1983). General History of Africa [vols."}, {"url": "https://answers.yahoo.com/question/index?qid=20100525145740AAzm9V0", "passage_text": "In the U.S.A 1776-1865 (89 years) slavery was legal in some part of u.s.a 1776-1787 slavery was legal in the north after 1787 it was illegal to have slaves in the land that is known as wisconsin,illinois, indiana, ohio,michigan. the first african slave in the land of america before it became the u.s.a was in 1620. If you are talking about the slavery involving Aifrcans and Europeans; Depends 1619 - 1865 (African-American) slavery in USA. 246 years 1502 - 1888 (Africans) Institution of slavery in the Americas (North & South American continents) beginning and ending in Brazil."}, {"url": "http://www.huffingtonpost.com/2013/12/18/end-of-slavery-anniversary_n_4466330.html", "passage_text": "On Dec. 18, 1865, slavery ended in the United States. Secretary of State William Seward issued a statement verifying the ratification of the 13th Amendment to the U.S. Constitution making the end of slavery official eight months after the end of the Civil War. The amendment states: "}, {"url": "http://news.bbc.co.uk/2/hi/africa/6504141.stm", "passage_text": "By Will Ross BBC News, Ghana About 12m Africans were forced onto European slave ships Between the 15th and 19th Centuries, it is estimated that up to 12m Africans were forced onto European slave ships and taken across the Atlantic. Two hundred years after the British parliament voted to abolish the trade, the effects on Africa are still being felt. But after the slave ships left, it was not long before the Africa was divided up and colonised by European countries. 'A bit suppressed'. The devastation left by the slave trade, and the absence of able-bodied people, made it easy for European powers to move in and colonise."}, {"url": "http://www.bbc.co.uk/history/british/abolition/africa_article_01.shtml", "passage_text": "Historians have long debated how and why African kingdoms and merchants entered into a trade that was so disadvantageous to Africa and its inhabitants. Some have argued that slavery was endemic at that time in Africa and that, therefore, a demand from Europe quickly led to the development of an organised trade. The African Slave Trade from 15th to the 19th Centuries (UNESCO Reports and Papers (2), 1999). How Europe Underdeveloped Africa by Walter Rodney (Bogle l'Ouverture, 1983). General History of Africa [vols."}, {"url": "http://www.bbc.co.uk/history/british/empire_seapower/antislavery_01.shtml", "passage_text": "British Anti-slavery. By Dr John Oldfield Last updated 2011-02-17. In the space of just 46 years, the British government outlawed the slave trade that Britain had created and went on to abolish the practice of slavery throughout the colonies. Introduction. British anti-slavery was one of the most important reform movements of the 19th century. But its history is not without ironies. During the course of the 18th century the British perfected the Atlantic slave system."}, {"url": "http://www.enotes.com/homework-help/why-did-slavery-start-how-long-did-last-131453", "passage_text": "The first african slaves were brought over on August 20th, 1619, and slavery wasn't abolished until December 6, 1865 when the thirteenth amendment was passed, I wouldn't say that's exactly when slavery ended but that is the timeline. meaning slavery lasted for 246 years. In that year, a load of slaves was dropped off in Jamestown, the first settlement in what is now the United States. Slavery would continue to exist in the United States until the end of the Civil War, which was in 1865."}, {"url": "http://www.bbc.co.uk/history/british/empire_seapower/antislavery_01.shtml", "passage_text": "British and Foreign Anti-Slavery Society © In the space of some 46 years, between 1787 and 1833, Britain had not only outlawed the slave trade but also abolished slavery throughout her colonial possessions. For many the struggle was over. For others, however, 1833 signalled a new beginning. Introduction. British anti-slavery was one of the most important reform movements of the 19th century. But its history is not without ironies. During the course of the 18th century the British perfected the Atlantic slave system."}]