[{"url": "http://www.healthofchildren.com/L/Language-Delay.html", "passage_text": "Maturation delay, also called developmental language delay, is one of the most common types of language delay. Children with a maturation delay may be referred to as late talkers or late bloomers.. Maturation delays frequently run in families. Language delay may result from a variety of underlying disorders, including the following: 1  mental retardation. 2  maturation delay (This delay in the maturation of the central neurological processes required to produce speech is often the cause of late talking.). 3  hearing impairment"}, {"url": "https://en.wikipedia.org/wiki/Language_delay", "passage_text": "Language delay is distinct from speech delay, in which the speech mechanism itself is the focus of delay. Oral communication is a two-stage process. The first stage is to encode the message into a set of words and sentence structures that convey the required meaning, i.e. into language. However a child with a language delay typically has not yet been able to use language to formulate material to speak; he or she is therefore likely to have a delay in speech as well. Language delay is commonly divided into receptive and expressive categories. Receptive language refers to the process of understanding what is said to the subject. Expressive language refers to the use of words and sentences to communicate messages to others. Both categories are essential to effective communication"}, {"url": "https://en.wikipedia.org/wiki/Speech_delay", "passage_text": "Speech, as distinct from language, refers to the actual process of making sounds, using such organs and structures as the lungs, vocal cords, mouth, tongue, teeth, etc. Language delay refers to a delay in the development or use of the knowledge of language. Because language and speech are two independent stages, they may be individually delayed. For example, a child may be delayed in speech (i.e., unable to produce intelligible speech sounds), but not delayed in language"}, {"url": "http://www.healthline.com/health/language-delay", "passage_text": "A language delay is a communication disorder. A child is said to have a language delay if he or she does not meet the language developmental milestones for his or her age. Language may be developing, but it is at a slower rate than the norm for the child's age. A language delay can involve a hearing, speech, or language impairment, or a combination of two impairments or all three. Language and speech disorders are common. According to the University of Michigan Health System, they affect up to 10 percent of preschool-age children (University of Michigan Health System) "}, {"url": "http://www.autism-society.org/what-is/aspergers-syndrome/", "passage_text": "One of the major differences between Asperger’s Disorder and autism is that, by definition, there is no speech delay in Asperger’s. In fact, children with Asperger’s Disorder frequently have good language skills; they simply use language in different ways. "}, {"url": "http://kidneeds.com/diagnostic_categories/articles/speechlanguagedefinition.htm", "passage_text": "In this way an initial delay in speech and language or an initial speech pattern can become a disorder which can cause difficulties in learning. Because of the way the brain develops, it is easier to learn language and communication skills before the age of 5. "}, {"url": "https://en.wikipedia.org/wiki/Speech_delay", "passage_text": "Speech delay, also known as alalia, refers to a delay in the development or use of the mechanisms that produce speech. Language delay refers to a delay in the development or use of the knowledge of language."}, {"url": "http://www.healthofchildren.com/L/Language-Delay.html", "passage_text": "Description. Language delay is a communication disorder, a category that includes a wide variety of speech, language, and hearing impairments. The milestones of language development, including the onset of babbling and a child's first words and sentences, normally occur within approximate age ranges. Language delay may result from a variety of underlying disorders, including the following: 1  mental retardation. 2  maturation delay (This delay in the maturation of the central neurological processes required to produce speech is often the cause of late talking.). 3  hearing impairment"}]