[{"url": "http://www.cdc.gov/hepatitis/HCV/PDFs/HepCGettingTested.pdf", "passage_text": "• A non-reactive or negative antibody test means that you are not currently infected with the Hepatitis C virus. • However, if you think you might have been exposed to Hepatitis C in the last 6 months, you will need to be tested again. What to Expect When Getting Tested HEPATITIS C Getting tested for Hepatitis C • A blood test, called a Hepatitis C Antibody Test, is used to find out if someone has ever been infected with Hepatitis C. • The Hepatitis C Antibody Test, sometimes called the Anti-HCV Test, looks for antibodies to"}, {"url": "http://www.cdc.gov/hepatitis/HCV/PDFs/HepCGettingTested.pdf", "passage_text": "• A reactive antibody test does not necessarily mean that you currently have Hepatitis C and a follow-up test is needed. What to do if the Hepatitis C Antibody Test is reactive • If the antibody test is reactive, you need an additional test to see if you currently have Hepatitis C. This test is called a RNA test. Another name used for this test is a PCR test. What to Expect When Getting Tested HEPATITIS C Getting tested for Hepatitis C • A blood test, called a Hepatitis C Antibody Test, is used to find out if someone has ever been infected with Hepatitis C. • The Hepatitis C Antibody Test, sometimes called the Anti-HCV Test, looks for antibodies to the Hepatitis C virus."}, {"url": "http://www.thebody.com/h/what-does-it-mean-when-a-hepatitis-c-test-is-non-reactive.html/", "passage_text": "do i have hepatitis c. It depends. If you are at risk for HCV (eg, you shared injection drug paraphernalia in the past), you should check a HCV RNA...If you are NOT at risk, and these tests were done for some kind of screening, I would get a RIBA test which is more..."}, {"url": "http://www.justanswer.com/medical/2ehlp-does-non-reactive-hep-test-result-mean-my-hsv.html", "passage_text": "Expert: Dr Mark Zweben replied 6 years ago. Hello, A nonreactive test means you lack the antibody to hepatitis C so you have never been exposed. IgG is an antibody produced indicating previous exposure but not active infection so you have been exposed to HSV 1 and 2. The WBC count is elevated but not to a degree that is concerning. "}, {"url": "http://www.cdc.gov/knowmorehepatitis/LearnMore.htm", "passage_text": "Hepatitis C Overview. Hepatitis C is a serious liver disease that results from infection with the Hepatitis C virus. Hepatitis C has been called a silent epidemic because most people with Hepatitis C do not know they are infected. While some people who get infected with Hepatitis C are able to clear, or get rid of, the virus, most people who get infected develop a chronic, or lifelong, infection."}, {"url": "https://answers.yahoo.com/question/index?qid=20060616074506AAlye5T", "passage_text": "Best Answer: 1)Hep C AB reactive means that you have the antibody to Hep C. We are discussing the Hepatitis C virus which is transmitted by blood or body fluids...often with intercourse/needle sticks in healthcare workers/needle sharing in iv drug users. There is no vaccine to Hep C (like there is with Hep B). "}, {"url": "http://www.hepatitis.va.gov/patient/hcv/diagnosis/labtests-hepatitisC-antibody.asp", "passage_text": "If the antibody test result is negative, it means you have not been infected with the hepatitis C virus, and further testing for hepatitis C usually is not needed. Explanation of test results: If this test result is positive, it means your body was exposed to the hepatitis C virus and made antibodies (for more information, see Antibody section under Associated Lab Tests)."}, {"url": "http://www.cdc.gov/knowmorehepatitis/LearnMore.htm", "passage_text": "1 A Non-reactive or a negative Hepatitis C antibody test result means that a person does not have Hepatitis C. However, if a person has been recently exposed to the Hepatitis C virus, he or she will need to be tested again. Hepatitis C has been called a silent epidemic because most people with Hepatitis C do not know they are infected. While some people who get infected with Hepatitis C are able to clear, or get rid of, the virus, most people who get infected develop a chronic, or lifelong, infection."}, {"url": "http://www.healingwell.com/community/default.aspx?f=25&m=2145071", "passage_text": "A non-reactive Hepatitis B surface antigen test means you are NOT INFECTED with the hepatitis B virus. 2. Hepatitis B Surface Antibody: NON-REACTIVE. A non-reactive hepatitis B surface antibody test means you are NOT PROTECTED against hepatitis B. I would definitely get with my doctor and discuss the results with him/her. Hope this helps."}]