[{"url": "https://en.wikipedia.org/wiki/Renin%E2%80%93angiotensin_system", "passage_text": "This increases the volume of extracellular fluid in the body, which also increases blood pressure. If the renin–angiotensin–aldosterone system is abnormally active, blood pressure will be too high. There are many drugs that interrupt different steps in this system to lower blood pressure. These drugs are one of the main ways to control high blood pressure (hypertension), heart failure, kidney failure, and harmful effects of diabetes"}, {"url": "https://en.wikipedia.org/wiki/Renin%E2%80%93angiotensin_system", "passage_text": "The renin–angiotensin system (RAS) or the renin–angiotensin–aldosterone system (RAAS) is a hormone system that regulates blood pressure and fluid balance. If the renin–angiotensin–aldosterone system is abnormally active, blood pressure will be too high."}, {"url": "http://www.definitions.net/definition/renin–angiotensin%20system", "passage_text": "Renin–angiotensin system. The renin-angiotensin system or the renin-angiotensin-aldosterone system is a hormone system that regulates blood pressure and water balance. When blood volume is low, juxtaglomerular cells in the kidneys secrete renin directly into circulation. These drugs are one of the main ways to control high blood pressure, heart failure, kidney failure, and harmful effects of diabetes. Images & Illustrations of renin–angiotensin system. Translation. Find a translation for the renin–angiotensin system definition in other languages:"}, {"url": "http://medical-dictionary.thefreedictionary.com/renin-angiotensin-aldosterone+system", "passage_text": "Angiotensin II is a potent vasoconstrictor, which also increases blood pressure. The role of the renin-angiotensin-aldosterone system in regulation of blood pressure. Solid lines represent positive interactions; broken lines show negative interactions or feedback inhibition. From Cotran et al., 1994. renin-angiotensin-aldosterone system see renin-angiotensin-aldosterone system. respiratory system the group of specialized organs whose specific function is to provide for the transfer of oxygen from the air to the blood and of waste carbon dioxide from the blood to the air."}, {"url": "https://en.wikipedia.org/wiki/Renin%E2%80%93angiotensin_system", "passage_text": "Angiotensin II is a potent vaso-active peptide that causes blood vessels to constrict, resulting in increased blood pressure. Angiotensin II also stimulates the secretion of the hormone aldosterone from the adrenal cortex. If the renin–angiotensin–aldosterone system is abnormally active, blood pressure will be too high."}, {"url": "http://medical-dictionary.thefreedictionary.com/renin-angiotensin-aldosterone+system", "passage_text": "renin-angiotensin-aldosterone system the regulation of sodium balance, fluid volume, and blood pressure by secretion of renin in response to reduced perfusion of the kidney. renin-angiotensin-aldosterone system see renin-angiotensin-aldosterone system. respiratory system the group of specialized organs whose specific function is to provide for the transfer of oxygen from the air to the blood and of waste carbon dioxide from the blood to the air."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=89353", "passage_text": "The definition information for renin-angiotensin-aldosterone system is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students. Definitions: 1. three hormones, renin, angiotensin, and aldosterone working together to regulate blood pressure."}, {"url": "http://study.com/academy/lesson/renin-angiotensin-aldosterone-system-raas-pathway-functions-terms.html", "passage_text": "I'll try to combine things when possible to help you see the big picture. The most important system involved in the regulation of systemic blood pressure, renal blood flow, and glomerular filtration rate is called the renin-angiotensin-aldosterone system, or (RAAS) for short. The Control of Blood Pressure. I'm pretty sure you have seen or heard a commercial touting a new drug that helps to regulate something known as systemic hypertension, or high blood pressure, all over the body. Your body has an entire system that regulates blood pressure as well."}]