[{"url": "http://www.babynamespedia.com/meaning/Iwan", "passage_text": "Iwan is also a Polish, Russian, Ukrainian, and Welsh form of the English and Hebrew name John. Forms of the name include the Russian pet form Wanja and the Belorussian, Czech, English, Russian, Slavic, and Ukrainian spelling variant Ivan. See also the related forms, the Italian and Russian Ivano and the French Yvan. In 2012, among the group of boy names directly related to Iwan, John was the most widely used. Baby names that sound like Iwan include Ivan, Ifan, Ivin, Ivon, Eavan, Ebyn, Yvann, Yvon, Ibano, Ibhanan, Ipyana, Ivano, Epiphaney, Epiphanie, Epephanio, Epiphafanee, Epiphaneo, and Iban. ibán"}, {"url": "http://www.thinkbabynames.com/meaning/1/Iwan", "passage_text": "Iwan /iwan/ [2 sylls.] as a boys' name. Iwan's name origins are Russian, Slavic and Hebrew, and the meaning of the name Iwan is God is gracious. Iwan is a variant transcription of Ivan (Russian, Slavic, Hebrew): variation of Hebrew John. Owan is a conventional surname. Kreatif forms: Iwaniah, Iwanioa, Iwannio. "}, {"url": "https://en.wikipedia.org/wiki/Iwan", "passage_text": "Iwan of the Āmeri House in Kashan, Iran. An iwan (Persian: ایوان eyvān, Arabic: إيوان ‎ Iwan, also spelled ivan, Turkish: eyvan) is a rectangular hall or space, usually vaulted, walled on three sides, with one end entirely open. The Iwan of Khosrau is a Sassanid-era Persian monument in Mada'in which is the only visible remaining structure of the ancient city of Ctesiphon. It is near the modern town of Salman Pak, Iraq."}, {"url": "http://www.sheknows.com/baby-names/name/iwan", "passage_text": "Welsh Meaning: The name Iwan is a Welsh baby name. In Welsh the meaning of the name Iwan is: God's gift'. SoulUrge Number: 1. Expression Number: 2. People with this name have a deep inner desire to use their abilities in leadership, and to have personal independence."}, {"url": "http://www.babynamespedia.com/meaning/Iwan", "passage_text": "Tweet. [ 2 syll. i-wan, iw-an ] The baby boy name Iwan is pronounced in Polish as IY-VaaN †. Iwan is primarily used in Polish, Russian, Ukrainian, and Welsh, and it is of Hebrew origin. Iwan is a Polish, Russian, and Ukrainian form of the Belorussian, Czech, English, Russian, Slavic, and Ukrainian name Ivan. In 2012, among the group of boy names directly related to Iwan, John was the most widely used. Baby names that sound like Iwan include Ivan, Ifan, Ivin, Ivon, Eavan, Ebyn, Yvann, Yvon, Ibano, Ibhanan, Ipyana, Ivano, Epiphaney, Epiphanie, Epephanio, Epiphafanee, Epiphaneo, and Iban. ibán"}, {"url": "http://www.behindthename.com/name/ivan", "passage_text": "Meaning & History. Newer form of the old Slavic name іѡаннъ (Ioannu) , which was derived from Greek Ioannes (see JOHN). This was the name of six Russian rulers, including the 15th-century Ivan III the Great and 16th-century Ivan IV the Terrible, the first tsar of Russia. It was also borne by nine emperors of Bulgaria. "}, {"url": "https://en.wikipedia.org/wiki/Iwan_(name)", "passage_text": "Iwan is a masculine given name and a surname. It is a Welsh and Cornish name related to Ifan and derived from the Latin Johannes. It is also found in Germanic and Slavic languages as a variant of Ivan (name) , which is a form of the Biblical name John. The Welsh given name related to this is Ioan rather than Iwan."}, {"url": "http://www.babynamewizard.com/baby-name/boy/iwan", "passage_text": "Origin of the name John: Derived from the Middle Latin Johannes, which is from the Ecclesiastic Late Latin Joannes, which is from the Greek Iōannes. Iōannes is from the Hebrew Yehanan, a short form of Yehohanan which is derived from yehōhānān (Yahweh is gracious). John is the most enduring of the biblical names and remains one of the most popular names bestowed in the United States. Var: Jon. Pet: Johnnie, Johnny, Jonnie, Jonny."}]