[{"url": "http://www.pokerlistings.com/live-tournaments/wpt/qualify", "passage_text": "Each tournament requires players to pay an entry fee (the buy-in), which on the World Poker Tour is generally around $10,000 U.S., although there are events with buy-ins as low as $2,500. You can also gain entry into a WPT Main Event by winning a satellite tournament with a lower buy-in (usually around $1,000). The tournament winner generally gets between 35-40% of the pool, with the top 10-20% of the field sharing the rest. For example, if 150 players bought-in at $10,000 each, the prize pool would total $1.5 million. The winner could take home as much as $500,000, leaving $1 million to be split between the next 14 finishers. Once players are registered, their table and seat numbers are drawn at random"}, {"url": "http://www.91daychallenge.com/blog/poker/club-wpt-review/", "passage_text": "Final Thoughts. If you plan on playing a lot of poker, Club WPT is a fantastic deal. As this review points out, this service is definitely not a scam. For $19.95 a month, you get access to. 1  Daily $1,000 prize pool tournaments. 2  Monthly $10,000 prize pool tournaments. The first thing that caught my attention with Club WPT was the daily $1,000 pool-prize tournament. For $19.95 a month, you can compete in a tournament that will give away $1,000 split between people who make the money."}, {"url": "http://www.burnpoker.com/free-poker-rooms/", "passage_text": "SpadeClub. SpadeClub.com is another popular monthly subscription online poker room that only charges a monthly membership fee to access all of the benefits of the website. The cost to become a member at Spade Club is only $19.99 per month and this will give you the chance to earn over $100K in cash and prizes. Poker Stars is the best online poker room, hands down. They have one of the largest player basis, they offer the best freeroll tournaments that don’t cost a penny to play in, with prize pools in the thousands of dollar range. PokerStars offers the widest range of poker games online, and you can play eery game for Free!"}, {"url": "http://www.onlinepokerbee.com/wpt.php", "passage_text": "How to Join WPT. There are only two major ways that you can join and play in the World Poker Tour. Either you pay up front between $2,500 and $25,000 as your buy-in or you win your way in. Yet, if the buy-ins is too much for you, you can win a seat in this prestigious event by joining World Poker Tour satellite tournaments. The World Poker Tour is one of the world' s biggest and most prestigious poker events where buy-ins ranges from $2,500-25,000. The prizes that players do win amount to millions which is one of the main draws of the event."}, {"url": "https://www.clubwpt.com/membership/", "passage_text": "Play unlimited poker online anytime and anywhere and if you reside in an eligible territory, get instant access to win a share of more than $100,000 in cash and prizes each month.* (See Prize Eligibility for more details). That’s why we, the World Poker Tour created ClubWPT… the ultimate poker experience. Play unlimited poker online anytime and anywhere. Basic Members receive a top up of 5,000 Play Chips daily."}, {"url": "http://www.chipcage.com/clubwpt/", "passage_text": "ClubWPT is the subscription poker site of the World Poker Tour, and it offers U.S. players a chance to legally enjoy their favorite card games (poker and elimination blackjack) online. That's because no money is wagered at ClubWPT.com, and there are no deposits or buy-ins. Free Poker Games at ClubWPT. If you want to get a feel for the site, the ClubWPT free membership is the way to go. Designed with the novice in mind, the basic membership level includes access to poker and blackjack strategy, freeroll tournaments, online tutorials, advice from the experts, and much more."}, {"url": "http://www.pokerforfree.org/online-poker-reviews/club-wpt/", "passage_text": "There are a number of cash tournaments available to choose from on the Club WPT site with prizes, including: 1  Daily $10, $20 and $50 poker tournaments. 2  $100 cash tournaments. 3  $100 Late Night tournament. 4  $100 Nooner. 5  $200 cash tournaments. 6  $500 cash tournaments. 7  $1,000 cash tournaments. "}, {"url": "http://pokernewsboy.com/clubwpt", "passage_text": "ClubWPT was setup in 2008 as a legal alternative for online poker players. Run by the World Poker Tour, the site allows players of all skill sets both a place to play online poker and learn more about the World Poker Tour. The way it differs from other online poker sites is that you will never have to buy-in to play in any of the club WPT poker tournaments on the site. Players have a choice to either register as a Basic Member for free or they can sign-up as a VIP member where they have access to win up to $100,000 a month in prize money. Players that participate in games on ClubWPT have the opportunity to win both cash, prizes, and even WPT Main Event buy-ins. Over 5,000 tournaments are held a month, both in Sit-N-Go and Multi-table format. Some are of you basic freeroll variety offering prizes ranging from $10 to $1,000 in cash prizes."}, {"url": "http://www.chipcage.com/clubwpt/", "passage_text": "Each month, you pay a subscription fee to be eligible for sweepstakes prizes, but the winners of those prizes are determined by poker or elimination blackjack tournaments. Prizes range from cash ($100 to $10,000) to seats at the WPT or WSOP. No limit Texas hold'em is the most common game at ClubWPT, but elimination blackjack and poker games like no limit Omaha are also available. And even if you're terrible at online poker or online blackjack, you'll never lose more than $19.95 per month. Free Poker Games at ClubWPT. If you want to get a feel for the site, the ClubWPT free membership is the way to go. Designed with the novice in mind, the basic membership level includes access to poker and blackjack strategy, freeroll tournaments, online tutorials, advice from the experts, and much more."}]