[{"url": "http://www.cdc.gov/STD/HPV/STDFact-HPV.htm", "passage_text": "There are HPV tests that can be used to screen for cervical cancer. These tests are recommended for screening only in women aged 30 years and older. They are not recommended to screen men, adolescents, or women under the age of 30 years. However, there are treatments for the health problems that HPV can cause: 1  Genital warts can be treated by you or your physician. 2  If left untreated, genital warts may go away, stay the same, or grow in size or number. 3  Cervical precancer can be treated."}, {"url": "http://www.webmd.com/sexual-conditions/hpv-genital-warts/hpv-symptoms-tests", "passage_text": "Infection by genital HPV (human papillomavirus) is very common. At least half of people who are sexually active will contract the HPV virus at some point in their lives. Yet many will not know it and have no symptoms. Whether symptoms occur or not can depend on the type of HPV virus involved in the infection. Read more about how to reveal you have an STD. Related to HPV. HPV symptoms, HPV vaccine, HPV test, Cervical cancer, Genital warts, Gardasil, Human papillomavirus, LEEP, Colposcopy, Pap test. Some types of HPV are associated with cervical and other cancers, and no warts occur, and no other symptoms may be noticed. Some HPV types also cause common warts that you can find on other areas of the body such as your hands or feet"}, {"url": "http://www.cdc.gov/std/hpv/stdfact-hpv-and-men.htm", "passage_text": "HPV is the most common sexually transmitted infection. HPV is a viral infection that can be spread from one person to another person through anal, vaginal, or oral sex, or through other close skin-to-skin touching during sexual activity. If you are sexually active you can get HPV, and nearly all sexually active people get infected with HPV at some point in their lives. There is no specific treatment for HPV, but there are treatments for health problems caused by HPV. Genital warts can be treated by your healthcare provider, or with prescription medication. HPV-related cancers are more treatable when diagnosed and treated promptly. For more information, visit www.cancer.org."}, {"url": "http://www.cdc.gov/STD/HPV/STDFact-HPV.htm", "passage_text": "If you are pregnant and have HPV, you can get genital warts or develop abnormal cell changes on your cervix. Abnormal cell changes can be found with routine cervical cancer screening. You should get routine cervical cancer screening even when you are pregnant. However, there are treatments for the health problems that HPV can cause: 1  Genital warts can be treated by you or your physician. 2  If left untreated, genital warts may go away, stay the same, or grow in size or number. 3  Cervical precancer can be treated."}, {"url": "http://www.webmd.com/sexual-conditions/hpv-genital-warts/human-papillomavirus-hpv-test", "passage_text": "1 Check for high-risk types of human papillomavirus (HPV) in women who had a Pap test that showed abnormal cervical cells called atypical squamous cells (ASC) . 2  An HPV test can help look for one or more high-risk types of HPV. A Pap test or an HPV test can be used to screen for cervical cancer. An HPV test may be done at the same time as a Pap test or by itself. The results of an HPV test can help doctors decide if further tests or treatments are needed. To learn more, see the topic Pap Test."}, {"url": "http://goaskalice.columbia.edu/answered-questions/no-symptoms-concerned-about-genital-warts", "passage_text": "Genital warts are caused by certain strains of the human papillomavirus (HPV). For women, a Pap smear can detect cell changes on the cervix caused by other types of HPV (strains that do not cause warts but are linked to cervical cancer). However, there is no approved test for HPV in men, nor a test used specifically for the strains of HPV that cause genital warts. Instead, warts are usually diagnosed by a health care provider during a visual exam, when warts are actually present."}, {"url": "http://www.webmd.com/sexual-conditions/hpv-genital-warts/human-papillomavirus-hpv-test", "passage_text": "Why It Is Done. An HPV test is done to: 1  Check for high-risk types of human papillomavirus (HPV) in women who had a Pap test that showed abnormal cervical cells called atypical squamous cells (ASC) . 2  An HPV test can help look for one or more high-risk types of HPV. A Pap test or an HPV test can be used to screen for cervical cancer. An HPV test may be done at the same time as a Pap test or by itself. The results of an HPV test can help doctors decide if further tests or treatments are needed. To learn more, see the topic Pap Test."}, {"url": "http://goaskalice.columbia.edu/answered-questions/no-symptoms-concerned-about-genital-warts", "passage_text": "You're right that people can carry the types of HPV that cause genital warts without having symptoms. However, you shouldn't need to visit your health care provider unless you or your partner notices warts. It may feel frustrating that there isn't a test that can tell symptom-free people whether they carry the virus. However, there is no approved test for HPV in men, nor a test used specifically for the strains of HPV that cause genital warts. Instead, warts are usually diagnosed by a health care provider during a visual exam, when warts are actually present."}, {"url": "http://www.webmd.com/sexual-conditions/hpv-genital-warts/hpv-symptoms-tests", "passage_text": "Some types of genital HPV infection are associated with cancer, including cervical cancer and cancer of the vulva, anus, or penis. If infection occurs with one of these virus types, precancerous changes can occur in cells in the tissue without causing any symptoms. Read more about how to reveal you have an STD. Related to HPV. HPV symptoms, HPV vaccine, HPV test, Cervical cancer, Genital warts, Gardasil, Human papillomavirus, LEEP, Colposcopy, Pap test. Some types of HPV are associated with cervical and other cancers, and no warts occur, and no other symptoms may be noticed. Some HPV types also cause common warts that you can find on other areas of the body such as your hands or feet"}]