[{"url": "https://en.wikipedia.org/wiki/Superior_colliculus", "passage_text": "The superior colliculus, (Latin, upper hill) is a paired structure of the mammalian midbrain. In other vertebrates this is known as the optic tectum or simply tectum, and the adjective tectal may also be used. The superior colliculus forms a major component of the midbrain. The tectum is a layered structure, with a number of layers that varies by species. The superficial layers are sensory-related, and receive input from the eyes as well as other sensory systems"}, {"url": "https://en.wikipedia.org/wiki/Corpora_quadrigemina", "passage_text": "In the brain, the corpora quadrigemina (Latin for quadruplet bodies) are the four colliculi—two inferior, two superior —located on the tectum of the dorsal aspect of the midbrain. "}, {"url": "http://www.merriam-webster.com/medical/superior%20colliculus", "passage_text": "Medical Definition of SUPERIOR COLLICULUS. : either member of the anterior and higher pair of corpora quadrigemina that together constitute a primitive center for vision—called also optic lobe, optic tectum; compare inferior colliculus. "}, {"url": "http://www.csuchico.edu/~pmccaffrey/syllabi/CMSD%20320/362unit6.html", "passage_text": "Sensory axons, including those of the spinothalamic tract also ascend, along the front of the midbrain behind the motor tracts. The corpora quadrigemina, which is located on the posterior surface of the midbrain, is composed of two superior colliculi and two inferior colliculi. The superior colliculi are part of the visual system, relaying input from the optic tract t o the lateral geniculate bodies of the thalamus. The pons, which is also part of the brain stem, is inferior to the midbrain and superior to the medulla. Its posterior border is separated from the cerebellum by the aqueduct of Sylvius, and more inferiorly, by the fourth ventricle."}, {"url": "https://en.wikipedia.org/wiki/Superior_colliculus", "passage_text": "Note on terminology: This article follows terminology established in the literature for the analogous structure in mammals/non-mammals (see above), using the term superior colliculus when discussing mammals and optic tectum when discussing either specific non-mammalian species or vertebrates in general. In other vertebrates this is known as the optic tectum or simply tectum, and the adjective tectal may also be used. The superior colliculus forms a major component of the midbrain."}, {"url": "http://www.csuchico.edu/~pmccaffrey/syllabi/CMSD%20320/362unit6.html", "passage_text": "The inferior colliculi are part of the auditory pathway and send information to the medial geniculate bodies of the thalamus. Several important nuclei are located in the midbrain, including the red nuclei, the substantia nigra, and the nuclei of cranial nerves III and IV. The pons, which is also part of the brain stem, is inferior to the midbrain and superior to the medulla. Its posterior border is separated from the cerebellum by the aqueduct of Sylvius, and more inferiorly, by the fourth ventricle."}, {"url": "http://www.merriam-webster.com/medical/corpora%20quadrigemina", "passage_text": "Tweet. : two pairs of colliculi on the dorsal surface of the midbrain composed of white matter externally and gray matter within, the superior pair containing correlation centers for optic reflexes and the inferior pair containing correlation centers for auditory reflexes. "}, {"url": "https://en.wikipedia.org/wiki/Midbrain", "passage_text": "The corpora quadrigemina (quadruplet bodies) are four solid lobes on the dorsal side of the cerebral aqueduct, where the superior posterior pair are called the superior colliculi and the inferior posterior pair are called the inferior colliculi. The four solid lobes help to decussate several fibres of the optic nerve. The midbrain comprises the tectum (or corpora quadrigemina), tegmentum, the cerebral aqueduct (or ventricular mesocoelia or iter), and the cerebral peduncles, as well as several nuclei and fasciculi."}, {"url": "http://www.healthline.com/human-body-maps/superior-colliculus", "passage_text": "The superior colliculus refers to the rostral (front) bump on the lateral (side) part of the midbrain. It is, in fact, a pair of two colliculi, superior and inferior, on either side of the midbrain that together constitute the tectum. The superior colliculus is a layered, multi-sensory structure."}, {"url": "http://www.menieresdisease-treatment.com/meniere-disease/inferior-colliculus.html", "passage_text": "The anatomic structure that includes inferior colliculi and the superior coliculi forms two parts: (1) the eminences of the corpora quadrigemina. (2) part of the tectal region of the midbrain. The inferior colliculus is located near the following structures: (1) the superior colliculus. (2) the trochlear nerve. (3) the base of the projection of the medial geniculate nucleus. Inferior colliculus. The Inferior colliculus is the main midbrain nucleus and important structure of the auditory passage."}]