[{"url": "https://yanderedev.wordpress.com/2015/04/15/dont-let-senpai-notice-you/", "passage_text": "On the ‘heartbroken’ game over page (specifically the one which occurs from a senpai related game over, e.g. killing a student in front of senpai or standing in front of him), if you press ‘enter’ Yandere-chan rotates and then if you then press enter again, you can start to move your mouse around to do some funky stuff."}, {"url": "http://knowyourmeme.com/memes/i-hope-senpai-will-notice-me", "passage_text": "About. “I Hope Senpai Will Notice Me” is a catchphrase commonly associated with anime shows and manga books that can often be found on the microblogging site Tumblr to express a quest to resolve unrequited admiration."}, {"url": "https://yanderedev.wordpress.com/2015/04/15/dont-let-senpai-notice-you/", "passage_text": "1 Senpai will no longer “notice” you if you’re having a conversation with a student. ( 2 Talking with a student is an inconspicuous activity, so it’s like “social camoflague” that causes Senpai to overlook you.)."}, {"url": "http://www.youtube.com/watch?v=6jfkZQNw9U4", "passage_text": "A compilation of the NOTICE ME SENPAI lines so far. I hope you guys like it! :). Thank you guys for over 440.000 views!! You guys are the best!! :). Video's used : BABYSITTER BLOODBATH!"}, {"url": "http://knowyourmeme.com/memes/i-hope-senpai-will-notice-me", "passage_text": "In September 2012, the Facebook fan page “I hope Senpai will notice me” was created, gaining more than 200 fans as of September 2013. The phrase has continued to be popular on Tumblr, where the tags “I hope senpai notices me” and the positive “senpai noticed me” are all active."}, {"url": "http://datingtips.match.com/ways-crush-notice-13443446.html", "passage_text": "Dress to Impress. A good way to get your crush to notice you is to dress up your appearance. Instead of dressing casually, wear a nice shirt with a pair of dress slacks. Put on a little perfume or cologne. Also watch your posture, which can affect your overall appearance, no matter what you're wearing."}, {"url": "http://datingtips.match.com/ways-crush-notice-13443446.html", "passage_text": "A good way to get your crush to notice you is to dress up your appearance. Instead of dressing casually, wear a nice shirt with a pair of dress slacks. Put on a little perfume or cologne."}, {"url": "http://www.rockybytes.com/yandere-simulator", "passage_text": "In this case, you would get away with the crime with a witness and the witness will be taken as a fool. If you get caught, you get expelled and lose the game. If your senpai ever witnesses or finds out you are the killer, you lose the game as well by becoming heartbroken."}, {"url": "http://knowyourmeme.com/memes/i-hope-senpai-will-notice-me", "passage_text": "Over the next three days, blogs titled “I Am Senpai And I Just” , “Your Senpai Noticed You And” and “Senpai Noticed You Then” were created with the intention of utilizing Tumblr’s notification feature to make joke sentences when liking and reblogging posts found on the senpai tag."}]