[{"url": "http://taxes.about.com/od/deductionscredits/qt/traditional_ira.htm", "passage_text": "You can contribute funds to your traditional or Roth IRA at any time during the calendar year, and you can make contributions to an IRA by the first deadline for your tax return without any extensions. 1  IRA contributions for tax year 2014 are due by April 15, 2015. "}, {"url": "https://www.irahelp.com/slottreport/tax-filing-extension-does-not-mean-ira-contribution-extension", "passage_text": "Filing this form gives you until October 15, 2015 to file your 2014 tax return. However, to get the extension, you must estimate the taxes you’ll owe and should also pay any amount due. But, be aware that a request for an extension will give you extra time to file your tax return; not extra time to pay any taxes owed. The deadline for making your IRA contribution for 2014 is also April 15, 2015. Even if you filed for an extension to file your taxes, that does not extend your IRA contribution deadline. The IRA deadline is your un-extended tax filing deadline. There are some exceptions to this rule: 1  If you are in the military and served in a combat zone, you may have more time to make an IRA contribution for 2014."}, {"url": "http://finance.zacks.com/can-contributions-simple-ira-made-up-time-filing-extensions-8466.html", "passage_text": "Therefore, for the 2012 tax year, the deadline is April 15, 2013; for 2013, April 15, 2014. Even if you file an extension to submit your taxes at a later date, this deadline still applies. The IRS does not extend your SIMPLE IRA contribution deadline to coincide with extensions. Under IRS rules, the last day you can contribute funds to your SIMPLE IRA as an employee is April 15, unless that date falls on a Saturday or Sunday. When that occurs, the last date you can contribute is the Monday immediately following the 15th."}, {"url": "http://finance.zacks.com/can-invest-roth-ira-after-file-taxes-1043.html", "passage_text": "Can Contribute After Taxes. The deadline for contributing to a Roth IRA is your tax filing deadline, regardless of when you file your income taxes. You must typically file your income taxes by April 15, but some years the deadline is extended if the deadline falls on a weekend or holiday. For example, if you file your tax return after the regular tax filing deadline, even if have an extension, you've missed the deadline to contribute to a Roth IRA. Besides having to be at least 59 1/2 years old, your Roth IRA has to be open for at least five years before you're eligible to take qualified distributions."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Tax-Extensions/Reasons-for-Filing-for-an-Extension-on-Your-Federal-Taxes/INF14458.html", "passage_text": "If you fail to file a return altogether by the extension date, the IRS penalty increases to 5 percent per month, for a maximum penalty of 25 percent. An easy way to avoid the penalty is to make a tax payment with your debit card before the filing deadline. Traditionally, federal tax returns are due on April 15 or the first business day thereafter. However, the IRS does grant you an automatic six-month extension to file your taxes every year, as long as you complete Form 4868."}, {"url": "http://www.investopedia.com/articles/retirement/05/021505.asp", "passage_text": "Maximum Contribution. You may contribute up to $5,500 to your IRA for 2013. If you are at least age 50 by the end of the year to which the contribution applies, you may contribute an additional $1,000. This additional amount is referred to as a catch-up contribution. "}, {"url": "http://www.jklasser.com/news/getting-an-extension-for-the-60-day-ira-rollover-period/", "passage_text": "If an IRA owner does not qualify for an automatic extension, he or she can ask the IRS for one. This entails the cost of a user fee ($3,000) payable to the IRS and professional fees (typically $2,500 to $10,000) to prepare the request. Getting an Extension for the 60-Day IRA Rollover Period. If you take a distribution from your IRA and want to avoid any tax on it, you must roll it over-to the same IRA, a new IRA, or a qualified retirement plan-within 60 days. The 60 days is fixed by law."}, {"url": "http://finance.zacks.com/can-contributions-simple-ira-made-up-time-filing-extensions-8466.html", "passage_text": "If you receive bonuses or commissions between Jan. 1 and April 15, you may be able to contribute a portion of those amounts to your SIMPLE IRA for the prior year. The maximum amount you can contribute to a SIMPLE IRA as an employee is $11,500 for 2012 if you are age 49 and under and $14,000 if age 50 or more. For 2013, the maximum increases to $12,000 for under age 50 and $14,500 for 50 or older. Under IRS rules, the last day you can contribute funds to your SIMPLE IRA as an employee is April 15, unless that date falls on a Saturday or Sunday. When that occurs, the last date you can contribute is the Monday immediately following the 15th."}]