[{"url": "http://teachmeanatomy.info/head/cranial-nerves/trigeminal-nerve/", "passage_text": "The trigeminal nerve, CN V, is the fifth paired cranial nerve. It is also the largest cranial nerve. In this article, we shall look at the anatomical course of the nerve, and the motor, sensory and parasympathetic functions of its terminal branches. Note that the nuclei are situated within in the CNS, and the ganglia outside the CNS. The trigeminal nerve originates from three sensory nuclei (mesencephalic, principal sensory, spinal nuclei of trigeminal nerve) and one motor nucleus (motor nucleus of the trigeminal nerve) extending from the midbrain to the medulla. A nucleus (pl"}, {"url": "https://en.wikipedia.org/wiki/Abducens_nerve", "passage_text": "From Wikipedia, the free encyclopedia. The abducens nerve or abducent nerve (the sixth cranial nerve, also called the sixth nerve or simply CNVI) is a somatic efferent nerve that, in humans, controls the movement of a single muscle, the lateral rectus muscle of the eye. The abducens nerve leaves the brainstem at the junction of the pons and the medulla, medial to the facial nerve. In order to reach the eye, it runs upward (superiorly) and then bends forward (anteriorly). The nerve enters the subarachnoid space when it emerges from the brainstem."}, {"url": "http://droualb.faculty.mjc.edu/Lecture%20Notes/Unit%205/cranial_nerves%20Spring%202007%20with%20figures.htm", "passage_text": "T he facial nerve is a mixed sensory and motor nerve. The motor neurons originate from the pons. The somatic motor neurons innervate the muscles of facial expression and visceral motor neurons innervate the lacrimal and nasal mucous glands and the submandibular and sublingual salivary glands. The vagus nerve is a mixed motor and sensory nerve. The sensory neurons convey information from the inferior pharynx, larynx and thoracic and abdominal organs. Somatic motor neurons innervate muscles in the soft palate, pharynx and intrinsic laryngeal muscles."}, {"url": "http://teachmeanatomy.info/head/cranial-nerves/facial-nerve/", "passage_text": "The facial nerve, CN VII, is the seventh paired cranial nerve. In this article, we shall look at the anatomical course of the nerve, and the motor, sensory and parasympathetic functions of its terminal branches. The nerve arises in the pons, an area of the brainstem. It begins as two roots; a large motor root, and a small sensory root (the part of the facial nerve that arises from the sensory root is sometimes known as the intermediate nerve)."}, {"url": "http://www.csuchico.edu/~pmccaffrey/syllabi/CMSD%20320/362unit9.html", "passage_text": "CN V is the trigeminal nerve. The motor nucleus of this large mixed nerve originates in the pons. It provides motor innervation to the muscles that control the mandible (jaw), the tensor veli palatini muscle of the velum, and the tensor tympani muscle of the middle ear. It is usually classified as a motor nerve. The cranial nerves innervate the muscles of the jaw, face, tongue, neck, pharynx, and larynx. Some of them are motor, some are sensory and some are mixed nerves, containing both sensory and motor fibers."}, {"url": "https://en.wikipedia.org/wiki/Abducens_nucleus", "passage_text": "From Wikipedia, the free encyclopedia. The abducens nucleus is the originating nucleus from which the abducens nerve (VI) emerges-a cranial nerve nucleus. This nucleus is located beneath the fourth ventricle in the caudal portion of the pons, medial to the sulcus limitans. The abducens nucleus along with the internal genu of the facial nerve make up the facial colliculus, a hump at the caudal end of the medial eminence on the dorsal aspect of the pons."}, {"url": "http://radiopaedia.org/articles/cranial-nerves-mnemonic", "passage_text": "Either way, they can be helpful for remembering the names of the twelve cranial nerves as well as remembering which nerves are sensory, motor or both. Remembering cranial nerve names in order of CN I through to CN XII: 1  On old Olympus' towering top a Fin and German viewed some hops. 2  Ooh, ooh, ooh to touch and feel very good velvet."}, {"url": "https://en.wikipedia.org/wiki/Abducens_nucleus", "passage_text": "Two primary neuron types are located in the abducens nucleus: motorneurons and interneurons. The former directly drive the contraction of the ipsilateral lateral rectus muscle via the abducens nerve (sixth cranial nerve); contraction of this muscle rotates the eye outward (abduction). The abducens nucleus along with the internal genu of the facial nerve make up the facial colliculus, a hump at the caudal end of the medial eminence on the dorsal aspect of the pons."}]