[{"url": "http://www.healthcare-salaries.com/physicians/doctor-salary", "passage_text": "Doctor Salary. Doctors need to spend 12 to 15 years in medical school, residences, and fellowships. It could be four years of undergraduate school, another four years of medical school, and at least three to eight years of internship or residency."}, {"url": "http://www.healthcare-salaries.com/physicians/doctor-salary", "passage_text": "As expected, a doctor with more experience are paid more. There is a huge leap from the salary of AU$14,068 to AU$147,949 for a doctor with one to four years of experience to the salary range of AU$99,442 to AU$183,126 per year for a veteran doctor with more than 20 years of experience."}, {"url": "http://www.healthcare-salaries.com/physicians/medical-doctor-salary-md", "passage_text": "Based on years of work experience, medical doctors (doctors of medicine) earn different salaries in the United States. MDs with more than 5 years of practice experience earn an average yearly salary of around $155,861, whereas Medical doctors with 20+ years of practice experience earn around $174,000 per year."}, {"url": "http://www.healthcare-salaries.com/physicians/doctor-salary", "passage_text": "The average doctor salary for those working in the office varies based on whether they are primary care physicians or medical specialists. According to PayScale, general practitioners earn around $125,568 a year, while family doctors make $150,321 as the lowest earning doctors."}, {"url": "http://money.usnews.com/careers/best-jobs/physician/salary", "passage_text": "In fact, a physician’s average salary was $188,440 in 2013, which was higher than any other salary in our Best Health Care Jobs list. Dentists, who made an average salary of $164,570 had the next highest salary."}, {"url": "http://www.answers.com/Q/Doctor_salary_per_year", "passage_text": "As per the various salary surveys, the median salaries for lawyers is around USD 92,000. However, the salaries for the beginners having less experience were found to be in the … range of USD 30,000 to USD 42,000."}, {"url": "http://www.healthcare-salaries.com/physicians/doctor-salary", "passage_text": "Doctor salary in Australia. The annual doctor’s salary in Australia ranges from AU$42,750 to AU$198,526 per year. PayScale reported the median doctor salary to be AU$100,435. Their basic salary is around AU$27,987 to AU$183,994 with an added bonus of up to AU$20,044."}, {"url": "http://www.bestmedicaldegrees.com/salary-of-doctors/", "passage_text": "That’s almost half of a doctors average net residency income of $50,000. So, for a doctor practicing internal medicine to forbear a $300,000 loan for three years during residency, then repay that loan for 20 years, it would result in an overall loan cost of $687,360. That’s $34,368 per year for 20 years."}, {"url": "http://www.healthcare-salaries.com/physicians/medical-doctor-salary-md", "passage_text": "Average Medical doctor salary in US. An average annual salary for a specialist MD in the United States is around $339,738; while an annual salary for an MD general practitioner is around $186,044 per annum. The average salaries for physicians possessing Doctor of Medicine (M.D.) degree depends on various determinants."}]