[{"url": "http://www.parliament.uk/site-information/glossary/delegated-or-secondary-legislation/", "passage_text": "An Act of Parliament (primary legislation) will often empower ministers to make further regulations within its scope after it has become law. These regulations are 'secondary' or 'delegated' legislation. Delegated legislation often takes the form of a statutory instrument. 1  About Parliament: Delegated legislation. 2  Related glossary term: Acts of .... "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20120130015646AAotfBJ", "passage_text": "Report Abuse. Primary legislation is law made by the legislative branch of government. This contrasts with secondary legislation, which is usually made by the executive branch. Secondary (or delegated) legislation must be authorised by primary legislation, and conform to boundaries it has laid down"}, {"url": "https://en.wikipedia.org/wiki/Primary_legislation", "passage_text": "Primary legislation is law made by the legislative branch of government. That contrasts with secondary legislation, which is usually made by the executive branch. Secondary (or delegated) legislation must be authorised by primary legislation and must conform to boundaries laid down. In the United Kingdom, and other Commonwealth nations, primary legislation takes the form of an Act of Parliament, and in the United States, it is (at the federal level) an Act of Congress. In European Union law, the founding treaties are the main primary legislatio"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_primary_legislation_and_delegated_legislation", "passage_text": "Primary legislation is the legislation which has been passed by elected leaders, such as Parliament or Congress. Delegated legislation is rules and regulations which is set by … the civil service, which cannot override Primary Legislation. 11 people found this useful. Delegated legislation is rules and regulations which is set by the civil service, which cannot override Primary Legislation. For example, a piece of Primary legislation may allow a government agency to set regulations for something. These regulations would then be a type of delegated l"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_primary_legislation_and_delegated_legislation", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Primary legislation is the legislation which has been passed by elected leaders, such as Parliament or Congress. Delegated legislation is rules and regulations which is set by the civil service, which cannot override Primary Legislation. For example, a piece of Primary legislation may allow a government agency to set regulations for something. These regulations would then be a type of delegated legislation."}, {"url": "http://www.ehow.com/about_5510537_define-primary-legislation.html", "passage_text": "Acts are divided into primary and secondary legislation, with the primary legislation taking precedence over all other forms of law. Primary legislation is not subjected to scrutiny by the judicial branch, as the courts do not have the ability to question the validity of statutes. One of the differences between primary and secondary legislation are the branches of government that write and pass the laws. In the U.K., the legislative branch issues primary legislation, while the secondary legislation is passed by the executive branch."}, {"url": "http://www.ehow.com/about_5510537_define-primary-legislation.html", "passage_text": "In summation, primary legislation is defined as the supreme authority of law in the United Kingdom. It is considered primary due to its ability to override all other forms of law. Primary legislation is an act of Parliament and is comparable to an act of Congress at the federal level in the United States. Primary legislation includes acts both public and private and prevails over the United Kingdom in its entirety. One of the differences between primary and secondary legislation are the branches of government that write and pass the laws. In the U.K., the legislative branch issues primary legislation, while the secondary legislation is passed by the executive branch."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20120130015646AAotfBJ", "passage_text": "Best Answer: Primary legislation is a general term for all the enactments passed by Parliament to become law. Secondary legislation refers to the body of rules and legislation which are subsequently set in place by government departments authorised to do so by Parliament on the basis of the primary legislation. Primary legislation is law made by the legislative branch of government. This contrasts with secondary legislation, which is usually made by the executive branch. Secondary (or delegated) legislation must be authorised by primary legislation, and conform to boundaries it has laid dow"}]