[{"url": "http://www.tpub.com/weather2/8-30.htm", "passage_text": "IMPORTANCE OF CONVERGENCE AND DIVERGENCE The importance of convergence and di-vergence is related to pressure changes at the surface and height changes of the constant-pressure levels. As the air accumulates in the 300-200-mb stratum over a region, greater pressure is exerted throughout the atmosphere. In order for divergence to take place, the. The simplest form of convergence and di-vergence. Wind speed in relation to wind direction is also a contributor to convergence and divergence. If the wind speed decreases downstream, there s a net inflow of air into the region, and convergence takes place."}, {"url": "http://thebritishgeographer.weebly.com/the-climate-of-tropical-regions.html", "passage_text": "The map below shows the areas within the tropics which have all 12 months of the year with temperatures above 18 °C. The three types of tropical climate are classified as Tropical Rainforest or Equatorial (Af), Tropical Monsoon (Am) and Tropical Wet and Dry or Savannah (Aw). The second distinctive climate feature of tropical regions is the dry season. As you can see from the diagram to the right of the Hadley circulation air rises above the ITCZ to create a low pressure zone, characterised by high humidity and rainfall. Further north and south of this zone air begins to sink."}, {"url": "http://thebritishgeographer.weebly.com/the-climate-of-tropical-regions.html", "passage_text": "The Tropical Climate Control. The most important climate control in regard to the tropical climate types relates to the position of the Inter Tropical Convergent Zone or ITCZ. The ITCZ is an area of low pressure and marks the point of trade wind convergence. The second distinctive climate feature of tropical regions is the dry season. As you can see from the diagram to the right of the Hadley circulation air rises above the ITCZ to create a low pressure zone, characterised by high humidity and rainfall. Further north and south of this zone air begins to sink."}, {"url": "http://www.tpub.com/weather2/8-30.htm", "passage_text": "OUTLINE Importance of convergence and divergence Convergence and divergence (simple motions) Convergence and divergence CONVERGENCE AND DIVERGENCE Convergence is the accumulation of air in a region or layer of the atmosphere, while levels. In order for divergence to take place, the. The simplest form of convergence and di-vergence. Wind speed in relation to wind direction is also a contributor to convergence and divergence. If the wind speed decreases downstream, there s a net inflow of air into the region, and convergence takes place."}, {"url": "https://en.wikipedia.org/wiki/Intertropical_Convergence_Zone", "passage_text": "In the seamen's speech the zone is referred to as the doldrums because of its erratic weather patterns with stagnant calms and violent thunderstorms. The ITCZ appears as a band of clouds, usually thunderstorms, that circle the globe near the equator. In the Northern Hemisphere, the trade winds move in a southwestern direction from the northeast, while in the Southern Hemisphere, they move northwestward from the southeast. For instance, when the ITCZ is situated north of the equator, the southeast trade wind changes to a southwest wind as it crosses the equator. The ITCZ is formed by vertical motion largely appearing as convective activity of thunderstorms driven by solar heating, which effectively draw air in; these are the trade winds."}, {"url": "https://en.wikipedia.org/wiki/Intertropical_Convergence_Zone", "passage_text": "The Inter Tropical Convergence Zone (ITCZ), known by sailors as the doldrums, is the area encircling the earth near the equator where the northeast and southeast trade winds come together. For instance, when the ITCZ is situated north of the equator, the southeast trade wind changes to a southwest wind as it crosses the equator. The ITCZ is formed by vertical motion largely appearing as convective activity of thunderstorms driven by solar heating, which effectively draw air in; these are the trade winds."}, {"url": "http://www.cabrillo.edu/~dbalogh/geography/geography1/pdf/pretest_2nd.pdf", "passage_text": "The region in which the intertropical convergence can be found is ______. a) near the North Pole b) the Equator c) the Southeastern United State d) northern Australia e) central Siberia 8. The contact zone of warm tropical and cold Polar air is known as the a) subtropical high b) Polar easterly c) Polar front d) monsoon e) intertropical convergence 10. ______ are map lines connecting points of equal atmospheric pressure. a) Isobars b) Millibars c) Contours d) Isohyets e) Isotherms 11."}, {"url": "https://quizlet.com/15536595/chapter-14-convergent-boundaries-flash-cards/", "passage_text": "Appalachian Mountains. Old, eroded mountains; the oldest in North America; they extend from Canada to western Alabama; formation is a result of 3 different mountain-building episodes. 1st ~600 mill. years ago two subduction zones likely formed.   . Old, eroded mountains; the oldest in North America; they extend from Canada to western Alabama; formation is a result of 3 different mountain-building episodes."}]