[{"url": "http://legal-dictionary.thefreedictionary.com/Fruit+of+the+Poisonous+Tree", "passage_text": "The name fruit of the poisonous tree is thus a metaphor: the poisonous tree is evidence seized in an illegal arrest, search, or interrogation by law enforcement. The fruit of this poisonous tree is evidence later discovered because of knowledge gained from the first illegal search, arrest, or interrogation. The principle that prohibits the use of secondary evidence in trial that was culled directly from primary evidence derived from an illegal Search and Seizure. The fruit of the poisonous tree doctrine is an offspring of the Exclusionary Rule."}, {"url": "http://legal-dictionary.thefreedictionary.com/Fruit+of+the+Poisonous+Tree", "passage_text": "The term fruit of the poisonous tree was first used in Nardone v. United States, 308 U.S. 338, 60 S. Ct. 266, 84 L. Ed. 307 (1939). In Nardone, Frank C. Nardone appealed his convictions for Smuggling and concealing alcohol and for conspiracy to do the same. The principle that prohibits the use of secondary evidence in trial that was culled directly from primary evidence derived from an illegal Search and Seizure. The fruit of the poisonous tree doctrine is an offspring of the Exclusionary Rule."}, {"url": "https://en.wikipedia.org/wiki/List_of_poisonous_plants", "passage_text": "Some plants have physical defenses such as thorns, spines and prickles, but by far the most common type of protection is chemical. Over millennia, through the process of natural selection, plants have evolved the means to produce a vast and complicated array of chemical compounds in order to deter herbivores. Many of the known plant defense compounds primarily defend against consumption by insects, though other animals, including humans, that consume such plants may also experience negative effects, ranging from mild discomfort to death. Many of these poisonous compounds also have important medicinal benefits."}, {"url": "https://en.wikipedia.org/wiki/Manchineel", "passage_text": "The manchineel tree, Hippomane mancinella, is a species of flowering plant in the spurge family (Euphorbiaceae). It is native to tropical southern North America and northern South America. Hippomane mancinella, the Manchineel tree, grows up to 15 metres (49 ft) tall. It has a greyish bark and shiny green leaves. Spikes of small greenish flowers are followed by fruits, which are similar in appearance to an apple, are green or greenish-yellow when ripe."}, {"url": "http://weirdnewsfiles.com/the-most-poisonous-tree-in-the-world/", "passage_text": "Tweet. The Manchineel tree, native to the western hemisphere, which is known as the most poisonous tree in the world. In places where it grows like Florida, the Caribbean and the Bahamas, the tree is often marked with warning signs, so the people who pass by won’t go near it. "}, {"url": "http://www.oddee.com/item_97805.aspx", "passage_text": "One of the most deadly trees in the world, these evergreens are common in the forests of Europe. With the exception of the berries, all of the tree is toxic, and the Yew was once used by early herbalists to induce abortions. The flowering plants are considered among the most poisonous trees in the world and are native to Florida, the Bahamas, the Caribbean, Central America and northern South America. The Spanish name is manzanilla de la muerte: which means little apple of death."}, {"url": "https://en.wikipedia.org/wiki/Manchineel", "passage_text": "The name manchineel (sometimes written manchioneel) as well as the specific epithet mancinella is from Spanish manzanilla (little apple), from the superficial resemblance of its fruit and leaves to those of an apple tree. Hippomane mancinella, the Manchineel tree, grows up to 15 metres (49 ft) tall. It has a greyish bark and shiny green leaves. Spikes of small greenish flowers are followed by fruits, which are similar in appearance to an apple, are green or greenish-yellow when ripe."}, {"url": "https://en.wikipedia.org/wiki/List_of_poisonous_plants", "passage_text": "1 Euonymus europaeus (commonly known as spindle, European spindle or spindle tree). 2  The fruit is poisonous, containing amongst other substances, the alkaloids theobromine and caffeine, as well as an extremely bitter terpene. 3  Poisonings are more common in young children, who are enticed by the brightly coloured fruits. Many of the known plant defense compounds primarily defend against consumption by insects, though other animals, including humans, that consume such plants may also experience negative effects, ranging from mild discomfort to death. Many of these poisonous compounds also have important medicinal benefits."}, {"url": "http://ucanr.edu/sites/poisonous_safe_plants/Toxic_Plants_by_common_Name_659/", "passage_text": "Toxic Plants (by common name). To search for photos of these plants, check the UC Berkeley CalPhotos: Plants site. Toxicity Class (third column in table below). 1  Major Toxicity: These plants may cause serious illness or death. 2  If ingested, immediately call the Poison Control Center -- (800) 222-1222 -- or your doctor. "}]