[{"url": "http://skunkfacts.net/skunks_habitat/skunks_habitat.html", "passage_text": "The basics of a skunk’s habitat. Skunks can adapt to just about any environment, but most of them prefer wooded areas. Some species of skunk prefer open or agricultural areas, while others would rather live in rocky areas. Some varieties can even live in dry areas. There are 10 different skunk species and there are several different kinds of habitats that are preferable to each one. In terms of size, skunks can range from one pound up to 20 pounds and from 15 to 40 inches."}, {"url": "http://tracker.cci.fsu.edu/skunk/", "passage_text": "Welcome to the Skunk Habitat. Skunks are small black and white mammals that are most widely known for the powerful odor they spray when they feel threatened. They live across North America, from central Canada down to northern Mexico and can be found throughout Florida"}, {"url": "http://www.havahart.com/skunk-facts", "passage_text": "The most common and recognized skunk species in North America is the striped skunk, whose range extends from the southern half of Canada to the northernmost parts of Mexico, covering most of the continental United States. Skunks are extremely adaptable and thrive in many different habitats, as long as food and shelter are available. Because they rarely travel more than 2 miles from their established dens, a skunk will typically settle down within 2 miles of a water source."}, {"url": "http://www.outwitcritters.com/skunk/habitat.html", "passage_text": "Skunk Habitat. Skunk Habitat is fairly common among all species. In the wild they choose areas that are more open including clearings in forests, and prairies. They live in pastures and the open areas along forest edges. Skunk Habitat-Range. Skunks are native to North America with the exception of the Asian Badger who was only recently added to the skunk family by scientists. The Striped Skunk’s habitat range is found fairly far north but does not extend as far as Alaska. Its southern range extends only slightly into Mexico"}, {"url": "http://tracker.cci.fsu.edu/skunk/about/where/", "passage_text": "Striped skunks are native to North America, and can be found in Northern Mexico, throughout the United States, and as far north as Central Canada. Other species of skunks, such as the spotted skunk and the hog-nosed skunk, can be found further south, ranging from Canada to Central and South America. Stink badgers, which resemble the hog-nosed skunk, are strictly found in the Philippines, Malaysia, and Indonesia."}, {"url": "https://en.wikipedia.org/wiki/Skunk", "passage_text": "Mephitis mephitis, the striped skunk species, is the most social skunk and the one most commonly domesticated. When a skunk is kept as a pet, its scent glands are often surgically removed. Skunks can legally be kept as pets in the UK, but the Animal Welfare Act 2006 has made it illegal to remove their scent glands. Skunks are mammals known for their ability to spray a liquid with a strong odor. Different species of skunk vary in appearance from black-and-white to brown or cream colored, but all have warning coloration."}, {"url": "http://wildliferemovalplus.com/wildlife-facts/skunks-facts-and-information/", "passage_text": "Skunks Description and Habitats. The skunk is 20” to 30” long including a 10” to 15” tail weighing 6 to 12 lbs. There coat is thick, fluffy, mainly black with a large white nape patch that continues and becomes two stripes along sides of back, usually reaching the tail (occasionally mostly white above). "}]