[{"url": "http://www.pigeonrivercanoeandcamp.com/rates.htm", "passage_text": "All prices are based on 2 people per canoe. Third person in canoe (13 or older) costs half the canoe rental. Third person in canoe (12 or younger) is free. No more than 3 people (13 or older) allowed in 1 canoe. All canoe rentals come with 2 paddles per canoe and as many life jackets as needed. Extra paddles can be rented for $5.00/each (depending on availability). Canoers are liable for lost or damaged equipment. Shuttle service is included with rental"}, {"url": "http://www.howmuchisit.org/how-much-does-a-canoe-cost/", "passage_text": "1 Handcrafted canoes that are made from wood or cedar can cost $900 to $2,600. 2  A higher end canoe such as one made of fiberglass can cost as much as $8,000. 3  For example, the KL Industries Water Quest 156 canoe can cost anywhere from $550 to $675. 4  The Advanced Elements Straight Edge can cost $550 to $600. Most standard canoes can fit 2, while larger canoes can fit up to 4. The cost of a canoe is going to greatly vary depending on the size, the brand, and other various factors. 1  On average, a canoe is going to cost anywhere from $430 to as much as $2,600 for a higher end, handcrafted unit. 2  Most purchases are going to be within the $430 to $800 price tag range"}, {"url": "http://www.howmuchisit.org/how-much-does-a-canoe-cost/", "passage_text": "1 On average, a canoe is going to cost anywhere from $430 to as much as $2,600 for a higher end, handcrafted unit. 2  Most purchases are going to be within the $430 to $800 price tag range. 3  An inflatable canoe that can be blown up with a simple pump can cost anywhere from $180 to as much as $2,000 for a 14 seater. Most standard canoes can fit 2, while larger canoes can fit up to 4. The cost of a canoe is going to greatly vary depending on the size, the brand, and other various factors. 1  On average, a canoe is going to cost anywhere from $430 to as much as $2,600 for a higher end, handcrafted unit. 2  Most purchases are going to be within the $430 to $800 price tag range"}, {"url": "https://answers.yahoo.com/question/index?qid=20101215144353AAX4Yde", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Kayaks run from a couple of hundred dollars for a cheap recreational style boat (only safe for ponds and small slow streams) to several thousand dollars for a high-end touring kayak you can safely take into the open ocean. So there really is no average cost. If you would prefer an inflatable kayak for easy portability and storage the price range is roughly $100 - $2000. With an average good quality one costing anywhere between $250 and $1000."}, {"url": "http://www.jeffscanoerentals.com/PriceRental.htm", "passage_text": "Here at Jeff's Canoe Rental, we offer one and two day floats. Our one day canoe floats leave you with your choice of either a 6 or 11 mile float. If you prefer the slower paced rafts, we only offer the 6 mile float. Note: Occasionally, on weekends, our 10am, 6 mile float fills to capacity. Our 11 mile float is popular with fisherman and paddlers. On average this float takes 6-8 hours to complete. Departure time for the 11 mile float is 8am. Please arrive by 7:30am-7:45am for check-in. 6 Mile Float leaves Sunday-Friday at 10am."}, {"url": "http://www.sugarvalleycanoes.com/trip-info.html", "passage_text": "Canoe, Kayak, and Tube Trips. Prices are good for 2 persons/canoe & 1 person/kayak. Additional cost for extra persons; canoes can have up to 3 adults or 2 adults & 2 children under the age of 8. Additional deposit required (minimum $20 or $5 per canoe/kayak). 7% sales tax included"}, {"url": "https://answers.yahoo.com/question/index?qid=20101215144353AAX4Yde", "passage_text": "Kayak/canoe rentals are around $30 per half day and $40 for a full day. If you want to try the sport out, or just see if you like it, it would probably be best to start with a rental somewhere. If you would prefer an inflatable kayak for easy portability and storage the price range is roughly $100 - $2000. With an average good quality one costing anywhere between $250 and $1000."}, {"url": "http://riversedgeoutfitters.com/rental-rates/", "passage_text": "10am to 1pm 7 days/week. Pricing. Canoes: 1-4 canoes rented – $43 per canoe; 5-9 canoes rented and paid by single payer – $39 per canoe; 10 or canoes rented and paid by single payer – $34 per canoe. Kayaks: $32. Rafts: Not available on Kenton’s Run as the distance is too long for a raft."}]