[{"url": "http://www.extento.hawaii.edu/Kbase/Crop/crops/i_mango.htm", "passage_text": "DESCRIPTION Back To: Menu Bar. Mango trees are deep-rooted, symmetrical evergreens that attain heights of 90 feet and widths of 80 feet. Mango trees have simple alternate lanceolate leaves that are 12 to 16 inches in length and yellow-green, purple, or copper in color when young. Mature leaves are leathery, glossy, and deep green in color. New leaves arise in terminal growth flushes that occur several times a year."}, {"url": "https://en.wikipedia.org/wiki/Mango", "passage_text": "While other Mangifera species (e.g. horse mango, Mangifera foetida) are also grown on a more localized basis, Mangifera indica —the common mango or Indian mango—is the only mango tree commonly cultivated in many tropical and subtropical regions. A mango tree in full bloom in Kerala. Mango trees grow up to 35–40 m (115–131 ft) tall, with a crown radius of 10 m (33 ft). The trees are long-lived, as some specimens still fruit after 300 years."}, {"url": "http://www.thefreedictionary.com/mango+trees", "passage_text": "Noun. 1. mango-large evergreen tropical tree cultivated for its large oval fruit. Mangifera indica, mango tree. mango-large oval tropical fruit having smooth skin, juicy aromatic pulp, and a large hairy seed. edible fruit-edible reproductive body of a seed plant especially one having sweet flesh. Mangifera indica, mango, mango tree-large evergreen tropical tree cultivated for its large oval fruit. Noun. 1. mango-large evergreen tropical tree cultivated for its large oval fruit. Mangifera indica, mango tree. mango-large oval tropical fruit having smooth skin, juicy aromatic pulp, and a large hairy seed. fruit tree-tree bearing edible fruit."}, {"url": "https://en.wikipedia.org/wiki/Mango", "passage_text": "The mango is a juicy stone fruit belonging to the genus Mangifera, consisting of numerous tropical fruiting trees, cultivated mostly for edible fruit. The majority of these species are found in nature as wild mangoes. They all belong to the flowering plant family Anacardiaceae. A mango tree in full bloom in Kerala. Mango trees grow up to 35–40 m (115–131 ft) tall, with a crown radius of 10 m (33 ft). The trees are long-lived, as some specimens still fruit after 300 years."}, {"url": "https://www.hort.purdue.edu/newcrop/morton/mango_ars.html", "passage_text": "M. foetida Lour., the horse mango, is a handsome, well-formed tree, 60 to 80 ft (18-24 m) tall with very stiff leaves and showy particles of pink-red, odorless flowers. The fruit is oblong, 3 to 5 1/2 in (7.5-16 cm) long, plump, with yellowish-or grayish-green skin when ripe. "}, {"url": "http://www.answers.com/Q/How_would_you_describe_a_mango", "passage_text": "Confidence votes 697. A mango is a tropical fruit found in various southern countries with high temperatures. It comes in a variety of colors, from green (unripe) to deep red (ripe). It contains a pit in the middle, like peaches, and has a waxy layer of skin on the outside"}, {"url": "http://mango-trees.blogspot.com/2011/08/description-of-mango-fruit.html", "passage_text": "Description of mango fruit. This tropical fruit is high in vitamin C. Mango fruits contain 10-20 percent sugar and are important source of vitamin A. They have a rich, luscious aromatic flavor and a delicious taste in which sweetness and acidity are delicately blended. The mango fruit is a large, fleshy drupe, containing an edible mesocarp of varying thickness. The mesocarp is resinous and highly variable with respect to shape, size, color, presence of fiber and flavor."}, {"url": "http://www.mdidea.com/products/herbextract/mangiferin/data03.html", "passage_text": "Uses of Mango Leaves,Seeds and Bark. The mango is the most popular fruit of the tropics and is called 'The King of Asiatic fruits'. It is regarded as a valuable item of diet and a household remedy. The mango is fleshy drupe, variable in size and shape, with varying mixtures of green, yellow and red color. The mango is indigenous to India"}]