[{"url": "http://www.metoffice.gov.uk/public/weather/forecast/gcxtfnft4?map=SignificantWeather", "passage_text": "High pressure looks to remain close to the UK for much of this period and settled but cool weather should continue. Most places will be dry with a mix of sunshine and scattered cloud, although a few light showers, brought in on the cool breeze, may pepper windward coastal areas at times. The most probable trend, however, is for the northwest of the UK to see the bulk of any wet and windy weather, with the southeast drier and more settled, although here there are still likely to be occasional showers or spells of rain."}, {"url": "http://www.whitbyweather.com/index.php?p=1_10_Tides-Moon", "passage_text": "You can see full details of tides at Whitby for the month ahead by clicking on the National Oceanography Centre logo: The SS Hermiston Built in 1901 the 4,389 ton Steam Ship Hermiston was owned by The Borderdale Shipping Co. of Glasgow, She ran aground on Ness Point and was later towed off by four tugs. Tides & Moon. Photo by Paul AllisonIt is well worth keeping an eye on the state of the tide when planning your day on the beach and please take great care when setting out on a walk along the coast, the tide can come in very quickly."}, {"url": "http://www.worldweatheronline.com/Whitby-weather/Ontario/CA.aspx", "passage_text": "Whitby weather text for Thu 15 th October. The weather is going to be sunny. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1009 mb. The daytime temperature is going to reach 19 °c and the temperature is going to dip to 7 °c at night. Whitby weather text for Sun 18 th October. It looks on Sunday, 18 October the Whitby weather is going to be overcast. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1030 mb. The daytime temperature is going to reach 7 °c and the temperature is going to dip to 1"}, {"url": "http://www.bbc.com/weather/2634135?day=1", "passage_text": "Information given for most appropriate forecast location. See FAQs for details. Copyright © 2015 BBC. The BBC is not responsible for the content of external sites. Read more. This page is best viewed in an up-to-date web browser with style sheets (CSS) enabled. While you will be able to view the content of this page in your current browser, you will not be able to get the full visual experience."}, {"url": "http://www.metoffice.gov.uk/public/weather/forecast/gcxtfnft4?map=SignificantWeather", "passage_text": "UK Outlook for Sunday 25 Oct 2015 to Sunday 8 Nov 2015: The weather for the end of October and into early November looks rather uncertain at this stage with a number of possibilities across the UK at this time. The most probable trend, however, is for the northwest of the UK to see the bulk of any wet and windy weather, with the southeast drier and more settled, although here there are still likely to be occasional showers or spells of rain."}, {"url": "http://www.metoffice.gov.uk/public/weather/forecast/gcxtfnft4", "passage_text": "UK Outlook for Tuesday 27 Oct 2015 to Tuesday 10 Nov 2015: The weather for the end of October and into early November looks very uncertain at this stage with a number of possibilities across the UK at this time. High pressure looks likely to remain close to or just west of the UK for much of this period with generally settled weather continuing. Most places will be dry with variable, but often large amounts of cloud and some sunny or clear spells."}, {"url": "http://www.worldweatheronline.com/Whitby-weather/Ontario/CA.aspx", "passage_text": "Whitby weather text for Sat 17 th October. The Whitby weather is going to be cloudy. Whitby visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1024 mb. The daytime temperature is going to reach 8 °c and the temperature is going to dip to 0 °c at night. Whitby weather text for Sun 18 th October. It looks on Sunday, 18 October the Whitby weather is going to be overcast. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1030 mb. The daytime temperature is going to reach 7 °c and the temperature is going to dip to 1"}, {"url": "http://www.holiday-weather.com/whitby/averages/", "passage_text": "Whitby: Annual Weather Averages. The most daily sunshine hours in Whitby are 9 in June. The best month to swim in the sea is in August when the average sea temperature is 16°C (61°F)."}, {"url": "http://www.worldweatheronline.com/Whitby-weather/Ontario/CA.aspx", "passage_text": "Whitby weather text for Tue 20 th October. It looks on Tuesday, 20 October the Whitby weather is going to be sunny. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1018 mb. The daytime temperature is going to reach 18 °c and the temperature is going to dip to 13 °c at night. Whitby weather text for Sun 18 th October. It looks on Sunday, 18 October the Whitby weather is going to be overcast. The visibility is going to be around 10 km i.e. 6 miles and an atmospheric pressure of 1030 mb. The daytime temperature is going to reach 7 °c and the temperature is going to dip to 1"}]