[{"url": "http://drsaulmarcus.com/mentalillness/Organicacidtestingmental.html", "passage_text": "Some advantages to organic acid testing. 1  Organic acid tests shows if you have enough to meet your specific metabolic needs. 2  Just counting up how much of any vitamin is in your blood doesn't do this. 3  Not all vitamins are stored in the blood. 4  For example vitamin B12 is stored in the liver."}, {"url": "http://www.webmd.com/digestive-disorders/alanine-aminotransferase-alt", "passage_text": "The alanine aminotransferase (ALT) test is done to: 1  Identify liver disease, especially cirrhosis and hepatitis caused by alcohol, drugs, or viruses. 2  Help check for liver damage. 3  Find out whether jaundice was caused by a blood disorder or liver disease. 4  Keep track of the effects of medicines that can damage the liver."}, {"url": "http://drsaulmarcus.com/mentalillness/Organicacidtestingmental.html", "passage_text": "The organic acid Formiminoglutamate (FIGLU) can be tested. FIGLU is converted into glutamate by folate. Hi FIGLU in the urine indicates a functional need for more folate. There is a blood test for folate, but at times it comes back normal despite"}, {"url": "http://drsaulmarcus.com/mentalillness/Organicacidtestingmental.html", "passage_text": "1 Organic acid tests shows if you have enough to meet your specific metabolic needs. 2  Just counting up how much of any vitamin is in your blood doesn't do this. 3  Not all vitamins are stored in the blood. 4  For example vitamin B12 is stored in the liver."}, {"url": "http://drsaulmarcus.com/mentalillness/Organicacidtestingmental.html", "passage_text": "Some advantages to organic acid testing. 1  Organic acid tests shows if you have enough to meet your specific metabolic needs. 2  Not all vitamins are stored in the blood. 3  There are some metabolites for which there are no blood tests. 4  Organic acid tests can reveal problems before they show up as deficiencies on other tests."}, {"url": "http://www.webmd.com/digestive-disorders/alanine-aminotransferase-alt", "passage_text": "An alanine aminotransferase (ALT) test measures the amount of this enzyme in the blood. ALT is found mainly in the liver, but also in smaller amounts in the kidneys, heart, muscles, and pancreas. ALT was formerly called serum glutamic pyruvic transaminase (SGPT)."}, {"url": "http://www.idph.state.il.us/HealthWellness/fs/organic.htm", "passage_text": "Definition. Organic acid disorders are a group of inherited metabolic conditions. Each organic acid disorder is associated with a specific enzyme deficiency that causes the accumulation of organic acids in blood and urine."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/prnanmia/diagnosis", "passage_text": "Hematocrit is a measure of how much space red blood cells take up in your blood. A low level of hemoglobin or hematocrit is a sign of anemia. The normal range of these levels may be lower in certain racial and ethnic populations. Your doctor can explain your test results to you."}, {"url": "https://labtestsonline.org/understanding/analytes/phosphorus/tab/test", "passage_text": "Since mildly abnormal phosphorus levels usually cause no symptoms, phosphorus testing is typically performed in follow up to an abnormal calcium test and/or when symptoms of abnormal calcium such as fatigue, muscle weakness, cramping, or bone problems are present."}]