[{"url": "http://www.mayoclinic.org/diseases-conditions/cold-sore/basics/causes/CON-20021310", "passage_text": "Causes. Cold sores are caused by certain strains of the herpes simplex virus (HSV). HSV-1 usually causes cold sores. HSV-2 is usually responsible for genital herpes. However, either type can cause sores in the facial area or on the genitals. Cold sores are caused by certain strains of the herpes simplex virus (HSV). HSV-1 usually causes cold sores. HSV-2 is usually responsible for genital herp"}, {"url": "https://en.wikipedia.org/wiki/Cold_sores", "passage_text": "Herpes labialis (also called cold sores, fever blisters, herpes simplex labialis, recurrent herpes labialis, or orolabial herpes) is a type of herpes simplex occurring on the lip, i.e. an infection caused by herpes simplex virus (HSV). An outbreak typically causes small blisters or sores on or around the mouth. "}, {"url": "http://www.emedicinehealth.com/cold_sores/article_em.htm", "passage_text": "Cold Sore Causes. The virus that causes cold sores is known as the herpes simplex virus (HSV). There are two types of HSV, type I and type II. Cold sores are usually caused by type I. Herpes simplex is a contagious oral virus. The virus is spread from person to person by kissing or other close contact with sores or even from contact with apparently normal skin that is shedding the virus. Infected saliva is also a means of spreading the virus. Cold sores are small, painful, fluid-filled blisters or sores that appear on the lips, mouth, or nose that are caused by a virus. The sores can be painful and usually last a few days. Unlike most viral infections, the cold sore virus is not completely eliminated by the body defenses."}, {"url": "http://www.medicalnewstoday.com/articles/172389.php", "passage_text": "Most cases of cold sores are a consequence of infection with HSV-1 (herpes simplex virus type 1). Infection with HSV-2, usually resulting from oral sex with a person who has genital herpes, is a much less common cause of cold sore outbreaks. 1 Cold sores are caused by the herpes simplex virus strain HSV-1. 2  On rare occasions cold sores may be caused by strain HSV-2 - a result of having oral sex with someone who has genital herpes. 3  Cold sores usually clear within 7-10 days without treatment."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/cold-sores-topic-overview", "passage_text": "Cold sores, sometimes called fever blisters, are groups of small blisters on the lip and around the mouth. The skin around the blisters is often red, swollen, and sore. The blisters may break open, leak a clear fluid, and then scab over after a few days. They usually heal in several days to 2 weeks. Cold sores are caused by the herpes simplex virus (HSV) . There are two types of herpes simplex virus: HSV-1 and HSV-2. Both virus types can cause sores around the mouth (herpes labialis) and on the genitals (genital herpes). Cold sores can also be spread to other areas of the body. The first symptoms of cold sores may include pain around your mouth and on your lips, a fever, a sore throat, or swollen glands in your neck or other parts of the body. Small children sometimes drool before cold sores appear."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/understanding-cold-sores-basics", "passage_text": "Cold sores -- also called fever blisters -- are a painful infection caused by the herpes simplex virus (HSV). These blisters are usually caused by HSV type 1, but can less commonly be due to HSV type 2. Genital herpes is usually caused by herpes simplex virus type 2. A person with a cold sore who performs oral sex on another person can give that person genital lesions with HSV-1."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/understanding-cold-sores-basics", "passage_text": "Cold sores are usually caused by the herpes simplex virus (HSV) type 1, which is transmitted by such forms of contact as kissing an infected person or sharing eating utensils, towels, or razors. Genital herpes is usually caused by herpes simplex virus type 2. A person with a cold sore who performs oral sex on another person can give that person genital lesions with HSV-1. Similarly, a person who performs oral sex on another person with genital HSV-2 lesions can develop oral lesion"}, {"url": "http://www.medicalnewstoday.com/articles/172389.php", "passage_text": "Cold sores are caused by the herpes simplex viruses; the most common cause of sores around the mouth is herpes simplex type 1, or HSV-1. Much less commonly, cold sores may be caused by HSV-2 (herpes simplex type 2), which may result from having oral sex with a person who has genital herpes. 1 Cold sores are caused by the herpes simplex virus strain HSV-1. 2  On rare occasions cold sores may be caused by strain HSV-2 - a result of having oral sex with someone who has genital herpes. 3  Cold sores usually clear within 7-10 days without treatment."}]