[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=15383", "passage_text": "Lipids are an important part of living cells. Together with carbohydrates and proteins, lipids are the main constituents of plant and animal cells. Cholesterol and triglycerides are lipids. Lipids are easily stored in the body. They serve as a source of fuel and are an important constituent of the structure of cells. Lipids include fatty acids, neutral fats, waxes and steroids (like cortisone). Lipids: Another word for fats. (Please see the various meanings of Fat.) Lipids can be more formally defined as substances such as a fat, oil or wax that dissolves in alcohol but not in water."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4168", "passage_text": "Lipid: Another word for fat. (Please see the various meanings of fat.) A lipid is chemically defined as a substance that is insoluble in water and soluble in alcohol, ether, and chloroform. Lipids are an important component of living cells. Together with carbohydrates and proteins, lipids are the main constituents of plant and animal cells. Cholesterol and triglycerides are lipids. Lipids are easily stored in the body. They serve as a source of fuel and are an important constituent of the structure of cells. Lipids include fatty acids, neutral fats, waxes and steroids (like cortisone)"}, {"url": "http://www2.chemistry.msu.edu/faculty/reusch/VirtTxtJml/lipids.htm", "passage_text": "The common feature of these lipids is that they are all esters of moderate to long chain fatty acids. Acid or base-catalyzed hydrolysis yields the component fatty acid, some examples of which are given in the following table, together with the alcohol component of the lipid. "}, {"url": "https://en.wikipedia.org/wiki/Lipid", "passage_text": "Fatty acids or fatty acid residues when they form part of a lipid, are a diverse group of molecules synthesized by chain-elongation of an acetyl-CoA primer with malonyl-CoA or methylmalonyl-CoA groups in a process called fatty acid synthesis. Lipids may be broadly defined as hydrophobic or amphiphilic small molecules; the amphiphilic nature of some lipids allows them to form structures such as vesicles, multilamellar/ unilamellar liposomes, or membranes in an aqueous environment."}, {"url": "http://medical-dictionary.thefreedictionary.com/lipid", "passage_text": "lipid (lip´id) , n a heterogeneous group of substances related actually or potentially to the fatty acids that are soluble in nonpolar solvents such as benzene, chloroform, and ether and are relatively insoluble in water. Included are the fatty acids, acylglycerols, phospholipids, cerebrosides, and steroids. Any of a group of organic compounds, including the fats, oils, waxes, sterols, and triglycerides, that are insoluble in water but soluble in common organic solvents, are oily to the touch, and together with carbohydrates and proteins constitute the principal structural material of living cells. lip·id′ic adj."}, {"url": "http://biology.about.com/od/molecularbiology/ss/lipids.htm", "passage_text": "Lipids: Fats. Fats are composed of three fatty acids and glycerol. These so called triglycerides can be solid or liquid at room temperature. Those that are solid are classified as fats, while those that are liquid are known as oils. Fatty acids consist of a long chain of carbons with a carboxyl group at one end. "}, {"url": "https://en.wikipedia.org/wiki/Lipid", "passage_text": "Lipids are a group of naturally occurring molecules that include fats, waxes, sterols, fat-soluble vitamins (such as vitamins A, D, E, and K), monoglycerides, diglycerides, triglycerides, phospholipids, and others. Lipids may be broadly defined as hydrophobic or amphiphilic small molecules; the amphiphilic nature of some lipids allows them to form structures such as vesicles, multilamellar/ unilamellar liposomes, or membranes in an aqueous environment."}, {"url": "http://chemistry.about.com/od/lecturenoteslabs/a/lipids-introduction.htm", "passage_text": "Examples of common lipids include butter, vegetable oil, cholesterol and other steroids, waxes, phospholipids, and fat-soluble vitamins. The common characteristic of all of these compounds is that they are essentially insoluble in water yet soluble in one or more organic solvents. "}, {"url": "http://medical-dictionary.thefreedictionary.com/lipid", "passage_text": "n. Any of a group of organic compounds, including the fats, oils, waxes, sterols, and triglycerides, that are insoluble in water but soluble in common organic solvents, are oily to the touch, and together with carbohydrates and proteins constitute the principal structural material of living cells. lip·id′ic adj."}, {"url": "http://www.wisegeek.org/what-are-lipids.htm", "passage_text": "In biochemistry, lipids are molecular organic compounds, composed largely of carbon and hydrogen, that are essential for cell growth. Lipids are non-soluble in water and combine with carbohydrates and proteins to form the majority of all plant and animal cells. They are more commonly synonymous with the word fats when speaking in terms of personal health. Although all fats are lipids, not all lipids are fats"}]