[{"url": "http://california.hometownlocator.com/ca/amador/volcano.cfm", "passage_text": "Volcano ranks in the lower quartile for Population Density and Diversity Index when compared to the other cities, towns and Census Designated Places (CDPs) in California. See peer rankings below. The primary coordinate point for Volcano is located at latitude 38.4456 and longitude -120.6305 in Amador County."}, {"url": "http://www.answers.com/Q/Where_are_the_volcanoes_in_California_located", "passage_text": "The tallest, and most imposing, volcano in California is Mt.  Shasta, at 14,179 feet. However, the largest volcano by volume is  the Medicine Lake Volcano (which is also the … biggest volcano by  volume in the Cascades)."}, {"url": "http://www.usa.com/volcano-ca.htm", "passage_text": "volcano is located close to the center of california volcano is part of amador county volcano has 1 50 square miles of land area and has no water area as of 2010 the total volcano population is 115 volcano median household income is $ 89632 in 2008 2012"}, {"url": "http://volcano.oregonstate.edu/mono-lake-vol-field", "passage_text": "Volcanic Field, California. Location: 37.6N, 118.8W. Long Valley caldera, located at the boundary between the Sierra Nevada and the Basin and Range Province, is one of the largest Quaternary rhyolitic volcanic centers in North America. The caldera is elliptical in shape and 10 by 20 miles (15 by 30 km) in size."}, {"url": "http://www.answers.com/Q/Where_are_the_volcanoes_in_California_located", "passage_text": "The California volcanoes are Cosco (last activity 2.5 million years ago), Long Valley Caldera (last activity in the 1750's), Clear Lake (last activity 10,000 years ago), … Lassen Peak (last activity 1921), Mount Shasta (last activity 1786), and Medicine Lake (last activity 900 years ago)."}, {"url": "http://www.answers.com/Q/Where_are_volcanoes_located", "passage_text": "The most active volcanoes are found on the so-called ring of fire in Pacific Ocean. Indonesia has several volcanoes including Krakatoa. Hawaii's Kilauea produces the most lava of all active volcanoes in the world. North America has Mt. St. Helens and Mt. Rainier in Washington, USA."}, {"url": "https://en.wikipedia.org/wiki/Volcano,_California", "passage_text": "Volcano (formerly, Soldier's Gulch and The Volcano) is a census-designated place in Amador County, California. It lies at an elevation of 2070 feet (631 m). The population was 115 at the 2010 census. It is located at 38°26′35″N 120°37′51″W﻿ / ﻿38.44306°N 120.63083°W﻿ / 38.44306; -120.63083, just north of Pine Grove."}]