[{"url": "http://www.cwu.edu/~robinsos/ppages/resources/Theatre_History/Theahis_2.html", "passage_text": "Theatre and Drama in Ancient Greece The Greeks' history began around 700 B.C. with festivals honoring their many gods. One god, Dionysus, was honored with an unusual festival called the City Dionysia. "}, {"url": "https://en.wikipedia.org/wiki/Theatre_of_ancient_Greece", "passage_text": "Greek tragedy as we know it was created in Athens around the time of 532 BC, when Thespis was the earliest recorded actor. Being a winner of the first theatrical contest held at Athens, he was the exarchon, or leader, of the dithyrambs performed in and around Attica, especially at the rural Dionysia. 1 Mask and Performance in Greek Tragedy: from ancient festival to modern experimentation, Cambridge, 1997. 2  Wise, Jennifer, Dionysus Writes: The Invention of Theatre in Ancient Greece, Ithaca 1998."}, {"url": "http://www.slideshare.net/Nazish2010/greek-theatre-9213931", "passage_text": "1 2. About Greek Theatre. 2  3. 3  It all started in 534 BC, the ancient Athenians created a theatre culture and the first theatre was the ‘Western Theatre’ which is in Athens, Greece. 4  The types of musicals that they had then were about their gods and mostly held in honour of god Dionysian. 1 Music was often played during the chorus' delivery of its lines. 2  It all started in 534 BC, the ancient Athenians created a theatre culture and the first theat} DUPipeline_QISnippet_FirstGood_Snippet_v1: {},{-1|-1|1|"}, {"url": "http://www.slideshare.net/Nazish2010/greek-theatre-9213931", "passage_text": "1 3. 2  It all started in 534 BC, the ancient Athenians created a theatre culture and the first theatre was the ‘Western Theatre’ which is in Athens, Greece. 3  The types of musicals that they had then were about their gods and mostly held in honour of god Dionysian. 1 Music was often played during the chorus' delivery of its lines. 2  It all started in 534 BC, the ancient Athenians created a theatre culture and the first theat} DUPipeline_QISnippet_FirstGood_Snippet_v1: {},{-1|-1|1|Greek Theatre."}, {"url": "https://en.wikipedia.org/wiki/Theatre_of_ancient_Greece", "passage_text": "The word τραγῳδία (tragoidia), from which the word  tragedy  is derived, is a compound of two Greek words: τράγος (tragos) or goat and ᾠδή (ode) meaning song, from ἀείδειν (aeidein), to sing. This etymology indicates a link with the practices of the ancient Dionysian cults. 1 Mask and Performance in Greek Tragedy: from ancient festival to modern experimentation, Cambridge, 1997. 2  Wise, Jennifer, Dionysus Writes: The Invention of Theatre in Ancient Greece, Ithaca 1998."}, {"url": "http://www.slideshare.net/Nazish2010/greek-theatre-9213931", "passage_text": "1 2. About Greek Theatre. 2  It all started in 534 BC, the ancient Athenians created a theatre culture and the first theat} DUPipeline_QISnippet_FirstGoodLong_Snippet_v1: {},{-1|-1|1|Greek Theatre. 1 Music was often played during the chorus' delivery of its lines. 2  It all started in 534 BC, the ancient Athenians created a theatre culture and the first theat} DUPipeline_QISnippet_FirstGood"}, {"url": "http://anarchon.tripod.com/indexGREEKTH.html", "passage_text": "The theatre of Ancient Greece evolved from religious rites which date back to at least 1200 BC. At that time, Greece was peopled by tribes that we in our arrogance might label 'primitive'. In northern Greece, in an area called Thrace, a cult arose that worshipped Dionysus, the god of fertility and procreation. The Theatre of Dionysus, built at the foot of the Acropolis in Athens, could seat 17,000 people. During their heyday, the competitions drew as many as 30,000 spectators. The words theatre and amphitheatre derive from the Greek word theatron, which referred to the wooden spectator stands erected on those hillsides."}, {"url": "http://www.ancientgreece.com/s/Theatre/", "passage_text": "The Greek theatre history began with festivals honoring their gods. A god, Dionysus, was honored with a festival called by City Dionysia. In Athens, during this festival, men used to perform songs to welcome Dionysus. Plays were only presented at City Dionysia festival. Three well-known Greek tragedy playwrights of the fifth century are Sophocles, Euripides and Aeschylus. Comedy was also an important part of ancient Greek theatre. Comedy plays were derived from imitation; there are no traces of its origin. Aristophanes wrote most of the comedy plays. Out of these 11 plays survived-Lysistrata, a humorous tale about a strong woman who leads a female coalition to end war in Greece"}, {"url": "http://www.slideshare.net/Nazish2010/greek-theatre-9213931", "passage_text": "1 It all started in 534 BC, the ancient Athenians created a theatre culture and the first theatre was the ‘Western Theatre’ which is in Athens, Greece. 2  The types of musicals that they had then were about their gods and mostly held in honour of god Dionysian. 1 Music was often played during the chorus' delivery of its lines. 2  It all started in 534 BC, the ancient Athenians created a theatre culture and the first theat} DUPipeline_QISnippet_FirstGood_Snippet_v1: {},{-1|-1|1|Greek Theatre."}]