[{"url": "http://www.arthritis.org/about-arthritis/types/rheumatoid-arthritis/articles/rhemuatoid-arthritis-affects-body.php", "passage_text": "Rheumatoid arthritis is a systemic disease, meaning it can affect many parts of the body. For that matter, so can some of the drugs used to treat RA. Following is a listing by body part of the ways RA (and sometimes the drugs used to treat it) can affect you. When RA-related inflammation of the blood vessels (called vasculitis) affects the skin, a rash of small red dots is the result. In more severe cases, vasculitis can cause skin ulcers on the legs or under the nails."}, {"url": "http://www.healthline.com/health/rheumatoid-arthritis/effects-on-body", "passage_text": "Rheumatoid arthritis (RA) is a chronic inflammatory autoimmune disease that causes problems primarily in the joints, but can cause symptoms throughout the body. Inflammation of the finger joints causes stretching of the ligaments and tendons. This leads to the erosion of bone and cartilage and deformity of the joints. "}, {"url": "http://www.answers.com/Q/What_part_of_the_body_does_arthritis_affect", "passage_text": "The popular conception is that arthritis affects the bones However inflammatory diseases such as rheumatoid arthritis can effect many other parts of the body involving connect … ive tissue including the heart, skin, eyes, lungs, muscles etc. To name but a few. RA is a systemic disease, that can also effect other tissues throughout the body including the skin, blood vessels, heart, lungs, and muscles. About 60% of RA patients are unable to work 10 years after the onset of their disease."}, {"url": "http://www.niams.nih.gov/health%5Finfo/rheumatic%5Fdisease/", "passage_text": "Rheumatoid arthritis (RA) is an inflammatory disease that causes pain, swelling, stiffness, and loss of function in the joints. It occurs when the immune system, which normally defends the body from invading organisms, turns its attack against the membrane lining the joints. "}, {"url": "http://www.emedicinehealth.com/rheumatoid_arthritis/article_em.htm", "passage_text": "Rheumatoid arthritis is often referred to as RA. 1  The inflammation in the joints causes joint pain, stiffness, swelling, and loss of function. 2  The inflammation often affects other organs and systems of the body, including the lungs, heart, and kidneys. Although rheumatoid arthritis most often affects the joints, it is a disease of the entire body. It can affect many organs and body systems besides the joints. Therefore, rheumatoid arthritis is referred to as a systemic disease."}, {"url": "http://www.answers.com/Q/What_part_of_the_body_does_arthritis_affect", "passage_text": "It can affect any joint from the jaw, neck, shoulders, elbows, wrists, hands, fingers, lower back (ankylosing spondylitis), hips, groin, knees, ankles, feet and toes. In sever … e cases it can also cause inflammation throughout the body such as inflammation of the body surrounding the heart and lungs. RA is a systemic disease, that can also effect other tissues throughout the body including the skin, blood vessels, heart, lungs, and muscles. About 60% of RA patients are unable to work 10 years after the onset of their disease."}, {"url": "http://www.arthritis.com/rheumatoid_arthritis_symptoms", "passage_text": "RA can affect many different joints. In some people, it can even affect parts of the body other than the joints, including the eyes, blood, the lungs, and the heart. Although RA is often a chronic disease, the severity and duration of symptoms may unpredictably come and go. Share +. Text A A A. Rheumatoid arthritis (RA) is an autoimmune disease where the body's immune system attacks normal joint tissues, causing inflammation of the joint lining. This inflammation of the joint lining (called the synovium) can cause pain, stiffness, swelling, warmth, and redness."}, {"url": "http://www.arthritis.org/about-arthritis/types/rheumatoid-arthritis/articles/rhemuatoid-arthritis-affects-body.php", "passage_text": "Rashes. When RA-related inflammation of the blood vessels (called vasculitis) affects the skin, a rash of small red dots is the result. In more severe cases, vasculitis can cause skin ulcers on the legs or under the nails. Controlling the rash or ulcers requires controlling the underlying inflammation. Drug effect"}, {"url": "http://www.answers.com/Q/What_parts_of_the_body_does_rheumatoid_arthritis_affect", "passage_text": "It can affect any joint from the jaw, neck, shoulders, elbows, wrists, hands, fingers, lower back (ankylosing spondylitis), hips, groin, knees, ankles, feet and toes. In severe cases it can also cause inflammation throughout the body such as inflammation of the body surrounding the heart and lungs. RA is a systemic disease, that can also effect other tissues throughout the body including the skin, blood vessels, heart, lungs, and muscles. About 60% of RA patients are unable to work 10 years after the onset of their disease."}]