[{"url": "http://www.healthcare-salaries.com/allied-health-professionals/social-worker-salary", "passage_text": "Social worker salary. Social worker’s salary in the United States is around $48,302 per annum according to the BLS salary reports. The annual salary for the upper 10 percent social workers is around more than $70,390 per year, while the lower 10 percent of them earn less than $26,710 per year."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-social-workers-make/", "passage_text": "Social workers employed in the District of the Columbia earn the highest annual salary at a whopping $66,130. Following close behind, Nevada social workers make an average $64,640 and those in California earn $63,480."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-social-workers-make/", "passage_text": "How much does a social worker make? According to the May 2012 records from the Bureau of Labor Statistics, the mean annual healthcare social worker salary is $51,460, or $24.74 per hour. The lowest ten percent earn $31,410, while the top ten percent make an average of $74,030 annually."}, {"url": "http://money.usnews.com/careers/best-jobs/child-and-family-social-worker/salary", "passage_text": "With an average salary of $46,060 per year, child and family social workers earn slightly more than mental health counselors ($43,700) and substance abuse and behavioral disorder counselors ($41,090). However, they earn less than other professionals."}, {"url": "http://www.collegesanddegrees.com/programs/social-work/salary-prospects", "passage_text": "The average annual salary for social workers ranges from $24,000 to $70,000 a year, according to the Bureau of Labor Statistics (BLS); PayScale puts the pay range at $26,000 to $56,000. The average annual salary is around $42,000, according to the BLS. Glassdoor.com puts the average salary at about $50,000."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-social-workers-make/", "passage_text": "Social workers employed in general hospitals earn more with an average annual salary $56,960, while those in individual and family services make less than average at $42,110. The top paying industry for this occupation is in specialty hospitals at $61,750 per year, as well as employment services at $60,160 annually."}]