[{"url": "https://answers.yahoo.com/question/index?qid=20100328085928AA2jXar", "passage_text": "For shoes, they need to be re-shod every 3-4 weeks depending on how worn down their shoes are. If you kept her barefoot (which if you're riding on sand, and only doing a few hacks, she seems like she'd be a good candidate) that is every 5-6 weeks for a trim."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090206054201AAxP3kV", "passage_text": "Depending on the wear and tear on your horses hooves, every 6-8 weeks is good for being re-shod. If your riding your horse on the road a lot, they might need to be re-done sooner. And also, talk to your farrier about going barefoot. Its much cheaper and i think better! Both of my horses are"}, {"url": "http://horses.about.com/od/basiccare/f/shoeoften.htm", "passage_text": "Plan to have the farrier reset your horse’s shoes approximately every six weeks. The shoes should be shaped to the horse’s feet for a custom fit. When the shoes are reset, the farrier will pull the shoes off, trim the hoof growth off and nail the same shoes back on."}, {"url": "http://horses.about.com/od/basiccare/f/shoeoften.htm", "passage_text": "Answer: Plan to have the farrier reset your horse’s shoes approximately every six weeks. The shoes should be shaped to the horse’s feet for a custom fit. When the shoes are reset, the farrier will pull the shoes off, trim the hoof growth off and nail the same shoes back on."}, {"url": "https://answers.yahoo.com/question/index?qid=20100328085928AA2jXar", "passage_text": "Some horses need to be re-shod every 4 weeks because of hoof problems. Every 6 weeks is safest, but eight is okay. Your farrier will be able to determine that with you. She shouldn't need a new shoe every time, as long as you don't ride on pavement."}, {"url": "http://www.walkinghorseclubky.com/how-often-should-i-shoe-or-trim-my-horse/", "passage_text": "As a general rule, a horse should be shod or trimmed every six or seven weeks. Like anything else, there seems to be exceptions to every rule. Remember your horses feet are growing at some rate of speed, no matter the use of your horse."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090720100000AAetnlB", "passage_text": "Usually they need shod about every 6-8 weeks although it varies from horse to horse depending on how fast their feet grow and how much road work you do. Not all horses need to be shod. Some can go without shoes so you would only have to pay for a trim every 6-8 weeks which is probably only about £20-£30."}, {"url": "http://www.horseandhound.co.uk/forums/archive/index.php/t-423186.html", "passage_text": "Shod horses are done every 6 weeks, 5 in the summer. Trimmed horses are trimmed every 6-8 weeks depending on the horse. They are done at this interval to keep their feet balanced. There is no way i would go longer than 6 weeks between shoes for my horses because of foot balance."}]