[{"url": "http://www.hpo.ncdcr.gov/dryout.htm", "passage_text": "If sheetrock has been exposed to water for less than two hours, it can probably be repaired. If the sheetrock was exposed to floodwater for more than two hours, it will be saturated by contaminated water and require complete replacement. Open windows in all rooms, even if there is no evidence of moisture retention."}, {"url": "http://www.plasterer-dave.co.uk/work-Info", "passage_text": "A small window should be left open so that moisture drawn from the walls can escape.Plastering on to plasterboard will dry much quicker (about 2-3 days) than on to backing plaster (about 4-6 days). As a rule plaster should be left for about a week before painting or tiling."}, {"url": "http://www.answers.com/Q/How_long_does_plaster_of_paris_take_to_dry", "passage_text": "If you want to paint over plaster it is important to let it dry  thoroughly. This can take between five and ten days, and in some  cases even longer. However, it will feel d … ry to the touch within a  day or so."}, {"url": "http://www.diydoctor.org.uk/projects/paintnewplaster.htm", "passage_text": "There is no definitive answer to this question as all walls and ceilings will dry out at different speeds. With a normal centrally heated house you can be pretty sure of safely painting after 4 weeks but it can take as long as 6 and with extra heat in the room it may be ready in 3."}, {"url": "http://www.answers.com/Q/How_long_does_plaster_of_paris_take_to_dry", "passage_text": "Allow 15-30 minutes for Plaster of Paris to set, and 24 hours of dry time before painting or decorating."}, {"url": "http://www.waterdamageout.com/water_damage_drying_drywall.htm", "passage_text": "Once the wet drywall is remove the remaining members such as wood framing structure (studs) should be dried appropriately to within at least 4% of the dry structural standard (usually around 16% moisture content)."}, {"url": "http://www.answers.com/Q/How_long_does_plaster_of_paris_take_to_dry", "passage_text": "The thinner the plaster of Paris is, the quicker it dries, so it depends on what you are using it for. To be safe, I would leave it for 24 hours until it completely dries. 11 people found this useful. Edit."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061009091602AAcEgkT", "passage_text": "Hi Churchy, You should wait until the walls are completely dry,3-4days.If you are using half water,and half paint you would probably have to put 2 or 3 coats before painting.You can tell better after the 2nd coat,if a third is needed.It does depend on the weather to, if it will take longer to dry. Hoped i help."}]