[{"url": "http://www.europeancuisines.com/what-part-of-the-cow-does-corned-beef-come-from", "passage_text": "Both of these are tough cuts requiring either long, slow cooking, or pickling in brine, or both -- hence their use in corned beef. See this article for lots more background on corned beef, including the oldest historical info. There are rumors that corned beef comes from -- let's put this delicately -- the lady parts of a cow. These are untrue. Corned beef is a muscle meat, not an organ meat, and anybody who tells you otherwise is just trying to gross you out. "}, {"url": "https://en.wikipedia.org/wiki/Corned_beef", "passage_text": "Corned beef is a salt-cured beef product. The term comes from the treatment of the meat with large grained rock salt, also called corns of salt. It features as an ingredient in many cuisines. "}, {"url": "https://answers.yahoo.com/question/index?qid=1006042519802", "passage_text": "Report Abuse. Corned beef is beef that is cured in a salt brine, often with spices. A cut of Brisket is typically used when making corned beef. Brisket is one of the least tender cuts of beef, but when slow cooked and prepared right, as is done when making corned beef, it can be quite flavorful. Corned beef comes from a cut of beef commonly called a london broil that has been soaked in a brine(salty water with other spices for flavor). mrjwm · 10 years ago."}, {"url": "http://dianeduane.com/outofambit/2006/03/16/what-part-of-the-cow-does-corned-beef-come-from/", "passage_text": "Putting it in your liver won’t matter a bit. Tags: corned beef, Irish, Ireland, St. Patrick’s Day, St. Paddy’s Day, St. Patty’s Day, who the heck is Patty, Patrick, Irish food, what do people eat on Saint Patrick’s Day, what part of the cow does the corned beef come from. What part of the cow does corned beef come from. March 16, 2006 Diane Duane 1 Comment. We’ve had about (EDITED, 17 Mar 2011) twenty three hundred queries about this today. We always get these this time of year, and more of them every year that goes by."}, {"url": "http://culinaryarts.about.com/od/glossary/g/Corned-Beef.htm", "passage_text": "Lisa Romerein/The Image Bank/Getty Images. Corned beef is a preparation in which a cut of beef, traditionally the brisket, is cured in a brine solution along with various seasonings, and then slowly simmered until it's tender and flavorful. "}, {"url": "http://startcooking.com/how-to-cook-corned-beef-brisket", "passage_text": "Brisket is the name of a particular “cut” of beef, which tells you what part of the cow it came from. Corned Beef is is a cut of meat (brisket) that has been cured (or pickled) in a seasoned brine. For this recipe you will need to purchase a corned beef brisket. Brisket is the name of a particular “cut” of beef"}, {"url": "https://answers.yahoo.com/question/index?qid=1006042519802", "passage_text": "Corning is a form of curing; it has nothing to do with corn. The name comes from Anglo-Saxon times before refrigeration. In those days, the meat was dry-cured in coarse corns of salt. Pellets of salt, some the size of kernels of corn, were rubbed into the beef to keep it from spoiling and to preserve it. Corned beef comes from a cut of beef commonly called a london broil that has been soaked in a brine(salty water with other spices for flavor). mrjwm · 10 years ago."}, {"url": "http://dianeduane.com/outofambit/2006/03/16/what-part-of-the-cow-does-corned-beef-come-from/", "passage_text": "Corned beef comes from the brisket and silverside (just under the topside) of the cow. Both of these are tough cuts requiring either long, slow cooking, or pickling in brine, or both — hence their use in corned beef. See this article for lots more background on corned beef, including the oldest historical info. What part of the cow does corned beef come from. March 16, 2006 Diane Duane 1 Comment. We’ve had about (EDITED, 17 Mar 2011) twenty three hundred queries about this today. We always get these this time of year, and more of them every year that goes by."}, {"url": "http://dish.allrecipes.com/corned-beef-basics/", "passage_text": "By Allrecipes Staff. The first corned beef was packed in salt, and sometimes spices, in order to cure it. It got its name from the corn kernel-sized grains of salt it was packed in. Photo by LilSnoo. Today, corned beef is usually made by soaking a brisket roast in a brine of water, salt, and spices. While it’s not traditional in Ireland, corned beef is what most Americans prepare for St. Patrick’s Day feasts. Photo by abapplez. 1  Deluxe Corned Beef Hash."}]