[{"url": "http://www.answers.com/Q/What_kind_of_government_does_New_Zealand_have", "passage_text": "There are two separate governments as Australia and New Zealand are different countries (like USA and Canada). The type of government in Australia and New Zealand is as follow … s: The government in Australia is both a Federal parliamentary democracy and a constitutional monarchy."}, {"url": "http://www.answers.com/Q/What_type_of_government_in_australia_and_New_Zealand", "passage_text": "New Zealand is a parliamentary democracy with a constitutional monarchy as head of state. This means that the most powerful institution is our democratically elected parliamen … t, which chooses the executive (the Prime Minister and cabinet), while a ceremonial head of state with limited powers reigns."}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_New_Zealand_have", "passage_text": "New Zealand has a constitutional monarchy (i.e. the Head of State is Queen Elizabeth II, represented by the Governor-General) and a parliamentary democracy (i.e. the people of … New Zealand elect MPs to represent them, who then form a government, led by a Prime Minister, currently John Key of the National Party)."}, {"url": "http://www.move2nz.com/nz/nz_government.aspx", "passage_text": "New Zealand is a constitutional monarchy with a parliamentary democracy. Under the Royal Titles Act (1953), Queen Elizabeth II, as the Queen of New Zealand, is the Head of State and is represented, in her absence, by a non-partisan Governor-General."}, {"url": "https://www.govt.nz/browse/engaging-with-government/government-in-new-zealand/", "passage_text": "NZ is a constitutional monarchy with a parliamentary system of government. This means that our head of state is a sovereign (currently Queen Elizabeth II). The Queen is represented in NZ by the Governor-General, Sir Jerry Mateparae."}, {"url": "http://www.answers.com/Q/What_kind_of_government_does_New_Zealand_have", "passage_text": "Confidence votes 1. New Zealand is a parliamentary democracy and limited monarchy where Queen Elizabeth II is the Head of State and the Prime Minister of New Zealand is the Head of Government."}, {"url": "http://www.indexmundi.com/new-zealand/government_type.html", "passage_text": "New Zealand Government. Government type: parliamentary democracy. Definition: This entry gives the basic form of government. Definitions of the major governmental terms are as follows: Anarchy-a condition of lawlessness or political disorder brought about by the absence of governmental authority."}, {"url": "http://www.answers.com/Q/What_type_of_government_in_australia_and_New_Zealand", "passage_text": "New Zealand has a constitutional monarchy (i.e. the Head of State is Queen Elizabeth II, represented by the Governor-General) and a parliamentary democracy (i.e. the people of … New Zealand elect MPs to represent them, who then form a government, led by a Prime Minister, currently John Key of the National Party)."}]