[{"url": "http://thelawdictionary.org/article/how-much-of-my-student-loan-interest-do-i-get-back-from-taxes/", "passage_text": "The Student Loan Interest Tax Deduction is governed by strict income limits. If you're filing singly, you can deduct up to $2,500 in student loan interest provided that you earned less than $60,000 during the tax year. If your income was between $60,000 and $75,000, you'll be able to deduct between $0 and $2,500 according to the exact amount that you earned. If you're currently in the 20 percent tax bracket, you'll owe $300 less as a result of this deduction. Importantly, the Student Loan Interest Tax Deduction doesn't prevent you from claiming other tax credits and deductions."}, {"url": "http://taxes.about.com/od/deductionscredits/qt/studentloanint.htm", "passage_text": "Your lender will send you a Form 1098-E. The amount of interest you paid on your student loans for the year will be reported on Form 1098-E, box 1. The maximum amount of student loan interest you can claim as a tax deduction is limited to $2,500. N/A. If your modified adjusted gross income is under the threshold where the phaseout begins, then you can deduct up to $2,500 in student loan interest. If your modified adjusted gross income falls within the phaseout range, then your limit for the student loan interest deduction will be prorated."}, {"url": "https://www.irs.gov/publications/p970/ch04.html", "passage_text": "Effect of the Amount of Your Income on the Amount of Your Deduction. The amount of your student loan interest deduction is phased out (gradually reduced) if your MAGI is between $65,000 and $80,000 ($130,000 and $160,000 if you file a joint return). You cannot claim a student loan interest deduction if your MAGI is $80,000 or more ($160,000 or more if you file a joint return). "}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Forms/What-is-a-1098-E--Student-Loan-Interest/INF26053.html", "passage_text": "You can also add student loan interest payments you made that aren't reported on Form 1098-E to this total as long as the interest is paid on a qualified loan. Regardless of how much interest you paid, the maximum you can deduct is $2,500. OVERVIEW. If you're currently paying off a student loan, you may get Form 1098-E in the mail from each of your lenders. Your lenders have to report how much interest you pay annually. Student loan interest can be deductible on federal tax returns, but receiving a 1098-E doesn't always mean you're eligible to take the deduction"}, {"url": "http://thelawdictionary.org/article/how-much-of-my-student-loan-interest-do-i-get-back-from-taxes/", "passage_text": "These days, the average college graduate leaves school with over $20,000 in student loan debt. For graduates of private four-year universities, the average debt load is closer to $40,000. If you're currently in the 20 percent tax bracket, you'll owe $300 less as a result of this deduction. Importantly, the Student Loan Interest Tax Deduction doesn't prevent you from claiming other tax credits and deductions."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Forms/What-is-a-1098-E--Student-Loan-Interest/INF26053.html", "passage_text": "If you have several student loans with the same lender, the financial institution applies the $600 threshold amount to the total interest paid on all of your loans; you may get a separate Form 1098-E for each loan, though. OVERVIEW. If you're currently paying off a student loan, you may get Form 1098-E in the mail from each of your lenders. Your lenders have to report how much interest you pay annually. Student loan interest can be deductible on federal tax returns, but receiving a 1098-E doesn't always mean you're eligible to take the deduction"}, {"url": "https://www.tuition.io/blog/2013/10/how-to-get-the-most-from-tax-deductions-for-student-loan-interest/", "passage_text": "The maximum you can deduct each year is $2,500. Early on in your repayment cycle, more of what you pay is interest. Student loans of roughly $37,000 at 6.8% will trigger this amount of interest annually. If You’re Single and Deducting Interest on Your Own Loans. If you earn less than $60,000 you can take the maximum deduction. If you earn between $60,000-$75,000 you can take a prorated amount. Form 1098-E. Each year, your lender should provide you with a Form 1098-E that confirms how much in interest you paid for the prior tax year. If your lender doesn’t provide you with the form by January 31 st each year, contact them to request a copy."}, {"url": "http://thelawdictionary.org/article/how-much-of-my-student-loan-interest-do-i-get-back-from-taxes/", "passage_text": "As a college graduate, it entitles you to deduct student loan interest worth up to $2,500 from your total taxable income. If you earned $40,000 and paid $1,500 in student loan interest last year, this deduction allows you to reduce the value of your total taxable income to $38,500. If you're currently in the 20 percent tax bracket, you'll owe $300 less as a result of this deduction. Importantly, the Student Loan Interest Tax Deduction doesn't prevent you from claiming other tax credits and deductions."}]