[{"url": "http://repairpal.com/i-need-to-know-how-the-imrc-actuator-and-valve-position-sensor-and-solenoid-work-455", "passage_text": "I need to know how the IMRC actuator and valve position sensor and solenoid work on 2002 Honda CR-V. I pulled a p1077 code at AutoZone. Definition: IMRC valve stuck short. Probable cause: Check for mechanical condition. Open or short circuit condition. Failed IMRC actuator. I ran several tests. I got 5v from the valve position sensor 3p connector Nos. 1 and 3 with the ignition on. Check resistance between sensor side of valve position sensor terminals Nos. 2 and 3, should read 3.2 kOhm, I got 2939. Then check resistance between terminals Nos. 1 and 2."}, {"url": "http://www.answers.com/Q/What_is_IMRC_on_a_ford", "passage_text": "Making the world better, one answer at a time. IMRC stands for intake manifold runner controller. It is used for emission control and performance. your intake manifold has plates inside that are connected to a rod and tghe connected to the control motor. each bank of the engine can be opened and closed by the motor depending on engine load and other things. The imrc on a 2002 Mercury Cougar with the V6 Duratec is located just in front of the engine under the plastic IMRC cover, the plastic cover which says Duratec. There should b … e several screws holding the cover in place."}, {"url": "http://www.wikihow.com/Replace-an-Intake-Manifold-Runner-Control-Valve-96-Ford-Windstar", "passage_text": "If you're van is throwing the code Intake Manifold Runner Control Valve stuck open, this article will show you the easy, yet still correct, way to replace it. Just follow the steps below carefully, and keep common sense in mind, and you'll do great. See tips below for a tool list. Ad. Take the vacuum lines off of the fuel pressure regulator, and both of the Intake Manifold Runner Control (IMRC) Valves. Now, swing the whole harness out of the way. Remove the electrical connector on the front valve"}, {"url": "http://my.prostreetonline.com/2014/10/21/dtc-p0661-service-imrc/", "passage_text": "The IMRC position sensor is located on the valve shaft of the IMRC and allows the PCM to know what exact position the IMRC is at. This valve position sensor also has an armature that moves the IMRC valve and provides the PCM with a linear position signal that lets the PCM know the position when moving. The Intake Manifold Runner Control (IMRC_ system found in the Honda / Acura K series engines has to do with the intake manifold and the butterfly actuated runner system that’s been used so often in small displacement motors."}, {"url": "http://www.buzzle.com/articles/intake-manifold-runner-control.html", "passage_text": "The intake manifold runner control (IMRC) is a valve that controls the ratio of air to gas in a car. This article provides information regarding the same. Advertisement. Using a car is today's necessity. "}, {"url": "http://www.wikihow.com/Replace-an-Intake-Manifold-Runner-Control-Valve-96-Ford-Windstar", "passage_text": "6. Take the vacuum lines off of the fuel pressure regulator, and both of the Intake Manifold Runner Control (IMRC) Valves. Now, swing the whole harness out of the way. Remove the electrical connector on the front valve"}, {"url": "http://lawyermusings.com/?p=416", "passage_text": "However, I concluded why it exists by a description of how it is controlled. There are two inlet ports cast in the manifold for each cylinder. The IMRC is a vacuum controlled actuator that opens butterfly valves in one of the two inlet ports. A V6 engine has two IMRCs, one operating each bank of cylinders. The actuators open the butterfly valves at high rpm, allowing plenty of air to enter the cylinders. The IMRC system keeps the airflow even to all the cylinders when the engine is operating at low speed by restricting airflow through the valved port. This is done by closing the butterfly valves, limiting each cylinder’s ability to get air by increasing the inlet resistance"}, {"url": "http://therangerstation.com/forums/archive/index.php/t-57165.html", "passage_text": "The IMRC actuator and manifold are composite/plastic with a single intake air passage for each cylinder. The passage has a butterfly valve plate that blocks 60% of the opening when actuated, leaving the top of the passage open to generate turbulence. "}]