[{"url": "http://home.costhelper.com/mobile-home.html", "passage_text": "1 Regionally, the lowest average price was $35,900 for a new single-wide in the Midwest and $83,800 for a new double-wide in the West. 2  Many new manufactured/mobile homes are set up in developments/parks, where the home owners pay monthly fees/space rent of $100-$800 or more, depending on location and park amenities. 1 Single-wide mobile/manufactured homes are a maximum of 18 feet wide and 90 feet long. 2  Double-wides are at least 20 feet wide and a maximum of 90 feet long, and are towed in two separate units that are joined together at the site. 3  There are triple-wide and homes with four or more units, but they are less common."}, {"url": "http://home.costhelper.com/mobile-home.html", "passage_text": "Discounts: 1  If you're buying or selling a used mobile/manufactured house, NadaGuides.com will provide a detailed retail value report for a 1969 or newer mobile home for $20, or sells a manufactured housing cost guide for $60-$120. 2  There are a variety of guidebooks for buying manufactured homes selling for $10-$40. 1 Single-wide mobile/manufactured homes are a maximum of 18 feet wide and 90 feet long. 2  Double-wides are at least 20 feet wide and a maximum of 90 feet long, and are towed in two separate units that are joined together at the site. 3  There are triple-wide and homes with four or more units, but they are less common."}, {"url": "http://personalfinance.costhelper.com/mobile-home-insurance.html", "passage_text": "1 For example a $60,000 mobile home would cost about $300-$400 per year with Allstate while a unit purchased for $100,000 would cost about $500-$600 annually. 2  A double-wide mobile home is two connected single-wide units. 1 Insurance for triple-wide mobile homes will cost about $550-$1,300 per year, depending on age, purchase price, size, choice of deductible, level of liability coverage, and location."}, {"url": "http://home.costhelper.com/mobile-home-transport.html", "passage_text": "1 Full-service mobile home moves of about 60 miles that include disconnect, reconnect and transport will cost about $3,000-$5,000 for a single-wide unit, $4,000-$10,000 for a double-wide and $10,000-$14,000 or more for a triple-wide, depending on size and location. 1 For example, Riley's Transport in California will move a small single-wide mobile home within the state up to 60 miles starting about $1,000"}, {"url": "http://personalfinance.costhelper.com/mobile-home-insurance.html", "passage_text": "1 Insuring a single-wide mobile home typically costs about $250-$700 per year, depending on age, purchase price, choice of deductible, level of liability coverage, size and location. 1 Insurance for triple-wide mobile homes will cost about $550-$1,300 per year, depending on age, purchase price, size, choice of deductible, level of liability coverage, and location."}, {"url": "http://www.mobilehomesell.com/what-is-the-cost-of-moving-a-manufactured-home/", "passage_text": "Monetary Costs. The money you spend on moving your mobile homes depends on the distance of the move. Short distant moves can cost between $1,000–$5,000, while longer trips can cost as much as $15,000 or more. You can determine your cost using this good rule-of-thumb: Estimate about $5–$10 per mile for your move. If you’re considering moving a manufactured home, the costs involved can include much more than just money. In fact, the headache of the moving process is a price all of its own. And moving a mobile home involves much more than calling a local tow truck company and hitching up."}, {"url": "http://home.costhelper.com/mobile-home.html", "passage_text": "1 If you're buying or selling a used mobile/manufactured house, NadaGuides.com will provide a detailed retail value report for a 1969 or newer mobile home for $20, or sells a manufactured housing cost guide for $60-$120. 2  There are a variety of guidebooks for buying manufactured homes selling for $10-$40. 1 Single-wide mobile/manufactured homes are a maximum of 18 feet wide and 90 feet long. 2  Double-wides are at least 20 feet wide and a maximum of 90 feet long, and are towed in two separate units that are joined together at the site. 3  There are triple-wide and homes with four or more units, but they are less common."}, {"url": "http://homeguides.sfgate.com/average-cost-deliver-set-up-mobile-home-96554.html", "passage_text": "A mobile home's moving cost depends on transport distance as well as the home's width. The HowMuchIsIt.org website says it commonly costs between $2,000 and $5,000 to move a mobile home less than 100 miles. The Manufactured Selling Solutions website, though, says it may cost as little as $1,000 to move a mobile home. If you're moving a mobile home more than 100 miles, expect to pay $6 to $15 per mile or up to $15,000 in transport costs alone. Negotiating Moving Costs. Double-wide mobile homes may cost more than $5,000 to move and then set up. Also, mobile home owners are usually responsible for removing their own skirting, deck, steps and landscaping prior to moving their homes. Sometimes, it may not even make financial sense to move a used"}]