[{"url": "http://birding.about.com/od/attractingbirds/a/Attract-Birds-To-Your-Windows.htm", "passage_text": "1 If you do not have a window box, add a garden hook or pole very close to the window for a convenient place to hang or mount a feeder. 2  Water: Bird baths don't have to be large to attract thirsty birds, and a small saucer bird bath can be a great addition to a window box. 1 Add interior shutters or blinds to the window and keep them partially closed as much as possible. 2  This will inhibit the birds' view but still give you a good blind for watching them. 3  Install a film on the window that turns the glass either into a one-way mirror or an opaque surface that you can still see out."}, {"url": "http://birding.about.com/od/attractingbirds/a/Attract-Birds-To-Your-Windows.htm", "passage_text": "To shield the view inside your window…. 1  Add a sheer curtain over the window that will inhibit birds looking inside but still admits light and can be moved carefully away to give you a good view of the birds. 2  Add interior shutters or blinds to the window and keep them partially closed as much as possible. 1 Add interior shutters or blinds to the window and keep them partially closed as much as possible. 2  This will inhibit the birds' view but still give you a good blind for watching them. 3  Install a film on the window that turns the glass either into a one-way mirror or an opaque surface that you can still see out."}, {"url": "http://www.wikihow.com/Attract-Birds", "passage_text": "1 Window feeders attach to your window with suction cups, offering a full view of bird activity. 2  They will attract birds like chickadees, finches, and some kinds of sparrows. 3  Suet feeders. 4  Suet feeders are designed to offer suet cakes, which attract different birds like woodpeckers, nuthatches, and chickadees. 1. Research birds in your area. Find out what types of birds live in your area or are likely to come to your property through migration. You may want to obtain a field guide to the area in order to know which birds to attract."}, {"url": "http://www.wikihow.com/Attract-Cardinals", "passage_text": "2. Put a suet feeder out in winter. In the winter use a suet feeder to provide extra energy for cardinals and other birds. While this will probably not be the primary feeding choice of cardinals in your area, they may come to a suet feeder to find extra food in the winter. "}, {"url": "http://birding.about.com/od/attractingbirds/a/Attract-Birds-To-Your-Windows.htm", "passage_text": "1 Window-mount feeders such as the Window Watch Feeder for hummingbirds or the Super Songbird Mirrored Bird Feeder for seed are ideal choices to add a feeding station at a window. 2  If you do not have a window box, add a garden hook or pole very close to the window for a convenient place to hang or mount a feeder. 1 Add interior shutters or blinds to the window and keep them partially closed as much as possible. 2  This will inhibit the birds' view but still give you a good blind for watching them. 3  Install a film on the window that turns the glass either into a one-way mirror or an opaque surface that you can still see out."}, {"url": "http://www.wikihow.com/Attract-Birds", "passage_text": "1 House feeders. 2  These keep seed in a contained area and dispense it as the birds feed from a small tray at the bottom of the feeder. 3  Window feeders. 4  Window feeders attach to your window with suction cups, offering a full view of bird activity. 1. Research birds in your area. Find out what types of birds live in your area or are likely to come to your property through migration. You may want to obtain a field guide to the area in order to know which birds to attract."}, {"url": "http://www.bestnest.com/bestnest/lc/lc_window_bird_feeder_faq.asp", "passage_text": "To attract a greater variety of birds, clean your feeder thoroughly and replace the seed mix with something that appeals to more birds, such as black oil sunflower seed. If you have just put out a window feeder, it may take a month or more before the birds to discover and trust your feeder. Window feeders typically do not increase the likelihood that a bird will fly into your window; in fact, window feeders are likely to decrease the chance that a bird will fly into your window. Birds tend to fly into clean windows or glass when they see a reflection of the sky."}, {"url": "http://ezinearticles.com/?How-To-Attract-Birds-With-Window-Bird-Feeders&id=367393", "passage_text": "If you don't have enough space to have a garden in your backyard, there are still ways to attract birds. Window bird feeders are a great way to do this, even if you don't have any yard space at all. There are plenty of different sizes and styles of bird feeders, each designed for a different type of bird. You can also choose different types of food to attract different varieties of birds to your windowsill. These feeders are usually made with a one-way mirror so you can see through it to watch the birds but they see a reflection so they're not scared by having you watching them"}, {"url": "http://www.wikihow.com/Attract-Birds", "passage_text": "1 Window feeders. 2  Window feeders attach to your window with suction cups, offering a full view of bird activity. 3  They will attract birds like chickadees, finches, and some kinds of sparrows. 1. Research birds in your area. Find out what types of birds live in your area or are likely to come to your property through migration. You may want to obtain a field guide to the area in order to know which birds to attract."}]