[{"url": "http://legal-dictionary.thefreedictionary.com/Misdemeanor", "passage_text": "n. a lesser crime punishable by a fine and/or county jail time for up to one year. Misdemeanors are distinguished from felonies which can be punished by a state prison term. They are tried in the lowest local court such as municipal, police or justice courts. Under federal law, and most state laws, any offense other than a felony is classified as a misdemeanor. Certain states also have various classes of misdemeanors (e.g., Class A, B, etc.)."}, {"url": "http://www.wisegeek.com/whats-the-difference-between-a-misdemeanor-and-a-felony.htm", "passage_text": "The difference between a misdemeanor and a felony is not always clear-cut from state to state in the US, or in other countries. In general, it is fair to say that a misdemeanor can be defined by the maximum length of time a person can be incarcerated for the crime, usually no more than one year. Crimes with a minimum jail time of over a year are usually felonies. Moreover, one can say that any crime not a felony, is by nature a misdemeanor."}, {"url": "https://answers.yahoo.com/question/index?qid=20101119052620AAZ4mx0", "passage_text": "Class A Misdemeanor The penalty for a Class A misdemeanor may include a fine up to $10,000, or imprisonment for up to 9 months, or both; however, for a repeat offender, the term of imprisonment may increase up to 2 years. Class B Misdemeanor The penalty for a Class B misdemeanor may include a fine up to $1,000, or imprisonment for up to 90 days, or both; however, for a repeat offender, the term of imprisonment increase up to 2 years. Source(s): NONAME · 5 years ago"}, {"url": "http://thelawdictionary.org/misdemeanor/", "passage_text": "A general name for criminal offenses of every sort, punishable by indictment or special proceedings, which do not in law amount to the grade of felony. A misdemeanor is an act committed or omitted in violation of a public law either forbidding or commanding it. "}, {"url": "http://www.yourdictionary.com/misdemeanor", "passage_text": "noun. The definition of a misdemeanor is a criminal offense more serious than an infraction and less serious than a felony. Federal criminal law classifies a misdemeanor as one in which the maximum punishment in terms of jail time is less than one year. "}, {"url": "http://definitions.uslegal.com/m/misdemeanor/", "passage_text": "Misdemeanor Law & Legal Definition. A misdemeanor is an offense for which a sentence to a term of imprisonment not in excess of one year may be imposed. A misdemeanor is less serious than a felony and is punishable by fine or imprisonment in a city or county jail rather than in a prison. Misdemeanors are tried in the lower courts, such as municipal, police or justice courts."}, {"url": "http://legal-dictionary.thefreedictionary.com/Misdemeanor", "passage_text": "Misdemeanor. Offenses lower than felonies and generally those punishable by fine, penalty, Forfeiture, or imprisonment other than in a penitentiary. Under federal law, and most state laws, any offense other than a felony is classified as a misdemeanor. Certain states also have various classes of misdemeanors (e.g., Class A, B, etc.)."}, {"url": "http://www.youtube.com/watch?v=G2NZ9c0qT3w", "passage_text": "What a Misdemeanor Can Mean on Your Record. A misdemeanor is a lessor crime than a felony and are divided by degrees. A 1st degree misdemeanor conviction may result in up to one year in jail and a $1,000 fine. A few examples of this offense are: • Resisting arrest. • Marijuana possession. • Carrying a concealed weapon. "}]