[{"url": "http://www.powdercity.com/products/d-ribose-powder", "passage_text": "D-Ribose Powder Benefits. The main benefit of D-Ribose Bulk Powder is in the production of ATP, which is the most direct and essential form of energy within the human body. This supplement has also been shown to help deal with symptoms that would normally result from the lack of energy. What Is D-Ribose Powder? D-Ribose powder (or really any type of Ribose) is a special type of sugar that is naturally produced by the body. It has also been used to help improve athletic performance, the symptoms of chronic fatigue disorder, and a number of heart issues [1]."}, {"url": "http://www.livestrong.com/article/448411-what-is-d-ribose-powder/", "passage_text": "D-ribose is a form of carbohydrate that plays a critical role in adenosine triphosphate production. ATP is a high-energy molecule and a major source of energy for all the body's cells. Its role in helping the body produce energy led to its use as a sports supplement. A type of sugar your body uses for fuel, D-ribose is marketed for sports performance and commonly found in powder form. The powder is typically mixed with water or another beverage. Aside from athletic enhancement claims, D-ribose may have therapeutic benefits for patients with chronic fatigue or fibromyalgia"}, {"url": "http://www.powdercity.com/products/d-ribose-powder", "passage_text": "D-Ribose is a supplement that seems to have been taking the world by storm. It is touted as a supplement capable of feats from fighting fatigue to protecting your heart and even helping to extend your life. What Is D-Ribose Powder? D-Ribose powder (or really any type of Ribose) is a special type of sugar that is naturally produced by the body. It has also been used to help improve athletic performance, the symptoms of chronic fatigue disorder, and a number of heart issues [1]."}, {"url": "https://en.wikipedia.org/wiki/Ribose", "passage_text": "Ribose is an aldopentose (a monosaccharide containing five carbon atoms) that, in its open chain form, has an aldehyde functional group at one end. In the conventional numbering scheme for monosaccharides, the carbon atoms are numbered from C1' (in the aldehyde group) to C5'. It is a C'-2 carbon epimer of the sugar. - arabinose (both isomers of which are named for their source, gum arabic) and ribose itself is named as a transposition of the name of arabinose. The ribose β-D-ribofuranose forms part of the backbone of RNA."}, {"url": "https://en.wikipedia.org/wiki/Ribose", "passage_text": "Ribose is an organic compound with the formula C 5 H 10 O 5; specifically, a pentose monosaccharide (simple sugar) with linear form H−(C=O)−(CHOH) 4 −H, which has all the hydroxyl groups on the same side in the Fischer projection. The term may refer to either of two enantiomers. The term usually indicates D-ribose, which occurs widely in nature and is discussed here. Its synthetic mirror image, L-ribose, is not found in nature. -Ribose was first reported in 1891 by Emil Fischer. It is a C'-2 carbon epimer of the sugar. - arabinose (both isomers of which are named for their source, gum arabic) and ribose itself is named as a transposition of the name of arabinose. The ribose β-D-ribofuranose forms part of the backbone of RNA."}, {"url": "http://www.superfoods-scientific-research.com/natural-remedies/d-ribose-benefits.html", "passage_text": "D-Ribose Benefits and Side Effects. By superfoods Leave a Comment. D-Ribose is a sugar that has been shown to boost levels of the energy compound ATP. Because D-ribose is a simple sugar, it is extremely well absorbed. Food sources do not supply enough of the recommended amounts of ribose. However, the body generally synthesized enough ribose from glucose to meet its needs. "}, {"url": "http://www.powdercity.com/products/d-ribose-powder", "passage_text": "D-Ribose powder (or really any type of Ribose) is a special type of sugar that is naturally produced by the body. It has also been used to help improve athletic performance, the symptoms of chronic fatigue disorder, and a number of heart issues [1] . What Is D-Ribose Powder? D-Ribose powder (or really any type of Ribose) is a special type of sugar that is naturally produced by the body. It has also been used to help improve athletic performance, the symptoms of chronic fatigue disorder, and a number of heart issues [1]."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-827-RIBOSE.aspx?activeIngredientId=827&activeIngredientName=RIBOSE", "passage_text": "RIBOSE Overview Information. Ribose is a kind of sugar that is produced by the body. It is used as a medicine. Ribose is used to improve athletic performance and the ability to exercise by boosting muscle energy. It has also been used to improve symptoms of chronic fatigue syndrome (CFS), fibromyalgia, and coronary artery disease. Ribose is an energy source that the body makes from food. There is some evidence that supplemental ribose might prevent muscle fatigue in people with genetic disorders that prevent sufficient energy production by the body. It might provide extra energy to the heart during exercise in people with heart"}]