[{"url": "https://en.wikipedia.org/wiki/Cerebrum", "passage_text": "The cerebrum is a large part of the brain containing the cerebral cortex (of the two cerebral hemispheres), as well as several subcortical structures, including the hippocampus, basal ganglia, and olfactory bulb. In humans, the cerebrum is the superior-most region of the central nervous system. "}, {"url": "https://en.wikipedia.org/wiki/Cerebellum", "passage_text": "The cerebellum (Latin for little brain) is a region of the brain that plays an important role in motor control. It may also be involved in some cognitive functions such as attention and language, and in regulating fear and pleasure responses, but its movement-related functions are the most solidly established. The name cerebellum is a diminutive of cerebrum (brain); it can be translated literally as little brain. The Latin name is a direct translation of the Ancient Greek παρεγκεφαλίς (parencephalis), which was used in the works of Aristotle, the first known writer to describe the structure."}, {"url": "http://www.cerebellum.us/", "passage_text": "The cerebellum is a part of the human brain. It is the part of the brain that that is responsible for human movement, co-ordination, motor control and sensory perception. The cerebellum is in the lower posterior part of the brain which looks almost like it is separate but still of the same unit."}, {"url": "https://en.wikipedia.org/wiki/Cerebellum", "passage_text": "Cerebellar damage produces disorders in fine movement, equilibrium, posture, and motor learning. Anatomically, the cerebellum has the appearance of a separate structure attached to the bottom of the brain, tucked underneath the cerebral hemispheres. The name cerebellum is a diminutive of cerebrum (brain); it can be translated literally as little brain. The Latin name is a direct translation of the Ancient Greek παρεγκεφαλίς (parencephalis), which was used in the works of Aristotle, the first known writer to describe the structure."}, {"url": "https://en.wikipedia.org/wiki/Cerebellum", "passage_text": "The cerebellum does not initiate movement, but it contributes to coordination, precision, and accurate timing. It receives input from sensory systems of the spinal cord and from other parts of the brain, and integrates these inputs to fine-tune motor activity. The name cerebellum is a diminutive of cerebrum (brain); it can be translated literally as little brain. The Latin name is a direct translation of the Ancient Greek παρεγκεφαλίς (parencephalis), which was used in the works of Aristotle, the first known writer to describe the structure."}, {"url": "http://biology.about.com/od/anatomy/p/cerebellum.htm", "passage_text": "Cerebellum: In Latin, the word cerebellum means little brain. The cerebellum is the area of the hindbrain that controls motor movement coordination, balance, equilibrium and muscle tone. Like the cerebral cortex, the cerebellum is comprised of white matter and a thin, outer layer of densely folded gray matter."}, {"url": "http://www.healthline.com/human-body-maps/cerebellum", "passage_text": "Cerebellum. The cerebellum is located behind the top part of the brain stem (where the spinal cord meets the brain) and is made of two hemispheres (halves). The cerebellum receives information from the sensory systems, the spinal cord, and other parts of the brain and then regulates motor movements. The cerebellum coordinates voluntary movements such as posture, balance, coordination, and speech, resulting in smooth and balanced muscular activity. It is present in animals that scientists believe existed before humans. Damage to the cerebellum, while not causing paralysis or intellectual impairment, might lead to a lack of balance, slower movements, and tremors (shaking)."}, {"url": "http://www.answers.com/Q/What_does_the_cerebellum_do", "passage_text": "Split and merge into it. Answer by cat kluss. Confidence votes 51.8K. The cerebellum is the portion of the brain that controls coordination, balance, voluntary motor movements, sense of position of the different parts of your body, equilibrium, and muscle tone. It also plays an important role in memory. The cerebellum is involved in the coordination of voluntary motor movement, balance and equilibrium and muscle tone. It is located just above the brain stem and toward t … he back of the brain."}]