[{"url": "http://themoneyconverter.com/SAR/INR.aspx", "passage_text": "SAR-Saudi Riyal *. The Saudi riyal has been the currency of Saudi Arabia since the country came in to being and was the currency of Hejaz before Saudi Arabia was created. In June 1986, the riyal was officially pegged to the US Dollar at a fixed exchange rate of 1 U.S. dollar = 3.75 riyals. 1  SAR RSS Feed. 2  Saudi National Bank. "}, {"url": "http://coinmill.com/SAR_calculator.html", "passage_text": "To show Saudi Arabian Riyals and just one other currency click on any other currency. The Saudi Arabian Riyal is the currency in Saudi Arabia (SA, SAU). The Saudi Arabian Riyal is also known as the Saudi Arabian Rial. The symbol for SAR can be written SRls, and ﷼. The Saudi Arabian Riyal is divided into 100 halalat. The exchange rate for the Saudi Arabian Riyal was last updated on October 9, 2015 from The International Monetary Fund."}, {"url": "http://the-saudi.net/saudi-arabia/currency.htm", "passage_text": "Saudi Arabia Currency The Saudi Riyal (SR) is the unit of currency in the Kingdom of Saudi Arabia. It is divided into a hundred Halalah. The denominations of the Saudi currency are as follows: Bills: 1, 5, 10, 20, 50, 100, 200 and 500 Riyals. Coins: 5, 10, 25, 50, and 100 Halalahs. 1 Riyal equal 100 Halalas."}, {"url": "http://www.xe.com/currency/sar-saudi-arabian-riyal", "passage_text": "Saudi Arabian Riyal History. Prior to the 20th century, foreign currencies such as the Maria Theresa Thalers and British Gold Sovereigns circulated and served the monetary needs in Arabia, with the exchange rate of 1 Gold Sovereign being equal to 5 Theresa Thalers. Saudi Arabia, Riyal. The Saudi Arabian Riyal is the currency of Saudi Arabia. Our currency rankings show that the most popular Saudi Arabia Riyal exchange rate is the INR to SAR rate. The currency code for Riyals is SAR, and the currency symbol is ﷼"}, {"url": "https://answers.yahoo.com/question/index?qid=1006052329032", "passage_text": "Report Abuse. The riyal (currency code SAR) is the official currency of Saudi Arabia. History The riyal has been the currency of Saudi Arabia since the country came in to being and was the currency of Hejaz before Saudi Arabia was created. The Hejaz riyal was initially equivalent to the Ottoman 20 qurush coin and was consequently divided into 20 qurush, each of 40 par"}, {"url": "http://themoneyconverter.com/USD/SAR.aspx", "passage_text": "ر.س. The Saudi riyal has been the currency of Saudi Arabia since the country came in to being and was the currency of Hejaz before Saudi Arabia was created. In June 1986, the riyal was officially pegged to the US Dollar at a fixed exchange rate of 1 U.S. dollar = 3.75 riyals. 1  SAR RSS Feed. 2  Saudi National Bank"}, {"url": "http://themoneyconverter.com/USD/SAR.aspx", "passage_text": "*Pegged: 1 USD = 3.75000 SAR. The Saudi riyal has been the currency of Saudi Arabia since the country came in to being and was the currency of Hejaz before Saudi Arabia was created. In June 1986, the riyal was officially pegged to the US Dollar at a fixed exchange rate of 1 U.S. dollar = 3.75 riyals. 1  SAR RSS Feed. 2  Saudi National Bank"}, {"url": "https://en.wikipedia.org/wiki/Saudi_riyal", "passage_text": "The riyal has been the currency of Saudi Arabia since the country came into being and was the currency of Hejaz before Saudi Arabia was created. one of the primary currencies in the Mediterranean region during the Ottoman era. The Saudi riyal (Arabic: ريال riyāl; ISO 4217 code: SAR) is the currency of Saudi Arabia. It is abbreviated as ر.س or SR (Saudi Riyal) . It is subdivided into 100 Halala s (Arabic: هللة ‎ Halalah) "}]