[{"url": "http://www.indigenousaustralia.info/the-dreaming.html", "passage_text": "E-mail. The Dreaming is infinite and links the past with the present to determine the future. It is the natural world, especially the land or county to which a person belongs, which provides the link between the people and The Dreaming."}, {"url": "http://www.indigenousaustralia.info/the-dreaming.html", "passage_text": "When a story is a component of an Aboriginal Dreaming story and is told outside of the country it belongs to, then it is respected as an Aboriginal Dreaming Story from that area, however within its country it remains a significant, sacred Dreaming story. The Dreaming is infinite and links the past with the present to determine the future. It is the natural world, especially the land or county to which a person belongs, which provides the link between the people and The Dreaming."}, {"url": "https://en.wikipedia.org/wiki/Dreaming_(spirituality)", "passage_text": "In Australian Aboriginal art, a Dreaming is a totemistic design or artwork, which can be owned by a tribal group or individual. The term Dreaming is based on the root of the term altjira (alcheringa) used by the Aranda people, although it has since been pointed out that the rendition is based on a mistranslation. Stanner introduced the derived term of  dreamtime  in the 1970s."}, {"url": "http://www.angelfire.com/biz2/turquoisebutterfly/dreaming.html", "passage_text": "There was, and is, a strong belief in the efficiency of such visions, and the power found within their messages. It is said that all can be found within your dreams. To the Native American, the dream is its own form of reality. There are worlds which can be seen, and worlds which can not. The physical and the spiritual are two aspects of the same presence. Dreams are a way to connect the two; to pull both into the same dimension of the dreamers world."}, {"url": "https://en.wikipedia.org/wiki/Dreaming_(spirituality)", "passage_text": "A Dreaming is a story owned by different tribes and their members that explains the creation of life, people and animals. A Dreaming story is passed on protectively as it is owned and is a form of  intellectual property . The term Dreaming is based on the root of the term altjira (alcheringa) used by the Aranda people, although it has since been pointed out that the rendition is based on a mistranslation. Stanner introduced the derived term of  dreamtime  in the 1970s."}, {"url": "http://www.australia.gov.au/about-australia/australian-story/dreaming", "passage_text": "The Creation or Dreaming stories, which describe the travels of the spiritual ancestors, are integral to Aboriginal spirituality. In many areas there are separate spheres of men's and women's stories. Knowledge of the law and of the Dreaming stories is acquired progressively as people proceed through life. In most stories of the Dreaming, the Ancestor Spirits came to the earth in human form and as they moved through the land, they created the animals, plants, rocks and other forms of the land that we know today. They also created the relationships between groups and individuals to the land, the animals and other people."}, {"url": "https://en.wikipedia.org/wiki/Dreamtime", "passage_text": "Dreaming  is now also used as a term for a system of totemistic symbols, so that an indigenous Australian may own a specific Dreaming, such as Kangaroo Dreaming, or Shark Dreaming, or Honey Ant Dreaming, or any combination of Dreamings pertinent to their country. The term Dreaming is directly based on the term Altjira (Alchera), the name of a spirit or entity in the mythology of the Aranda. Related entities are known as Mura-mura by the Dieri, and as Tjukurpa in Pitjantjatjara."}, {"url": "https://en.wikipedia.org/wiki/Dreamtime", "passage_text": "This is because in Dreamtime an individual's entire ancestry exists as one, culminating in the idea that all worldly knowledge is accumulated through one's ancestors. Many Indigenous Australians also refer to the Creation time as The Dreaming. The Dreamtime laid down the patterns of life for the Aboriginal people. The term Dreaming is directly based on the term Altjira (Alchera), the name of a spirit or entity in the mythology of the Aranda. Related entities are known as Mura-mura by the Dieri, and as Tjukurpa in Pitjantjatjara."}, {"url": "http://www.australia.gov.au/about-australia/australian-story/dreaming", "passage_text": "Australian Stories also contain links to sites that may use images of Aboriginal and Islander people now deceased. The Dreaming, or 'Tjukurrpa', also means to 'see and understand the law' as it is translated from the Arrernte language (Frank Gillen with Baldwin Spencer, translating an Arrernte word Altyerrenge). Dreaming stories pass on important knowledge, cultural values and belief systems to later generations. In most stories of the Dreaming, the Ancestor Spirits came to the earth in human form and as they moved through the land, they created the animals, plants, rocks and other forms of the land that we know today. They also created the relationships between groups and individuals to the land, the animals and other people."}, {"url": "https://en.wikipedia.org/wiki/Dreamtime", "passage_text": "The term is based on a rendition of the indigenous (Arandic) word alcheringa, used by the Aranda (Arunta, Arrernte) people of Central Australia, although it appears that it is based on a misunderstanding or mistranslation, and the word has a meaning closer to  eternal, uncreated . The term Dreaming is directly based on the term Altjira (Alchera), the name of a spirit or entity in the mythology of the Aranda. Related entities are known as Mura-mura by the Dieri, and as Tjukurpa in Pitjantjatjara."}]