[{"url": "http://www.bbc.co.uk/homes/property/buying_auctionglossary.shtml", "passage_text": "The sale of a property at a price agreed by the seller and the buyer or their agents. Proxy bid. The auctioneers can undertake bidding on behalf of buyers unable to attend the auction in person. The buyers must contact the auction house prior to the auction to obtain an official, proxy bidding form. The offer to buy property at a specific price. Completion. On completion of the sale of the lot there is usually a defined time period from the auction to the completion date in which the sale must be finalised. Penalties will be applied if the sale is completed late which can include losing your deposit"}, {"url": "https://en.wikipedia.org/wiki/Auction", "passage_text": "An auction is a process of buying and selling goods or services by offering them up for bid, taking bids, and then selling the item to the highest bidder. The open ascending price auction is arguably the most common form of auction in use today. 1 Buyout price – A price that, if accepted by a bidder, immediately ends the auction and awards the item to him/her (an example is eBay 's BuyItNow feature).  2 Choice - a form of bidding whereby a number of identical or similar items are bid at a single price for each item."}, {"url": "https://www.qld.gov.au/law/housing-and-neighbours/buying-and-selling-a-property/buying-a-home/ways-to-buy-your-home/buying-at-auction/", "passage_text": "It's illegal for a seller or their agent to give you a price guide for an auction property. This is because they cannot know how high the bidding will go. A property may appear on a listing website when you search by price. This is only for the purposes of the web search, and is not designed as a price guide. The website should give you a statement that explains this. Sometimes, an auctioneer may offer you a comparative market analysis (CMA) ."}, {"url": "http://www.bbc.co.uk/homes/property/buying_auctionglossary.shtml", "passage_text": "Guide price. A guide price gives an indication of the price that the property is expected to sell for and what the vendor is hoping to achieve. Guide prices are for information only and shouldn’t be relied on as an indication of reserve price, or representing professional valuations for any purpose. The offer to buy property at a specific price. Completion. On completion of the sale of the lot there is usually a defined time period from the auction to the completion date in which the sale must be finalised. Penalties will be applied if the sale is completed late which can include losing your deposit"}, {"url": "http://www.realtor.org/auction/glossary", "passage_text": "Reserve Auction. An auction in which the seller reserves the right to establish a reserve price, to accept or decline any and all bids or to withdraw the property at any time prior to the announcement of the completion of the sale by the auctioneer. See also Auction With Reserve. "}, {"url": "http://howtoreallybuyaproperty.co.uk/what-does_guide-price_mean.php", "passage_text": "Properties sold at auction have a reserve price and a guide price. The reserve price is the value below which the seller will not sell. The guide price is the value the auctioneer expects the property to fetch. In general much of this is an advertising gimmick to attract potential bidders through the door. For example, is it the norm at the point that you are buying for property to be selling at 10% below the asking price and for tenants to be negotiating 5% off the rental values. These are the real market figures."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20140610024914AAYsLQ1", "passage_text": "There is a property advertised on Rightmove at a guide price of £140,000 to £150,000. We really like the property and made an offer of £135,000. We expected the offer to be declined and it was. "}, {"url": "http://www.bbc.co.uk/homes/property/buying_auctionglossary.shtml", "passage_text": "Failure to reach the reserve price or insufficient bidding. The auctioneer will withdraw the property from the auction. If you're considering purchasing a property at auction you should always consult with auction professionals and solicitors. This article is intended as a guide only. The offer to buy property at a specific price. Completion. On completion of the sale of the lot there is usually a defined time period from the auction to the completion date in which the sale must be finalised. Penalties will be applied if the sale is completed late which can include losing your deposit"}, {"url": "http://www.auctionadvisory.com/glossary.htm", "passage_text": "AUCTION PRICE: The price of property obtained through the auction. AUCTION VALUE: The price which a particular property/item brings in open competitive bidding at public auction. AUCTION WITH RESERVE: Also known as Reserve Auction and Auction Subject to Confirmation. ABSENTEE BIDDER: A person (or entity) who does not attend the sale but submits, in advance, a written or oral bid that is the top price he/she will pay for a given property. ABSOLUTE AUCTION: An auction where the property is sold to the highest qualified bidder with no limiting conditions or amount."}]