[{"url": "http://unibicanzacbiscuits.com/about-anzac-biscuits.html", "passage_text": "Anzac biscuit recipes, in the form we know them today, began appearing in cookbooks in the 1920s. They were sometimes called Anzac crisps or Anzac crispies (not Anzac cookies, as one would assume) in reference to their hardness. The earliest recipe for these crispies found to date is from a New Zealand cookbook published in 1921."}, {"url": "http://www.answers.com/Q/Why_were_ANZAC_biscuits_called_anzac_biscuits", "passage_text": "The ANZAC biscuits were so named because they were made by the  women at home and sold to buy small necessities and luxuries for  the ANZAC troops (Australian and New Zealan … d Army Coros) in World  War I. These little comforts of home included things like soap,  toothpaste, pencils, books and lollies."}, {"url": "http://www.answers.com/Q/Why_were_ANZAC_biscuits_called_anzac_biscuits", "passage_text": "The ANZAC biscuits were so named because they were made by the women at home and sold to buy small necessities and luxuries for the ANZAC troops in World War I. These little  … comforts of home included things like soap, toothpaste, pencils, books and lollies."}, {"url": "https://en.wikipedia.org/wiki/Anzac_biscuit", "passage_text": "An Anzac biscuit is a sweet biscuit, popular in Australia and New Zealand, made using rolled oats, flour, desiccated coconut, sugar, butter, golden syrup, baking soda and boiling water. Anzac biscuits have long been associated with the Australian and New Zealand Army Corps (ANZAC) established in World War I."}, {"url": "http://www.answers.com/Q/Why_are_anzac_biscuits_called_anzac_biscuits", "passage_text": "The ANZAC biscuits were so named because they were made by the women at home and sold to buy small necessities and luxuries for the ANZAC troops (Australian and New Zealand Army Coros) in World War I. These little comforts of home included things like soap, toothpaste, pencils, books and lollies."}, {"url": "http://unibicanzacbiscuits.com/about-anzac-biscuits.html", "passage_text": "For all that they represent what we have in common, the history of Anzac biscuits is highly contested. Both Australia and New Zealand claim to have invented the cookie-like Anzac biscuit that we now know, but its origins are not clear."}, {"url": "http://www.answers.com/Q/Why_were_ANZAC_biscuits_called_anzac_biscuits", "passage_text": "Originally the biscuits were called soldiers' biscuits, and only gained the name ANZAC biscuits towards the end of the war, long after the unsuccessful Gallipoli campaign. It was an expression of patriotic pride in the Australian and New Zealand troops serving overseas."}, {"url": "http://www.answers.com/Q/Why_are_anzac_biscuits_called_anzac_biscuits", "passage_text": "The ANZAC biscuits were so named because they were made by the women at home and sold to buy small necessities and luxuries for the ANZAC troops in World War I. These little  … comforts of home included things like soap, toothpaste, pencils, books and lollies."}]