[{"url": "https://simple.wikipedia.org/wiki/Natural_resource", "passage_text": "The natural resource of wind powers these 5MW wind turbines on this wind farm in Belgium. A natural resource is anything that people can use which comes from nature. People do not make natural resources, but gather them from the earth. Examples of natural resources are air, water, wood, oil, wind energy, iron, and coal"}, {"url": "http://www.palmtreepassion.com/palm-tree-uses.html", "passage_text": "But the other uses for various types of palm tree fruit are for oil, biodiesel, wax, jelly, wine and palm heart for salads. Now there's what is called vegetable ivory being made from the seed of a palm in South America. That's a renewable resource I think we can all live with. Here's an article explaining. Wherever palm trees are grown, their leaves are eaten by the animals of the area. Hut above has just been built. You can see the leaves are still green. Palm leaves make great roofs because of their size-the ones from coconut or royal palm in the feather leaf category."}, {"url": "https://en.wikipedia.org/wiki/Palm_wine", "passage_text": "In India and South Asia, coconut palms and Palmyra palms such as the Arecaceae and Borassus are preferred. In southern Africa, palm wine (ubusulu) is produced in Maputaland, an area in the south of Mozambique between the Lobombo mountains and the Indian Ocean. The palm tree also supplies fiber to cover roofs and sugar. In the Moluccas the tree was especially appreciated because of the palm wine that can be made from the sap of the immature flower flasks."}, {"url": "http://www.gardens.si.edu/come-learn/docs/Template_Trees_What%20Trees%20Provide.pdf", "passage_text": "Think about what they provide for the environment in which they live and why it is important to trees. List as many things you can think of that describe how trees help the environment. Food Consider what types of food humans, animals and insects get from trees. What Trees Provide Activity: 1. In the classroom or at home: Review the introduction and handout the Tree Cards for the four trees highlighted from the Butterfly Garden. Have students complete Activity Part I. This will guide students to consider what trees provide for us and what they do in their own habitats. 2."}, {"url": "https://en.wikipedia.org/wiki/Palm_wine", "passage_text": "Palm wine is an alcoholic beverage created from the sap of various species of palm tree such as the palmyra, date palms, and coconut palms. It is known by various names in different regions and is common in various parts of Asia, Africa the Caribbean and South America. The palm tree also supplies fiber to cover roofs and sugar. In the Moluccas the tree was especially appreciated because of the palm wine that can be made from the sap of the immature flower flasks."}, {"url": "https://en.wikipedia.org/wiki/Coconut", "passage_text": "The coconut tree (Cocos nucifera) is a member of the family Arecaceae (palm family). It is the only accepted species in the genus Cocos. The term coconut can refer to the entire coconut palm, the seed, or the fruit, which, botanically, is a drupe, not a nut. The spelling cocoanut is an archaic form of the word. "}, {"url": "http://www.kidsface.org/pages/resource.html", "passage_text": "Trees are also very important for us as a renewable resource. Trees are a natural resource that can be renewed-by the planting of trees-replacing the trees that are harvested for use by people. We depend on forest products for things like the wood we burn for heat and the wood we use to make houses and furniture."}, {"url": "http://www.palmtreepassion.com/palm-tree-uses.html", "passage_text": "There are cultures that make sugar out of the sap of the sugar palm tree. It's collected very similar to the way we get sap for maple syrup from maple trees but its then fermented into the sugary drink called toddy.. After a coconut tree has gone beyond its productive years, the tree is chopped down. Wherever palm trees are grown, their leaves are eaten by the animals of the area. Hut above has just been built. You can see the leaves are still green. Palm leaves make great roofs because of their size-the ones from coconut or royal palm in the feather leaf category."}, {"url": "http://www.palmtreepassion.com/palm-tree-uses.html", "passage_text": "Other palm tree uses for leaves are, to produce a different kind of oil and wax from those produced from the fruit. The Puerto Rican hat palm is famous for it's leaves being made into the best quality straw hats. Many different leaves are also used in weaving everything from furniture, to decorations and place-mats. Wherever palm trees are grown, their leaves are eaten by the animals of the area. Hut above has just been built. You can see the leaves are still green. Palm leaves make great roofs because of their size-the ones from coconut or royal palm in the feather leaf category."}, {"url": "http://herbs-treatandtaste.blogspot.com/2011/07/sugar-palm-and-toddy-seeds-nutritious.html", "passage_text": "In India the sugary sap from the tree is called toddy, as is the liquid that can be sucked from the fruit through the wiry fibres. These white fibres are either coated with white or orange pulp and inside there are the toddy seeds. When the fruit is young the toddy seeds are hollow, translucent and soft. Also sugar from this sap is supposed to be an antidote to poisoning and used for liver problems. The fresh toddy is heated to fermentation point and bandaged onto ulcers too, while the pulp from the mature fruit is used on the skin for dermatitis. Different parts of the tree are used for spleen and liver enlargement."}]