[{"url": "https://en.wikipedia.org/wiki/Ethanol", "passage_text": "Ethanol /ˈɛθənɒl/ , also commonly called ethyl alcohol, drinking alcohol, or simply alcohol is the principal type of alcohol found in alcoholic beverages, produced by the fermentation of sugars by yeasts. It is a neurotoxic psychoactive drug and one of the oldest recreational drugs used by humans. Ethanol is a volatile, flammable, colorless liquid with a slight chemical odor. It is used as an antiseptic, a solvent, a fuel, and, due to its low freezing point, the active fluid in post-mercury thermometers."}, {"url": "http://www.ehow.com/info_8169825_difference-between-ethanol-alcohol.html", "passage_text": "Ethanol. Ethanol is an example of a primary alcohol. It is colorless and clear with a pleasant smell. Most alcoholic beverages are made from ethanol as the impurities in the fermentation process give specific liquors -- such as whiskey, brandy or scotch -- their distinct flavors. "}, {"url": "http://alternativefuels.about.com/od/ethanol/a/whatsethanol.htm", "passage_text": "Ethanol (ethyl alcohol) is an alternative fuel fermented from corn, grains or agricultural waste or it is chemically extracted from ethylene (hydration). It is used primarily as a supplement to gasoline. Pure ethanol is not sold as a stand-alone fuel, at least not yet—it is commonly mixed with gasoline in varying percentages creating a transitional fuel that will pave the way for pure alcohol vehicles. For example, E85 is a common mixture: 85 percent ethanol, 15 percent gasoline"}, {"url": "http://www.eia.gov/tools/faqs/faq.cfm?id=27&t=10", "passage_text": "Gasoline with 10% ethanol content is referred to as E10, and gasoline with 15% ethanol content is called E15. E85 is a fuel that averages 85% ethanol and 15% gasoline. Most of the motor gasoline with more than 10% ethanol is sold in the Midwest. All gasoline vehicles can use E10. "}, {"url": "http://web.extension.illinois.edu/ethanol/", "passage_text": "Ethanol is a grain alcohol that can be blended with gasoline and used in motor vehicles. Many gasoline stations provide a blended fuel, which typically is 10 percent ethanol and 90 percent gasoline. Vehicles do not need any modifications to use this blend of fuel. "}, {"url": "http://www.merriam-webster.com/dictionary/ethanol", "passage_text": "Definition of ETHANOL. : a colorless volatile flammable liquid C2H5OH that is the intoxicating agent in liquors and is also used as a solvent and in fuel —called also ethyl alcohol, grain alcohol. See ethanol defined for English-language learners. See ethanol defined for kids."}, {"url": "http://environment.about.com/od/ethanolfaq/f/what_is_ethanol.htm", "passage_text": "Answer: Ethanol (which is also called ethyl alcohol or grain alcohol, and abbreviated as EtOH) is an alcohol-based alternative fuel that is blended with gasoline to produce a fuel with a higher octane rating and fewer harmful emissions than unblended gasoline. Ethanol is made from grains or other plants. Blends with lower concentrations of ethanol, such as E10 (10 percent ethanol and 90 percent gasoline), are sometimes used to increase octane and improve emissions quality, but are not considered alternative fuels. Ethanol is good for the economy. Ethanol production supports farmers and creates domestic jobs."}, {"url": "https://en.wikipedia.org/wiki/Ethanol_fuel", "passage_text": "Ethanol fuel is ethanol (ethyl alcohol), the same type of alcohol found in alcoholic beverages. It is most often used as a motor fuel, mainly as a biofuel additive for gasoline. It is commonly made from biomass such as corn or sugarcane. World ethanol production for transport fuel tripled between 2000 and 2007 from 17 billion to more than 52 billion liters. From 2007 to 2008, the share of ethanol in global gasoline type fuel use increased from 3.7% to 5.4%."}, {"url": "http://www.fueleconomy.gov/feg/ethanol.shtml", "passage_text": "Ethanol. Ethanol is a renewable, domestically produced alcohol fuel made from plant material, such as corn, sugar cane, or grasses. Using ethanol can reduce oil dependence and greenhouse gas emissions. Ethanol fuel use in the U.S. has increased dramatically from about 1.7 billion gallons in 2001 to about 13.2 billion in 2013. 1. "}]