[{"url": "https://answers.yahoo.com/question/index?qid=20091231172519AAvaVHx", "passage_text": "Important artists in the jazz movement include Louis Armstrong, Duke Ellington, Bessie Smith, and Jelly Roll Morton. The Harlem Renaissance was started by a rising middle class of African Americans. Jazz and Blues were brought from the South to the North by African Americans with Great Migration which started after World War I. The Harlem Renaissance spread its message through literature and poetry."}, {"url": "http://www.history.com/topics/black-history/harlem-renaissance", "passage_text": "A+E Networks. Spanning the 1920s to the mid-1930s, the Harlem Renaissance was a literary, artistic, and intellectual movement that kindled a new black cultural identity. Harlem Renaissance. The nucleus of the movement included Jean Toomer, Langston Hughes, Rudolf Fisher, Wallace Thurman, Jessie Redmon Fauset, Nella Larsen, Arna Bontemps, Countee Cullen, and Zora Neale Hurston."}, {"url": "http://www.myblackhistory.net/Harlem_Renaissance.htm", "passage_text": "The Harlem Renaissance. Originally called the New Negro Movement, the Harlem Renaissance was a literary and intellectual flowering that fostered a new black cultural identity that began in Harlem, New York after World War I and ended around 1935 during the Great Depression."}, {"url": "https://en.wikipedia.org/wiki/Harlem_Renaissance", "passage_text": "The Harlem Renaissance was a movement that spanned the 1920s. The Harlem Renaissance was the name given to the cultural, social, and artistic explosion that took place in Harlem, New York. During the time, it was known as the  New Negro Movement , named after the 1925 anthology by Alain Locke. The Movement also included the new African-American cultural expressions across the urban areas in the Northeast and Midwest United States affected by the Great Migration (African American) , of which Harlem was the largest. The Harlem Renaissance was considered to be a rebirth of African American arts."}, {"url": "http://study.com/academy/lesson/art-and-culture-of-the-harlem-renaissance-artists-poets-authors-music.html", "passage_text": "'The New Negro Movement,' as it was called during its time, the Harlem Renaissance was essentially the flowering of a unique African-American culture. African-American writers, poets, artists, musicians and intellectuals found new ways to express pride in their race and culture. The Harlem Renaissance. The Harlem Renaissance was an African-American artistic and intellectual movement that flourished throughout the 1920s. The movement was based in Harlem, New York, but its influence extended throughout the nation and even the world."}, {"url": "http://www.infoplease.com/spot/bhmharlem1.html", "passage_text": "Originally called the New Negro Movement, the Harlem Renaissance was a literary and intellectual flowering that fostered a new black cultural identity in the 1920s and 1930s. "}, {"url": "http://www.history.com/topics/black-history/harlem-renaissance", "passage_text": "Introduction. Spanning the 1920s to the mid-1930s, the Harlem Renaissance was a literary, artistic, and intellectual movement that kindled a new black cultural identity. Harlem Renaissance. The nucleus of the movement included Jean Toomer, Langston Hughes, Rudolf Fisher, Wallace Thurman, Jessie Redmon Fauset, Nella Larsen, Arna Bontemps, Countee Cullen, and Zora Neale Hurston."}, {"url": "https://answers.yahoo.com/question/index?qid=20091231172519AAvaVHx", "passage_text": "The Harlem Renaissance was a movement about not only music, but also visual arts, literature, poems, and political movements. It attempted to bring recognition to the African American community in a time without civil rights, in a time when the outside world chose to ignore the world of Harlem. The Harlem Renaissance was started by a rising middle class of African Americans. Jazz and Blues were brought from the South to the North by African Americans with Great Migration which started after World War I. The Harlem Renaissance spread its message through literature and poetry."}, {"url": "http://www.pbs.org/wnet/jimcrow/stories_events_harlem.html", "passage_text": "The Harlem Renaissance was the name given to the cultural, social, and artistic explosion that took place in Harlem between the end of World War I and the middle of the 1930s. During this period Harlem was a cultural center, drawing black writers, artists, musicians, photographers, poets, and scholars. The Renaissance was more than a literary movement: It involved racial pride, fueled in part by the militancy of the New Negro demanding civil and political rights. The Renaissance incorporated jazz and the blues, attracting whites to Harlem speakeasies, where interracial couples danced."}]