[{"url": "http://www.quinessence.com/hydrosols.htm", "passage_text": "About Hydrosols and Flower Waters. A hydrosol is the condensate water that is left over after the process of extracting an essential oil by water or steam distillation. This aromatic water contains the very essence of everything that was contained within the plant when it was still alive and growing. The rose otto essential oil and hydrosol produced in this very special region is equalled only by the same species grown in Esparta, Turkey. Apart from these two locations, there is no other country in the world that grows roses yielding a more beautifully fragrant essential oil or hydrosol."}, {"url": "http://www.aromaweb.com/hydrosols/what-are-hydrosols.asp", "passage_text": "Hydrosols are sometimes referred to as hydrolats, distillate waters or floral waters. Explained as simply as possible, a hydrosol is the aromatic water that remains after steam-distilling or hydro-distilling botanical material such as lavender. Hydrosols can be used in place of water in creating natural fragrances, lotions, creams, facial toners and other skin care products. They can also be added to the bath, and used on their own as a light cologne or body spray. Hydrosol can be added to finger bowls for elegant, romantic dinners."}, {"url": "http://www.aromaweb.com/hydrosols/hydrosol-uses.asp", "passage_text": "Hydrosol Uses. Hydrosols can be used in an endless number of ways. Most hydrosols are virtually clear and water soluble. Misting and spraying hydrosols is the most popular way of using them. "}, {"url": "http://www.aromaweb.com/hydrosols/what-are-hydrosols.asp", "passage_text": "Beware of the Term Floral Waters. Sometimes water simply blended with essential oils are sold as floral waters or improperly classified as hydrosols. It is always wise to ask vendors for details about the hydrosols that they sell to ensure that what you are purchasing is a true hydrosol as defined here. Hydrosols can be used in place of water in creating natural fragrances, lotions, creams, facial toners and other skin care products. They can also be added to the bath, and used on their own as a light cologne or body spray. Hydrosol can be added to finger bowls for elegant, romantic dinners."}, {"url": "https://en.wikipedia.org/wiki/Herbal_distillate", "passage_text": "They are colloidal suspensions (hydrosol) of essential oils as well as water-soluble components obtained by steam distillation or hydrodistillation (a variant of steam distillation) from plants/herbs. These herbal distillates have uses as flavorings, medicine and cosmetics (skin care). Herbal distillates are produced in the same or similar manner as essential oils. However, the essential oil will float to the top of the distillate where it is removed, leaving behind the watery distillate."}, {"url": "http://www.aromaweb.com/hydrosols/what-are-hydrosols.asp", "passage_text": "Expert hydrosol distillers, including Ann Harman, author of Harvest to Hydrosol, specifically distill plants for the resulting hydrosol that they produce. This can result in hydrosols with superior aroma and therapeutic benefit. Hydrosols can be used in place of water in creating natural fragrances, lotions, creams, facial toners and other skin care products. They can also be added to the bath, and used on their own as a light cologne or body spray. Hydrosol can be added to finger bowls for elegant, romantic dinners."}, {"url": "http://www.aromaticplantproject.com/articles_archive/Hydrosols_101.html", "passage_text": "Hydrosols are that other product of distillation when plants are steam-distilled to release their essential oil. Hydrosol simply means, hydro or water and sol or solution, that is, the water solution that contains some of the water-soluble micro-molecules of essential oil as well as water-soluble plant components. The hydrosol is the first 20% of the distilled non-alcoholic waters. They are used 100% pure as they come out of the still with a strong taste, strong scent and a perfect acid balance of 5.5 to match human skin."}, {"url": "https://www.mountainroseherbs.com/learn/hydrosols", "passage_text": "There is approximately .02% essential oil in hydrosol. Hydrosols, also known as floral waters, hydroflorates, flower waters or distillates are products from steam distilling plant materials. Hydrosols are like essential oils but in far less of a concentration. When a distiller brews plant material with water in a large cooker the steam fills the pot and, as it rises, it causes the glands of the plants to burst and release the oils and essence of the plant into the steam"}, {"url": "https://www.mountainroseherbs.com/learn/hydrosols", "passage_text": "Hydrosols are usually the result of essential oil production as a by-product but the highest quality hydrosols come from the devoted distillers who, with artist like precision steam the floral and plant material strictly to produce a hydrosol. Hydrosols, also known as floral waters, hydroflorates, flower waters or distillates are products from steam distilling plant materials. Hydrosols are like essential oils but in far less of a concentration. When a distiller brews plant material with water in a large cooker the steam fills the pot and, as it rises, it causes the glands of the plants to burst and release the oils and essence of the plant into the steam"}]