[{"url": "http://www.mayoclinic.org/diseases-conditions/low-blood-pressure/basics/treatment/con-20032298", "passage_text": "Medications. Several medications, either used alone or together, can be used to treat low blood pressure that occurs when you stand up (orthostatic hypotension). For example, the drug fludrocortisone is often used to treat this form of low blood pressure. This drug helps boost your blood volume, which raises blood pressure."}, {"url": "http://www.home-remedies-for-you.com/remedy/Low-blood-pressure.html", "passage_text": "Most people with low blood pressure show no symptoms. For such people, there are no underlying conditions causing the low blood pressure, and hence, no treatment is necessary. However, medical attention is vital when low blood pressure also leads to insufficient supply of blood to the brain and other vital organs. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/low-blood-pressure/basics/lifestyle-home-remedies/CON-20032298", "passage_text": "Lifestyle and home remedies. Depending on the reason for your low blood pressure, you may be able to take certain steps to help reduce or even prevent symptoms. Some suggestions include: 1  Drink more water, less alcohol. 2  Alcohol is dehydrating and can lower blood pressure, even if you drink in moderation."}, {"url": "http://www.top10homeremedies.com/home-remedies/home-remedies-for-low-blood-pressure.html", "passage_text": "1. Salt Water. Salt water helps treat low blood pressure because the sodium in salt increases blood pressure. Do not overdo this remedy though, as excess salt can prove to be unhealthy. Simply mix one-half teaspoon of salt in a glass of water and drink it. You can also drink sports beverages. "}, {"url": "http://www.nhs.uk/Conditions/Blood-pressure-(low)/Pages/Treatment.aspx", "passage_text": "Treating low blood pressure. Low blood pressure (hypotension) usually only needs to be treated if it's causing symptoms. This involves general lifestyle advice and treating any underlying cause of the condition. If you have naturally low blood pressure and it's not causing any problems, treatment is rarely necessary. If you have low blood pressure, you may benefit from having more salt in your diet. Your GP can advise how much additional salt you need and whether you can add salt to your usual food or take salt tablets. Don't add extra salt to your diet without seeing your GP first."}, {"url": "http://www.mayoclinic.org/diseases-conditions/low-blood-pressure/basics/treatment/con-20032298", "passage_text": "If it's not clear what's causing low blood pressure or no effective treatment exists, the goal is to raise your blood pressure and reduce signs and symptoms. Depending on your age, health status and the type of low blood pressure you have, you can do this in several ways: Use more salt. Several medications, either used alone or together, can be used to treat low blood pressure that occurs when you stand up (orthostatic hypotension). For example, the drug fludrocortisone is often used to treat this form of low blood pressure. This drug helps boost your blood volume, which raises"}, {"url": "http://www.nytimes.com/health/guides/disease/hypotension/overview.html", "passage_text": "Back to Top Treatment. Lower than normal blood pressure in a healthy person that does not cause any symptoms often does not need treatment. Otherwise, treatment depends on the cause of your low blood pressure and your symptoms. When you have symptoms from a drop in blood pressure, sit or lie down right away. Then raise your feet above heart level. Severe hypotension caused by shock is a medical emergency. You may be given: 1  Blood through a needle (IV). Treatments for low blood pressure after standing up too quickly include: 1  If medicines are the cause, your doctor may change the dosage or switch you to a different drug. 2  Your doctor may suggest drinking more fluids to treat dehydration. 3  Wearing compression stockings can help keep blood from collecting in the legs."}, {"url": "http://www.medicinenet.com/low_blood_pressure/page6.htm", "passage_text": "Symptoms of low blood pressure caused by conditions or diseases depend upon the specific cause of the low blood pressure. For example, if insufficient blood flows to the brain, brain cells do not receive enough oxygen and nutrients, and a person can feel lightheaded, dizzy, or even faint. 1 If the blood pressure is already low, standing can make the low pressure worse, to the point of causing symptoms. 2  The development of lightheadedness, dizziness, or fainting upon standing caused by low blood pressure is called orthostatic hypotension."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hyp/treatment", "passage_text": "The pressure helps move blood throughout your body. If medicine is causing your low blood pressure, your doctor may change the medicine or adjust the dose you take. Several medicines are used to treat orthostatic hypotension. These medicines, which raise blood pressure, include fludrocortisone and midodrine. "}, {"url": "http://www.webmd.com/heart/understanding-low-blood-pressure-treatment", "passage_text": "For many people, chronic low blood pressure can be effectively treated with diet and lifestyle changes. Depending on the cause of your symptoms, your doctor may tell you to increase your blood pressure by making these simple changes: 1  Eat a diet higher in salt. 2  Drink lots of nonalcoholic fluids. 3  Limit alcoholic beverages. 4  Drink more fluids during hot weather and while sick with a viral illness, such as a cold or the flu. 5  Have your doctor evaluate .."}]