[{"url": "http://specialty.insureon.com/professions/court-reporters/176", "passage_text": "Property Insurance for Court Reporters and Stenographers. Property Insurance guards your court reporting business from unexpected property loss caused by…. 1  Fire. 2  Theft. 3  Vandalism. 4  Certain weather events (like windstorms, tornadoes, and others). Business Owner's Policies (BOPs) package General Liability and Property Insurance in one policy, which can be a good deal for court reporter small businesses looking to save money on their business insurance. Insurers sell BOPs to small businesses that meet certain criteria and are considered lower-risk.."}, {"url": "http://specialty.insureon.com/professions/court-reporters/176", "passage_text": "As a court reporter, you're responsible for the accurate record of a legal proceeding, which means you have a lot of responsibility and liability. Your business insurance can help protect you from lawsuits, damaged property, and other costs that could force your small business into bankruptcy. Business Owner's Policies (BOPs) package General Liability and Property Insurance in one policy, which can be a good deal for court reporter small businesses looking to save money on their business insurance. Insurers sell BOPs to small businesses that meet certain criteria and are considered lower-risk.."}, {"url": "https://answers.yahoo.com/question/index?qid=20070827154415AAa8k9X", "passage_text": "show more court reporters?? have a couple questions about court reporters first of all...what do they do? how do they type everything?? is it in codes or how does that work? "}, {"url": "http://www.excite.com/education/criminal-justice/careers/how-to-become-a-court-reporter", "passage_text": "A: You can become a court reporter in 12- 18 months, depending upon the type of training program you enroll in. The fastest way to be a court reporter is to take up the associate's degree. More comprehensive degrees require 24 months or 4 years for completion. A: To become a court reporter, you must an associate degree or a certification in this specific field. There are a number of schools offering court reporting diplomas, certificate programs, and associate programs. The main purpose of such programs is to provide career-specific knowledge and skills to students"}, {"url": "http://www.proliability.com/professional-liability-insurance/court-reporters", "passage_text": "The accuracy of your work as a court reporter is critical to the judicial process, which makes your professional liability risk greater in the face of mistakes that could have an impact on court outcomes. "}, {"url": "http://www.excite.com/education/criminal-justice/careers/how-to-become-a-court-reporter", "passage_text": "A court reporter or court stenographer is a transcription specialist that produces a written record of judicial proceedings, and meetings held between lawyers and clients. A: To become a court reporter, you must an associate degree or a certification in this specific field. There are a number of schools offering court reporting diplomas, certificate programs, and associate programs. The main purpose of such programs is to provide career-specific knowledge and skills to stud"}, {"url": "http://www.amisinsurance.com/content/professional_liability_myths.php", "passage_text": "As a court reporter you need to carry both Commercial General Liability as well as the Professional Liability (more commonly known as Errors & Omissions or E&O in the US), but very few court reporters truly understand the difference between them. "}, {"url": "http://www.amisinsurance.com/lines/court_reporter_stenographer_liability.php", "passage_text": "Make sure that you have the coverage you need! There are several methods of court reporting, but the most common is called stenographic. Using a stenotype machine, stenotypists document all statements made during official proceedings. Electronic reporters and transcribers often are responsible for producing a written transcript of the recorded proceeding. Voice writing that is another type of court reporting. Using the voice-writing method, a court reporter speaks directly into a voice silencer—a hand-held mask containing a microphone. The mask prevents the reporter from being heard during testimony as the reporter repeats the testimony into the recorder"}]