[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/thermo/spht.html", "passage_text": "The specific heat of water is 1 calorie/gram °C = 4.186 joule/gram °C which is higher than any other common substance. As a result, water plays a very important role in temperature regulation. The specific heat per gram for water is much higher than that for a metal, as described in the water-metal example. The relationship between heat and temperature change is usually expressed in the form shown below where c is the specific heat. The relationship does not apply if a phase change is encountered, because the heat added or removed during a phase change does not change the temperature."}, {"url": "http://what-when-how.com/chemistry/temperature-and-heat/", "passage_text": "Also related to temperature are specific heat capacity, or the amount of energy required to change the temperature of a substance, and also calorimetry, the measurement of changes in heat as a result of physical or chemical changes. Specific Heat Capacity. Specific heat capacity (sometimes called specific heat) is the amount of heat that must be added to, or removed from, a unit of mass for a given substance to change its temperature by 1°C. Typically, specific heat capacity is measured in units of J/g • °C (joules per gram-degree Celsius)."}, {"url": "http://www.sparknotes.com/testprep/books/sat2/physics/chapter12section1.rhtml", "passage_text": "Temperature is a property of a material, and thus depends on the material, whereas heat is a form of energy existing on its own. The difference between heat and temperature is analogous to the difference between money and wealth. For example, $200 is an amount of money: regardless of who owns it, $200 is $200. Specific heat allows us to express the relationship between heat and temperature in a mathematical formula: where Q is the heat transferred to a material, m is the mass of the material, c is the specific heat of the material, and is the change in temperature."}, {"url": "http://www.iun.edu/~cpanhd/C101webnotes/matter-and-energy/specificheat.html", "passage_text": "Note that the specific heat is per unit mass. Thus, the specific heat of a gallon of milk is equal to the specific heat of a quart of milk. A related quantity is called the heat capacity (C). of an object. The relation between S and C is C = (mass of obect) x (specific heat of object)."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/thermo/spht.html", "passage_text": "Specific Heat. The specific heat is the amount of heat per unit mass required to raise the temperature by one degree Celsius. The relationship between heat and temperature change is usually expressed in the form shown below where c is the specific heat. The relationship does not apply if a phase change is encountered, because the heat added or removed during a phase change does not change the temperature."}, {"url": "http://www.eeweb.com/blog/andrew_carter/heat-and-temperature-change-specific-heat-capacity", "passage_text": "Heat is a one form of energy that runs from substance having high temperature to a substance with low temperature with respect to a specific matter. A difference in temperature of the substance produces heat or energy transfer. Heat is related to the amount of matter also. 4. If heat is present to a matter, it increases its temperature or phase. The specific heat is the quantity of heat per unit mass necessary to increase the temperature by one degree Celsius and is given in the formula: Table for Specific Heat of Different Substances. Examples: 1. Calculate the amount of heat needed to increase the temperature of 250g of water from 20C to 46C"}, {"url": "http://what-when-how.com/chemistry/temperature-and-heat/", "passage_text": "Specific heat capacity: The amount of heat that must be added to, or removed from, a unit of mass of a given substance to change its temperature by 1°C. It is typically measured in J/g • °C (joules per gram-degree Celsius). A calorie is the specific heat capacity of 1 gram of water. Specific Heat Capacity. Specific heat capacity (sometimes called specific heat) is the amount of heat that must be added to, or removed from, a unit of mass for a given substance to change its temperature by 1°C. Typically, specific heat capacity is measured in units of J/g • °C (joules per gram-degree Celsius)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080313112100AAXQDeo", "passage_text": "· just now. Report Abuse. Heat is related to temperature by a few things, specific heat, mass and phase. Q=cp*m*dT Q= heat cp= specific heat m= mass dT= temperature change So, the more of the stuff you have and the more you plan on warming it up, the more heat it takes. There are other equations the relate to change in phase in case something is melting, evaporating or sublimating. NJ Engineer · 8 years ago. Thumbs up. "}]