[{"url": "http://ofrf.org/organic-faqs", "passage_text": "Certified organic refers to agricultural products that have been grown and processed according to uniform standards, verified by independent state or private organizations accredited by the USDA. All products sold as organic must be certified. Organic meat, dairy products, and eggs are produced from animals that are fed organic feed and allowed access to the outdoors. They must be kept in living conditions that accommodate the natural behavior of the animals."}, {"url": "https://en.wikipedia.org/wiki/Organic_farming", "passage_text": "Organic farming is a form of agriculture that relies on techniques such as crop rotation, green manure, compost, and biological pest control. Fewer than 10% of organic farmers use these pesticides regularly; one survey found that only 5.3% of vegetable growers in California use rotenone while 1.7% use pyrethrum. These pesticides are not always more safe or environmentally friendly than synthetic pesticides and can cause harm."}, {"url": "http://www.sustainabletable.org/246/sustainable-agriculture-the-basics", "passage_text": "Sustainable Agriculture. In simplest terms, sustainable agriculture is the production of food, fiber, or other plant or animal products using farming techniques that protect the environment, public health, human communities, and animal welfare. "}, {"url": "https://en.wikipedia.org/wiki/Organic_farming", "passage_text": "Organic agriculture is a production system that sustains the health of soils, ecosystems and people. It relies on ecological processes, biodiversity and cycles adapted to local conditions, rather than the use of inputs with adverse effects. Fewer than 10% of organic farmers use these pesticides regularly; one survey found that only 5.3% of vegetable growers in California use rotenone while 1.7% use pyrethrum. These pesticides are not always more safe or environmentally friendly than synthetic pesticides and can cause harm."}, {"url": "http://ofrf.org/organic-faqs", "passage_text": "Organic farming refers to agricultural production systems used to produce food and fiber. Organic farming management relies on developing biological diversity in the field to disrupt habitat for pest organisms, and the purposeful maintenance and replenishment of soil fertility. Organic meat, dairy products, and eggs are produced from animals that are fed organic feed and allowed access to the outdoors. They must be kept in living conditions that accommodate the natural behavior of the animals."}, {"url": "http://smallfarms.ifas.ufl.edu/organic_production/organic_livestock.html", "passage_text": "Organic production practices are just one of the many options available to livestock producers to grow and market quality livestock and wholesome end-products. Waste Management: Organic livestock producers are mandated to manage manure so that is does not contribute to the contamination of crops, soil, or water and optimizes recycling of nutrients. Health Care: Organic livestock production practices require the producer to establish preventative health care practices."}, {"url": "http://certifiedorganic.bc.ca/aboutorganic/whatis.php", "passage_text": "Organic farming promotes the sustainable health and productivity of the ecosystem – soil, plants, animals and people. Organic foods are farmed in an environmentally sustainable and socially responsible way, focusing on soil regeneration, water conservation and animal welfare. Most people think of organic farming in terms of what is NOT allowed: 1  Produce and grains are grown without synthetic pesticides, herbicides, fertilizers or GMOs (genetically modified organisms)."}, {"url": "https://en.wikipedia.org/wiki/Organic_farming", "passage_text": "Organic agriculture is an ecological production management system that promotes and enhances biodiversity, biological cycles and soil biological activity. It is based on minimal use of off-farm inputs and on management practices that restore, maintain and enhance ecological harmony. Fewer than 10% of organic farmers use these pesticides regularly; one survey found that only 5.3% of vegetable growers in California use rotenone while 1.7% use pyrethrum. These pesticides are not always more safe or environmentally friendly than synthetic pesticides and can cause harm."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/rural_environments/farming_rural_areas_rev4.shtml", "passage_text": "Organic farming. Organic farming does not use chemical fertilisers or feed additives for livestock. It relies upon more natural forms of farming such as biological pest control and crop rotation. Using ladybirds which eat aphids is one example where a natural process replaces a chemical pesticide"}]