[{"url": "https://en.wikipedia.org/wiki/Photovoltaics", "passage_text": "Photovoltaics are best known as a method for generating electric power by using solar cells to convert energy from the sun into a flow of electrons. The photovoltaic effect refers to photons of light exciting electrons into a higher state of energy, allowing them to act as charge carriers for an electric current. Photovoltaic power generation employs solar panels composed of a number of solar cells containing a photovoltaic material. Materials presently used for photovoltaics include monocrystalline silicon, polycrystalline silicon, amorphous silicon, cadmium telluride, and copper indium gallium selenide /sulfide."}, {"url": "http://whatis.techtarget.com/definition/photovoltaic-cell-PV-Cell", "passage_text": "A photovoltaic cell (PV cell) is a specialized semiconductor diode that converts visible light into direct current (DC). Some PV cells can also convert infrared (IR) or ultraviolet (UV) radiation into DC electricity. Photovoltaic cells are an integral part of solar-electric energy systems, which are becoming increasingly important as alternative sources of utility power. In a PV cell, flat pieces of these materials are placed together, and the physical boundary between them is called the P-N junction. The device is constructed in such a way that the junction can be exposed to visible light, IR, or UV."}, {"url": "http://science.nasa.gov/science-news/science-at-nasa/2002/solarcells/", "passage_text": "Solar cells are made of the same kinds of semiconductor materials, such as silicon, used in the microelectronics industry. For solar cells, a thin semiconductor wafer is specially treated to form an electric field, positive on one side and negative on the other. A number of solar cells electrically connected to each other and mounted in a support structure or frame is called a photovoltaic module. Modules are designed to supply electricity at a certain voltage, such as a common 12 volts system. The current produced is directly dependent on how much light strikes the module."}, {"url": "http://whatis.techtarget.com/definition/photovoltaic-cell-PV-Cell", "passage_text": "The use of PV cells and batteries for the generation of usable electrical energy is known as photovoltaics. One of the major advantages of photovoltaics is the fact that it is non-polluting, requiring only real estate (and a reasonably sunny climate) in order to function. In a PV cell, flat pieces of these materials are placed together, and the physical boundary between them is called the P-N junction. The device is constructed in such a way that the junction can be exposed to visible light, IR, or UV."}, {"url": "http://www.answers.com/Q/What_is_a_photovoltaic_cell", "passage_text": "A photovoltaic cell, commonly called a solar cell or PV, is the technology used to convert solar energy dir … ectly into electrical power. A photovoltaic cell is a nonmechanical device usually made from silicon alloys. Answer by Mabrozek. Confidence votes 2.0K. Photovoltaic cell, or solar cell, is a thin and and often very small semiconductor device, usually made from silicon, which converts light, e.g., sunlight, into electricity."}, {"url": "http://www.technologystudent.com/energy1/solar5.htm", "passage_text": "Photovoltaic cells look similar to solar panels but they work in a different way. Solar panels are use to produce hot water or even steam. Photovoltaic panels convert the sunlight directly into electricity. A typical example of a device powered by photovoltaic cells is a solar powered calculator. This type of device only needs a small amount of electrical power to work and can even be used in a room with artificial light (bulbs / fluorescent light). The batteries power the phone during the night. Often photovoltaic cells are used as a backup to conventional energy. If conventional fails the cells are used to produce electricity. Silicon is a material known as a semiconductor as it conducts electricity and it is the main material for photovoltaic cells."}, {"url": "https://en.wikipedia.org/wiki/Photovoltaics", "passage_text": "Photovoltaics (PV) is the name of a method of converting solar energy into direct current electricity using semiconducting materials that exhibit the photovoltaic effect, a phenomenon commonly studied in physics, photochemistry and electrochemistry. Photovoltaic power generation employs solar panels composed of a number of solar cells containing a photovoltaic material. Materials presently used for photovoltaics include monocrystalline silicon, polycrystalline silicon, amorphous silicon, cadmium telluride, and copper indium gallium selenide /sulfide."}, {"url": "https://en.wikipedia.org/wiki/Solar_cell", "passage_text": "A solar cell, or photovoltaic cell, is an electrical device that converts the energy of light directly into electricity by the photovoltaic effect, which is a physical and chemical phenomenon. A photoelectrolytic cell (photoelectrochemical cell), on the other hand, refers either to a type of photovoltaic cell (like that developed by Edmond Becquerel and modern dye-sensitized solar cells), or to a device that splits water directly into hydrogen and oxygen using only solar illumination."}, {"url": "http://www.fsec.ucf.edu/en/consumer/solar_electricity/basics/how_pv_cells_work.htm", "passage_text": "A typical silicon PV cell is composed of a thin wafer consisting of an ultra-thin layer of phosphorus-doped (N-type) silicon on top of a thicker layer of boron-doped (P-type) silicon. An electrical field is created near the top surface of the cell where these two materials are in contact, called the P-N junction. "}]