[{"url": "http://www.sydney.com/destinations/sydney/sydney-north/northern-beaches/attractions/collaroy-beach", "passage_text": "Collaroy has great swimming conditions and is excellent for beginner surfers. While advanced surfers are more likely to look at nearby wave-magnets such as Narrabeen and Long Reef, Collaroy does offer a considerable advantage in amenities for visitors."}, {"url": "http://wikitravel.org/en/Sydney/Collaroy", "passage_text": "The first is Long Reef headland, just south of Collaroy, where there is also a spectacularly situated golf course. The second is Collaroy Plateau which rises behind Collaroy to the west and gives a grand view from a lookout point across the Northern Beaches."}, {"url": "https://en.wikipedia.org/wiki/Collaroy,_New_South_Wales", "passage_text": "Collaroy’s surf beach joins Narrabeen Beach at Wetherill Street making one continuous 3.4 km surf beach. Four Surf Lifesaving Clubs provide swimming supervision/surf rescue services (North Narrabeen SLC, Narrabeen SLC, South Narrabeen SLC, and Collaroy SLC)."}, {"url": "http://beachsafe.org.au/beach/nsw310", "passage_text": "Extremely hazardous: 9-10. Narrabeen-Collaroy beach (NSW 310) is Sydney's second longest beach. The 3.6 km long beach curves in a gentle east-facing arc between 20 m high Narrabeen Head in the north to rocks and low cliff at Collaroy Point, with beachfront houses and apartments backing much of the beach (Fig. 4.206)."}, {"url": "https://www.yha.com.au/hostels/nsw/sydney-surrounds/collaroy/", "passage_text": "85%. Sydney, Collaroy Beachouse YHA. Sydney's northern beaches are arguably some of the best beaches in Australia. Thankfully, Collaroy YHA Hostel is just a stone’s throw (50 metres) from Collaroy beach and an easy commute to Dee Why, Manly & Palm Beach (Used in the filming of Australian TV series ‘Home & Away’)."}, {"url": "http://wikitravel.org/en/Sydney/Collaroy", "passage_text": "Collaroy is one of the Northern Beaches suburbs of Sydney. From Central or Wynyard in the city, any bus with the number between 184 and 190 will go through Collaroy."}, {"url": "https://en.wikipedia.org/wiki/Collaroy,_New_South_Wales", "passage_text": "Collaroy is a suburb in northern Sydney, in the state of New South Wales, Australia. Collaroy is 22 kilometres north-east of the Sydney central business district, in the local government area of Warringah Council."}]