[{"url": "http://www.bioxplorer.com/spliceosome/", "passage_text": "Each spliceosome is composed of five small nuclear RNA proteins, called snRNPs and a range of non-snRNP associated protein factors. The snRNPs that make up the nuclear spliceosome are named U1, U2, U4, U5 and U6. All of the are highly interconnected (via RNA-RNA interactions) and also interact with proteins, forming a huge complex. The RNA component of the snRNP is rich in uridine"}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3119917/", "passage_text": "Nuclear pre-mRNA splicing is catalyzed by the spliceosome, a multi-megadalton ribonucleoprotein (RNP) complex. Both the conformation and composition of the spliceosome are highly dynamic, affording the splicing machinery its accuracy and at the same time flexibility. During spliceosome assembly, an intricate RNA–RNA interaction network is formed that is extensively rearranged during catalytic activation of the spliceosome and the catalytic steps of splicing (reviewed by Nilsen 1998)."}, {"url": "http://www.merriam-webster.com/medical/spliceosome", "passage_text": "Medical Definition of SPLICEOSOME. : a ribonucleoprotein complex that is the site in the cell nucleus where introns are excised from precursor messenger RNA and exons are joined together to form functional messenger RNA. — spli·ce·o·som·al \\ˌsplī-sē-ə-ˈsō-məl\\ adjective. Tweet. : a ribonucleoprotein complex that is the site in the cell nucleus where introns are excised from precursor messenger RNA and exons are joined together to form functional messenger RNA."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071104143301AA2hA6v", "passage_text": "Once a DNA sequence has been transcribed as a hnRNA strand, the introns will be spliced out. The resulting mRNA sequence will then be translated into a protein. A spliceosome is a complex of specialized RNA and protein subunits that removes introns from a transcribed hnRNA (often called pre-mRNA) segment. This process is generally referred to as splicing. "}, {"url": "https://en.wikipedia.org/wiki/Small_nuclear_RNA", "passage_text": "The spliceosome is a large, protein-RNA complex that consists of five small nuclear RNAs (U1, U2, U4, U5, and U6) and over 150 proteins. The snRNAs, along with their associated proteins, form ribonucleoprotein complexes (snRNPs), which bind to specific sequences on the pre-mRNA substrate. Small nuclear ribonucleic acid (snRNA), also commonly referred to as U-RNA, is a class of small RNA molecules that are found within the splicing speckles and Cajal bodies of the cell nucleus in eukaryotic cells."}, {"url": "http://www.biology-online.org/dictionary/Spliceosome", "passage_text": "One component of a spliceosome are small nuclear RNA molecules (u1, u2, u4, u5, u6) that collaborate with proteins, to help create rNA structures (snurps) that participate in hnRNA splicing. Origin: Gr. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_spliceosome", "passage_text": "The spliceosome is a complex of small nuclear RNA (snRNA) and small nuclear protein (snRNP) molecules, snRNAs and snRNPs. snRNPs include U1, U2, U4, U5 and U6. This removal is done in a coimplex protein structure called the spliceosome. The spliceosome splices out the non-coding introns from the primary mRNA transcript, and stiches the exons back together into the mature mRNA transcript."}, {"url": "https://en.wikipedia.org/wiki/Spliceosome", "passage_text": "A spliceosome is a large and complex molecular machine found primarily within the splicing speckles of the cell nucleus of eukaryotic cells. The spliceosome is assembled from snRNAs and protein complexes. The spliceosome removes introns from a transcribed pre-mRNA, a kind of primary transcript. This process is generally referred to as splicing. The RNA component of the small nuclear ribonucleic protein or snRNP (pronounced snurp) is rich in uridine (the nucleoside analog of the uracil nucleotide). The canonical assembly of the spliceosome occurs anew on each hnRNA (pre-mRNA)."}, {"url": "http://www.bioxplorer.com/spliceosome/", "passage_text": "The spliceosome is the component that makes possible the “maturation” of the mRNAs (removing the introns from the transcribed pre-mRNAs) and which was more important for my choice, the spliceosome determines the genetic diversity in eukaryotes in the context of the alternative splicing. The snRNPs that make up the nuclear spliceosome are named U1, U2, U4, U5 and U6. All of the are highly interconnected (via RNA-RNA interactions) and also interact with proteins, forming a huge complex."}]