[{"url": "http://www.alleghenyconference.org/10CountyRegion.php", "passage_text": "The Pittsburgh region consists of the City of Pittsburgh and 10 counties, each offering its own unique strengths and character as business locations and community centers. "}, {"url": "https://en.wikipedia.org/wiki/Pittsburgh_metropolitan_area", "passage_text": "The U.S. Census Bureau defines the area as both an MSA consisting of seven Western Pennsylvania counties anchored by the city of Pittsburgh and a twelve county Pittsburgh– New Castle-Weirton CSA with 2 West Virginia counties and one in Ohio. The metropolitan area consists of the city of Pittsburgh in the Commonwealth of Pennsylvania and surrounding counties. By many definitions the area extends into the U.S. states of West Virginia and"}, {"url": "http://www.bnbfinder.com/Pennsylvania/Pittsburgh-Region-Bed-and-Breakfast", "passage_text": "- Found in western Pennsylvania, the Pittsburgh region is centered on the city of Pittsburgh but also includes destinations like Butler, Gibsonia, Harmony, and Portersville. Pittsburgh is the second biggest city in Pennsylvania, and is known as The City of Bridges (did you know it has around 450 bridges??). "}, {"url": "http://wikitravel.org/en/Pittsburgh", "passage_text": "Pittsburgh [1] is a city of about 350,000 in Allegheny County, at the center of the Pittsburgh Region in southwestern Pennsylvania; the population of its metropolitan area is about 2.4 million. It is situated at the confluence of the Monongahela and Allegheny Rivers, which meet to form the Ohio River. The Pittsburgh Panthers of the University of Pittsburgh (Pitt) are very popular in the region, with teams in a variety of sports. The men's and women's basketball teams have been very competitive lately, with the men's frequently ranking in the top 15 in the NCAA basketball playoffs."}, {"url": "https://en.wikipedia.org/wiki/Pittsburgh_metropolitan_area", "passage_text": "This article is about the region. For the core city, see Pittsburgh. The Pittsburgh metropolitan area (also called Greater Pittsburgh, Southwestern Pennsylvania or the Pittsburgh Tri-State) is the largest population center in both the Ohio River Valley and Appalachia. The metropolitan area consists of the city of Pittsburgh in the Commonwealth of Pennsylvania and surrounding counties. By many definitions the area extends into the U.S. states of West Virginia and Ohio"}, {"url": "http://explorepahistory.com/regions_pittsburgh.php", "passage_text": "Visit PA Regions. Paths of Innovation. Pittsburgh has grown from a patchwork of small towns, divided by hills and rivers, along the confluence of the Allegheny and Monongahela Rivers to an ever-changing urban landscape with its finger on the pulse of emerging industries."}, {"url": "https://en.wikipedia.org/wiki/Pittsburgh", "passage_text": "There are two major daily newspapers in Pittsburgh: the Pittsburgh Post-Gazette and the Pittsburgh Tribune-Review. Weekly papers in the region include the Pittsburgh Business Times, Pittsburgh City Paper, Pittsburgh Catholic, The Jewish Chronicle of Pittsburgh, The New People, and the New Pittsburgh Courier. A month later, Forbes named Pittsburgh the 7th best place to raise a family. Pittsburgh was ranked the 4th best city for working mothers by Forbes in 2010 and the city was ranked as one of the best for entrepreneurs by Entrepreneur. Forbes named Pittsburgh, in an 8-way tie, the world's 10th cleanest city for 2007."}, {"url": "http://www.visitpa.com/regions/pittsburgh-its-countryside", "passage_text": "And the Children's Museum of Pittsburgh gives the kids a place to play, learn, and create all at the same time. Cities in this Region: Ambridge, Butler, East Berlin, Ellwood City, Indiana, Monroeville, New Castle, New Wilmington, Pittsburgh, Washington. Pittsburgh and Its Countryside is a region full of history, great food, and cool activities."}, {"url": "http://www.barberinstitute.org/location/pittsburgh-region", "passage_text": "Making Dreams Come True in the Pittsburgh Region. The Barber National Institute was founded in Erie, Pennsylvania in 1952 by Erie educator Dr. Gertrude A. Barber. Our organization currently serves more than 4,200 children, adults and families across the commonwealth with a wide range of quality educational, vocational, residential and behavioral health services."}]