[{"url": "http://www.probiotics-lovethatbug.com/bifidobacterium.html", "passage_text": "Bifidobacterium are another group of probiotics with enough members in the family to make it confusing to sort out which supplement is best for you. So let's look at why one the Bifidobacterium family might be a very good choice for you. 1  One of the useful lactic acid producing bacteria which are found in many probiotics and are essential for health. 2  Natural colonizers of the human intestinal tract 1 - this makes them a highly desirable probiotic. Why you need Bifidobacteria. Although Bifidobacteria make up only 3 to 6% of the bacteria count in adult stools, their presence has been associated with many beneficial health effects such as the prevention of diarrhea, the reduction of lactose intolerance, an immune enhancement 1."}, {"url": "http://www.powerofprobiotics.com/Bifidobacterium.html", "passage_text": "Bifidobacterium, along with Lactobacillus, are also some of the most well-known probiotics and are an important part of your flora. These good bacteria are lactic-acid producing bacteria (LAB), just like Lactobacillus, and they both produce vitamins, bacteriocins (antibacterial chemicals) and antibiotic-like substances. Bifidobacteria)– The Shy Probiotic Lactic-Acid Bacteria Superstars. Bifidobacterium are the shy probiotic LAB (lactic-acid bacteria) superstars. Although you need more than one type of probiotic microbe to be healthy, these probiotic microbes play critical roles in your health."}, {"url": "http://healthyeating.sfgate.com/foods-containing-lactobacillus-bifidobacterium-3728.html", "passage_text": "Many bacteria live in your intestines in a parasitic relationship that benefits both you and them. Lactobacillus bacteria belong to a class of bacteria known as lactic acid bacteria. Bifidobacterium produce lactic acid as an end product of fermentation. Lactic acid bacteria ferment foods, which lowers the pH level and prevents harmful bacterial growth. In some cases, such as certain types of yogurt, fermented foods contain live bacteria cultures that might have beneficial intestinal effects."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-891-BIFIDOBACTERIA.aspx?activeIngredientId=891&activeIngredientName=BIFIDOBACTERIA", "passage_text": "Bifidobacteria are a group of bacteria that normally live in the intestines. They can be grown outside the body and then taken by mouth as medicine. Bifidobacteria are used for many conditions affecting the intestines, including preventing diarrhea in infants and children; as well as traveler’s diarrhea in adults. Bifidobacteria are also used to treat a bowel disease called ulcerative colitis, as well as a condition called pouchitis, which sometimes develops after surgery for ulcerative colitis. Some people use Bifidobacteria to prevent a particular bowel infection called necrotizing enterocolitis in newborns."}, {"url": "http://probiotic.org/bifidobacterium.htm", "passage_text": "Bifidobacterium. Bifidobacteria are one variety of “good” bacteria that live in a healthy intestinal tract. Since bifidobacteria exist naturally in your gastrointestinal system, you might guess that nature intends bifidobactera to serve a specific purpose there, and your guess would be correct."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-891-BIFIDOBACTERIA.aspx?activeIngredientId=891&activeIngredientName=BIFIDOBACTERIA", "passage_text": "Other uses for Bifidobacteria include treating a skin condition in infants called atopic eczema, yeast infections (candidiasis), cold, flu, reducing flu-like symptoms in children attending day-care centers, breast pain (mastitis), hepatitis, lactose intolerance, mumps, Lyme disease, and cancer. Bifidobacteria are also used to treat a bowel disease called ulcerative colitis, as well as a condition called pouchitis, which sometimes develops after surgery for ulcerative colitis. Some people use Bifidobacteria to prevent a particular bowel infection called necrotizing enterocolitis in newborns."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-891-BIFIDOBACTERIA.aspx?activeIngredientId=891&activeIngredientName=BIFIDOBACTERIA", "passage_text": "Lactic acid bacteria are found in fermented foods like yogurt and cheese. Bifidobacteria are used in treatment as so-called “probiotics,” the opposite of antibiotics. They are considered friendly bacteria and are taken to grow and multiply in areas of the body where they normally would occur. Bifidobacteria are also used to treat a bowel disease called ulcerative colitis, as well as a condition called pouchitis, which sometimes develops after surgery for ulcerative colitis. Some people use Bifidobacteria to prevent a particular bowel infection called necrotizing enterocolitis in newborns."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-891-BIFIDOBACTERIA.aspx?activeIngredientId=891&activeIngredientName=BIFIDOBACTERIA", "passage_text": "Probiotics such as bifidobacteria are typically used in cases when a disease occurs or might occur due to a kill-off of normal bacteria. For example, treatment with antibiotics can destroy disease-causing bacteria, but also normal bacteria in the GI (gastrointestinal) and urinary tracts. Bifidobacteria are also used to treat a bowel disease called ulcerative colitis, as well as a condition called pouchitis, which sometimes develops after surgery for ulcerative colitis. Some people use Bifidobacteria to prevent a particular bowel infection called necrotizing enterocolitis in newborns."}, {"url": "https://en.wikipedia.org/wiki/Bifidobacterium", "passage_text": "Bifidobacterium is a genus of Gram-positive, nonmotile, often branched anaerobic bacteria. They are ubiquitous, endosymbiotic inhabitants of the gastrointestinal tract, vagina and mouth (B. dentium) of mammals, including humans. Bifidobacteria are one of the major genera of bacteria that make up the colon flora in mammals. Some bifidobacteria are used as probiotics. Before the 1960s, Bifidobacterium species were collectively referred to as  Lactobacillus bifidus "}]