[{"url": "http://www.oxforddictionaries.com/definition/english/burial", "passage_text": "View synonyms. 1.2 [count noun] Archaeology A grave or the remains found in it: [as modifier]: burial mounds. More example sentences. 1  Because of this not all the earth had been put back into the grave at the time of the burial, so it seems likely that a small burial mound or barrow surmounted the grave. 1 The action or practice of burying a dead body: his remains were shipped home for burial. More example sentences. 1  They are also charged with preventing or conspiring to prevent the lawful and decent burial of a dead body."}, {"url": "http://www.investopedia.com/terms/b/burial-insurance.asp", "passage_text": "DEFINITION of 'Burial Insurance '. A basic type of life insurance that is used to pay for funeral services and merchandise costs. This policy usually covers people until they reach the age of 100. "}, {"url": "http://www.learnersdictionary.com/definition/burial", "passage_text": "an ancient burial ground [=an area of land where dead people were buried in ancient times]. [+] more examples [-] hide examples [+] Example sentences [-] Hide examples. 2. [noncount] : the act of burying something in the ground. The law prohibits the burial of toxic substances without special permits. [+] more examples [-] hide examples [+] Example sentences [-] Hide examples. Comments & Questions."}, {"url": "http://dictionary.cambridge.org/dictionary/english/funeral", "passage_text": "funeral noun [C]. B2 a (usually ​religious) ​ceremony for ​burying or ​burning the ​body of a ​dead ​person: The funeral will be ​held next ​Friday. Over 300 ​mourners ​attended the funeral. a funeral ​procession. More examples. 1  She ​ looked ​ remarkably ​ composed ​ throughout the funeral. "}, {"url": "http://www.learnersdictionary.com/definition/burial", "passage_text": "Learner's definition of BURIAL. 1. : the act or ceremony of burying a dead person in a grave. — often used before another noun. [noncount]. They prepared the body for burial. [+] more examples [-] hide examples [+] Example sentences [-] Hide examples. [count]. She wanted to give him a proper burial. [noncount] : the act of burying something in the ground. The law prohibits the burial of toxic substances without special permits. [+] more examples [-] hide examples [+] Example sentences [-] Hide examples. Comments & Questions."}, {"url": "http://www.thefreedictionary.com/burial", "passage_text": "burial. n. 1. the act of burying, esp the interment of a dead body. [Old English byrgels burial place, tomb; see bury, -al²]. burial-the ritual placing of a corpse in a grave. entombment, inhumation, interment, sepulture. funeral-a ceremony at which a dead person is buried or cremated; hundreds of people attended his funeral."}, {"url": "http://www.usccb.org/prayer-and-worship/bereavement-and-funerals/overview-of-catholic-funeral-rites.cfm", "passage_text": "An Overview of Catholic Funeral Rites. At the death of a Christian, whose life of faith was begun in the waters of Baptism and strengthened at the Eucharistic table, the Church intercedes on behalf of the deceased because of its confident belief that death is not the end, nor does it break the bonds forged in life. "}, {"url": "http://www.thefreedictionary.com/funeral", "passage_text": "funeral. n. 1. a. a ceremony at which a dead person is buried or cremated. b. (as modifier): a funeral service. 2. a procession of people escorting a corpse to burial. 3. worry; concern; affair: that's your funeral. Noun. 1. funeral-a ceremony at which a dead person is buried or cremated; hundreds of people attended his funeral. ceremonial, ceremonial occasion, ceremony, observance-a formal event performed on a special occasion; a ceremony commemorating Pearl Harbor."}, {"url": "http://www.yourdictionary.com/burial", "passage_text": "burial. cerement the cloth or clothing in which the dead are wrapped for burial or other form of funeral. columbarium a vault where the remains of cremated bodies are kept, usually in one of a number of recesses in a wall. "}, {"url": "http://legal-dictionary.thefreedictionary.com/burial", "passage_text": "Burial. BURIAL. The act of interring the dead. 2. No burial is lawful unless made in conformity with the local regulations; an when a dead body has been found, it cannot be lawfully buried until the coroner has holden an inquest over it. "}]