[{"url": "http://memorize.com/emt-b-airway/pandora", "passage_text": "(C) The actual exchange of oxygen and carbon dioxide occurs in the capillaries. (D) Blood that returns to the lungs from the body has a low carbon dioxide content. (B) Oxygen and carbon dioxide diffuse across the alveolar walls and"}, {"url": "http://www.merckmanuals.com/home/lung-and-airway-disorders/biology-of-the-lungs-and-airways/exchanging-oxygen-and-carbon-dioxide", "passage_text": "To support the exchange of oxygen and carbon dioxide, about 5 to 8 liters (about 1.3 to 2.1 gallons) of air per minute are brought in and out of the lungs, and about three tenths of a liter of oxygen is transferred from the alveoli to the blood each minute, even when the person is at rest."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/anatomyvideos/000059.htm", "passage_text": "Gas exchange is the delivery of oxygen from the lungs to the bloodstream, and the elimination of carbon dioxide from the bloodstream to the lungs. It occurs in the lungs between the alveoli and a network of tiny blood vessels called capillaries, which are located in the walls of the alveoli."}, {"url": "http://www.merckmanuals.com/home/lung-and-airway-disorders/biology-of-the-lungs-and-airways/exchanging-oxygen-and-carbon-dioxide", "passage_text": "The function of the respiratory system is to exchange two gases: oxygen and carbon dioxide. The exchange takes place in the millions of alveoli in the lungs and the capillaries that envelop them. As shown below, inhaled oxygen moves from the alveoli to the blood in the capillaries, and carbon dioxide moves from the blood in the capillaries to the air in the alveoli."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/G/GasExchange.html", "passage_text": "The exchange of oxygen and carbon dioxide in the leaf (as well as the loss of water vapor in transpiration) occurs through pores called stomata (singular = stoma). The immediate cause is a change in the turgor of the guard cells."}, {"url": "http://www.merckmanuals.com/home/lung-and-airway-disorders/biology-of-the-lungs-and-airways/exchanging-oxygen-and-carbon-dioxide", "passage_text": "At the same time, a similar volume of carbon dioxide moves from the blood to the alveoli and is exhaled. During exercise, it is possible to breathe in and out more than 100 liters (about 26 gallons) of air per minute and extract 3 liters (a little less than 1 gallon) of oxygen from this air per minute."}, {"url": "http://www.merckmanuals.com/home/lung-and-airway-disorders/biology-of-the-lungs-and-airways/exchanging-oxygen-and-carbon-dioxide", "passage_text": "Similarly, carbon dioxide passes from the blood into the alveoli and is then exhaled. Oxygenated blood travels from the lungs through the pulmonary veins and into the left side of the heart, which pumps the blood to the rest of the body (see Function of the Heart)."}, {"url": "http://www.answers.com/Q/Where_does_the_exchange_of_oxygen_and_carbon_dioxide_occur", "passage_text": "The alveoli is the structure of the lungs where the exchange of  carbon dioxide and oxygen occur. The alveoli are like tiny sacs of  air."}, {"url": "http://beltina.org/health-dictionary/oxygen-carbon-dioxide-exchange.html", "passage_text": "Oxygen-carbon dioxide-The process by which oxygen passes from the air in the LUNGS to the HEMOGLOBIN in the BLOOD, and carbon dioxide from the hemoglobin passes into the air in the lungs. Oxygen-carbon dioxide exchange is fundamental to life and is the primary function of"}]