[{"url": "https://en.wikipedia.org/wiki/Meta-analysis", "passage_text": "1 Selection of a meta-regression statistical model: e.g. simple regression, fixed-effect meta-regression or random-effect meta-regression. 2  Meta-regression is a tool used in meta-analysis to examine the impact of moderator variables on study effect size using regression-based techniques."}, {"url": "http://www.bmj.com/content/315/7121/1533", "passage_text": "The sensitivity analysis thus shows that the results from this meta-analysis are robust to the choice of the statistical method and to the exclusion of trials of poorer quality or of studies stopped early."}, {"url": "https://en.wikipedia.org/wiki/Meta-analysis", "passage_text": "1 Meta-regression is a tool used in meta-analysis to examine the impact of moderator variables on study effect size using regression-based techniques. 2  Meta-regression is more effective at this task than are standard regression"}, {"url": "https://en.wikipedia.org/wiki/Meta-analysis", "passage_text": "The basic tenet of a meta-analysis is that there is a common truth behind all conceptually similar studies, but which has been measured with a certain error within individual studies."}, {"url": "http://wilderdom.com/research/meta-analysis.html", "passage_text": "1 In meta-analysis, effect sizes should also be reported with: 2  the number of studies and the number of effects used to create the estimate. 3  confidence intervals to help readers determine the consistency and reliability of the mean estimated effect size."}, {"url": "https://www.meta-analysis.com/pages/why_do.php", "passage_text": "Meta-analysis is the statistical procedure for combining data from multiple studies. When the treatment effect (or effect size) is consistent from one study to the next, meta-analysis can be used to identify this common effect. When the effect varies from one study to the next, meta-analysis may be used to identify the reason for the variation."}, {"url": "https://en.wikipedia.org/wiki/Meta-analysis", "passage_text": "Meta-analyses are often, but not always, important components of a systematic review procedure. For instance, a meta-analysis may be conducted on several clinical trials of a medical treatment, in an effort to obtain a better understanding of how well the treatment works."}, {"url": "https://en.wikipedia.org/wiki/Meta-analysis", "passage_text": "The aim in meta-analysis then is to use approaches from statistics to derive a pooled estimate closest to the unknown common truth based on how this error is perceived."}, {"url": "http://wilderdom.com/research/meta-analysis.html", "passage_text": "1 The standardised mean effect size is basically computed as the difference score divided by the standard deviation of the scores. 2  In meta-analysis, effect sizes should also be reported with: 3  the number of studies and the number of effects used to create the estimate."}]