[{"url": "http://arborist101.com/brand/echo/", "passage_text": "ECHO CS-350TES Chainsaw. Echo CS-350TES Chainsaw – lightweight chainsaw with a reliable and powerful engine which does not need excessive efforts to run thanks to the unique quick start system «Easy Start» from the Echo Company. Chainsaw can be used with one hand and effectively utilized for work at height."}, {"url": "http://www.echo-usa.com/Products/Chain-Saws", "passage_text": "Whether you're pruning limbs, cutting firewood or taking down a whole tree, each ECHO Chain Saw is designed to provide long, trouble-free life. You want a chainsaw that starts easy, runs smooth, and provides years of dependable performance."}, {"url": "http://chainsawadviser.com/echo-chainsaw-cs-310-14-bar-review/", "passage_text": "The Echo Chainsaw CS-310 is one of the best chainsaws in the market. A lot of users have given it generally positive reviews, all accounting for its size, power and cost as one of the best, if not the best,"}, {"url": "http://chainsawadviser.com/echo-chainsaw-cs-310-14-bar-review/", "passage_text": "Features: The Echo Chainsaw CS-310 has a number of features that will help you in cutting down trees, branches and wood much easier. With its 14-inch bar length, you might think that it weighs quite a bit. But at 8 lbs., it’s quite lightweight compared to other powerful chainsaws."}, {"url": "http://www.consumerreports.org/cro/chain-saws/buying-guide.htm", "passage_text": "Echo is one of the leading brands of gas-engine chain saws. Echo chain saws come in a variety of bar lengths, from 14 inches to 20 inches, and are marketed to consumers and professionals. Echo chain saws can be purchased from dealers and Home Depot."}, {"url": "http://www.top-chainsaws.com/best-echo-chainsaw/", "passage_text": "Offering a high level of cutting, a good echo chainsaw enables you to be more and more possible to do cutting jobs. In this page, we plan to give you several useful advice about a lot of products which are taking up the market for a long time."}]