[{"url": "http://www.maplandia.com/hong-kong/chai-wan/", "passage_text": "detailed map of Chai Wan and near places. Welcome to the Chai Wan google satellite map! This place is situated in Hong Kong, its geographical coordinates are 22° 16' 0 North, 114° 14' 0 East and its original name (with diacritics) is Chai Wan. See Chai Wan photos and images from satellite below, explore the aerial photographs of Chai Wan in Hong Kong. Chai Wan hotels map is available on the target page linked above. The location of each Chai Wan hotel listed is shown on the detailed zoomable map. Moreover, Chai Wan hotel map is available where all hotels in Chai Wan are marked. You can easily choose your hotel by location."}, {"url": "https://en.wikipedia.org/wiki/Chai_Wan", "passage_text": "Chai Wan was formerly known as Sai Wan (西灣). At the beginning of the 18th century, the area consisted of six villages: Dai Ping Village, Law Uk, Luk Uk, Nam Uk, Sai Village, Sing Uk. In 1845, the British military built a fort and a barracks in Siu Sai Wan which operated until the 1980s. Heng Fa Chuen is a private residential estate in Chai Wan, jointly developed by MTR Corporation and Kerry Properties. Construction of the residential estate began on 13 August 1977, ended on 26 April 1982 and officially opened on 10 July 1982."}, {"url": "https://en.wikipedia.org/wiki/Wan_Chai", "passage_text": "Wan Chai (/ˌwɑːn ˈtʃaɪ/ Chinese: 灣仔) is a metropolitan area situated at the western part of the Wan Chai District on the northern shore of Hong Kong Island, in Hong Kong. Its other boundaries are Canal Road to the east, Arsenal Street to the west and Bowen Road to the south. Geographically, Wan Chai is the crossing point between the western (West Point / Central) and the eastern (Causeway Bay / North Point) districts. Its thoroughfares connect the main developed areas along the northern coast of Hong Kong Island. The transport infrastructure is efficient, convenient and highly accessible."}, {"url": "https://en.wikipedia.org/wiki/Wan_Chai", "passage_text": "Wan Chai originally began as Ha Wan (下環), literally meaning a bottom ring or lower circuit. As one of the earliest developed areas in Hong Kong along the Victoria Harbour, Central, Sheung Wan (upper ring), Sai Wan (western ring) and Wan Chai are collectively known as the four rings (四環) by the locals. Geographically, Wan Chai is the crossing point between the western (West Point / Central) and the eastern (Causeway Bay / North Point) districts. Its thoroughfares connect the main developed areas along the northern coast of Hong Kong Island. The transport infrastructure is efficient, convenient and highly accessible."}, {"url": "https://en.wikipedia.org/wiki/Wan_Chai", "passage_text": "The area north of Gloucester Road is often referred to as Wan Chai North. Wan Chai is one of the busiest commercial areas in Hong Kong with offices of many small and medium-sized companies. Wan Chai North features office towers, parks, hotels and an international conference and exhibition centre. Geographically, Wan Chai is the crossing point between the western (West Point / Central) and the eastern (Causeway Bay / North Point) districts. Its thoroughfares connect the main developed areas along the northern coast of Hong Kong Island. The transport infrastructure is efficient, convenient and highly accessible."}, {"url": "http://gohongkong.about.com/od/whattoseeinhk/a/Visitors-Guide-To-Wan-Chai.htm", "passage_text": "Squeezed in between Victoria Peak and Victoria Harbour, Wan Chai’s reputation as one of Asia’s most dedicated red light district was earned during the Vietnam War and cemented by a starring role in the film and novel Suzie Wong. Wan Chai is second only to swanky Central for skyscrapers – with the Hopewell Centre and The Centre some of the tallest buildings in the city. It’s also one of Hong Kong’s premium nightlife districts and its bars, pubs and clubs offer a less pretentious alternative to Lan Kwai Fong."}, {"url": "http://www.discoverhongkong.com/ca/shop/where-to-shop/shopping-areas/wan-chai.jsp", "passage_text": "Made internationally famous by the 1960 film The World of Suzie Wong, historic Wan Chai is not just Hong Kong’s party district; by day it’s a pleasant neighbourhood for wandering and shopping. "}, {"url": "https://en.wikipedia.org/wiki/Chai_Wan", "passage_text": "Skyline of Chai Wan, extending from Island Resort in Siu Sai Wan (left) to Heng Fa Chuen (right), viewed from Lei Yuen Mun (Kowloon) across the Lei Yue Mun channel. Chai Wan is built on land reclaimed from the bay and extends west from Lei Yue Mun in Heng Fa Chuen (see below) and east to Siu Sai Wan. Mount Collinson and Pottinger Peak on the south and Mount Parker on the west, restrict further development. Shek O Country Park is at the south of Chai Wan. Heng Fa Chuen is a private residential estate in Chai Wan, jointly developed by MTR Corporation and Kerry Properties. Construction of the residential estate began on 13 August 1977, ended on 26 April 1982 and officially opened on 10 July 1982."}]