[{"url": "http://www.asianonlinerecipes.com/food_articles/seaweed-different-types.php", "passage_text": "The Different Types of Seaweed Seaweed has long been prized as an excellent source of minerals. It provides an abundance of minerals, plus other nutrients such as vitamins A and C (especially Konbu) and protein (especially nori)."}, {"url": "http://www.best-natural-foods.com/seaweed-types.html", "passage_text": "Dulse is used similarly to Japanese seaweed types such as nori and wakame (below). Click here for some dulse seaweed recipes. Recommendations: 1  In salads and soups, small amounts of dulse-equivalent to, say, two or three square inches, may be taken daily or several times a week."}, {"url": "http://www.best-natural-foods.com/seaweed-types.html", "passage_text": "And the milder taste also indicates that these seaweed types do not contain as much nutrients as brown algae. For example, the iodine content of red algae can be as low as 15 micrograms per 100 grams of seaweed, whereas brown algae might contain several thousand micrograms of iodine per 100 grams of seaweed."}, {"url": "http://www.infoplease.com/encyclopedia/science/seaweed-types-seaweed.html", "passage_text": "Types of Seaweed. The simplest of the seaweeds are among the cyanobacteria, formerly called the blue-green algae, and green algae (division Chlorophyta), found nearest the shore in shallow waters and usually growing as threadlike filaments, irregular sheets, or branching fronds."}, {"url": "http://knowledgenuts.com/2013/12/08/the-difference-between-seaweed-and-kelp/", "passage_text": "Kelp is one of those types. Among the largest types of seaweed, what makes them unique is their tendency to grow in large, thick kelp forests that can be home to hundreds of different species of marine life."}, {"url": "http://www.newworldencyclopedia.org/entry/Seaweed", "passage_text": "Types of seaweed. Seaweeds are classified into brown algae (Phaeophyta), red algae (Rhodophyta), and green algae (Chlorophyta). Note that in reality the term algae is mainly used for convenience, rather than taxonomic purposes, as there appears little relationship between the various phyla."}, {"url": "http://www.best-natural-foods.com/seaweed-types.html", "passage_text": "In Europe and North America, laver is one of the commonly eaten seaweed types similar to nori. Recommendation: 1  Half to one large sheet per day, or equivalent amount. 2  Okay to eat more occasionally, as in a sushi meal, since nori is not one of the stronger seaweed types."}, {"url": "http://www.seaweed.ie/descriptions/", "passage_text": "Seaweed descriptions and pictures. Here is a selection of 200 or so of the larger seaweeds from the north-eastern Atlanic, many of which occur in Norway, Britain, Ireland, Atlantic France and Spain, and in Portugal. Web pages have so far been completed for those with links (underlined). Please bear with me while the descriptions and pictures are refined."}]