[{"url": "http://www.legalmatch.com/law-library/article/class-a-misdemeanor-laws.html", "passage_text": "Since Class A misdemeanors are usually the most serious type of misdemeanor offense, they often involve the maximum amount of penalties that can be prescribed for a misdemeanor. This typically includes: 1  Fines ranging anywhere from $500 to $5,000. 2  1 year in jail. States typically divide misdemeanors into categories such as Class A, B, C, D (or some numerical equivalent), with A being the most serious and C or D being the least serious."}, {"url": "http://www.attorneys.com/criminal-defense/types-of-misdemeanors", "passage_text": "Tweet. Crimes are classified as either misdemeanors or a felonies, depending on the severity. A misdemeanor is the lesser of the two distinctions. In general, punishment for a misdemeanor consists of a fine, up to one year in jail, probation, court supervision, community service, or some combination of these. Depending on state laws, a number of different types of offenses that may be considered misdemeanors"}, {"url": "https://en.wikipedia.org/wiki/Misdemeanor", "passage_text": "In the United States, the federal government generally considers a crime punishable with incarceration for one year or less to be a misdemeanor. All other crimes are considered felonies. Many states also employ this distinction. A misdemeanor is considered a crime of low seriousness, and a felony one of high seriousness. A principle of the rationale for the degree of punishment meted out is that the punishment should fit the crime. One standard for measurement is the degree to which a crime affects others or society"}, {"url": "http://www.attorneys.com/criminal-defense/felonies-and-misdemeanors", "passage_text": "The Differences Between a Felony and a Misdemeanor. The main difference between a felony and a misdemeanor is the severity of the crime. What is considered to be a severe crime will vary from society to society and, sometimes, from state to state. Both felonies and misdemeanors can be committed against people, property, or the state. Once again, though, the difference is the severity of the crime. Because state legislatures and Congress define what constitutes a felony and a misdemeanor, crimes that fit into each category may differ somewhat from jurisdiction to jurisdiction. In general, felonies are reserved for more serious crimes and entail more serious punishments."}, {"url": "http://www.legalmatch.com/law-library/article/class-a-misdemeanor-laws.html", "passage_text": "A Class A Misdemeanor is the most serious classification of misdemeanor charge in most states. States typically divide misdemeanors into categories such as Class A, B, C, D (or some numerical equivalent), with A being the most serious and C or D being the least serious."}, {"url": "http://www.attorneys.com/criminal-defense/felonies-and-misdemeanors", "passage_text": "Criminal law divides crimes into two main categories: felony and misdemeanor. Because state legislatures and Congress define what constitutes a felony and a misdemeanor, crimes that fit into each category may differ somewhat from jurisdiction to jurisdiction. In general, felonies are reserved for more serious crimes and entail more serious punishments."}, {"url": "http://public.getlegal.com/legal-info-center/misdemeanor-crimes/", "passage_text": "Misdemeanors Defined. As a general rule, a misdemeanor is a criminal offense that carries a penalty of up to one year in detention. In most instances, the incarceration is in a county jail or similar facility, rather than a prison. Most misdemeanor convictions also require the payment of a fine"}, {"url": "http://criminal.findlaw.com/criminal-law-basics/what-distinguishes-a-misdemeanor-from-a-felony.html", "passage_text": "Other states define a misdemeanor as a crime that is not a felony or an infraction. Prosecutors generally have a great degree of flexibility in deciding what crimes to charge, how to punish them, and what kinds of plea bargains to negotiate. Felonies: Felonies are the most serious types of crimes. Misdemeanors: Misdemeanors are more serious than infractions. They are usually defined as a crime which is punishable by up to a year in jail time. Sometimes that jail time is served in a local county jail instead of a high security prison."}, {"url": "http://criminal.lawyers.com/criminal-law-basics/classification-of-crimes.html", "passage_text": "Misdemeanor Crimes. A misdemeanor is considered a less serious crime. Most states and the federal government classify a crime that’s punishable by less than one year in prison as a misdemeanor. Some states consider a misdemeanor as any crime that’s punishable only by fine or a small length of time in jail. If a misdemeanor is considered a very minor offense, such as jaywalking, the crime may be classified as a petty offense. There’s a wide variety of crimes that are considered misdemeanors in most states. Some common misdemeanors include: 1  Public intoxication. 2  Trespassing. 3  Speeding. 4  Prostitution. 5  Vandalism"}]