[{"url": "https://graphpad.com/scientific-software/prism/", "passage_text": "GraphPad Prism was originally designed for experimental biologists in medical schools and drug companies, especially those in pharmacology and physiology. Prism is now used much more broadly by all kinds of biologists, as well as social and physical scientists. I was able to use the demo yesterday to create two layouts of publication-quality scientific graphics in an amazingly short time. I hope we're able to buy GraphPad Prism because this software is a pleasure to use, very intuitive and perfectly suited to my boss's needs and my abilities."}, {"url": "http://www.softpedia.com/get/Science-CAD/GraphPad-Prism.shtml", "passage_text": "GraphPad Prism provides users with an full-featured, comprehensive biostatistics application that aims to assist biologists and researchers in analyzing complex sets of data and generating understandable graphs. GraphPad Prism bundles all the tools that you would expect from an application of its type. It runs detailed, thorough analysis and then enables you to check the resulting data for errors by retracing each performed step."}, {"url": "http://download.cnet.com/GraphPad-Prism/3000-2053_4-8453.html", "passage_text": "Publisher's Description. From GraphPad Software: GraphPad Prism, available for both Windows and Mac computers, combines scientific graphing, comprehensive curve fitting (nonlinear regression), understandable statistics, and data organization. GraphPad Prism was originally designed for experimental biologists in medical schools and drug companies, especially those in pharmacology and physiology. Prism is now used much more broadly by all kinds of biologists, as well as social and physical scientists."}, {"url": "http://graphpad-prism.software.informer.com/5.0/", "passage_text": "GraphPad Prism is a highly efficient tool capable of doing all mathematical calculations as well as graphical plotting such as curve fitting. "}, {"url": "https://en.wikipedia.org/wiki/GraphPad_Prism", "passage_text": "GraphPad Prism is a commercial scientific 2D graphing and statistics software published by GraphPad Software, Inc., a privately held California corporation. Prism is available for both Windows and Macintosh computers. "}, {"url": "http://www.hearne.software/Software/GraphPad-Prism/Editions", "passage_text": "GraphPad Prism 6.0. GraphPad Prism was originally designed for experimental biologists in medical schools and drug companies, especially those in pharmacology and physiology. Prism is now used much more broadly by all kinds of biologists, as well as social and physical scientists. The main difference is that the Mac version does not support Object Linking and Embedding (OLE): When you copy and paste a graph created with Prism Windows into another program such as Word or PowerPoint, you can embed an entire Prism object or paste a link to the Prism file."}, {"url": "http://file.org/free-download/graphpad-prism", "passage_text": "The download is free. GraphPad Prism is a program that is intended to be used by medical practitioners such as biologists, pharmacologists and physiologists for the creation of comprehensive nonlinear regression curve fitting, statistics analysis, data organization and scientific graphing. It is also extensively used by medical students. All acquired results using the GraphPad Prism program are linked. When a data entry is modified, the rest follows. This means that the GraphPad Prism updates the graphs, the layout, and the analysis automatically as triggered by any change in entry."}, {"url": "http://file.org/free-download/graphpad-prism", "passage_text": "GraphPad Prism also generates an analysis checklist that can be used during experimentations and in making assumptions. It also includes statistical help whenever deemed necessary. By pressing the ‘Learn’ button, you will see all the principles behind the provided analysis and curves generated using this software. All acquired results using the GraphPad Prism program are linked. When a data entry is modified, the rest follows. This means that the GraphPad Prism updates the graphs, the layout, and the analysis automatically as triggered by any change in entry."}]