[{"url": "http://www.afar.com/travel-guides/south-korea/sokcho-si/guide", "passage_text": "Sokcho, a vibrant city on Korea's East Coast, is one of the best places in the country to sample all the spoils of the sea-including fresh flower crab, lobster, scallops, and anything else you can fish out of the ocean with a net. Taepo Fish Market, Sokcho, Gangwon Province, South Korea. Step 3: Once you get to the city of Sokcho, leave the bus terminal, turn right. and walk for about 30 seconds.You'll see a city bus stop. Take bus 7 or 7-1. It costs about W1100 and the ride is about 25 minutes to Seoraksan."}, {"url": "http://mapcarta.com/Sokcho", "passage_text": "Sokcho. Sokcho is a city in Gangwon, South Korea. Sokcho has a population of around 84,000. It's quite a sleepy city and is known as a gateway to Seoraksan National Park, which is a 30 minute bus ride from the central hub."}, {"url": "https://en.wikipedia.org/wiki/Sokcho", "passage_text": "Yeonggeumjeong is a popular pavilion built on the shores of Sokcho. It is not only popular for its magnificent views of the sunrise, but also for the sound of the sea which is thought to be particularly nice at this site. The beach of Sokcho has a good reputation, and is open all year round with the summer months being the most popular. There are natural hot springs in Sokcho, some of which have been developed into spas and pleasure swimming halls. There are also golf courses which are popular because of their natural surroundings."}, {"url": "https://en.wikivoyage.org/wiki/Sokcho", "passage_text": "Sokcho has a population of around 84,000. It's quite a sleepy city and is known as a gateway to Seoraksan National Park, which is a 30 minute bus ride from the central hub. Also, the DMZ is located an hour north by bus, from the central hub. Sokcho is not filled with the plethora of hofs (restaurants with a drinking atmosphere), but almost all restaurants serve beer and soju (sweet potato wine, 20% proof) for ₩3,000 per liter of beer, 500 mL of soju. Hofs do exist, but are scattered, and mostly empty."}, {"url": "http://www.todoin.net/en/south-korea/where-is-sokcho-south-korea-1866", "passage_text": "38 $. Show Rates. How to get to Sokcho. You can get to Sokcho by train or bus: The nearest airport to get to Sokcho is Sokcho Airport very close and easy to reach, E. Within 110 Km from Sokcho there are 4 more airports, listed on the Sokcho airports map here below, click on the airport icon to see how to get to Sokcho. "}, {"url": "https://en.wikipedia.org/wiki/Sokcho", "passage_text": "Sokcho (속초) is a city in Gangwon-do province, South Korea. It is located in the far northeast of Gangwon-do. Lying north of the 38th parallel, the city belonged to North Korea from 1945 until the end of the Korean War, when the dividing line between the two Korean states was officially altered. The beach of Sokcho has a good reputation, and is open all year round with the summer months being the most popular. There are natural hot springs in Sokcho, some of which have been developed into spas and pleasure swimming halls. There are also golf courses which are popular because of their natural surroundings."}, {"url": "https://en.wikipedia.org/wiki/Seoraksan", "passage_text": "Seoraksan is the highest mountain in the Taebaek mountain range (태백산맥) in the Gangwon Province in eastern South Korea. It is located in a national park near the city of Sokcho. After the Hallasan volcano on Jeju Island and Jirisan in the south, Seoraksan is the third highest mountain in South Korea. The Daechongbong Peak (대청봉) of Seoraksan reaches 1,708 metres (5,603 feet). "}, {"url": "http://wikitravel.org/en/Sokcho", "passage_text": "Understand [edit]. Sokcho has a population of around 84,000. It's quite a sleepy city and is known as a gateway to Seoraksan National Park, which is a 30 minute bus ride from the central hub. Also, the DMZ is located an hour north by bus, from the central hub. Drink [edit]. Sokcho is not filled with the plethora of hofs (restaurants with a drinking atmosphere), but almost all restaurants serve beer and soju (sweet potato wine, 20% proof) for 3,000 Won per liter of beer, 500 mL of soju."}]