[{"url": "http://blog.doctoroz.com/is-this-right-for-you/5-htp-is-this-right-for-you", "passage_text": "5-HTP is a chemical compound that is naturally produced in your body as it makes serotonin, an important hormone for regulating your mood. Some doctors consider 5-HTP to be the best natural appetite suppressant. Physicians suggest taking a 5-HTP supplement instead of a serotonin supplement because 5-HTP can access the brain from the bloodstream, while serotonin cannot. In order to access the brain, chemicals and compounds will have to access the blood brain barrier, which grants access to the brain."}, {"url": "https://en.wikipedia.org/wiki/5-Hydroxytryptophan", "passage_text": "Not to be confused with serotonin (5-hydroxytryptamine, 5-HT). 5-Hydroxytryptophan (5-HTP), also known as oxitriptan (INN), is a naturally occurring amino acid and chemical precursor as well as a metabolic intermediate in the biosynthesis of the neurotransmitters serotonin and melatonin from tryptophan. 5-HTP is decarboxylated to serotonin (5-hydroxytryptamine or 5-HT) by the enzyme aromatic-L-amino-acid decarboxylase with the help of vitamin B6. This reaction occurs both in nervous tissue and in the liver. 5-HTP crosses the blood–brain barrier, while 5-HT does not."}, {"url": "http://women.emedtv.com/5-hydroxytryptophan/5-hydroxytryptophan.html", "passage_text": "Possible side effects may include gas, nausea, and diarrhea. Advertisement. 5-hydroxytryptophan (5-HTP) is a naturally occurring amino acid that is closely related to serotonin, an important chemical found in the brain and other parts of the body. As a naturally occurring amino acid, 5-hydroxytryptophan is similar to serotonin and has become a popular ingredient in herbal supplements."}, {"url": "http://www.webmd.com/vitamins-and-supplements/5-htp-hydroxytryptophan", "passage_text": "5-HTP (5-Hydroxytryptophan). 5-HTP is an amino acid. Amino acids are substances that build proteins in your body. 5-HTP is related to serotonin, a brain chemical that affects mood, sleep, and pain. It is available as a supplement and is generally considered safe, although some contaminated supplements have caused dangerous side effects."}, {"url": "http://umm.edu/health/medical/altmed/supplement/5hydroxytryptophan-5htp", "passage_text": "Overview. 5-hydroxytryptophan (5-HTP) is a chemical that the body makes from tryptophan (an essential amino acid that you get from food). After tryptophan is converted into 5-HTP, the chemical is changed into another chemical called serotonin (a neurotransmitter that relays signals between brain cells). Available Forms. 5-HTP is made from tryptophan in the body, or can be taken as a supplement. Supplements are made from extracts of the seeds of the African tree Griffonia simplicifolia. 5-HTP can also be found in many multivitamin and herbal preparations."}, {"url": "http://www.everydayhealth.com/drugs/5-htp-5-hydroxytryptophan", "passage_text": "A: 5-HTP or 5-hydroxytryptophan is sold as a dietary supplement for anxiety, depression, insomnia, headaches and other conditions.. Because dietary supplements (e.g., 5-HTP) have not been thoroughly studied in the clinical setting, possible side effects and interactions with other drugs are not well known. 5-HTP and Anxiety. Given the fact that 5-HTP is a building block or precursor to the mood-enhancing chemical serotonin, scientists have explored the potential benefit of 5-HTP in lowering anxiety."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-794-5-HTP.aspx?activeIngredientId=794&activeIngredientName=5-HTP", "passage_text": "5-HTP (5-Hydroxytryptophan) is a chemical by-product of the protein building block L-tryptophan. It is also produced commercially from the seeds of an African plant (Griffonia simplicifolia). 1 Evidence on the effects of 5-HTP for the prevention or treatment of migraines in adults is unclear. 2  Some studies show that taking 5-HTP daily does not reduce migraines, while other studies show that it might be as beneficial as prescription drugs. 3  5-HTP does not seem to reduce migraines in children. 4  Obesity."}, {"url": "http://umm.edu/health/medical/altmed/supplement/5hydroxytryptophan-5htp", "passage_text": "5-HTP dietary supplements help raise serotonin levels in the brain. Since serotonin helps regulate mood and behavior, 5-HTP may have a positive effect on sleep, mood, anxiety, appetite, and pain sensation. 5-HTP is not found in the foods we eat, although tryptophan is found in foods. Eating foods with tryptophan does not increase 5-HTP levels very much, however. As a supplement, 5-HTP is made from the seeds of an African plant called Griffonia simplicifolia. Available Forms. 5-HTP is made from tryptophan in the body, or can be taken as a supplement. Supplements are made from extracts of the seeds of the African tree Griffonia simplicifolia. 5-HTP can also be found in many multivitamin and herbal preparations."}, {"url": "http://www.progressivehealth.com/l-tryptophan-vs-5-htp-are-they-different.htm", "passage_text": "As a drug/supplement, L-tryptophan is used because it is a precursor of serotonin, an important neurotransmitter in the brain. L-tryptophan is first converted to 5-hydroxytryptophan or 5 HTP (another dietary supplement) which is then converted to serotonin or 5 HT in the brain. However, these biochemical reactions happen in the brain, therefore, tryptophan has to cross the blood-brain barrier."}, {"url": "https://en.wikipedia.org/wiki/5-Hydroxytryptophan", "passage_text": "Uses [edit]. 5-HTP is sold over the counter in the United States, Canada, and the United Kingdom as a dietary supplement for use as an antidepressant, appetite suppressant, and sleep aid. 5-HTP is decarboxylated to serotonin (5-hydroxytryptamine or 5-HT) by the enzyme aromatic-L-amino-acid decarboxylase with the help of vitamin B6. This reaction occurs both in nervous tissue and in the liver. 5-HTP crosses the blood–brain barrier, while 5-HT does not."}]