[{"url": "http://www.mayoclinic.org/diseases-conditions/bone-spurs/expert-answers/heel-spurs/FAQ-20057821", "passage_text": "In the past, doctors often performed surgery to remove heel spurs, believing them to be the cause of the pain associated with plantar fasciitis. In treating plantar fasciitis now, doctors rely more on ice, arch supports, physical therapy and pain medications, and surgery is rarely performed. With. "}, {"url": "http://www.webmd.boots.com/foot-care/heel-spurs", "passage_text": "Heel spurs are often caused by strains on foot muscles and ligaments, stretching of the plantar fascia and repeated tearing of the membrane that covers the heel bone. Heel spurs are especially common among athletes who do a lot of running and jumping. Risk factors for heel spurs include: 1  Walking gait abnormalities, which place excessive stress on the heel bone, ligaments and nerves near the heel. 2  Running or jogging, especially on hard surfaces. 3  Poorly fitted or badly worn shoes, especially those lacking appropriate arch support."}, {"url": "http://www.webmd.boots.com/foot-care/heel-spurs", "passage_text": "Heel spurs. A heel spur is an extra growth on the bone of the heel that can build up over a long period. Heel spurs are more common among people who experience heel pain, though the spur doesn’t actually cause any pain. A heel spur, also known as a calcaneal spur, may stick out by as much as 1.25cm (half an inch). Risk factors for heel spurs include: 1  Walking gait abnormalities, which place excessive stress on the heel bone, ligaments and nerves near the heel. 2  Running or jogging, especially on hard surfaces. 3  Poorly fitted or badly worn shoes, especially those lacking appropriate arch support."}, {"url": "http://www.emedicinehealth.com/heel_spurs/article_em.htm", "passage_text": "Heel Spur Causes. Heel spurs are most commonly caused by strain injury of the tendons and tissues that attach to the heel bone (calcaneus). This can occur after repetitive athletic stress or strain injury. A heel spur is a bony outgrowth of the calcaneus bone in the heel. Heel spurs are attributed to chronic local inflammation at the insertion of soft-tissue ligaments or fascia in the area. Heel spurs can be located at the back of the heel or under the heel, beneath the sole of the foot."}, {"url": "http://www.webmd.com/pain-management/heel-spurs-pain-causes-symptoms-treatments", "passage_text": "Symptoms of Heel Spurs. Heel spurs often cause no symptoms. But heel spurs can be associated with intermittent or chronic pain -- especially while walking, jogging, or running -- if inflammation develops at the point of the spur formation. Other risk factors associated with plantar fasciitis include: 1  Increasing age, which decreases plantar fascia flexibility and thins the heel's protective fat pad. 2  Diabetes. 3  Spending most of the day on one's feet. 4  Frequent short bursts of physical activity."}, {"url": "http://www.webmd.com/pain-management/heel-spurs-pain-causes-symptoms-treatments", "passage_text": "Heel spurs occur when calcium deposits build up on the underside of the heel bone, a process that usually occurs over a period of many months. Heel spurs are often caused by strains on foot muscles and ligaments, stretching of the plantar fascia, and repeated tearing of the membrane that covers the heel bone. Heel spurs are especially common among athletes whose activities include large amounts of running and jumping. Risk factors for heel spurs include: 1  Walking gait abnormalities,which place excessive stress on the heel bone, ligaments, and nerves near the heel. 2  Running or jogging, especially on hard surfaces. 3  Poorly fitted or badly worn shoes, especially those lacking appropriate arch support. 4  Excess weight and obesity. Other risk factors associated with plantar fasciitis include: 1  Increasing age, which decreases plantar fascia flexibility and thins the heel's protective fat pad. 2  Diabetes. 3  Spending most of the day on one's feet. 4  Frequent short bursts of physical activity."}, {"url": "http://www.medicinenet.com/heel_spurs/page2.htm", "passage_text": "Heel spurs and plantar fasciitis can occur alone or be related to underlying diseases that cause arthritis (inflammation of the joints), such as reactive arthritis (formerly called Reiter's disease), ankylosing spondylitis, and diffuse idiopathic skeletal hyperostosis. Heel spurs under the sole of the foot (plantar area) are associated with inflammation of the plantar fascia (fasciitis), the bowstring-like tissue stretching underneath the sole that attaches at the heel. Plantar heel spurs cause localized tenderness and pain made worse when stepping down on the heel"}, {"url": "http://www.webmd.com/pain-management/heel-spurs-pain-causes-symptoms-treatments?page=2", "passage_text": "Non-Surgical Treatments for Heel Spurs. The heel pain associated with heel spurs and plantar fasciitis may not respond well to rest. If you walk after a night's sleep, the pain may feel worse as the plantar fascia suddenly elongates, which stretches and pulls on the heel. The pain often decreases the more you walk. "}, {"url": "http://www.footsmart.com/health-resource-center/foot/heel-pain-heel-spurs", "passage_text": "What are the causes and symptoms. Plantar fascia —the band of connective tissue on the bottom of your foot that stretches from the heel to the ball of your foot—supports your foot’s arch. If this tissue becomes inflamed, you’ll generally feel the pain in your heel. Eventually, hook-shaped calcium deposits, also known as bone or heel spurs, may form on your heel bone and cause further pain. Structural issues with the arch of your foot can lead to this cycle of inflammation, spur growth, and pain."}]