[{"url": "http://www.babynamewizard.com/baby-name/boy/gregory", "passage_text": "Meanings and history of the name Gregory : | Edit. English form of Latin Gregorius, which was from the Late Greek name γρηγοριος (Gregorios), derived from γρηγορος (gregoros) meaning watchful, alert. Gregory means: watchful, alert. The name Gregory name was popular among early Christians, being borne by a number of important saints including Saint Gregory Thaumaturgus (3rd century), Saint Gregory of Nyssa (4th century), Saint Gregory of Nazianzus (4th century), and Saint Gregory of Tours (6th century)."}, {"url": "https://en.wikipedia.org/wiki/Gregory_(given_name)", "passage_text": "Look up Gregory in Wiktionary, the free dictionary. Gregory is a masculine first name. It is derived from the Latin name Gregorius, which was from the late Greek name γρηγόριος (Grēgorios) meaning watchful, alert (derived from Greek γρηγoρεῖν grēgorein meaning to watch). Through folk etymology, the name also became associated with Latin grex (stem greg–) meaning 'flock' or 'herd'. This association with a shepherd who diligently guides his flock contributed to the name's popularity among monks and popes."}, {"url": "http://www.behindthename.com/name/gregory", "passage_text": "English form of Latin Gregorius, which was from the Late Greek name γρηγοριος (Gregorios) , derived from γρηγορος (gregoros) meaning watchful, alert. Due to the renown of the saints by this name, Gregory (in various spellings) has remained common in the Christian world through the Middle Ages and to the present day. It was not used in England, however, until after the Norman conquest. A famous bearer from the modern era was American actor Gregory Peck (1916-2003)."}, {"url": "http://www.sheknows.com/baby-names/name/greg", "passage_text": "The name Greg is an English baby name. In English the meaning of the name Greg is: meaning 'on the watch'. Often used as an independent name. American Meaning: The name Greg is an American baby name. In American the meaning of the name Greg is: meaning 'on the watch'. Often used as an independent name. Greek Meaning: The name Greg is a Greek baby name. In Greek the meaning of the name Greg is: Watchful. Famous bearer: American actor Gregory Peck, and Pope Gregory I who was also known as St Gregory the Great. "}, {"url": "http://www.sheknows.com/baby-names/name/gregory", "passage_text": "The name Gregory is a Greek baby name. In Greek the meaning of the name Gregory is: Watchful. Famous bearer: American actor Gregory Peck, and Pope Gregory I who was also known as St Gregory the Great. English Meaning: The name Gregory is an English baby name. In English the meaning of the name Gregory is: On the watch. As the first of 16 Gregory popes Pope Gregory fostered the development of Gregorian chants. See also Greg. Gregorio: (ltalian/Spanish/Portuguese) 'On the watch"}, {"url": "http://www.thinkbabynames.com/meaning/1/Gregory", "passage_text": "Gregory. Gregory /gre-go-ry/ [3 sylls.] as a boys' name is pronounced GREG-er-ee. It is of Latin and Greek origin, and the meaning of Gregory is watchful, vigilant. From Latin Gregorius via Greek Greg rios, derived from greg rein to watch. The first of the 16 popes and 10 saints with the name was called Gregory the Great. "}, {"url": "http://www.babynamewizard.com/baby-name/boy/gregory", "passage_text": "Origin of the name Gregory: From the Late Latin Gregorius, a cognate of the Greek Grēgorios (vigilant, a watchman), which is derived from the verb egeirein (to awaken). From A World of Baby Names by Teresa Norman. Gregory means: watchful, alert. The name Gregory name was popular among early Christians, being borne by a number of important saints including Saint Gregory Thaumaturgus (3rd century), Saint Gregory of Nyssa (4th century), Saint Gregory of Nazianzus (4th century), and Saint Gregory of Tours (6th century)."}, {"url": "https://en.wikipedia.org/wiki/Greg", "passage_text": "People. 1  A shortened form of Gregory (given name). 2  Gregg (surname) , origin and list of people with the surnames Greg and Gregg. 3  Greg (comics) , the pseudonym of the Belgian comic book artist Michel Regnier. "}]