[{"url": "http://www.scholastic.com/teachers/article/inuit-culture-and-legends", "passage_text": "Inuit culture and Inuit ways do not have comparable words in English. The word illiquusiq means ways and habits and refers to all aspects of living — survival skills, games, clothing, arts, weather, land, sea. Culture in English frequently means music, theater, dance or anything involving entertainment."}, {"url": "http://www.windows2universe.org/earth/polar/inuit_culture.html", "passage_text": "Traditions. Although Inuit life has changed significantly over the past century, many traditions continue. Traditional storytelling, mythology, and dancing remain important parts of the culture. Family and community are very important."}, {"url": "http://ravenswood-inuits.weebly.com/belief-system--traditions.html", "passage_text": "Inuit beliefs & Traditions. The Inuit have a deep, spiritual and loving bond with animals; the killing of an animal was considered a ritual, killing to survive and worshipping the spirits of the animals. Not only did they have a respect for animals, but also the natural environment in general."}, {"url": "http://www.windows2universe.org/earth/polar/inuit_culture.html", "passage_text": "Although Inuit life has changed significantly over the past century, many traditions continue. Traditional storytelling, mythology, and dancing remain important parts of the culture."}, {"url": "http://nunavut.asperand.org/traditionsculture", "passage_text": "Culture/Traditions. People of Nunavut were refered to as Inuit the word Inuit means the people but an inut is an inuit person. The Inuit had many traditions; Chiefly was one of the languages spoken by the Inuit people, Inuktitut is another one of the languages spoken."}, {"url": "http://www.windows2universe.org/earth/polar/inuit_culture.html", "passage_text": "Traditional Inuit way of life was influenced by the harsh climate and stark landscapes of the Arctic tundra from beliefs inspired by stories of the aurora to practicalities like homes made of snow. Inuit invented tools, gear, and methods to help them survive in this environment."}, {"url": "http://arcticinuksuk.com/inuit-culture.html", "passage_text": "Many Inuit communities continue to practice traditional Inuit dance and song including the drum dance and throat singing. Oral history and storytelling are still very much alive in Inuit culture, with tales passed down through the centuries. These stories are often about powerful spirits that inhabit the land and sea."}, {"url": "http://ravenswood-inuits.weebly.com/belief-system--traditions.html", "passage_text": "Traditional Inuit beliefs are bound up in the spiritual web of humans interacting with animals interacting with the environment. Their belief system reflects a deep love and respect for their world and"}]