[{"url": "http://www.psych.purdue.edu/~willia55/120/11.MotivationMM.pdf", "passage_text": "2 7 Drive-Reduction Theory When the instinct theory of motivation failed to explain most human motivation, it was replaced by the drive-reduction theory. A physiological need creates an aroused tension state (a drive) that motivates an organism to satisfy the need (Hull, 1951)."}, {"url": "http://changingminds.org/explanations/theories/drive.htm", "passage_text": "Drive theory is consequently also known as Drive Reduction Theory. These drives are necessary, otherwise needs would not be satisfied. It is also important for the person to perceive the stimulus and response in order to learn. Primary drives are those related to basic survival and procreation."}, {"url": "http://study.com/academy/lesson/drive-reduction-theory-of-motivation-definition-examples-quiz.html", "passage_text": "Drive Reduction. Drive Reduction Theory was first established by Clark Hull. Hull was interested in applying mathematical formulas to psychology, and it is simple to see how this works with the Drive Reduction Theory. If you have achieved homeostasis, your motivation is zero, since you have no drives to reduce."}, {"url": "http://study.com/academy/lesson/drive-reduction-theory-of-motivation-definition-examples-quiz.html", "passage_text": "When your body tells you that you 'need something,' or that you need to 'change something,' this is your body giving you a drive. Drive reduction theory of motivation can be simply described as you don't want to be hungry, thirsty, in pain, or horny. If your body wants something, that want is the drive. You are motivated to reduce"}, {"url": "http://www.psychologynoteshq.com/drive-reduction-theory/", "passage_text": "The Drive-Reduction Theory talks about an organism’s reaction in an event where his physical needs are challenged and unstable. Because of the disturbance in the organism’s level of homeostasis, there is a development of a drive to fulfill that specific need to bring the individual out of its discomfort."}, {"url": "http://psychologydictionary.org/drive-reduction-theory/", "passage_text": "A theory of learning where the goal of motivated behaviour is to reduce the drive state. Compare drive induction theory. DRIVE-REDUCTION THEORY: In drive reduction theory the drive behaviour is reduced.. No related posts."}]