[{"url": "http://www.asianinfo.org/asianinfo/myanmar/pro-economy.htm", "passage_text": "Back to Burma. Myanmar's Economy. Almost three quarters of Myanmar's population either grows or processes crops, with roughly only ten percent of of population working in the industrial sector. Myanmar is considered an agricultural country and before World War II, it had been the world's top exporter of rice. The most successful economy in Myanmar is the black market, which has little government interference. Since the late 90's Myanmar's economy has worsened due to U.S. economic sanctions (due to a negative human rights record) and the widespread Asian economic problems."}, {"url": "http://www.infoplease.com/encyclopedia/world/myanmar-economy.html", "passage_text": "More on Myanmar Economy from Infoplease: 1  Myanmar: Economy-Economy Myanmar suffered extensive damage in World War II, and some sectors of its economy have not ... The country is rich in minerals. Petroleum is found east of the Ayeyarwady in the Dry Zone. Tin and tungsten are mined in E Myanmar; the Mawchi mines in Kayah State are also rich in tungsten."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_burma", "passage_text": "The Economy of Myanmar (also known as Burma) is an emerging economy with an estimated nominal GDP of $59.43 billion and a purchasing power adjusted GDP of $111.1 billion. Real growth rate is estimated at 5.5% for the 2011 fiscal year. 1 Myanma Oil and Gas Enterprise (MOGE) is a national oil and gas company of Burma. 2  The company is a sole operator of oil and gas exploration and production, as well as domestic gas transmission through a 1,900-kilometre (1,200 mi) onshore pipeline grid."}, {"url": "http://www.infoplease.com/encyclopedia/world/myanmar-economy.html", "passage_text": "1 Myanmar: Economy-Economy Myanmar suffered extensive damage in World War II, and some sectors of its economy have not ... The country is rich in minerals. Petroleum is found east of the Ayeyarwady in the Dry Zone. Tin and tungsten are mined in E Myanmar; the Mawchi mines in Kayah State are also rich in tungsten."}, {"url": "https://en.wikipedia.org/wiki/Burma", "passage_text": "[mjəma]), mjəmà officially The republic of The union Of myanmar and also known As (/burma/ ˈBɜRMə-bur), mə is a sovereign state In Southeast asia bordered By, Bangladesh, India, China laos And. thailand Burma continues to be used in English by the governments of many countries, such as Australia and Canada. Official United States policy retains Burma as the country's name, although the State Department 's website lists the country as Burma (Myanmar) and Barack Obama has referred to the country by both names."}, {"url": "https://en.wikipedia.org/wiki/Economy_of_burma", "passage_text": "The current state of the Burmese economy has also had a significant impact on the demographics of Burma, as economic hardship results in extreme delays of marriage and family building. 1 Myanma Oil and Gas Enterprise (MOGE) is a national oil and gas company of Burma. 2  The company is a sole operator of oil and gas exploration and production, as well as domestic gas transmission through a 1,900-kilometre (1,200 mi) onshore pipeline grid."}, {"url": "http://www.infoplease.com/encyclopedia/world/myanmar-economy.html", "passage_text": "1 Myanmar: Economy-Economy Myanmar suffered extensive damage in World War II, and some sectors of its economy have not 2  ... Calculator. 3  Spelling Checker. 4  Place Finder. The country is rich in minerals. Petroleum is found east of the Ayeyarwady in the Dry Zone. Tin and tungsten are mined in E Myanmar; the Mawchi mines in Kayah State are also rich in tungsten."}, {"url": "http://www.nationsonline.org/oneworld/myanmar.htm", "passage_text": "Destination Myanmar. Myanmar is a country in Southeast Asia, also known as Burma, its also called the Golden Land. With an area of 676,578 km² the country is almost twice the size of Germany or slightly smaller than the U.S. state of Texas. Myanmar is a country in Southeast Asia, also known as Burma, its also called the Golden Land"}, {"url": "http://www.infoplease.com/encyclopedia/world/myanmar-economy.html", "passage_text": "Economy. Myanmar suffered extensive damage in World War II, and some sectors of its economy have not yet fully recovered. About 70% of the population works in agriculture and forestry, and rice accounts for about half of the agricultural output. The country is rich in minerals. Petroleum is found east of the Ayeyarwady in the Dry Zone. Tin and tungsten are mined in E Myanmar; the Mawchi mines in Kayah State are also rich in tungsten."}]