[{"url": "http://www.nchpeg.org/nutrition/index.php?option=com_content&view=article&id=468&tmpl=component", "passage_text": "1. Cystic fibrosis is an autosomal recessive genetic disorder. Cystic fibrosis (CF) is an autosomal recessive disease that affects many body systems. It is caused by mutations to the cystic fibrosis transmembrane conductance regulator (CFTR) gene. Located on human chromosome 7, the CFTR gene is made up of 250,000 DNA nucleotides. "}, {"url": "http://emedicine.medscape.com/article/1001602-overview", "passage_text": "Etiology. Cystic fibrosis is an autosomal recessive disease caused by defects in the CFTR gene, which encodes for a protein that functions as a chloride channel, and also regulates the flow of other ions across the apical surface of epithelial cells."}, {"url": "http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/pulmonary/cystic-fibrosis/", "passage_text": "CF is an autosomal recessive trait caused by mutations at a single gene locus on the long arm of chromosome 7. The gene product cystic fibrosis transmembrane conductance regulator (CFTR) is a 1480-amino acid polypeptide. "}, {"url": "https://en.wikipedia.org/wiki/Cystic_fibrosis", "passage_text": "Different people may have different degrees of symptoms. CF is an autosomal recessive disorder. It is caused by the presence of mutations in both copies of the gene for the protein cystic fibrosis transmembrane conductance regulator (CFTR). Those with a single working copy are carriers and otherwise mostly normal. Cystic fibrosis is the most common life-limiting autosomal recessive disease among people of European heritage. In the United States, approximately 30,000 individuals have CF; most are diagnosed by six months of age."}, {"url": "http://emedicine.medscape.com/article/1001602-overview", "passage_text": "Cystic fibrosis (CF) is the most common lethal inherited disease in white persons. Cystic fibrosis is an autosomal recessive disorder, and most carriers of the gene are asymptomatic. Cystic fibrosis is an autosomal recessive disease caused by defects in the CFTR gene, which encodes for a protein that functions as a chloride channel, and also regulates the flow of other ions across the apical surface of epithelial cells."}, {"url": "http://ghr.nlm.nih.gov/condition/cystic-fibrosis", "passage_text": "Cystic fibrosis is an inherited disease characterized by the buildup of thick, sticky mucus that can damage many of the body's organs. The disorder's most common signs and symptoms include progressive damage to the respiratory system and chronic digestive system problems. Mucus is a slippery substance that lubricates and protects the linings of the airways, digestive system, reproductive system, and other organs and tissues. In people with cystic fibrosis, the body produces mucus that is abnormally thick and sticky."}, {"url": "http://www.chw.org/medical-care/genetics-and-genomics-program/medical-genetics/single-gene-defects/autosomal-recessive/", "passage_text": "Autosomal recessive inheritance means that the gene is located on one of the autosomes (chromosome pairs 1 through 22). This means that males and females are equally affected. Recessive means that two copies of the gene are necessary to have the trait, one inherited from the mother, and one from the father. Autosomal recessive: cystic fibrosis (CF), sickle cell anemia (SC), Tay Sachs disease. Genes are inherited from our biological parents in specific ways. One of the basic patterns of inheritance of our genes is called autosomal recessive inheritance"}, {"url": "http://embryo.asu.edu/pages/cystic-fibrosis", "passage_text": "Cystic fibrosis is an autosomal recessive disorder, meaning that is not inherited solely from the mother or father as in sex-linked disorders. Rather, cystic fibrosis is inherited when an individual receives a mutated copy of the gene associated with cystic fibrosis from both parents. by Kristina Winikates Keywords: Genetics, Diseases. Cystic fibrosis (CF) is a fatal, inherited disease found in humans and characterized by buildup of thick, sticky mucus, particularly in the respiratory and digestive tracts."}, {"url": "http://health.mo.gov/lab/cf.php", "passage_text": "Cystic Fibrosis is an autosomal recessive genetic disorder characterized by severe lung damage and nutritional deficiencies. Mutations in the cystic fibrosis transmembrane conductance regulator (CFTR) gene causes the body to produce thick, sticky secretions that obstruct passageways in the lungs and pancreas leading to: "}]