[{"url": "https://www.quora.com/What-is-the-nearest-planet-to-earth", "passage_text": "When Venus is in the middle of the Sun and Earth, it is at its closest point to Earth. During this period, Venus would be the closest planet to Earth. However, there are times when Mars is actually the closest planet. 5.7k Views. Asking which planet is the closest to Earth is actually something of a trick question – the closest planet to Earth can change depending on the day, month, or even year."}, {"url": "http://www.outerspaceuniverse.org/what-is-the-closest-planet-to-earth-mars-venus-or-mercury.html", "passage_text": "Since every planet has its own orbit around the Sun, and every orbit is a different length, all planets have different periods that would signify a year (or a complete orbit of the Sun). When Venus is in the middle of the Sun and Earth, it is at its closest point to Earth. During this period, Venus would be the closest planet to Earth. However, there are times when Mars is actually the closest planet. For example, during August 2003, Earth and Mars were at such a point in their orbits that Mars was at one of its closest distances to Earth. Asking which planet is the closest to Earth is actually something of a trick question – the closest planet to Earth can change depending on the day, month, or even year. Rather than stating a time frame to describe when a given planet will be closest."}, {"url": "http://www.universetoday.com/14447/what-is-the-closest-planet-to-earth/", "passage_text": "When Venus is closest to Earth it is only 38 million km away. When Venus and Earth are at their closest approach to each other, it is called opposition. Incredibly, the distance between the planets can vary at different oppositions. 38 million km is the closest opposition possible for the two planets. The distance between the planets can vary by as much as 223 million km during their orbits. Even though Venus is the closest planet to Earth, it is a very inhospitable world. The hottest temperature here on Earth was recorded in the Lut desert in 2005. That temperature was 70.7°C."}, {"url": "http://www.answers.com/Q/What_is_the_closest_planet_to_the_earth", "passage_text": "The planet that is closest to Earth depends on where the other planets are in relation to Earth. Venus can come the closest when it is on the same side of the Sun as the Earth … , but Mars can be closest when Venus is on the far side of the Sun and Mars is on the same side of the sun as Earth. So the distance between Earth and any other planet changes over a wide range, depending on whether we're both on the same side of the sun or on opposite sides. At any given time, the planet closest to Earth could be either Mercury, Venus, or Mars."}, {"url": "https://www.quora.com/What-is-the-nearest-planet-to-earth", "passage_text": "VENUS is the closest planet to Earth. However, its proximity to our planet depends on the orbits of both. The two planets travel in ellipses around the sun, and so the distance between them is constantly changing. At its farthest, Venus lies 261 million kilometers away. This is when the Sun is between Venus and Earth. 5.7k Views. Asking which planet is the closest to Earth is actually something of a trick question – the closest planet to Earth can change depending on the day, month, or even year."}, {"url": "http://www.universetoday.com/14447/what-is-the-closest-planet-to-earth/", "passage_text": "Venus is the answer to ”what is the closest planet to Earth”. It is similar in diameter, mass, and volume, but you can see how it is a scary world compared to ours. There are several missions headed to Venus. The distance between the planets can vary by as much as 223 million km during their orbits. Even though Venus is the closest planet to Earth, it is a very inhospitable world. The hottest temperature here on Earth was recorded in the Lut desert in 2005. That temperature was 70.7°C."}, {"url": "http://www.ehow.com/about_4570851_what-closest-planet-earth.html", "passage_text": "Save. Venus is the closest planet to Earth and second closest to the sun. It was named after the Roman goddess of love and is often referred to as Earth's sister planet because of their similar size and composition. The atmosphere of Venus is filled with clouds of carbon dioxide and the surface is a dry desert. "}, {"url": "http://www.answers.com/Q/What_is_the_closest_planet_to_the_earth", "passage_text": "The planet that can be closest to Earth when we're both in the same part of our orbits is Venus. The minimum distance between us and Venus is about 25.5 million miles, or about 28% of the distance from earth to the sun. ======================================. While we're on the subject, this is also a good time to mention Mars. After Venus, Mars is the next nearest planet to Earth. So the distance between Earth and any other planet changes over a wide range, depending on whether we're both on the same side of the sun or on opposite sides. At any given time, the planet closest to Earth could be either Mercury, Venus, or Mars."}]