[{"url": "http://www.totalcrb.co.uk/faq/", "passage_text": "Yes. If you have received the results of your DBS disclosure and there is an error on it or you wish to dispute any of the information revealed, please contact the DBS immediately on 0870 90 90 778. Disputes should be raised within 3 months of the date of issue of the Disclosure. Back to Top."}, {"url": "https://www.gov.uk/disclosure-barring-service-check/overview", "passage_text": "check. The employer gets an application form from DBS or an umbrella body (a registered body that gives access to. checks). The employer gives the applicant the form to fill in and return to them along with documents proving their identity. The employer sends the completed application form to. or their umbrella body."}, {"url": "http://dbsdirect.co.uk/faq.php", "passage_text": "There is no set or guaranteed time frame for an Enhanced DBS application to be processed. This is due to the individual nature and complexity of each check, and so DBS checks can take different amounts of time for each applicant. The AVERAGE time to complete online DBS/CRB Applications is 8 days."}, {"url": "https://ekhuft.employmentcheck.org.uk/faq.php", "passage_text": "There is an error on my Disclosure. If you have received the results of your DBS check and there is an error or you wish to challenge any of the information, you must contact the DBS directly. Disputes must be raised with the DBS within the first three months of the date of issue of the"}, {"url": "http://www.childprotectioncompany.com/CPC/dbs-checks-faq", "passage_text": "The current online average turnaround is under 6 days for an Enhanced DBS, without content and 1 day for a Standard DBS check. Disclosure Services commitment to clients is same day processing of all disclosure applications and disclosure results. You can track each stage of an application from your web account."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20131101035953AApsmTM", "passage_text": "My CRB/DBS was received on the 27th September and its currently been stuck with the police @ stage 4 for a little over 4 weeks. Does anyone know how long this stage is supposed to take?"}]