[{"url": "http://www.skinandveins.com/services-procedures/skin/photodynamic-therapy", "passage_text": "Photodynamic therapy is a leading non-surgical treatment for Acne, pre-cancerous skin lesions (actinic keratosis), early forms of non-melanoma skin cancer (basal cell carcinoma and squamous cell carcinoma), rosacea, and sun-damaged skin."}, {"url": "http://community.healthywomen.org/profiles/blogs/photodynamic-therapy-pdt-for-wrinkles-does-it-work", "passage_text": "Wrinkles happen to everyone as they age. Wrinkles can make a person who is young at heart feel like they are getting old. There are treatments to help a person look as young as they feel. Photodynamic Therapy Treatment (PDT) help reduce the appearance of wrinkles. Photodynamic therapy uses a drug for photosensitizing purposes. When this drug is exposed to light it increases the levels of oxygen that the cell receives."}, {"url": "http://www.medicinenet.com/photodynamic_therapy/index.htm", "passage_text": "Featured: Photodynamic Therapy Main Article. Photodynamic therapy (PDT) is a procedure that treats precancerous cells, in addition to other types of cancer cells. The medical treatment does this with the help of a photosensitizing drug and a light source that activates the applied drug, destroying"}, {"url": "http://www.skinmds.com/face/wrinkles-aging/photodynamic-therapy.htm", "passage_text": "About. Photodynamic Therapy (PDT) involves the use of photochemical reactions mediated through the interaction of photosensitizing agents, light, and oxygen for the treatment of sun-damaged skin, precancers, acne, malignancies and other skin diseases. Benefits."}, {"url": "http://cosmeticlasermd.com/laser-technology/photodynamic-therapy-levulan", "passage_text": "Photodynamic therapy is a very safe and effective treatment for moderate to severe acne, aging, and severe sun damage. Susan Stevens Tanne, M.D. offers Photodynamic therapy with Levulan® and LightWave LED Blue light or IPL to help reverse sun damage and treat acne."}]