[{"url": "https://legalvision.com.au/what-is-minority-shareholder-oppression/", "passage_text": "Oppressive Conduct. In general, minority oppression refers to conduct which falls within Section 232 of the Corporations Act and includes conduct which is contrary to the interests of the shareholders as a whole or oppressive to, unfairly prejudicial to, or unfairly discriminatory against a shareholder or shareholders. Not only is such conduct illegal, but also it can have the effect of diminishing a shareholdings value, or damage the company generally. Not a particularly welcome scenario for a minority shareholder."}, {"url": "https://en.wikipedia.org/wiki/Shareholder_oppression", "passage_text": "The potential for shareholder oppression arguably increased when corporate law was changed to eliminate the common law right of minority shareholders to veto fundamental corporate changes such as mergers. In the United Kingdom, the Companies Act 2006 governs remedies for minority shareholder oppression. Contractual protections, such as buyout provisions in a shareholder agreement, have been cited as a potential alternative to statutory protections of minority shareholders."}, {"url": "http://www.srr.com/article/shareholder-oppression-fiduciary-duty-and-partnership-litigation-closely-held-companies", "passage_text": "Termination of Shareholder Employment as an Act of Oppression. Shareholder employment is another issue that frequently arises in the context of shareholder oppression litigation. A classic method of freezing out minority shareholders is to remove them from their positions within the company. Instead, each oppressive act is often part of a series of actions perpetrated by the majority against the minority. 21. Shareholder Agreements are Particularly Relevant to Oppression Claims. Often, shareholder oppression claims involve the failure of the majority to abide by the parties’ agreements. This is because the parties’ governing agreements are highly relevant to the shareholders’ interests and expectations. In Madugula v. Taub, 2012 WL 5290285 (Mich"}, {"url": "http://www.shareholderoppression.com/texas-proving-conduct.html", "passage_text": "D. Given that the doctrine of shareholder oppression is based on the majority s legal right to control the management of the corporation, it is somewhat paradoxical that many cases suggest that excluding a minority shareholder from participation in the management of the corporation can be oppressive conduct. "}, {"url": "http://www.mondaq.com/unitedstates/x/256246/Shareholders/Shareholder+Oppression+What+Is+It+And+Why+Care", "passage_text": "Frequently, all of the theories get discussed under the general term shareholder oppression.. For purposes of this discussion, the term will refer to the specific provision in the model business corporation acts and the business corporation and LLC acts of a number of jurisdictions. Any dispute among shareholders or members that involves acts of oppression can result in an expensive and time-consuming process of litigation or dispute resolution."}, {"url": "http://www.sgalaw.com/news-and-views/2010/3/23/what-is-shareholder-oppression.html", "passage_text": "The “shareholder oppression” doctrine is a set of legal principles that protect minority shareholders from abuse by the majority. As such, these principles stand in direct contradiction to the central rule of corporate decision making that the will of the majority governs. "}, {"url": "http://www.macdonaldillig.com/recognizing-minority-shareholder-oppression.html", "passage_text": "Recognizing minority shareholder oppression is one thing. Preventing or remedying oppression is another. Prevention is limited due to the inherent qualities of minority shareholder status - - lack of controlling interest and illiquidity of minority shares. A freeze-out or squeeze-out occurs in a closely held corporation when a minority shareholder is removed from office or his power or compensation is substantially diminished, in an attempt to exclude the shareholder from any meaningful role in the corporation or deny him benefits from the corporation."}, {"url": "https://en.wikipedia.org/wiki/Shareholder_oppression", "passage_text": "Shareholder oppression occurs when the majority shareholders in a corporation take action that unfairly prejudices the minority. In the United Kingdom, the Companies Act 2006 governs remedies for minority shareholder oppression. Contractual protections, such as buyout provisions in a shareholder agreement, have been cited as a potential alternative to statutory protections of minority shareholders."}]