[{"url": "http://www.ilpi.com/msds/ref/aliphatic.html", "passage_text": "Definition. 1  An aliphatic compound is one that is not aromatic; i.e. it lacks a particular arrangement of atoms in its molecular structure. 1 An aliphatic compound is one that is not aromatic; i.e. it lacks a particular arrangement of atoms in its molecular structure."}, {"url": "http://medical-dictionary.thefreedictionary.com/aliphatic", "passage_text": "aliphatic. 1. fatty or oily. 2. pertaining to a hydrocarbon that does not contain an aromatic ring. aliphatic organic arsenicals. include the pharmaceuticals—cacodylic, phenarsonic acids and the herbicides—monosodium and disodium methanearsontes. See also organic arsenical."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Aliphatic-Hydrocarbon-Definition.htm", "passage_text": "By Anne Marie Helmenstine, Ph.D. Aliphatic Hydrocarbon Definition: An aliphatic compound is a hydrocarbon compound containing carbon and hydrogen joined together in straight chains, branched trains or non-aromatic rings. Also Known As: aliphatic compound. Examples: ethylene, isooctane, acetylene."}, {"url": "http://www.merriam-webster.com/dictionary/aliphatic", "passage_text": "Definition of ALIPHATIC. : of, relating to, or being an organic compound (as an alkane) having an open-chain structure — compare alicyclic, aromatic 2. ADVERTISEMENT"}, {"url": "http://medical-dictionary.thefreedictionary.com/aliphatic", "passage_text": "pertaining to fat or oil, specifically hydrocarbon compounds that are open chains of carbon atoms, such as the fatty acids, rather than aromatic ring structures. Aliphatic compounds do not have conjugated unsaturated cyclic structures as are found in aromatic compounds such as benzene and naphthalene. 2. pertaining to a hydrocarbon that does not contain an aromatic ring. aliphatic organic arsenicals. include the pharmaceuticals—cacodylic, phenarsonic acids and the herbicides—monosodium and disodium methanearsontes. See also organic arsenical."}, {"url": "http://www.merriam-webster.com/dictionary/aliphatic", "passage_text": "aliphatic. adjective al·i·phat·ic \\ˌal-ə-ˈfat-ik\\. : of, relating to, or being an organic compound (as an alkane or alkene) having an open-chain structure—compare alicyclic, aromatic 2. : of, relating to, or being an organic compound (as an alkane) having an open-chain structure — "}, {"url": "http://www.thefreedictionary.com/aliphatic+compound", "passage_text": "Noun. 1. aliphatic compound-organic compound that is an alkane or alkene or alkyne or their derivative. acetylene, alkyne, ethyne-a colorless flammable gas used chiefly in welding and in organic synthesis. alicyclic compound-an aliphatic compound that contains a ring of atoms"}, {"url": "http://www.biology-online.org/dictionary/Aliphatic", "passage_text": "Aliphatic. Definition. noun, plural: aliphatics. A compound composed of carbon and hydrogen arranged in straight or branched chains, and not containing aromatic rings. adjective. Of or relating to such compound. Supplement. 'Word origin: From Greek aleiphar, aleiphat-, oil, from aleiphein, to anoint with oil. Related terms: 1  Aliphatic compound."}, {"url": "http://www.merriam-webster.com/dictionary/aliphatic", "passage_text": "Medical Definition of ALIPHATIC. : of, relating to, or being an organic compound (as an alkane or alkene) having an open-chain structure—compare alicyclic, aromatic 2. : of, relating to, or being an organic compound (as an alkane) having an open-chain structure — "}]