[{"url": "http://www.ourbabynamer.com/meaning-of-Midge.html", "passage_text": "It consists of 5 letters and 1 syllable and is pronounced Midge. In the U.S. in 2014 less than 5 girls were given the name. Less than 5 boys were given the name. View the Midge Name Popularity Page to see how the popularity trend for Midge has changed since 1880, or to compare the popularity of Midge to other names. Midge is a variant spelling of Madge. Midge falls into the gem or mineral name category. Then just follow the diagram below. Just for fun, see the name Midge in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Midge in Nautical Flags page."}, {"url": "http://www.behindthename.com/name/midge/comments", "passage_text": "Midge Steering, the dimwitted wife of Fat Stew in The World According to Garp by John Irving. -- lucyskydiamonds 2/22/2010. Midge Klump is a character in the Archie Comic universe. Her defining characteristics are her short black hair and position as the girlfriend of Moose Mason. -- JoReia 8/31/2012."}, {"url": "http://extension.entm.purdue.edu/publichealth/insects/bitingmidge.html", "passage_text": "When numerous, biting midges have a real impact on residents and visitors of the Atlantic Coast, Gulf Coast, San Francisco Bay region, and southwestern deserts, primarily by limiting outdoor activities. Biting midge is a common name for pest species, but it is not the only one. For example, “no-see-ums” is used widely in the North America, “punkies” in the Northeast, “five-O’s (related to biting around 5 PM) in Florida and Alabama, “pinyon gnats” in the Southwest, and “moose flies” in Canada. "}, {"url": "http://www.babynamewizard.com/baby-name/girl/midge", "passage_text": "Personal experiences with the name Midge: | Edit. Share what you know! Nicknames for Midge: | Edit. Share what you know! Meanings and history of the name Midge : | Edit. Share what you know! Famous real-life people named Midge: | Edit. Midge Potts, political activist. "}, {"url": "https://en.wikipedia.org/wiki/Midge_%28Barbie%29", "passage_text": "Midge Hadley is a fictional doll character in the Barbie line of toys by Mattel that was first released in 1963. Midge was created, along with Skipper, to counteract criticism that claimed Barbie was a sex symbol. She was marketed as Barbie's best friend. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Midge", "passage_text": "Midge is an uncommonly occurring given name for females. Midge is an equivalently unusual last name too for all people. (2000 U.S. Census). Machelle, Mechelle, Mia (#6 last year) , Micaela, Michaela (#478) , Michele, Michelina, Michell, Michelle (#187) , Mickie and Mikaela (#573) are the popular variation forms of Midge (not ranked) . These girl names were at the peak of their popularity in 1996 (usage of 0.3965%) and have become much less widespread since (usage 0.2505%, down 36.8%), with the forms Mechelle, Micaela, Michele and Michell becoming less fashionable."}, {"url": "http://www.thinkbabynames.com/meaning/0/Madge", "passage_text": "Madge is a very popular first name for women (#855 out of 4276, Top 20%) and also a very popular surname for all people (#69636 out of 150436, Top 46%). (2000 U.S. Census). Shown below is the birth name popularity of Madge for girls. Madge reached its highest rank of #252 in the U.S. during 1890-1899, but is not in the Top 1000 currently. (2014 Birth Statistics). Shown below is a comparison of the popularity of the girl name Madge and related names."}, {"url": "http://www.babynamespedia.com/meaning/Midge/m", "passage_text": "mid-ge, mi-dge ] The baby boy name Midge is also used as a girl name. Its pronunciation is M IH-JH- †. Midge is used chiefly in the English language and its origin is Hebrew. Midge is a short form of the name Michael (Czech, English, French, German, and Yiddish). Midge is infrequently used as a baby name for boys. It is not listed in the top 1000 names."}, {"url": "http://www.meaning-of-name.info/nicknames.php?name=Midge", "passage_text": "Other names to choose. Midge Back to the name Midge to get all data. Names with the letter M You can see all names beginning with the letter M. All girl names You can see all the names of girl. "}]