[{"url": "https://en.wikipedia.org/wiki/Sebaceous_cyst", "passage_text": "The scalp, ears, back, face, and upper arm, are common sites for sebaceous cysts, though they may occur anywhere on the body except the palms of the hands and soles of the feet. In males a common place for them to develop is the scrotum and chest."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/epidermoid-sebaceous-cysts", "passage_text": "A. Many people often call any small, painless lump under the skin  sebaceous cysts .. But those are most often epidermoid cysts.. Sebaceous cysts are much less common and affect the sebaceous glands, the oil glands in the skin. Epidermoid cysts can be made up of a protein called keratin and fat. They usually appear on the face, neck, or upper body, especially the chest and shoulders."}, {"url": "http://www.patienteducationcenter.org/articles/sebaceous-cysts/", "passage_text": "The oily substance called sebum continues to be produced but cannot escape to the outer skin surface. The cyst may remain small for years, or it may continue to get larger. These cysts are rare in children but common in adults. Sebaceous cysts are not cancerous."}, {"url": "http://www.drugs.com/health-guide/sebaceous-cysts.html", "passage_text": "Sebaceous cysts are small lumps that arise within the skin on the face, upper back and upper chest. A sebaceous cyst can form when the opening to a sebaceous gland becomes blocked. The oily substance called sebum continues to be produced but cannot escape to the outer skin surface. The cyst may remain small for years, or it may continue to get larger. These cysts are rare in children but common in adults."}, {"url": "http://www.healthgrades.com/conditions/sebaceous-cyst", "passage_text": "A sebaceous cyst is a type of cyst that forms in the epidermis, the outermost layer of the skin. A sebaceous cyst is also sometimes called an epidermal cyst. It forms when a sebaceous gland, an oil-producing gland in the skin, becomes blocked. This creates a sac that fills with a fatty yellow substance that can resemble cottage cheese."}, {"url": "http://www.patienteducationcenter.org/articles/sebaceous-cysts/", "passage_text": "Sebaceous cysts are small lumps that arise within the skin on the face, upper back and upper chest. A sebaceous cyst can form when the opening to a sebaceous gland becomes blocked."}]