[{"url": "http://www.anatomybox.com/spleen-angiogram/", "passage_text": "The splenic artery supplies the spleen and substantial portions of the stomach and pancreas. The splenic artery courses superior and anterior to the splenic vein, along the superior edge of the pancreas. The splenic artery has many branches that supply the pancreatic body and tail. The first large branch is the dorsal pancreatic artery, and the second large branch is the greater pancreatic artery (or arteria pancreatica magna), which arises from the middle segment of the splenic artery."}, {"url": "http://emedicine.medscape.com/article/1948863-overview", "passage_text": "Vascular supply. The splenic artery supplies blood to the spleen. This artery is the largest branch of the celiac trunk and reaches the spleen's hilum by passing through the splenorenal ligament. It divides into multiple branches at the hilum. Hilum of the spleen along with anatomy of the splenic artery (a) and the splenic vein (v). Spleen anatomy. This section shows the spleen's red pulp and the white pulp and its relation to the liver and diaphragm."}, {"url": "http://www.anatomyatlases.org/AnatomicVariants/Cardiovascular/Text/Arteries/Hepatic.shtml", "passage_text": "Although the cystic normally arises from the hepatic arterial system, it may also arise from the gastroduodenal artery. The left hepatic artery arises from the common hepatic in 89% of cases; in 11% of cases the vessel is unusual and may arise from the left gastric. Supernumerary or accessory vessels to the left lobe of the liver occur in 23% of cases. "}, {"url": "http://www.anatomyatlases.org/AnatomicVariants/Cardiovascular/Text/Arteries/Splenic.shtml", "passage_text": "The dorsal pancreatic artery arises from the splenic in 37% of cases, the celiac in 33%, the superior mesenteric in 21%, and the common hepatic artery in 8%, typically close to the aortic source. As indicated in a previous section (celiac trunk), the celiac trunk may lack one or more of its main branches. It may divide into two branches that reunite, the splenic vein passing through the loop thus formed. It may give rise to branches normally derived from other vessels, such as the left gastric, middle colic, and left hepatic. The splenic artery supplies four to six (more or less) gastric vasa brevia arteries. These are terminal or end arteries. It can arise from the gastroepiploic artery, the splenic artery proper, the splenic branches of the splenic artery, or any combination thereof. The left gastroepiploic artery may originate from one of the splenic branches, rather than from the splenic artery proper"}, {"url": "http://www.anatomybox.com/spleen-angiogram/", "passage_text": "The inferior polar artery usually gives rise to the left gastroepiploic artery, but the latter may also arise from the distal splenic or inferior terminal artery. The left gastroepiploic artery then runs along the greater curvature of the stomach. Numerous short gastric branches arise from the terminal splenic or left gastroepiploic artery to supply the gastric cardia and fundus. The splenic artery has many branches that supply the pancreatic body and tail. The first large branch is the dorsal pancreatic artery, and the second large branch is the greater pancreatic artery (or arteria pancreatica magna), which arises from the middle segment of the splenic artery."}, {"url": "https://en.wikipedia.org/wiki/Splenic_artery", "passage_text": "Note that the branches of the splenic artery do not reach all the way to the lower part of the greater curvature of the stomach. Instead, that region is supplied by the right gastroepiploic artery, a branch of the gastroduodenal artery. The two gastroepiploic arteries anastomose with each other at that point. Splenic artery aneurysms are rare, but still the third most common abdominal aneurysm, after aneurysms of the abdominal aorta and iliac arteries. They may occur in pregnant women in the third trimester and rupture carries a maternal mortality of greater than 50% and a fetal mortality of 70% - 90%."}, {"url": "http://www.anatomyatlases.org/AnatomicVariants/Cardiovascular/Text/Arteries/Splenic.shtml", "passage_text": "In congenital absence of the spleen (very rare), the splenic artery terminates in the pancreas. Variant branches of the splenic artery: The posterior gastric artery is a branch of the splenic and it is present 48 to 67.8% of individuals; DiDio et al. found it in 46% of their subjects. It may divide into two branches that reunite, the splenic vein passing through the loop thus formed. It may give rise to branches normally derived from other vessels, such as the left gastric, middle colic, and left hepatic. The splenic artery supplies four to six (more or less) gastric vasa brevia arteries. These are terminal or end arteries. It can arise from the gastroepiploic artery, the splenic artery proper, the splenic branches of the splenic artery, or any combination thereof. The left gastroepiploic artery may originate from one of the splenic branches, rather than from the splenic artery proper"}, {"url": "https://en.wikipedia.org/wiki/Splenic_artery", "passage_text": "In anatomy, the splenic artery (in the past called the lienal artery) is the blood vessel that supplies oxygenated blood to the spleen. Splenic artery aneurysms are rare, but still the third most common abdominal aneurysm, after aneurysms of the abdominal aorta and iliac arteries. They may occur in pregnant women in the third trimester and rupture carries a maternal mortality of greater than 50% and a fetal mortality of 70% - 90%."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9357", "passage_text": "Splenic artery: A large artery within the abdomen that arises from an arterial vessel called the celiac trunk, which emerges from the aorta. The splenic artery supplies blood not only to the spleen, but also to the esophagus, stomach, duodenum, liver, and pancreas. "}]