[{"url": "http://www.aviva.co.uk/health-insurance/home-of-health/medical-centre/medical-encyclopedia/entry/structure-and-function-nerve-cells/", "passage_text": "Neurons. In addition to features common to all cells, such as a nucleus, neurons have specialized projections, known as nerve fibres (axons), that carry nerve signals. Neurons in the brain form densely packed clusters. Neurons in the spinal cord and around the body form long communication tract"}, {"url": "http://www.tutorvista.com/science/nerve-cell-structure-and-function", "passage_text": "Introduction to nerve cell structure and function : A Nerve cell with all its processes is called a neurone.It is the structural and functional unit of the nervous system.A neurone has cell body called soma and two types of processes called axons and dendrites. Function: Dendrites receives impulses from axon of another neurone through synapse and conducts the impulse towards the cell body ,therefore it is called the receptive organ."}, {"url": "http://www.ehow.com/facts_5804702_structure-function-nerve-cell.html", "passage_text": "A nerve cell, or neuron, is the basic unit of the nervous system. It transmits information to and from the brain. The structure of a neuron allows the transmission to be quick. 1  The Structure & Function of Muscle Cells. 2  What Is the Function of Blood Cells? Structure. Nerve cells consist of a cell body, axon and dendrites. The cell body contains the nucleus and other cellular compartments. The axon is long and surrounded by a layer of fat."}, {"url": "http://study.com/academy/lesson/what-are-nerve-cells-function-types-structure.html", "passage_text": "Instructor: John Williams. Nerve cells are the primary cells in the nervous system. They are responsible for relaying electrical messages to cells and tissues in other organ systems. This article discusses the functions and structures of nerve cells in the human body. Neurons are nerve cells, or cells found in the nervous system. These are specialized cells designed to stimulate other cells in the body in order to communicate. Neurons are excitable, which means they function by using electrical stimulation"}, {"url": "http://www.answers.com/Q/How_does_the_structure_of_a_nerve_cell_relate_to_its_function", "passage_text": "Nerve cells have several adaptations to their function. The basic function of the cell is do deliver a message to the next nerve cell in order to send information across the body. The ways in which it is adapted to do this are as follows: - long axon so can deliver an action potential a long way. The characteristic of a nerve cell that relates directly to its  function in receiving and transmitting nerve impulses is its king  extensions. Cells are limited in size by … the rate at which  substances needed by the cell can enter the cell through the  surface."}, {"url": "http://www.answers.com/Q/How_does_the_structure_of_a_nerve_cell_relate_to_its_function", "passage_text": "The function of the nerve cell is to transmit messages to other  parts of the body such as the brain. Neurons then transmit these  messages throughout the brain. Edit. Share to: Answered. The characteristic of a nerve cell that relates directly to its  function in receiving and transmitting nerve impulses is its king  extensions. Cells are limited in size by … the rate at which  substances needed by the cell can enter the cell through the  surface."}, {"url": "http://www.aviva.co.uk/health-insurance/home-of-health/medical-centre/medical-encyclopedia/entry/structure-and-function-nerve-cells/", "passage_text": "Structure and Function: Nerve Cells. Neurons are nerve cells that originate, process, transmit, and receive nerve impulses. They are connected to other neurons or to cells in muscles, organs, or glands. In addition to features common to all cells, such as a nucleus, neurons have specialized projections, known as nerve fibres (axons), that carry nerve signals. Neurons in the brain form densely packed clusters."}]