[{"url": "https://en.wikipedia.org/wiki/Railfan", "passage_text": "Some enthusiasts combine their interest in trains with the hobby of monitoring radio communications, specializing in listening to radio communications of railroad operations using a scanner. Various magazines, clubs and museums are designed mainly for railfans, concentrating on the history of trains and railroads."}, {"url": "https://en.wikipedia.org/wiki/Railfan", "passage_text": "Railfan photographing a Caltrain service in the United States. A railfan, rail buff or train buff (American English), railway enthusiast or railway buff (Australian / British English), or trainspotter or anorak (British English), is a person interested in a recreational capacity in rail transport. Railfans of many ages can be found worldwide."}, {"url": "http://tvtropes.org/pmwiki/pmwiki.php/Main/RailEnthusiast", "passage_text": "Someone obsessed with trains and railways, sometimes to an unhealthy degree, otaku-like. This is a type especially common in British and Japanese fictional works, which makes sense since both nations in real life have a high population of such enthusiasts."}, {"url": "http://www.modeltrainenthusiast.com/", "passage_text": "Browse the links on this site for more information about model trains, or sign up for my 11-part model train email course below, where you'll receive one lesson per day in your email box."}, {"url": "http://www.modeltrainenthusiast.com/", "passage_text": "Welcome to Model Train Enthusiast. My name is Henry Michael and I have gathered the most comprehensive material available in the world on model railroading."}, {"url": "http://www.modeltrainenthusiast.com/", "passage_text": "Dear Friend: Welcome to Model Train Enthusiast My name is Henry Michael and I have gathered the most comprehensive material available in the world on model railroading."}, {"url": "https://en.wiktionary.org/wiki/ferroequinologist", "passage_text": "And because you care, you’ve automatically classified yourself as a railfan (alias railroad enthusiast, train-watcher, ferroequinologist). 1990 October 19, Bruce Tiffany, “Re: 'America, a Godless State' and 'Barbaric Theists' merged.”, alt.atheism, Usenet:"}]