[{"url": "https://en.wikipedia.org/wiki/Stimulus_%28physiology%29", "passage_text": "In physiology, a stimulus (plural stimuli) is a detectable change in the internal or external environment. The ability of an organism or organ to respond to external stimuli is called sensitivity. When a stimulus is applied to a sensory receptor, it normally elicits or influences a reflex via stimulus transduction. The endocrine system is affected largely by many internal and external stimuli. One internal stimulus that causes hormone release is blood pressure. Hypotension, or low blood pressure, is a large driving force for the release of vasopressin, a hormone which causes the retention of water in the kidneys."}, {"url": "http://www.bioexpedition.com/tree-kangaroo/", "passage_text": "That is how they often get from one tree to the next. They can also jump from the trees to the ground up to about 59 feet without any type of injury. The Tree Kangaroo tends to be a solitary creature. The exceptions are when it is mating or when a female has a young one to care for. They can vary significantly in size based on location, food sources, and their subspecies. The average size can be from 16 to 30 inches long for the Tree Kangaroo. The tail can be another 15 to 34 inches. They often weigh around 30 pounds with the females being less than the males."}, {"url": "http://eol.org/pages/122672/details", "passage_text": "The red kangaroo (Macropus rufus) is the largest of all kangaroos, the largest terrestrial mammal native to Australia, and the largest extant marsupial. It is found across mainland Australia, avoiding only the more fertile areas in the south, the east coast, and the northern rainforests. Learn more about this article. The red kangaroo (Macropus rufus) is the largest of all kangaroos, the largest mammal native to Australia, and the largest extant marsupial. It is found across mainland Australia, avoiding only the more fertile areas in the south, the east coast, and the northern rainforests."}, {"url": "http://www.bioexpedition.com/tree-kangaroo/", "passage_text": "As the name inclines, they are small enough to live in trees. There are 14 subspecies of the Tree Kangaroo that have been identified. They can vary significantly in size based on location, food sources, and their subspecies. The average size can be from 16 to 30 inches long for the Tree Kangaroo. The tail can be another 15 to 34 inches. They often weigh around 30 pounds with the females being less than the males."}, {"url": "http://www.defenders.org/kangaroo/basic-facts", "passage_text": "Behavior. Kangaroos live and travel in organized groups or mobs, dominated by the largest male. Male kangaroos are called boomers, bucks or jacks; females are does, flyers, or jills, and the young ones are joeys. The collective noun for kangaroos is a mob, troop or court. "}, {"url": "http://bioweb.uwlax.edu/bio203/s2007/michaels_kell/classification_information.htm", "passage_text": "It is in the Genus Macropus because this genus includes both kangaroos and wallabies. It has the species name Macropus rufus because of it's distinctive has reddish-brown fur and facial features. (I constructed this phylogenetic tree using information from a variety of sources. The Red Kangaroo has been classified at each taxonomic level for specific reasons. This species is Eukaryotic because its cells contain a membrane bound nucleus. It is in the Kingdom Animalia because it is reactive to environmental stimuli, eats other organisms for energy, and is multicellular."}, {"url": "http://www.nbcnews.com/id/29494856/ns/world_news-world_environment/t/tree-kangaroos-get-refuge-pacific-island/", "passage_text": "BANGKOK, Thailand — Papua New Guinea has created a nearly 190,000-acre preserve to protect tree kangaroos and other endangered species, after years of criticism for turning a blind eye to environmental issues, a conservation group said Tuesday. By creating the country's first national conservation area, the PNG government and people have established a much-needed safe zone for the irreplaceable biodiversity it contains, said Lisa Dabek, the field conservation director at the Woodland Park Zoo and one of the world's top experts on the tree kangaroo."}, {"url": "http://www.worldwildlife.org/species/tree-kangaroo", "passage_text": "Overview. In 1990, a new species of tree kangaroo, the golden-mantled tree kangaroo, was discovered in the Torricelli Mountains of Papua New Guinea. It had a chestnut-brown coat, pale belly and a double stripe of gold down its back. The ancestors of tree kangaroos eventually headed back up into the foliage and they are now the largest tree-dwelling mammals in Australia. Tree kangaroos live in lowland and mountainous rainforests in Papua New Guinea, Indonesia and the far north of Queensland, Australia. They have adapted to life in the trees, with shorter legs and stronger forelimbs for climbing, giving them somewhat of the appearance of a cross between a kangaroo and a lemur"}]