[{"url": "http://dogtime.com/dog-breeds/cocker-spaniel", "passage_text": "The Cocker Spaniel is primarily a beloved companion dog breed, though he remains a capable bird dog at heart. Beautiful to look at (and labor-intensive to groom), the Cocker's amenable, cheerful disposition also makes him a treat to have in the family. In 1936, a group of English Cocker breeders formed a specialty club known as the English Cocker Spaniel Club of America, and they gained recognition from the AKC for an English type of the Cocker Spaniel."}, {"url": "https://en.wikipedia.org/wiki/American_Cocker_Spaniel", "passage_text": "The American Cocker Spaniel is a breed of sporting dog. It is a spaniel type dog that is closely related to the English Cocker Spaniel; the two breeds diverged during the 20th century due to differing breed standards in America and the UK. American Cocker Spaniels have won best in show at the Westminster Dog Show on four occasions, with the first win in 1921 by Ch. Midkiff Seductive. Ch. My Own Brucie won the title twice in 1940 and 1941, and became known as the most photographed dog in the world."}, {"url": "https://en.wikipedia.org/wiki/English_Cocker_Spaniel", "passage_text": "The English Cocker Spaniel is a breed of gun dog. The English Cocker Spaniel is an active, good-natured, sporting dog standing well up at the withers and compactly built. There are field or working cockers and show cockers. The American Cocker Spaniel was developed from the English Cocker Spaniel in the 19th century to retrieve quail and woodcock. They were originally divided from the English Cocker solely on a size basis, but were bred over the years for different specific traits."}, {"url": "https://en.wikipedia.org/wiki/Cocker_Spaniel", "passage_text": "Cocker Spaniel. Cocker Spaniels are dogs belonging to two breeds of the spaniel dog type: the American Cocker Spaniel and the English Cocker Spaniel, both of which are commonly called simply Cocker Spaniel in their countries of origin. In the early 20th century, Cocker Spaniels also included small hunting Spaniels. Cocker Spaniels were originally bred as hunting dogs in the United Kingdom, with the term cocker deriving from their use to hunt the Eurasian woodcock. When the breed was brought to the United States, it was bred to a different standard, which enabled it to specialize in hunting the Americ"}, {"url": "https://en.wikipedia.org/wiki/English_Cocker_Spaniel", "passage_text": "Outside the US, the breed is usually known simply as the Cocker Spaniel, as is the American Cocker Spaniel within the US. The word cocker is commonly held to stem from their use to hunt woodcock. The American Cocker Spaniel was developed from the English Cocker Spaniel in the 19th century to retrieve quail and woodcock. They were originally divided from the English Cocker solely on a size basis, but were bred over the years for different specific traits."}, {"url": "http://www.animaroo.com/dog-breeds/cocker-spaniels.html", "passage_text": "Cocker (the original Cockers are called English Cocker Spaniels). The American Cocker was recognized as a purebred by the AKC in 1946. Cockers have excellent retrieving, hunting and watch dogging abilities. They are beautiful dogs are commonly seen in the dog shows circuit. Best known for their long hanging ears, Cocker Spaniels make wonderful house pets Obedient and playful, Cocker Spaniels are friendly pets, but can be shy around strangers."}, {"url": "http://pets.thenest.com/dog-aggression-biting-cocker-spaniel-5078.html", "passage_text": "Cocker spaniels may be genetically more prone to aggression, but much of a dog's temperament is determined by environment. Because they are small dogs, owners are less likely to notice the early signs of aggression in cocker spaniels, and may even reward it by comforting or petting a dog who is behaving badly. "}, {"url": "http://www.animaroo.com/dog-breeds/cocker-spaniels.html", "passage_text": "Cocker Spaniel Dog Breed. Best known for their long hanging ears, Cocker Spaniels make wonderful house pets Obedient and playful, Cocker Spaniels are friendly pets, but can be shy around strangers. Most Cocker Spaniels are good with children, and this breed requires a lot of human interaction to be happy"}, {"url": "https://www.petfinder.com/dog-breeds/American-Cocker-Spaniel", "passage_text": "The American version of the Cocker Spaniel is derived from the English Cocker Spaniel. In the late 1800s, many English Cockers were brought to America, but American hunters preferred a slightly smaller dog to hunt quail and other small game birds. "}]