[{"url": "https://en.wikipedia.org/wiki/Atmospheric_pressure", "passage_text": "Atmospheric pressure is the pressure exerted by the weight of air in the atmosphere of Earth (or that of another planet). In most circumstances atmospheric pressure is closely approximated by the hydrostatic pressure caused by the weight of air above the measurement point. One atmosphere (101 kPa or 14.7 psi) is the pressure caused by the weight of a column of fresh water of approximately 10.3 m (33.8 ft)."}, {"url": "http://ww2010.atmos.uiuc.edu/(Gh)/guides/mtr/fw/prs/def.rxml", "passage_text": ". Atmospheric Pressure force exerted by the weight of the air. Atmospheric pressure is defined as the force per unit area exerted against a surface by the weight of the air above that surface. In the diagram below, the pressure at point X increases as the weight of the air above it increases"}, {"url": "https://en.wikipedia.org/wiki/Atmosphere_(unit)", "passage_text": "The standard atmosphere (symbol: atm) is a unit of pressure defined as 101325 Pa (1.01325 bar). It is sometimes used as a reference or standard pressure. For example, a partial pressure of oxygen is calibrated typically using air at sea level, so is expressed in units of atm. The old European unit technical atmosphere (at) is equal to 1 kilogram-force per square centimetre (kgf/cm 2), 7004980665000000000♠98066.5 Pa."}, {"url": "https://en.wikipedia.org/wiki/Atmospheric_pressure", "passage_text": "The standard atmosphere (symbol: atm) is a unit of pressure equal to 101325 Pa or 1013.25 hectopascals or millibars. Equivalent to 760 mmHg (torr), 29.92 inHg, 14.696 psi. (The pascal is a newton per square meter or in terms of SI base units, kilogram per meter per second-squared.). One atmosphere (101 kPa or 14.7 psi) is the pressure caused by the weight of a column of fresh water of approximately 10.3 m (33.8 ft)."}, {"url": "https://en.wikipedia.org/wiki/Atmosphere_(unit)", "passage_text": "Scuba divers and others use the word atmosphere and atm in relation to pressures that are relative to mean atmospheric pressure at sea level (1.013 bar). For example, a partial pressure of oxygen is calibrated typically using air at sea level, so is expressed in units of atm. The old European unit technical atmosphere (at) is equal to 1 kilogram-force per square centimetre (kgf/cm 2), 7004980665000000000♠98066.5 Pa."}, {"url": "http://www.universetoday.com/73474/what-is-atmospheric-pressure/", "passage_text": "Atmospheric pressure is often measured with a mercury barometer; however, since mercury is not a substance that humans commonly come in contact with, water often provides a more intuitive way to visualize the pressure of one atmosphere. One atmosphere is the amount of pressure that can lift water approximately 10.3m. The term standard atmosphere is used to express the pressure in a system(hydraulics and pneumatics) and is equal to 101.325 kPa. Other equivalent units are 760 mmHg and 1013.25 millibars. Mean sea level pressure (MSLP) is the pressure at sea level."}, {"url": "http://www.universetoday.com/73474/what-is-atmospheric-pressure/", "passage_text": "Atmospheric pressure is closely related to the hydrostatic pressure caused by the weight of air above the measurement point. The term standard atmosphere is used to express the pressure in a system(hydraulics and pneumatics) and is equal to 101.325 kPa. Other equivalent units are 760 mmHg and 1013.25 millibars. Mean sea level pressure (MSLP) is the pressure at sea level."}, {"url": "http://study.com/academy/lesson/what-is-atmosphere-layers-gases-pressure.html", "passage_text": "The atmospheric pressure at sea level is also conveniently set at 1 atmosphere, or atm for short. One atmospheric pressure (1 atm) is equal to 14.7 pounds per square inch (psi) . The atmospheric pressure drops to almost zero 30 kilometers up in the atmosphere. To unlock this lesson you must be a Study.com Member. "}, {"url": "http://www.livescience.com/39315-atmospheric-pressure.html", "passage_text": "Enter the barometer. Atmospheric pressure is the force per unit area exerted by the weight of the atmosphere. To measure that weight, meteorologists use a barometer. It was Evangelista Torricelli, an Italian physicist and mathematician who proved in 1643 that he could weigh the atmosphere against a column of mercury. "}]