[{"url": "http://www.wikihow.com/Prepare-for-Running-Long-Distance", "passage_text": "How to Prepare for Running Long Distance. Long distance running, also called marathon running, involves running distances of 1.86 miles (3 km) or more, often in a competitive setting. 3K, 5K, 10K, half marathon, cross-country and marathon races are all examples of long distance running. "}, {"url": "https://en.wikipedia.org/wiki/Long-distance_running", "passage_text": "In modern human society, long-distance running has multiple purposes: people may engage in it for physical exercise, for recreation, as a means of travel, for economic reasons, or for cultural reasons. Cross country running is the most naturalistic form of long-distance running in athletics as competitions take place on open-air courses over surfaces such as grass, woodland trails, earth or mountains."}, {"url": "https://en.wikipedia.org/wiki/Long-distance_running", "passage_text": "Typical long-distance track races range from 3000 metres to 10,000 metres (6.2 miles), cross country races usually cover 5 to 12 km (3 to 7½ miles), while road races can be significantly longer, reaching 100 kilometres (60 miles) and beyond. Cross country running is the most naturalistic form of long-distance running in athletics as competitions take place on open-air courses over surfaces such as grass, woodland trails, earth or mountains."}, {"url": "http://www.all-about-marathon-training.com/long-distance-running.html", "passage_text": "The idea behind these long distance runs is to build endurance. Without endurance there can be no marathon or half marathon. A marathon tests your endurance and if you have built up not only your body but also your mind to go the distance you will be successful in the marathon training. To build up your endurance and long run first make sure you are comfortable and able to run 6- 8 miles before attempting a marathon. Once you can do this you should complete one long run every other week, increasing your long run by 2 miles each time or by 10% of your weekly mileage."}, {"url": "http://www.artofmanliness.com/2012/01/09/beginners-guide-to-long-distance-running/", "passage_text": "If you’re training for your first marathon or half, for example, most of your long runs should be done at one to two minutes slower per mile than you’re capable of running the distance on that day. Any faster than that when you’re trying to run 10 or 15 miles for the first time is just begging for an injury. "}, {"url": "https://en.wikipedia.org/wiki/Long-distance_running", "passage_text": "Long-distance running, or endurance running, is a form of continuous running over distances of at least three kilometres (1.86 miles). Cross country running is the most naturalistic form of long-distance running in athletics as competitions take place on open-air courses over surfaces such as grass, woodland trails, earth or mountains."}, {"url": "http://www.all-about-marathon-training.com/long-distance-running.html", "passage_text": "To a track athlete, long distance running is anything that is 3 miles or over. However for a marathoner the answer is usually anything over 10 miles. In marathon and half marathon training, the main portion of your training is the long run. To build up your endurance and long run first make sure you are comfortable and able to run 6- 8 miles before attempting a marathon. Once you can do this you should complete one long run every other week, increasing your long run by 2 miles each time or by 10% of your weekly mileage."}, {"url": "http://www.all-about-marathon-training.com/long-distance-running.html", "passage_text": "This can be answered in various ways. To a track athlete, long distance running is anything that is 3 miles or over. However for a marathoner the answer is usually anything over 10 miles. In marathon and half marathon training, the main portion of your training is the long run. This is usually anything over 6-10 miles. To build up your endurance and long run first make sure you are comfortable and able to run 6- 8 miles before attempting a marathon. Once you can do this you should complete one long run every other week, increasing your long run by 2 miles each time or by 10% of your weekly mileage."}]