[{"url": "http://healthquestions.medhelp.org/swollen-glands-under-the-tongue", "passage_text": "My lymph nodes around my neck were swollen, my gland under my tongue was swollen, my glands under my armpits were hurting, but that faded but I still have a few problems going on. Be careful with antibiotics. If a doc gives you a script for antibiotics, make sure you eat a lot of natural yogurt with live cultures."}, {"url": "http://www.tandurust.com/oral-care/swollen-gland-under-tongue.html", "passage_text": "Swollen gland under the tongue is one such tongue related problem that may worry you a lot. In fact glandular swelling anywhere in your body may cause worry. You are afraid if that swelling will turn out to be malignant. In all probability, swollen gland under the tongue is the result of swollen salivary gland."}, {"url": "http://www.webmd.com/oral-health/guide/salivary-gland-problems-infections-swelling", "passage_text": "Your salivary glands make as much as a quart of saliva each day. Saliva is important to lubricate your mouth, help with swallowing, protect your teeth against bacteria, and aid in the digestion of food. The three major pairs of salivary glands are: 1  parotid glands on the insides of the cheeks. 2  submandibular glands at the floor of the mouth. 3  sublingual glands under the tongue."}, {"url": "http://www.webmd.com/oral-health/guide/salivary-gland-problems-infections-swelling", "passage_text": "The most common cause of swollen salivary glands, salivary stones are buildups of crystallized saliva deposits. Sometimes salivary stones can block the flow of saliva. When saliva can't exit through the ducts, it backs up into the gland, causing pain and swelling."}, {"url": "http://healthquestions.medhelp.org/glands-swollen-under-tongue", "passage_text": "My lymph nodes around my neck were swollen, my gland under my tongue was swollen, my glands under my armpits were hurting, but that faded but I still have a few problems going on. Be careful with antibiotics. If a doc gives you a script for antibiotics, make sure you eat a lot of natural yogurt with live cultures."}, {"url": "http://www.tandurust.com/oral-care/swollen-gland-under-tongue.html", "passage_text": "Swelling of salivary gland is the prominent reason for glandular swelling under the tongue. Salivary gland can swell due to two major reasons. Firstly, it is the infection and second is an obstruction in the salivary duct through which saliva comes out in the mouth."}, {"url": "http://www.entnet.org/content/salivary-glands", "passage_text": "We call the major salivary glands the parotid, submandibular, and sublingual glands. They all secrete saliva into your mouth, the parotid through tubes that drain saliva, called salivary ducts, near your upper teeth, submandibular under your tongue, and the sublingual through many ducts in the floor of your mouth."}, {"url": "http://www.healthline.com/health/salivary-gland-infections", "passage_text": "When one or more of these glands is infected, it is called parotitis. Submandibular glands are located on each side of your jaw below the jawbone. Sublingual glands sit on the bottom of your mouth under your tongue. Additionally, hundreds of small (minor) salivary glands deposit saliva from ducts around your mouth."}]