[{"url": "https://answers.yahoo.com/question/index?qid=20120731153521AAnJGPd", "passage_text": "Answers. Best Answer: depends what supervidor at my kohls there are the depaartment supervisors like for juniors supervisor, mens supervisor and misses supervisor or a area supervisor like a E3 0-2 0-3 1-1 1-2 and so on....... there are different kinds that have different duties. Source(s): luv dance n my guy! · 3 years ago."}, {"url": "https://cs.kohls.com/app/answers/detail/a_id/3/~/order-tracking-definitions", "passage_text": "Submitted: You've successfully completed the checkout process at Kohls.com. Your order has been accepted and will be sent for processing to ensure your purchase reaches you on time. After your order is past “Submitted”, we are not able to cancel or modify your order. In Fulfillment: Our fulfillment center is working hard to fill your order and your package will be sent as soon as possible. Please see our Delivery Options to find out when you can expect your package(s) to arrive."}, {"url": "http://www.jobbite.com/reviews/kohls", "passage_text": "E3's are what normal stores refer to as managers on duty, in Kohls world they're nothing but Credit Pimps, whose goal is to make you nothing more than their Credit Whore. I'm not naieve, in this day and age a good chunk of a store's income comes from in-store credit cards with a 20-25% interest rate. If you like working your a$$ off and doing twice the amount of work as a normal job, then Kohls is for you. They are always understaffed and you have 10 different things you need to do. Management always makes excuses to why there are not enough people working."}, {"url": "https://cs.kohls.com/app/answers/detail/a_id/3/~/order-tracking-definitions", "passage_text": "Partially Shipped: Part of your order has been shipped. The rest of your order will be shipped soon. Click here for more details. Shipped/Complete: Your order has been completely filled and shipped, and your credit card has been billed for all the items we've shipped to you. After your order is past “Submitted”, we are not able to cancel or modify your order. In Fulfillment: Our fulfillment center is working hard to fill your order and your package will be sent as soon as possible. Please see our Delivery Options to find out when you can expect your package(s) to arrive."}, {"url": "http://www.jobbite.com/reviews/kohls", "passage_text": "I currently work at Kohls part-time as a POS associate. My mom is also an employee, we both love it!! Our supervisors, asst managers, managers and district managers are some of the best management staff I have ever worked for! Kohl's is all about Yes you can! and I get to make so many customers happy on a daily basis. If you like working your a$$ off and doing twice the amount of work as a normal job, then Kohls is for you. They are always understaffed and you have 10 different things you need to do. Management always makes excuses to why there are not enough people working."}, {"url": "http://parttimejobs2students.blogspot.com/2010/11/pos-associate-cashier-at-kohls.html", "passage_text": "POS Associate (Cashier) at Kohl's. Our Associates are the reasons Kohl's is so successful. So, to make your career as rewarding as possible, here are just a few of the benefits you'll receive as an hourly Kohl's Store Associate. 1 Effectively responds to questions and requests from customers. 2  Processes customers’ transactions accurately and efficiently. 3  Maintains Company 2-in-a-line standard and calls additional cashiers as needed. 4  Bags customers’ purchases carefully and thanks customers for shopping at Kohl’s."}, {"url": "http://www.kohls.com/sale-event/shoes.jsp", "passage_text": "Looking for shoes for the whole family? Kohl's has you covered. From the perfect sneakers for teens, to comfort shoes, to baby shoes, we have the styles that you and your family will love. Explore women's sandals and wedges or find sparkly prom shoes at a great price. Make sure he's ready for graduation ceremonies or job interviews with men's dress shoes. Make sure everyone has the rain boots they'll need for spring showers and help the kids find new kid’s sandals for summer. From cute ballet flats and high heels, to flip-flops and slippers, Kohl's has the shoes your family needs in the styles you want, all at great prices. Sponsored Links."}, {"url": "http://www.jobbite.com/reviews/kohls", "passage_text": "So I've worked at Kohls for roughly a year now and I can honestly say that the store and me have a love/ hate relationship. I mainly work in customer service and occasionally I'll get to do MJM (misses, juniors, mens) or POS. I like customer service when it's busy. If you like working your a$$ off and doing twice the amount of work as a normal job, then Kohls is for you. They are always understaffed and you have 10 different things you need to do. Management always makes excuses to why there are not enough people working."}, {"url": "http://www.merriam-webster.com/dictionary/kohl", "passage_text": "Full Definition of KOHL. : a preparation used especially in Arabia and Egypt to darken the edges of the eyelids. See kohl defined for English-language learners. See kohl defined for kids."}]