[{"url": "http://iracontributionlimits2010.com/2010-ira-income-limits/2010/07/", "passage_text": "This way you might avoid costly mistakes. Contribution Limits vs. Deduction Limits. The maximum you can contribute to a traditional IRA depends on your age. For the 2015 tax year, the limit is five thousand five hundred dollars for those 49 and younger. If you turn 50 or older in 2015, then your upper limit raises to six thousand five hundred dollars. "}, {"url": "http://www.rothira.com/roth-ira-limits", "passage_text": "The IRS severely limits the ability to contribute to a Roth IRA for individuals that are married but file separately. If you do not have income you will not be allowed to contribute to a Roth IRA. If your income is less than $10,000 you cannot contribute up to the limit. Your contribution is reduced. Use the IRS worksheet to calculate your new reduced Roth IRA contribution limit."}, {"url": "http://www.rothira.com/roth-ira-limits", "passage_text": "If you file as married filing joint or as a qualifying widow(er) your income must be less than $183,000 to contribute up to the limit. If your income falls between $183,000 and $193,000 you cannot contribute up to the limit. Your contribution is reduced. If you do not have income you will not be allowed to contribute to a Roth IRA. If your income is less than $10,000 you cannot contribute up to the limit. Your contribution is reduced. Use the IRS worksheet to calculate your new reduced Roth IRA contribution limit."}, {"url": "http://www.rothira.com/roth-ira-limits", "passage_text": "If your earned income for the year is less than the contribution limit (in 2014, $5,500 for those under 50), you can only contribute up to your earned income. If you do not have income you will not be allowed to contribute to a Roth IRA. If your income is less than $10,000 you cannot contribute up to the limit. Your contribution is reduced. Use the IRS worksheet to calculate your new reduced Roth IRA contribution limit."}, {"url": "http://www.ehow.com/info_8085292_maximum-income-roth-ira.html", "passage_text": "Limits on contributions depend on your annual earned income amount and your filing status. If you are married and filing a joint return, you can contribute the annual maximum as long as your modified adjusted gross income (MAGI) amount, for both spouses, is $181,000 or less as of tax year 2014. Above this figure, your contribution limit begins to phase out until you reach a MAGI of $191,000. Each year, you may deposit additional funds up to the annual contribution limit. As of tax year 2014, that limit had reached $5,500, with an additional $1,000 allowed if you are age 50 or older. You must have earned income, meaning money from wages, commissions, tips, salaries, bonuses or self-employment."}, {"url": "http://www.ehow.com/info_8085292_maximum-income-roth-ira.html", "passage_text": "In 2014, the same income limit for those filing as single or head of household reached $129,000. At $114,000 or less, a full contribution is allowed, while the contribution limit begins to phase out between $114,000 and $129,000. Each year, you may deposit additional funds up to the annual contribution limit. As of tax year 2014, that limit had reached $5,500, with an additional $1,000 allowed if you are age 50 or older. You must have earned income, meaning money from wages, commissions, tips, salaries, bonuses or self-employment."}, {"url": "http://www.rothira.com/roth-ira-limits", "passage_text": "Roth IRA Income Limits for Single Filers. If you file as single, head of household, or married filing separately (if you did not live with your spouse at any time during the year) your income must be less than $116,000 to contribute up to the limit. If you do not have income you will not be allowed to contribute to a Roth IRA. If your income is less than $10,000 you cannot contribute up to the limit. Your contribution is reduced. Use the IRS worksheet to calculate your new reduced Roth IRA contribution limit."}, {"url": "http://www.mydollarplan.com/roth-401k-and-roth-ira-limits/", "passage_text": "Roth IRA Income Limits. You may contribute the full amount to your Roth IRA if your 2015 modified adjusted gross income is below $116,000 for singles ($183,000 for married). You may make partial contributions until your income hits $131,000 ($193,000 for married). If your income is above that, you cannot contribute to a Roth IRA. If you are interested, there is a workaround called the Backdoor Roth IRA if your income is above the limits."}, {"url": "http://www.kiplinger.com/article/saving/T046-C001-S003-income-limits-for-roth-contributions-in-2014.html", "passage_text": "If, for example, your modified AGI is $186,000 (halfway through the phaseout zone), you can each contribute $2,750 to a Roth IRA (half of the contribution amount). For single filers and heads of household, the income levels for the phaseout are $114,000 to $129,000. I’ve seen two different numbers for the income limit for married couples to be eligible to contribute to a Roth IRA in 2014 -- $181,000 and $191,000."}, {"url": "https://investor.vanguard.com/ira/roth-ira-income-limits", "passage_text": "Whether or not you can make the maximum Roth IRA contribution ($5,500 annually, or $6,500 if you're age 50 or older) depends on your tax filing status and your modified adjusted gross income (MAGI) . "}]