[{"url": "http://www.enotes.com/homework-help/what-3-examples-viruses-that-cause-illness-di-394244", "passage_text": "Here are some of the viruses that can cause illness or disease: 1  Human Immunodeficiency Virus -- this is HIV, the virus that causes AIDS. 2  Flu viruses. 3  There are lots of different strains of flu virus, which is why new vaccines have to be made every year. 4  Cold virus. 5  The common cold is caused by a virus."}, {"url": "http://www.livescience.com/topics/virus", "passage_text": "Some of the most common or best known viruses include the human immunodeficiency virus (HIV), which is the virus that causes AIDS, the herpes simplex virus, which causes cold sores, smallpox, multiple sclerosis, and the human papilloma virus, now believed to be a leading cause of cervical cancer in adult women."}, {"url": "http://www.livestrong.com/article/111147-list-diseases-caused-viruses/", "passage_text": "This common illness, characterized by diarrhea, nausea and vomiting, is caused by many different viruses, but not the influenza virus. According to a 2012 article in the journal American Family Physician, viruses cause between 75 and 90 percent of acute gastrointestinal disease in children."}, {"url": "http://www.learnnc.org/lp/pages/4067", "passage_text": "Influenza, more commonly known as “the flu,” is caused by a contagious virus. Symptoms include body aches, sore throat, headache, fever, coughing, and chills. Perhaps because influenza is so common, misconceptions about the disease abound."}, {"url": "http://www.healthgrades.com/conditions/viral-diseases", "passage_text": "The most common type of viral disease is the common cold, which is caused by a viral infection of the upper respiratory tract (nose and throat). Other common viral diseases include: Chickenpox. Flu (influenza). Herpes. Human immunodeficiency virus (HIV/AIDS). Human papillomavirus (HPV). Infectious mononucleosis."}, {"url": "http://www.livescience.com/topics/virus", "passage_text": "A virus is defined as any of a various number of submicroscopic parasites that can infect any animal, plant or bacteria and often lead to very serious or even deadly diseases. A virus consists of a core of RNA or DNA, generally surrounded by a protein, lipid or glycoprotein coat, or some combination of the three."}, {"url": "http://www.medicalcodingcareerguide.com/resources/glossary-of-common-viruses/", "passage_text": "Herpes – Herpes is a group of several viruses that infect humans. Diseases caused by the herpes viruses include cold sores, genital herpes, chickenpox, and shingles. Herpes viruses are spread between people by way of body fluids, through the air, and through contaminated objects and surfaces."}]