[{"url": "https://en.wikipedia.org/wiki/Democracy", "passage_text": "Representative democracy is a form of democracy in which people vote for representatives who then vote on policy initiatives as opposed to a direct democracy, a form of democracy in which people vote on policy initiatives directly. Direct democracy is a political system where the citizens participate in the decision-making personally, contrary to relying on intermediaries or representatives. The use of a lot system, a characteristic of Athenian democracy, is unique to direct democracies."}, {"url": "https://en.wikipedia.org/wiki/Direct_democracy", "passage_text": "Direct democracy (also known as pure democracy) is a form of democracy in which people decide (e.g. vote on, form consensus on) policy initiatives directly. This differs from the majority of modern Western-style democracies, which are indirect democracies. Direct democracy is similar to, but distinct from, representative democracy in which people vote for representatives who then enact policy initiatives."}, {"url": "http://www.answers.com/Q/What_is_direct_democracy", "passage_text": "Confidence votes 642. Direct democracy is where the citizens directly influence the decisions of the government. This is compared to indirect democracy (which is what the US has) where the people elect representatives who represent their interests in the decisions of goverment. Direct democracy is a form of democracy. In a repulic, people ellect representatives to do the governing. In a direct democracy, people vote themselves on all of the bills. Their is not legislative branch in a direct democracy.    In a direct democracy the whole population votes on issues."}, {"url": "http://usgovinfo.about.com/od/thepoliticalsystem/a/Direct-Democracy.htm", "passage_text": "Post. Share. Direct democracy, sometimes called pure democracy, is a form of democracy in which the people themselves, rather than elected representatives, determine the laws and policies by which they are governed. Direct democracy is the opposite of the more common representative democracy, under which the people elect representatives empowered to create laws and policies. Ideally, the laws and policies enacted by the elected representatives in a representative democracy reflect the will of the people"}, {"url": "http://www.answers.com/Q/What_is_direct_democracy", "passage_text": "A republic is a form of government where a group of officials who represent the people vote on issues, whereas a direct democracy is a form of government where all citizens di … rectly vote on issues. In a repulic, people ellect representatives to do the governing. In a direct democracy, people vote themselves on all of the bills. Their is not legislative branch in a direct democracy.    In a direct democracy the whole population votes on issues."}, {"url": "http://www.answers.com/Q/What_is_an_example_of_direct_democracy", "passage_text": "Direct democracy is where the citizens directly influence the decisions of the government. This is compared to indirect democracy (which is what the US has) where the people … elect representatives who represent their interests in the decisions of goverment. Making the world better, one answer at a time. Direct democracy is the governing of a people BY the people. All members of a group, rather than representatives, meet to make decisions, observing political equality and majority rule. An example of direct or participatory democracy would be a town meeting"}, {"url": "http://www.qwhatis.com/what-is-direct-democracy/", "passage_text": "Direct democracy is a type of democracy wherein citizens or people of a particular country or community make the actual decisions regarding the laws and policies applicable to them. In a direct democracy, the people themselves will cast their votes for or against a certain rule or policy. In a direct democracy, no such representatives are chosen to take care of laws and policies. The people themselves have a direct contribution into how things are done in a particular country or community."}]