[{"url": "http://www.thefreedictionary.com/freight", "passage_text": "freight. n. 1. Goods carried by a vessel or vehicle, especially by a commercial carrier; cargo. 2. A burden; a load. 3. a. Commercial transportation of goods. b. freight. 1. goods, cargo, or lading transported for pay. 2. the ordinary means of transport of goods provided by common carriers. 3. the charges for such transportation."}, {"url": "http://www.accountingcoach.com/terms/F/freight-in", "passage_text": "freight-in. The shipping cost to be paid by the buyer of merchandise purchased when the terms are FOB shipping point. Freight-in is considered to be part of the cost of the merchandise and should be included in inventory if the merchandise has not been sold. "}, {"url": "http://www.definitions.net/definition/freight", "passage_text": "Wiktionary (5.00 / 1 vote) Rate this definition: freight (Noun). Payment for transportation. The freight was more expensive for cars than for coal. freight (Noun). Goods or items in transport. The freight shifted and the trailer turned over on the highway. freight (Noun). Transport of goods. "}, {"url": "http://smallbusiness.chron.com/fob-mean-freight-12927.html", "passage_text": "Definition. The initials FOB stand for either free on board or freight on board.. Either way, it has the same definition. When using the term in business, buyers and sellers attach FOB to the beginning of a location to show the point at which freight changes hands from seller to buyer. "}, {"url": "http://www.oxforddictionaries.com/definition/english/freight", "passage_text": "1 Goods transported in bulk by truck, train, ship, or aircraft: a decline in the amount of freight carried by rail [as modifier]: a freight train. More example sentences. Synonyms. 1  According to transport experts, one freight train carries the equivalent of 75 lorry loads, reducing road congestion and pollution levels. 1.2 A charge for transport by freight: a bill indicating that the freight has been paid. More example sentences. 1  They'd far prefer to charge all customers full freight rather than start extensive discounting programs. 2  But in case not, I paid full freight for the machine I described in this post."}, {"url": "http://www.businessdictionary.com/definition/freight-cost.html", "passage_text": "Nearby Terms. 1  freezing point. 2  freight. 3  freight all kin... 4  freight analysi... 5  freight bill. 6  freight bill of... 7  freight carriag... 8  freight contain... 9  freight cost. 10  freight forward... 11  freight insuran... 12  freight invoice. 13  freight manifes... 14  freight notatio... 15  freight payer. 16  freight prepaid. 17  freight rate. "}, {"url": "http://www.farrow.com/article-what-is-freight-forwarding", "passage_text": "What Is Freight Forwarding? Freight forwarding is the coordination and shipment of goods from one place to another via a single or multiple carriers via air, marine, rail or highway. "}, {"url": "http://www.freightquote.com/howtoship/freight-dictionary.aspx", "passage_text": "Shipping terminology. We used our extensive logistics knowledge and experience to create a straightforward guide to shipping and logistics terminology. Whether you’re new to the freight industry or just want to brush up on freight terms, our shipping dictionary is your go-to resource. "}, {"url": "https://en.wikipedia.org/wiki/Freight_rate", "passage_text": "From Wikipedia, the free encyclopedia. A freight rate (historically and in ship chartering simply freight) is a price at which a certain cargo is delivered from one point to another. "}]