[{"url": "http://tracker.cci.fsu.edu/redwolf/about/where/", "passage_text": "Red wolves are very adaptive to different types of ecosystems and can live in a variety of areas such as forests, coastal prairies, and sometimes swamps. They have a secretive nature and require adequate cover, so they prefer areas with brush, shrubs, or trees. "}, {"url": "http://www.wolfworlds.com/wolf-habitat/", "passage_text": "Wolf Habitat and Distribution. Wolves are very diverse animals, which is why they have a habitat that is very spread out around the world. It isn’t true that they only live in very thick forests and come out at night. Wolves have been identified in many areas that you may not ever imagine them being able to survive. It is common for the habitat of a pack of wolves to overlap with that of other packs. Generally this is very peaceful with the different packs avoiding each other. However, when the size of the habitat is reduced and when food is hard to find they can become more aggressive towards each other."}, {"url": "https://en.wikipedia.org/wiki/Gray_wolf", "passage_text": "The gray wolf is a habitat generalist, and can occur in deserts, grasslands, forests and arctic tundras. Habitat use by gray wolves is strongly correlated with the abundance of prey, snow conditions, absence or low livestock densities, road densities, human presence and topography. The gray wolf or grey wolf (Canis lupus) also known as the timber wolf, or western wolf, is a canid native to the wilderness and remote areas of North America and Eurasia. It is the largest extant member of its family, with males averaging 43–45 kg (95–99 lb), and females 36–38.5 kg (79–85 lb)"}, {"url": "http://www.nwf.org/Wildlife/Wildlife-Library/Mammals/Gray-Wolf.aspx", "passage_text": "Habitat and Range. Wolves can thrive in a diversity of habitats from the tundra to woodlands, forests, grasslands and deserts. Today, gray wolves have populations in Alaska, northern Michigan, northern Wisconsin, western Montana, northern Idaho, northeast Oregon and the Yellowstone area of Wyoming. Size: Wolves vary in size depending on where they live. Wolves in the north are usually larger than those in the south. The average size of a wolf's body is 3-5 feet long. Their tails are usually 1-2 feet long. Females typically weigh 60-100 pounds, and males weigh 70-145 pounds."}, {"url": "http://www.buzzle.com/articles/gray-wolf-habitat.html", "passage_text": "Habitat of gray wolf, in general, can be found in places such as Mexico, Ethiopia, Arabian peninsula, Europe, Asia, etc. The Great Plains Wolf, a subspecies of the gray wolf, is a native to North America. It is also known as the buffalo wolf or the Eastern Timber Wolf. These wolves, once, dominated and claimed the vast stretches of continental U.S.A., especially, the western United States and southern Canada as their habitat. The gray wolf is as adaptable as man; no wonder its habitat is spread all over the world. Advertisement. The gray wolf or 'The Wolf', as it is commonly referred to, is one of those animals, which successfully survived the last ice age."}, {"url": "http://graywolves.weebly.com/habitat.html", "passage_text": "The gray wolves habitat needs to be a very large area that is all wildland. They also need a large number of prey in this area so they can hunt. Theses wolves can survive in many different areas. These areas include deserts, forests, mountains, tundras, and plains. There are many other creatures that share the habitat with the gray wolf. One of those creatures is elk. Wolves prey on elk. Another animal that shares the wolves habitat is rabbits."}, {"url": "http://www.answers.com/Q/What_is_the_habitat_of_the_wolf", "passage_text": "A wolf can live in many places such as a forest, swampy areas, deserts, artic areas and tundras, so it depends on which wolf you are talking about. The Grey Wolf lives in many areas around the world, mostly cold tundras or forests. Arctic wolves live in the Arctic Circle. The main habitat of the grey wolf is forest, but it can adapt to pretty much any habitat. Historically, the Gray Wolf was once the world's most widely distributed mammal, livi … ng north of 15°N latitude in North America and 12°N in Eurasia."}]