[{"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=14", "passage_text": "Celery is an excellent source of vitamin K and molybdenum. It is a very good source of folate, potassium, dietary fiber, manganese, and pantothenic acid. Celery is also a good source of vitamin B2, copper, vitamin C, vitamin B6, calcium, phosphorus, magnesium, and vitamin A (in the form of carotenoids)."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=14", "passage_text": "Celery is a rich source of phenolic phytonutrients that have antioxidant and anti-inflammatory properties. These phytonutrients include: caffeic acid, caffeoylquinic acid, cinnamic acid, coumaric acid, ferulic acid, apigenin, luteolin, quercetin, kaempferol, lunularin, beta-sitosterol and furanocoumarins."}, {"url": "http://www.medicalnewstoday.com/articles/270678.php", "passage_text": "Vitamins and minerals-celery is very rich in vitamin K and also contains folate, vitamin A, potassium, and vitamin C. Dietary fiber-despite being mainly water, celery also provides a fair amount of dietary fiber. The vegetable contains 1.6 grams of fiber per 100 grams."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=14", "passage_text": "This chart graphically details the %DV that a serving of Celery provides for each of the nutrients of which it is a good, very good, or excellent source according to our Food Rating System. Additional information about the amount of these nutrients provided by Celery can be found in the Food Rating System Chart."}, {"url": "http://www.foods-healing-power.com/celery-health-benefits.html", "passage_text": "Celery Health Benefits. For such a humble vegetable, celery health benefits are many. But first have a look at celery's nutritional highlights 1  : Celery is an excellent source of vitamin C and fibre. 2  It's a very good source of potassium, folic acid, and vitamin B6 and B1. 3  Celery is a good source of calcium and vitamin B2. 4  Rich source of dietary sodium."}, {"url": "http://www.medicalnewstoday.com/articles/270678.php", "passage_text": "Celery is a vegetable belonging to the Apiaceae family. It is well known for its crunchy stalks, which people often consume as a low calorie snack. However, celery is not only a good low calorie food. There are a number of other reasons why you might want to include this vegetable in your diet."}]