[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/triple_aqa/movement_of_molecules/dissolved_substances/revision/2/", "passage_text": "Root hair cells in plant roots use active transport to absorb mineral ions [ions: Electrically charged particles, formed when an atom or molecule gains or loses electrons.] (such as nitrates) from the soil-even though there are lower concentrations of minerals in the soil than there are within the root hair cell."}, {"url": "http://biology-igcse.weebly.com/active-transport.html", "passage_text": "Their concentration are often higher inside the root hair cell than in the soil, so the diffusion gradient is from the root hair a à the. Soil despite, this the root hair cells still can take nitrate ions, in by active. transport"}, {"url": "http://passmyexams.co.uk/GCSE/biology/active-transport-in-cells.html", "passage_text": "This is active transport. In active transport particles move against a concentration gradient and therefore require energy which must be supplied by the cell. Carrier proteins that are found in the cell membrane of cells use energy to transport molecules or ions across the membrane, against the concentration gradient."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_gateway/green_world/plantmineralsrev3.shtml", "passage_text": "Instead, active transport is used. The root hair cells have carrier molecules on their cell membranes. These pick up the mineral ions and move them across the membrane into the cell against the concentration gradient [concentration gradient: A difference in concentration between two areas next to each other."}, {"url": "http://biology-igcse.weebly.com/active-transport.html", "passage_text": "2. a) active transport is absorption of a substance into a cell or across a membrane. - against (up) a concentration gradient. - using energy. b) active transport requires energy. 1  Explain how the presence of root hair cells on roots enables the efficient absorption of water and minerals. [ 2  2 marks]. 3  Root hair cells can absorb mineral ions by diffusion and active transport."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20060620034238AA6m2vR", "passage_text": "Best Answer: Active transport is the movement of a molecule across a membrane or another barrier that is driven by energy other than stored in the concentration gradient or the electrochemical gradient of the transported molecule."}, {"url": "http://sciebegr.wikispaces.com/file/view/Active+Transport+in+Root+Hair+Cells.doc", "passage_text": "Osmosis is very important in root hair cells. Providing that the soil is moist, it is possible for water to enter the root hair by osmosis. Water passes from a region of high water concentration (wet soil) through a semi-permeable membrane (the cell membrane) to a region of lower water concentration (the cytoplasm)."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_gateway/green_world/plantmineralsrev3.shtml", "passage_text": "They absorb minerals dissolved in solution from the soil through their root hair cells root hair cell: Tiny hairs covering the ends of the smallest roots. They give the root a very large surface area through which to absorb water and mineral salts from the soil. ."}]