[{"url": "http://mesa.edu.au/cnidaria/default.asp", "passage_text": "Cnidaria is a phylum containing over 9,000 species found only in aquatic and mostly marine environments. All cnidarians have radial symmetrical. There are two major body forms among the Cnidaria-the polyp and the medusa. Sea anemones and corals have the polyp form, while jellyfish are typical medusae."}, {"url": "http://people.eku.edu/rameyb/page18.html", "passage_text": "Cells have become specialized and form true tissues and cnidarians are the first group to have B nerve cells organized into a nerve net B sense organs (statocysts and ocelli) B extracellular digestion Cnidarian Body Plan The diploblastic cnidarians are radially or biradially symmetrical with oral and aboral ends."}, {"url": "http://animals.about.com/od/cnidarians/ss/cnidarians.htm", "passage_text": "In hydras and jellyfish, the cnidocytes cells have a stiff bristle that projects out from the surface of the epidermis. This bristle is called a cnidocyl (it is not present in corals and sea anemones, which instead possess a similar structure called a ciliary cone)."}, {"url": "http://www.encyclopedia.com/topic/Cnidaria.aspx", "passage_text": "Cnidaria A phylum that comprises the sea anemones, jellyfish, and corals, and which is known from the late Precambrian. Cnidarians are basically radially symmetrical and have tentacles. The body contains a gastrovascular cavity and the body wall is diploblastic."}, {"url": "http://classic.sidwell.edu/us/science/vlb5/Labs/Classification_Lab/Eukarya/Animalia/Cnidaria/", "passage_text": "Cnidaria is a phylum within Kingdom Animalia which consists of hydras, jellies (or jellyfish), sea anemones, and corals. All cnidarians are radially symmetrical, and there are two main radially symmetrical body types. The first of these types is known as a polyp."}, {"url": "http://www.oceaninn.com/wildlife/cnidarians.htm", "passage_text": "Most Cnidarians alternate between these two stages, although some, sea anemones and corals for example, do not have an alternation of generations. Morphology. Cnidarians are said to be the simplest organisms at the tissue grade of organization. Their cells are organized into true tissues. Cnidarians are essentially bags made of two cell layers. The outer layer, or epidermis, contains the cnidocysts, the stinging cells that are characteristic of the phylum."}, {"url": "http://animals.about.com/od/cnidarians/ss/cnidarians.htm", "passage_text": "Cnidocytes are specialized cells located in the epidermis of all cnidarians. These cells are unique to cnidarians, no other organism possesses them. Cnidocytes are most concentrated within the epidermis of the tentacles. Cnidocytes contain organelles called cnidea."}, {"url": "http://mesa.edu.au/cnidaria/default.asp", "passage_text": "Cnidaria do not have a brain or groups of nerve cells ( ganglia ). The nervous system is a decentralized network (‘nerve net’), with one or two nets present. They do not have a head, but they have a mouth, surrounded by a crown of tentacles. The tentacles are covered with stinging cells (nematocysts)."}]