[{"url": "https://en.wikipedia.org/wiki/Southeast_Asia", "passage_text": "The culture in Southeast Asia is very diverse: on mainland Southeast Asia, the culture is a mix of Indochinese (Burma, Cambodia, Laos and Thailand) and Chinese (The Philippines,Singapore and Vietnam). Stock markets in Southeast Asia have performed better than other bourses in the Asia-Pacific region in 2010, with the Philippines' PSE leading the way with 22 percent growth, followed by Thailand's SET with 21 percent and Indonesia's JKSE with 19 percent."}, {"url": "http://wikitravel.org/en/Southeast_Asia", "passage_text": "Get in [edit]. Southeast Asia's touristy countries (Malaysia, Philippines, Singapore, Thailand) do not require visas from most visitors. Cambodia, Laos, Indonesia and East Timor offer visas on arrival at most points of entry. Vietnam and Myanmar require advance paperwork for most visitors. By plane [edit]. The main international gateways to Southeast Asia are Bangkok (Thailand) and Singapore, with Kuala Lumpur (Malaysia) in third place and Jakarta (Indonesia) following suit. Manila (Philippines) also offers relatively good connections to other cities outside the region, particularly North America."}, {"url": "http://www.nationsonline.org/oneworld/map_of_southeast_asia.htm", "passage_text": "Southeast Asia is a subregion of Asia, roughly be described as geographically situated east of the Indian subcontinent, south of China and north of Australia, between the Indian Ocean (in west) and the Pacific Ocean (in east). Regions in South-East Asia. Countries and regions on the fringe of Southeast Asia: Bhutan, Hong Kong, Indian States and Union Territories, Macau, Maldives, Nepal, Pakistan, Sri Lanka, Taiwan, Tibet."}, {"url": "https://en.wikipedia.org/wiki/Southeast_Asia", "passage_text": "Southeast Asia or Southeastern Asia is a subregion of Asia, consisting of the countries that are geographically south of China, east of India, west of New Guinea and north of Australia. The region lies near the intersection of geological plates, with heavy seismic and volcanic activity. Stock markets in Southeast Asia have performed better than other bourses in the Asia-Pacific region in 2010, with the Philippines' PSE leading the way with 22 percent growth, followed by Thailand's SET with 21 percent and Indonesia's JKSE with 19 percent."}, {"url": "http://www.answers.com/Q/What_are_the_countries_of_Southeast_Asia", "passage_text": "South East Asia is often defined by ASEAN (Association of South East Asian Nations), including 10 countries: Indonesia, Malaysia, Philippines, Singapore, Thailand, Brunei, Bur … ma, Cambodia, Laos and Vietnam. Countries are including Brunei Darussalam, Cambodia, Indonesia,  Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, Vietnam.  There is also East Timor that isn't under ASEAN yet."}, {"url": "http://www.answers.com/Q/What_are_the_countries_of_Southeast_Asia", "passage_text": "Thailand, however is  clearly a part of Southeast Asia.   Countries are including Brunei Darussalam, Cambodia, Indonesia,  Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, Vietnam.  There is also East Timor that isn't under ASEAN yet. Aaron McClellan."}, {"url": "https://answers.yahoo.com/question/index?qid=20091012191232AAEPQnD", "passage_text": "SOUTHEAST ASIA consists of Brunei, Cambodia, East Timor, Indonesia, Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, Vietnam, Cocos Islands, and Christmas Island. MatT · 6 years ago. Report Abuse. Nope. S.E.A. (Southeast Asia) includes countries like Malaysia, Phillipines and Vietnam. Korea is sometimes called a part of Northeast Asia, but it is usually just referred as East Asia. Source(s): Korean."}, {"url": "http://www.answers.com/Q/What_are_the_countries_of_Southeast_Asia", "passage_text": "Generally, the members of ASEAN (and probably Timor-Leste and P.N.G.) would be considered as part of southeast asia. Countries such as India, Nepal etc, oft confused as being part of it, are within SOUTH Asia, whereas China, Taiwan, the Koreas etc are in East Asia. Countries are including Brunei Darussalam, Cambodia, Indonesia,  Laos, Malaysia, Myanmar, Philippines, Singapore, Thailand, Vietnam.  There is also East Timor that isn't under ASEAN yet."}, {"url": "https://en.wikipedia.org/wiki/Thailand", "passage_text": "Thailand is an emerging economy and is considered a newly industrialised country. Thailand had a 2013 GDP of US$673 billion (on a purchasing power parity [PPP] basis). Thailand is the 2nd largest economy in Southeast Asia after Indonesia. Thailand ranks midway in the wealth spread in Southeast Asia as it is the 4th richest nation according to GDP per capita, after Singapore, Brunei, and Malaysia. Tourism in Thailand makes up about 6% of the economy. Thailand was the most visited country in Southeast Asia in 2013, according to the World Tourism Organisation. Prostitution in Thailand and sex tourism also form a de facto part"}]