[{"url": "http://www.payscale.com/research/AE/Job=Regional_Sales_Manager/Salary", "passage_text": "Regional Sales Manager Salary. (United Arab Emirates). The average salary for a Regional Sales Manager is AED 297,407 per year. Most people move on to other jobs if they have more than 20 years' experience in this field. Experience has a moderate effect on income for this job. AED 118,946 - AED 510,132."}, {"url": "http://www.dubaifaqs.com/salaries-dubai.php", "passage_text": "1 Minimum salaries for maids set by the respective governments of the country they come from are: Bangladesh AED 750, India AED 1,100, Indonesia AED 800, Philippines AED 1,400, Sri Lanka AED 850 (figures not confirmed). 2  It's not clear if these minimum salaries are supported by labour law in the UAE."}, {"url": "https://www.recruiter.com/salaries/sales-managers-salary/", "passage_text": "Sales Managers have the best average pay in New York, where they get an average salary rate of approximating $156800. People in this career receive the best pay in Finance and Insurance, where they can earn job pay of $137940. The national wage distribution is shown below."}, {"url": "http://www.payscale.com/research/AE/Job=Regional_Sales_Manager/Salary", "passage_text": "(United Arab Emirates). The average salary for a Regional Sales Manager is AED 297,407 per year. Most people move on to other jobs if they have more than 20 years' experience in this field. Experience has a moderate effect on income for this job. AED 118,946 - AED 510,132."}, {"url": "https://www.recruiter.com/salaries/sales-managers-salary/", "passage_text": "A Sales Manager will normally receive an average salary on a scale from 88000 and 132000 depending on the level of education. Sales Managers will normally receive average salaries of One Hundred Fourteen Thousand Two Hundred dollars on an annual basis."}, {"url": "http://www.dubaifaqs.com/salaries-dubai.php", "passage_text": "Average salaries and wages in Dubai and UAE. Table of average wages and salary ranges for jobs in Dubai. Similar pay scales and wages paid in Abu Dhabi companies and jobs (or higher), similar or lower in other emirates. All salary figures are monthly in UAE dirhams (AED) (3.67 dhs = US$1)."}]