[{"url": "http://www.theglobeandmail.com/life/food-and-wine/food-trends/spamming-it-up-with-the-tinned-luncheon-meat/article19830025/", "passage_text": "For the Spam bao, two slices of luncheon meat are seared on a grill, which caramelizes them and brings out notes of bacon. Pickled red onions cut through the Spam’s saltiness, and a tuft of iceberg lettuce adds some much-needed crunch. Spam is back: How the tinned luncheon meat is going upscale Add to ..."}, {"url": "https://answers.yahoo.com/question/index?qid=20100103065023AANdIQC", "passage_text": "Best Answer: The canning process kills off the bacteria in spam, since lunchmeats are uncanned, they are instead sprayed with live viruses to keep bacteria off. As far as the general products are concerned, the difference would be in the recipe, but mostly the process in which each meat is stored. Report Abuse. I think the difference is just the name-spam is a brand name. It does taste different to other luncheon meats, but that will just be down to the recipe they use. Basically the same stuff. Just as Coca Cola and Pepsi are basically the same things-both cola drinks, different recipes and tastes"}, {"url": "http://www.madehow.com/Volume-6/Spam.html", "passage_text": "Hormel's first experimental 12-oz (340-g) cans of this pork luncheon meat turned out to be 8 oz (227 g) of meat and 4 oz (113 g) of useless juice. As the heat cooked the meat in the sealed can, cells broke down and released an excessive amount of juice. Hormel tried many things to reduce the juice. The new luncheon meat was not available for a while, awaiting a marketable name and an iconic label. After much dispute, the name Spam seemed perfect. Most believe it to be a combination of the words spiced and ham, but the original product contained no ham."}, {"url": "https://en.wikipedia.org/wiki/Spam_%28food%29", "passage_text": "By the early 1970s the name Spam was often misused to describe any tinned meat product containing pork, such as pork luncheon meat. With expansion in communications technology, it became the subject of urban legends about mystery meat and other appearances in pop culture. Spam musubi is a popular snack and lunch food in Hawaii. Spam is especially popular in the state of Hawaii, where residents have the highest per capita consumption in the United States. Its perception there is very different from on the mainland."}, {"url": "http://www.theglobeandmail.com/life/food-and-wine/food-trends/spamming-it-up-with-the-tinned-luncheon-meat/article19830025/", "passage_text": "I never thought the day would come when I would walk into a restaurant and ask for tinned luncheon meat, the kind that escapes its can with an audible slurp, the kind that thwacks the plate in a pasty chunk of quasi-goo. Spam is back: How the tinned luncheon meat is going upscale Add to ..."}, {"url": "https://en.wikipedia.org/wiki/Spam_%28food%29", "passage_text": "According to its label, Spam's basic ingredients are pork shoulder meat, with ham meat added, salt, water, modified potato starch as a binder, sugar, and sodium nitrite as a preservative. Natural gelatin forms during cooking in its tins on the production line. Spam musubi is a popular snack and lunch food in Hawaii. Spam is especially popular in the state of Hawaii, where residents have the highest per capita consumption in the United States. Its perception there is very different from on the mainland."}, {"url": "https://en.wikipedia.org/wiki/Spam_%28food%29", "passage_text": "Spam is a brand of canned precooked meat products made by Hormel Foods Corporation. It was first introduced in 1937 and gained popularity worldwide after its use during World War II. By 2003, Spam was sold in 41 countries on six continents and trademarked in over 100 countries. Spam musubi is a popular snack and lunch food in Hawaii. Spam is especially popular in the state of Hawaii, where residents have the highest per capita consumption in the United States. Its perception there is very different from on the mainland."}, {"url": "http://www.madehow.com/Volume-6/Spam.html", "passage_text": "Spam is a brand name for a canned meat product containing ham, pork, salt, flavorings, and preservatives that are mixed and cooked under vacuum pressure. There are other brands of similar canned pork meat products, but Spam—made by Hormel Foods Corporation—is the original and the best-selling of the brands. The new luncheon meat was not available for a while, awaiting a marketable name and an iconic label. After much dispute, the name Spam seemed perfect. Most believe it to be a combination of the words spiced and ham, but the original product contained no ham."}]