[{"url": "http://www.blackpast.org/perspectives/national-association-advancement-colored-people-and-long-struggle-civil-rights-united-s", "passage_text": "Founded in 1909, the National Association for the Advancement of Colored People (NAACP) has provided critical institutional support and leadership in the fight against racial inequalities in America. In the article below historian Susan Bragg provides a brief introduction to the history of the National Association for the Advancement of Colored People (NAACP), the oldest continually active civil rights organization in the United States."}, {"url": "http://www.naacp.org/pages/naacp-history", "passage_text": "NAACP: 100 Years of History. Founded Feb. 12. 1909, the NAACP is the nation's oldest, largest and most widely recognized grassroots-based civil rights organization. Joel Spingarn, one of the NAACP founders, was a professor of literature and formulated much of the strategy that led to the growth of the organization. He was elected board chairman of the NAACP in 1915 and served as president from 1929-1939."}, {"url": "http://www.history.com/topics/naacp", "passage_text": "Introduction. Founded in 1909, the National Association for the Advancement of Colored People (NAACP) was one of the earliest and most influential civil rights organization in the United States. During its early years, the NAACP focused on legal strategies designed to confront the critical civil rights issues of the day. The National Association for the Advancement of Colored People (NAACP) was founded in 1909-1910 in New York City by a group of white and black intellectuals."}, {"url": "http://naacp.3cdn.net/14a2d3f78c1910ac31_frm6bev0u.pdf", "passage_text": "The History of the NAACP Founded February 12, 1909, the NAACP is the nation's oldest, largest and most widely recognized grassroots–based civil rights organization. "}, {"url": "http://epicroadtrips.us/2003/summer/nola/nola_offsite/Katrina/en.wikipedia.org/wiki/NAACP.html", "passage_text": "The National Association for the Advancement of Colored People, or NAACP, is one of the oldest and most influential civil rights organizations in the United States. It was founded in 1909 to work on behalf of black people. "}, {"url": "http://history1900s.about.com/od/1900s/qt/naacp.htm", "passage_text": "NAACP Is Founded (1909): The National Association for the Advancement of Colored People (NAACP) was founded on February 12, 1909. After a race riot in Springfield, Illinois in 1908, The Call went out to Northerners to find a way to create social equality. In 1909, a group of multi-racial activists held a conference in New York City in response to The Call and decided to form the NAACP (originally called the National Negro Committee)."}, {"url": "http://www.history.com/topics/naacp", "passage_text": "Founded in 1909, the National Association for the Advancement of Colored People (NAACP) today has approximately 425,000 members. In 1916, a new field secretary, James Weldon Johnson, began expanding the organization’s membership in the South. The National Association for the Advancement of Colored People (NAACP) was founded in 1909-1910 in New York City by a group of white and black intellectuals."}, {"url": "http://americanhistory.si.edu/brown/history/3-organized/naacp.html", "passage_text": "Founded in 1909, the NAACP is the nation’s oldest civil rights organization. Throughout the 1920s and 1930s, the association led the black civil rights struggle in fighting injustices such as the denial of voting rights, racial violence, discrimination in employment, and segregated public facilities. "}, {"url": "http://www.u-s-history.com/pages/h1595.html", "passage_text": "NAACP. The National Association for the Advancement of Colored People (NAACP) was founded in 1909 in New York City by a group of bi-racial activists. Originally called the National Negro Committee, it is the nation's oldest civil rights organization. "}]