[{"url": "http://www.justanswer.com/health/1aa3o-told-morning-retinal-fibrosis.html", "passage_text": "Hi, Thanks for the information. By what you are describing it seems that you have is cataract and pre-retinal fibrosis. Retina is a membrane on the posterior part of the eye, on which image is formed of what we see. In other words, retina is the main visual part of the eye. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/3429756", "passage_text": "Idiopathic preretinal fibrosis is a common disorder which typically affects elderly individuals. The epiretinal membranes are of glial origin in the retina where they migrate through breaks in the internal limiting membrane to form fibroglial sheets on the surface of the retina. "}, {"url": "http://www.spokaneeye.com/home/resources/diseases-disorders/retinal-disorders/premacular-fibrosis/", "passage_text": "Over the years, premacular fibrosis (PMF) has gone by many different names including cellophane maculopathy, epiretinal membrane (ERM), and macular pucker. Its nasty first cousin is proliferative vitreoretinopathy (PVR). Premacular fibrosis (PMF) is another of several diseases that affects the macula, the center of the retina, the portion of the retina that provides the detailed vision that we use for reading, driving, and detailed work. The disease has its effects on the front side of the retina. Macular degeneration affects the underside of the retina. Although the symptoms are superficially somewhat similar, PMF is definitely not macular degeneration. It has a distinct mechanism of action, prognosis, and therapy."}, {"url": "http://medical-dictionary.thefreedictionary.com/preretinal+macular+fibrosis", "passage_text": "If vision is significantly reduced, the main treatment is by vitreous surgery with removal of the layer of preretinal proliferative tissue. Syn. epiretinal membrane; macular epiretinal membrane; macular pucker; premacular fibrosis; preretinal membrane; preretinal vitreous membrane; surface wrinkling retinopathy. Ophthalmoscopically the retina presents a glinting reflex. The condition may occur after trauma, eye surgery, retinal vascular disease (e.g. branch retinal vein occlusion) and inflammation and with any of the causes of retinitis proliferans and most commonly in elderly patients."}, {"url": "http://www.malacards.org/card/preretinal_fibrosis", "passage_text": "MalaCards based summary: Preretinal Fibrosis, is also known as macular puckering of retina An important gene associated with Preretinal Fibrosis is MATK (megakaryocyte-associated tyrosine kinase). Affiliated tissues include retina. "}, {"url": "http://macula.org/macular-fibrosis", "passage_text": "Macular Fibrosis. Macular fibrosis is a condition also referred to as a macular pucker, epiretinal membrane, or cellophane maculopathy. Macular fibrosis occurs when a thin sheet of scar tissue forms on top of the macula, in response to damage or injury. Damage to the macula may occur due to eye trauma, retinal tears or detachments, the shrinking of the vitreous, or systemic disease, such as diabetes or hypertension."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1804382/", "passage_text": "Fibrosis in the eye: general considerations. Fibrosis commonly refers to the response of a tissue to injury. The injury can occur as a result of a mechanical wound or various metabolic malfunctions, including responses to inflammation, ischemia, and degenerative disease. "}, {"url": "http://medical-dictionary.thefreedictionary.com/preretinal+macular+fibrosis", "passage_text": "Proliferation of glial cells over the surface of the internal limiting membrane of the macular region of the retina. Ophthalmoscopically the retina presents a glinting reflex. The condition may occur after trauma, eye surgery, retinal vascular disease (e.g. branch retinal vein occlusion) and inflammation and with any of the causes of retinitis proliferans and most commonly in elderly patients. Initially the patient is asymptomatic or reports some distortion of vision (metamorphopsia)"}, {"url": "https://nei.nih.gov/health/pucker/pucker", "passage_text": "A macular pucker is scar tissue that has formed on the eye’s macula, located in the center of the light-sensitive tissue called the retina. The macula provides the sharp, central vision we need for reading, driving, and seeing fine detail. A macular pucker can cause blurred and distorted central vision. Macular pucker is also known as epiretinal membrane, preretinal membrane, cellophane maculopathy, retina wrinkle, surface wrinkling retinopathy, premacular fibrosis, and internal limiting membrane disease. "}, {"url": "http://medical-dictionary.thefreedictionary.com/preretinal+membrane", "passage_text": "fibrosis, preretinal macular. Proliferation of glial cells over the surface of the internal limiting membrane of the macular region of the retina. Ophthalmoscopically the retina presents a glinting reflex. "}]