[{"url": "http://www.infoplease.com/askeds/does-shakespeare-have-any-living-descendants.html", "passage_text": "The Answer: No, there are no direct descendants of William Shakespeare living today. Shakespeare, and his wife Anne had three children: Susanna, who was born in 1583 and twins Judith and Hamnet, who were born in 1585. Hamnet, a boy, died in 1596 at 11 years of age. Judith married Thomas Quiney in 1616 and had three sons, one of whom died in infancy. The other two sons both died unmarried in 1639. There are, however, numerous descendants of Shakespeare's sister, Joan Hart, who are alive today and can claim some relationship to the great bard. This information was taken from the Shakespeare Birthplace Trust. —The Editors. 1  Calculator"}, {"url": "http://www.answers.com/Q/Are_direct_living_descendents_of_William_shakespeare_today", "passage_text": "Shem descendants are from the seed of Abraham, Isaac, and Jacob who was the father to the 12 tribes of Israel which today are wide spread from Central Asia-East Asia-North … America through Mexico, Central America and South America. Shakespeare, and his wife Anne had three children: Susanna, who was born in 1583 and twins Judith and … Hamnet, who were born in 1585. Hamnet, a boy, died in 1596 at 11 years of age. Susanna married John Hall in 1607 and had one child, Elizabeth, in 1608."}, {"url": "https://en.wikipedia.org/wiki/Joan_Shakespeare", "passage_text": "He had many descendants. By the 18th century Joan's descendants were identifying themselves as carrying the poet's family line. John Hart (1755–1800) was identified as the 6th descendant of the poet Shakespeare on his gravestone in Tewkesbury Abbey Churchyard, Gloucestershire. Joan Shakespeare (baptised 15 April 1569 – buried 4 November 1646) was the sister of William Shakespeare. She is the only member of the family whose known descendants continue down to the present day"}, {"url": "http://tracingancestors-uk.com/surnames/do-you-have-shakespeare-genealogy", "passage_text": "It is a sad fact that there are no direct living descendants of the great bard, William Shakespeare. The direct line ended with his grandchildren, but of course there is always the possibility that anyone with the surname SHAKESPEARE (with or without the first or last ‘E’) could have links higher up the tree. "}, {"url": "http://www.answers.com/Q/Are_direct_living_descendents_of_William_shakespeare_today", "passage_text": "Judith married Thomas Quiney in 1616 and had three sons, one of whom died in infancy. The other two sons both died unmarried in 1639. There are, however, numerous descendants of Shakespeare's sister, Joan Hart, who are alive today and can claim some relationship to the great bard. This information was taken from the Shakespeare Birthplace Trust. Shakespeare, and his wife Anne had three children: Susanna, who was born in 1583 and twins Judith and … Hamnet, who were born in 1585. Hamnet, a boy, died in 1596 at 11 years of age. Susanna married John Hall in 1607 and had one child, Elizabeth, in 1608."}, {"url": "http://www.answers.com/Q/Are_direct_living_descendents_of_William_shakespeare_today", "passage_text": "No, there are no direct descendants of William Shakespeare living today. Shakespeare, and his wife Anne had three children: Susanna, who was born in 1583 and twins Judith and … Hamnet, who were born in 1585. Hamnet, a boy, died in 1596 at 11 years of age. Susanna married John Hall in 1607 and had one child, Elizabeth, in 1608."}, {"url": "http://www.answers.com/Q/Does_Shakespeare_have_any_living_descendants", "passage_text": "Confidence votes 53.2K. We're actors; we're the opposite of people - Tom Stoppard. No, there are no direct descendants of William Shakespeare living today. Shakespeare, and his wife Anne had three children: Susanna, who was born in 1583 and twins Judith and Hamnet, who were born in 1585. Hamnet, a boy, died in 1596 at 11 years of age. The other two sons both died unmarried in 1639. There are, however, numerous descendants of Shakespeare's sister, Joan Hart, who are alive today and can claim some relationship to the great bard. This information was taken from the Shakespeare Birthplace Trust"}]