[{"url": "https://en.wikipedia.org/wiki/Pseudomonas_fluorescens", "passage_text": "It belongs to the Pseudomonas genus; 16S rRNA analysis has placed P. fluorescens in the P. fluorescens group within the genus, to which it lends its name. The word Pseudomonas means 'false unit', being derived from the Greek words pseudo (Greek: ψευδο 'false') and monas (Latin: monas, fr. Greek: μονάς/μονάδα 'a single unit'). The word was used early in the history of microbiology to refer to germs."}, {"url": "http://jcm.asm.org/content/36/10/2914.full", "passage_text": "Pseudomonas fluorescens and Pseudomonas putida are members of the fluorescent pseudomonad group (2). These organisms, unlike the well-known Pseudomonas aeruginosa, are generally considered to have a low level of virulence and to be of little clinical significance (1, 2, 13). ABSTRACT. From 7 to 24 March 1997, four patients developed Pseudomonas fluorescens bacteremia at the hospital; one on the oncology ward and the other three in the chemotherapy room."}, {"url": "http://microbewiki.kenyon.edu/index.php/Pseudomonas_putida", "passage_text": "Pseudomonas putida is a rod-shaped, flagellated, gram-negative bacterium that is found in most soil and water habitats where there is oxygen. It grows optimally at 25-30 C and can be easily isolated. In a recent study, Pseudomonas putida strains were compared to each other to determine the phylogenetic relationships. Because the Pseudomonas putida strain KT2440 genome is fully sequenced it serves as a standard reference to compare with other Pseudomonas putida strains."}, {"url": "https://en.wikipedia.org/wiki/Pseudomonas_putida", "passage_text": "Pseudomonas putida is a Gram-negative, rod-shaped, saprotrophic soil bacterium. Based on 16S rRNA analysis, P. putida was taxonomically confirmed to be a pseudomonas species (sensu stricto) and placed, along with several other species, in the P. putida group, to which it lends its name. Because it is a living organism, the patent was disputed and brought before the United States Supreme Court in the historic court case Diamond v. Chakrabarty which the inventor, Ananda Mohan Chakrabarty, won. It demonstrates a very diverse metabolism, including the ability to degrade organic solvents such as toluene."}, {"url": "http://microbewiki.kenyon.edu/index.php/Pseudomonas_putida", "passage_text": "Cell structure and metabolism. Pseudomonas putida is a rod-shaped, nonsporeforming, gram-negative bacteria that utilizes aerobic metabolism. This bacterium also has multiple polar flagella for motility. The flagella have a waveform that is usually 2 to 3 wavelengths long. In a recent study, Pseudomonas putida strains were compared to each other to determine the phylogenetic relationships. Because the Pseudomonas putida strain KT2440 genome is fully sequenced it serves as a standard reference to compare with other Pseudomonas putida strains."}, {"url": "https://en.wikipedia.org/wiki/Pseudomonas_putida", "passage_text": "A variety of P. putida, called multi-plasmid hydrocarbon-degrading Pseudomonas, is the first patented organism in the world. Because it is a living organism, the patent was disputed and brought before the United States Supreme Court in the historic court case Diamond v. Chakrabarty which the inventor, Ananda Mohan Chakrabarty, won. It demonstrates a very diverse metabolism, including the ability to degrade organic solvents such as toluene."}, {"url": "https://en.wikipedia.org/wiki/Pseudomonas_fluorescens", "passage_text": "Pseudomonas fluorescens is a common Gram-negative, rod-shaped bacterium. The word Pseudomonas means 'false unit', being derived from the Greek words pseudo (Greek: ψευδο 'false') and monas (Latin: monas, fr. Greek: μονάς/μονάδα 'a single unit'). The word was used early in the history of microbiology to refer to germs."}, {"url": "http://genome.jgi.doe.gov/psefl/psefl.home.html", "passage_text": "Pseudomonas fluorescens encompasses a group of common, nonpathogenic saprophytes that colonize soil, water and plant surface environments. As its name implies, it produces a soluble, greenish fluorescent pigment, particularly under conditions of low iron availability. "}, {"url": "http://web.mst.edu/~microbio/BIO221_2009/P_fluorescens.html", "passage_text": "Pseudomonas fluorescens Morgan Boresi Pseudomonas fluorescens is an obligate aerobe, gram negative bacillus. These bacteria are able to inhabit many environments, including: plants, soil, and water surfaces. Its name comes from its production of the soluble fluorescent pigment pyoverdin. "}, {"url": "http://en.citizendium.org/wiki/Pseudomonas_putida", "passage_text": "Pseudomonas putida are Gram-negative rod-shaped bacteria. They are classified as Group 1 in Pseudomona. Other Pseudomonads are being re-evaluated to see if they truly fall into this category, while P. putida is firmly place in this group. P. putida are flourescent, aerobic, non sporeforming, oxidase positive bacteria. In genetic terms, Pseudomonas putida is very similar to strains of Pseudomonas aeruginosa, an opportunistic human pathogen. Although there is a considerable amount of genome conservation, P. putida seems to be missing the key virulent segments that P. aeroginosa has."}]