[{"url": "http://www.huffingtonpost.com/2012/03/20/freezing-meat_n_1367941.html", "passage_text": "You might be surprised to find that frozen meat can last in the freezer for a long amount of time. We bet that a lot of good meat has been unnecessarily thrown out -- and that's just a shame. If you feel this might be you, take a moment to look over the meat guide below with information provided by the USDA."}, {"url": "http://foodpreservation.about.com/od/Freezing/a/How-Long-Can-I-Store-Food-In-The-Freezer.htm", "passage_text": "Note that these times only refer to how long your frozen food will still be of excellent quality when you finally get around to eating it: It's not a safety issue. Frozen food will safely keep in the freezer indefinitely. But its flavor and texture will be vastly better if you stick to these maximum storage times."}, {"url": "http://www.oprah.com/health/How-Long-to-Keep-Frozen-Food-Nutrition-Advice-from-Dr-Katz", "passage_text": "1 Fatty fish like salmon can be frozen for two to three months, while lean fish like cod or flounder will last up to six. 2  Cooked leftovers: three months. 3  Ground meat (beef, lamb, pork) keeps for two or three months; roasts, steaks, and chops can be kept frozen for at least half a year. 4  Leftovers: two to"}, {"url": "http://www.oprah.com/health/How-Long-to-Keep-Frozen-Food-Nutrition-Advice-from-Dr-Katz", "passage_text": "1 Cooked leftovers: three months. 2  Ground meat (beef, lamb, pork) keeps for two or three months; roasts, steaks, and chops can be kept frozen for at least half a year. 3  Leftovers: two to three months. 4  Fruits and vegetables can be frozen eight months to a year and still taste fine."}, {"url": "http://www.wisegeek.org/how-long-will-frozen-meat-stay-fresh.htm", "passage_text": "If there is a power outage, frozen meat should remain safe for approximately two days in a closed, full freezer and one day in a half-full, closed freezer. Theoretically, when meat is frozen correctly and maintained at the optimal freezing temperature, it should stay good forever. However, it is hard to guarantee, particularly with home freezing, that the meat will remain safe and of good quality for eating."}, {"url": "http://www.huffingtonpost.com/2012/03/20/freezing-meat_n_1367941.html", "passage_text": "And with the use of a zip-seal bag and a permanent marker, you can avoid wasting your good food. Before you put meat in the freezer, you should always write the date on it -- that way you don't have to question how long it's been frozen. And, believe it or not, some meats can last in the freezer for up to one year. 1  Cooked poultry -- 4 months. 2  Uncooked poultry parts -- 9 months."}]