[{"url": "http://diseasespictures.com/mrsa-infection/", "passage_text": "MRSA Infection. by admin Leave a Comment. MRSA infection is the abbreviated form of Methyicillin Resistant Staphylococcus Aureus infection. This infection is caused by bacteria and strangely it occurs only in people who are in health care centers and hospitals. Causes : Staph bacteria are the main cause for MRSA infection. They are found on the skin almost on every human race but not all of them are harmful. When there is any cut or injury on the skin, they invade the skin and penetrate inside the bloodstream."}, {"url": "http://www.nhs.uk/Conditions/MRSA/Pages/Symptoms.aspx", "passage_text": "Skin and soft tissue MRSA infections. If MRSA infects the skin, it can result in a wound infection, boil or abscess. If it infects the deeper layers of skin, it's known as cellulitis. Typical symptoms are: 1  redness. 2  swelling. 3  tenderness. 4  pain. 5  a discharge of pus."}, {"url": "http://www.medicinenet.com/mrsa_infection/article.htm", "passage_text": "MRSA infections facts. 1  MRSA means methicillin-resistant Staphylococcus aureus bacteria. 2  The majority of MRSA infections are classified as CA-MRSA (community acquired) or HA-MRSA (hospital-or health-care-acquired). "}, {"url": "http://www.mayoclinic.org/diseases-conditions/staph-infections/basics/symptoms/CON-20031418", "passage_text": "Skin infections caused by staph bacteria include: Boils. The most common type of staph infection is the boil, a pocket of pus that develops in a hair follicle or oil gland. The skin over the infected area usually becomes red and swollen. If a boil breaks open, it will probably drain pus. Also known as blood poisoning, bacteremia occurs when staph bacteria enter a person's bloodstream. A fever and low blood pressure are signs of bacteremia. The bacteria can travel to locations deep within your body, to produce infections affecting: 1  Internal organs, such as your brain, heart or lungs. 2  Bones and muscles."}, {"url": "http://www.medicalnewstoday.com/articles/10634.php", "passage_text": "Causes of MRSA. Ultimately MRSA is caused by bacterium strains that have acquired a resistance to particular antibiotics. MRSA can spread from person to person (skin-to-skin contact) and from person to object to person when an individual has active MRSA or is colonized by the bacteria. "}, {"url": "http://www.healthline.com/health/mrsa", "passage_text": "Symptoms of HA-MRSA. HA-MRSA can cause severe problems, such as pneumonia, urinary tract infections, sepsis, and bone infections. The symptoms of HA-MRSA include: 1  generalized feeling of ill health (malaise). 2  rash. 3  headaches. 4  muscle aches. 5  chills. 6  fever. 7  fatigue. 8  cough. MRSA (methicillin resistant staphylococcus aureus) is a type of staphylococcus bacteria (staph) that is resistant to beta-lactam antibiotics. MRSA is contagious and can cause life-threatening infection. MRSA isn’t found in the natural environment (soil or water)."}, {"url": "http://www.healthline.com/health/mrsa", "passage_text": "Symptoms and Signs of a MRSA Infection. The majority of MRSA infections remain restricted to the skin. HA-MRSA can cause severe illness, where the bacteria can spread to the blood, bones, and other tissue. MRSA (methicillin resistant staphylococcus aureus) is a type of staphylococcus bacteria (staph) that is resistant to beta-lactam antibiotics. MRSA is contagious and can cause life-threatening infection. MRSA isn’t found in the natural environment (soil or water)."}, {"url": "http://diseasespictures.com/mrsa-infection/", "passage_text": "The bacteria is potentially dangerous since they can penetrate deep into the skin infecting bones, joints and bloodstream. Causes : Staph bacteria are the main cause for MRSA infection. They are found on the skin almost on every human race but not all of them are harmful. When there is any cut or injury on the skin, they invade the skin and penetrate inside the bloodstream."}, {"url": "http://diseasespictures.com/mrsa-infection/", "passage_text": "Another category of MRSA infection occurs in healthy people also and it usually starts on those who have a skin puncture or boil. It is contagious and spreads through skin contact. Symptoms : People infected with staph infection will have red bumps or lesions that looks like boils or insect bites. Causes : Staph bacteria are the main cause for MRSA infection. They are found on the skin almost on every human race but not all of them are harmful. When there is any cut or injury on the skin, they invade the skin and penetrate inside the bloodstream."}]