[{"url": "http://careers.geico.com/office-locations/", "passage_text": "Nearby the sand and surf, GEICO's Virginia Beach office employs more than 2,300 associates within several company operations. In 2013, we were voted Best Insurance Company, Best Employer for Advancement and Benefits, and Most Enjoyable Place to Work. 1  Check out our Virginia Beach office."}, {"url": "http://www.insurancezing.com/geico/phone-number.html", "passage_text": "GEICO Insurance claims office phone number is there for the customers to report claims about their policy. GEICO claims phone number serves as the superior service to contact the claims department. The following is a list of the some of the GEICO claims telephone number."}, {"url": "http://www.800-numbers.net/geico/", "passage_text": "Below is a list of toll free 800 numbers for Geico customers and policy holders. Auto Insurance Sales & Service: 1-800-861-8380 (24/7). 1  Thank you for calling GEICO your call may be monitored and I will record it. 2  Please listen careful as our menu options have recently changed."}, {"url": "http://customerservice1800.com/geico-customer-service-espanol-insurance-phone-number-in-spanish", "passage_text": "GEICO. Geico offers the following phone number for customer service, contact Geico International. Geico insurance phone number in spanish .. Geico Customer Service en espanol; Geico Phone Number Customer Service in Spanish .."}, {"url": "http://customerservice1800.com/geico-customer-service-espanol-insurance-phone-number-in-spanish", "passage_text": "Any further information you may need, we recommend to visit the Geico Website. Tags: 1800 CUSTOMER SERVICE, Contact, Customer Care, Customer Service, Customer Service Consultant, Espanol, Español, Geico Geico, Contact Geico Customer, Service Geico Phone, Number, insurance, International Phone, Number, Spanish, TELEPHONE. usa"}, {"url": "http://www.insurancezing.com/geico/phone-number.html", "passage_text": "The policyholders can pay their premium by phone at 1-800-932-8872. GEICO customer service phone number is there for the customers to contact the customer service department, whenever the policyholders have any problems regarding the insurance products and services offered by them."}]