[{"url": "http://www.softschools.com/timelines/abraham_lincoln/timeline_5/", "passage_text": "Abraham Lincoln Timeline Timeline Description: This timeline will outline all of the major events that occurred during the lifetime of Abraham Lincoln. It will begin when he was born and end at his death. You will learn about who Abraham Lincoln was by reading through this timeline. He was one of America's heroes. Lincoln's biggest accomplishment was his emancipation of the slaves. Date Event 1809 Abraham Lincoln is born Lincoln was born in Kentucky on February 12th. This became known as Lincoln Day. 1817 Abraham Lincoln's family settled in Indiana The Lincoln family settled in Perry County, Indiana."}, {"url": "http://millercenter.org/president/lincoln/key-events", "passage_text": "Abraham Lincoln is inaugurated as the sixteenth President of the United States, and the nation's first Republican President. Many Southerners view his victory, determined by the free states, as the final blow in decades of sectional conflict. April 15, 1861. Abraham Lincoln - 04/17/1861: In response to Lincoln’s decision to use force in …. In response to Lincoln's decision to use force in South Carolina, Virginia secedes from the nation, followed by three other upper Southern states: North Carolina, Tennessee, and Arkansas."}, {"url": "http://millercenter.org/president/lincoln/key-events", "passage_text": "Abraham Lincoln - 04/15/1865: Abraham Lincoln dies at 7:22 a.m. in the home of W…. Abraham Lincoln dies at 7:22 a.m. in the home of William Petersen. Vice President Andrew Johnson is sworn in as the seventeenth President of the United States. April 15, 1861. Abraham Lincoln - 04/17/1861: In response to Lincoln’s decision to use force in …. In response to Lincoln's decision to use force in South Carolina, Virginia secedes from the nation, followed by three other upper Southern states: North Carolina, Tennessee, and Arkansas."}, {"url": "http://www.answers.com/Q/What_are_the_important_events_of_Abraham_Lincoln", "passage_text": "The most important events in Abraham Lincoln's life are: when his mother died at the age of 34 when he was only 9 years old due to the Milk Disease; When he freed the slaves w … ith the emancipation proclamation that freed all the slaves in any slave states, and when he was murdered at the booth theater. He also wrote a very important document called the Emancipation Proclamation which stated … that slaves would be freed in confederate territory, not in the north. Abraham Lincoln let slaves become free in 1866 and was the first president to lead the country into war."}, {"url": "http://www.answers.com/Q/What_are_the_important_events_of_Abraham_Lincoln", "passage_text": "One important thing that Abraham Lincoln did as president was to  order the Emancipation Proclamation. Issued on January 1, 1863,  this order called for the freedom of slave … s in the ten states still  in rebellion. 3 people found this useful. He also wrote a very important document called the Emancipation Proclamation which stated … that slaves would be freed in confederate territory, not in the north. Abraham Lincoln let slaves become free in 1866 and was the first president to lead the country into war."}, {"url": "https://en.wikipedia.org/wiki/Presidency_of_Abraham_Lincoln", "passage_text": "The assassination of Abraham Lincoln, one of the last major events in the Civil War, took place on Good Friday, April 14, 1865, when the President was shot while attending a performance of Our American Cousin at Ford's Theatre with his wife and two guests. Lincoln died early the next morning. As Lincoln's election became more probable, secessionists made it clear that their states would leave the Union. With his election on November 6, 1860, South Carolina declared its secession on December 20, followed by Mississippi, Florida, Alabama, Georgia, Louisiana, and Texas."}, {"url": "http://www.american-presidents-history.com/abraham-lincoln-timeline.html", "passage_text": "Abraham Lincoln Timeline. Abraham Lincoln Timeline. A lifetime of events for the 16th American President, both private and public. From his birth February 12, 1809 in Kentucky to Lincoln's untimely death by assassination. Lincoln was shot in the back of the head on April 14, 1865 by John Wilkes Booth and he died early the following morning."}, {"url": "http://www.timelinesoftware.com/Schedules/LincolnPresidency.html", "passage_text": "The war lasted through April 1865 and only days after the surrender Lincoln was fatally shot at Ford's theater. The Lincoln Presidency Timeline illustrates key events which occurred during the presidency of United States president Abraham Lincoln. Milestones Professional timeline software was used to create this timeline. Milestones Professional is a great product if you need Project Management Software. "}]