[{"url": "http://www.whfoods.com/genpage.php?tname=george&dbid=115", "passage_text": "Carbohydrates are are composed of carbon, hydrogen, and oxygen, which are arranged into small units called sugars, or monosaccharides. Small carbohydrates, like glucose or sucrose (table sugar) are composed of one or two sugar units, respectively, and are the molecules that give food a sweet taste. Plants store their energy by stringing together many glucose units into a long complex of several hundred to several thousand sugar (glucose) molecules. Plant foods that contain stored energy, for example seeds that must provide energy for the young plant when it starts growing, are high in starch."}, {"url": "https://answers.yahoo.com/question/index?qid=20101111083247AATzqKq", "passage_text": "They are formed from different basic elements. They are not soluble in water. They release less energy. The hydrogen-oxygen ratio is different. Starch is a monosaccharide. True False Glucose has _____ carbon atoms. 12 6 ... show more Select all that apply. Lipids differ frm carbs-The H:O ratio is different.. In some cases. The rest are wrong. Some lipids are insoluble in water, not all. Lipids release more energy per gram than carbs. Starch is a polysaccharide. Glucose has 6 Carbons. Its a hexose sugar. A"}, {"url": "http://www.answers.com/Q/Is_monosaccharides_a_starch", "passage_text": "They are the simple sugars in a carbohydrate (ex. glucose) All  carbohydrates, whether it be simple glucose or complex starch, are  classified as a sugar. To find the net carbs, you subtract the fiber from the total carbs to find net carbs. Sugar is the carbohydrate for quick energy and is also known as a simple carb. Starches are complex carbs meaning that they are long complex chains of simple sugars."}, {"url": "http://www.weegy.com/?ConversationId=526D01F9", "passage_text": "Weegy: begining ....present particle is formed by adding (ing) User: identify the appositive.. My dog, a German shepherd, is very well-trained. User: what is an appositive Weegy: An appositive is a noun or noun phrase that renames another noun right beside it. The appositive can be a short or long combination of words. [ Look at these examples: The insect, a cockroach, is crawling across the kitchen table. User: the breakdown of a polysaccharide into monosaccharides is an example of _____? User: the breakdown of a polysaccharide into monosaccharides is an example of _____?.. synthesis, decomposition, exchange, reversible."}, {"url": "http://www.foodinsight.org/Content/3862/FINAL%20Carbohydrate%20CPE%20Quiz%20with%20Answers.pdf", "passage_text": "Which of the following statements is not true of carbohydrates? a) They are the main source of energy for the body; b) They are comprised of carbon, hydrogen and oxygen; c) Types of carbohydrates include sugars, starches, and fiber; d) Carbohydrates are typically found in meats, chicken and fish. 2. Which of the following are examples of monosaccharides? a) glucose b) fructose c) maltose d) a & b only e) b & c only f) none of the above 4. Sucrose is an example of which type of sugar? a) monosacccharide b) disaccharide c) oligosaccharide d) none of the above 5."}, {"url": "http://www.whfoods.com/genpage.php?tname=george&dbid=115", "passage_text": "Disaccharides contain two monosaccharides (di=two) bonded together, and include sugars such as lactose (milk sugar), sucrose (table sugar), maltose and isomaltose (sugars formed from the breakdown of starch). Plants store their energy by stringing together many glucose units into a long complex of several hundred to several thousand sugar (glucose) molecules. Plant foods that contain stored energy, for example seeds that must provide energy for the young plant when it starts growing, are high in starch."}, {"url": "https://en.wikipedia.org/wiki/Polysaccharide", "passage_text": "They may be amorphous or even insoluble in water. When all the monosaccharides in a polysaccharide are the same type, the polysaccharide is called a homopolysaccharide or homoglycan, but when more than one type of monosaccharide is present they are called heteropolysaccharides or heteroglycans. Polysaccharides contain more than ten monosaccharide units. Definitions of how large a carbohydrate must be to fall into the categories polysaccharides or oligosaccharides vary according to personal opinion."}, {"url": "https://en.wikipedia.org/wiki/Monosaccharide", "passage_text": "Some monosaccharides have a sweet taste. Examples of monosaccharides include glucose (dextrose), fructose (levulose) and galactose. Monosaccharides are the building blocks of disaccharides (such as sucrose and lactose) and polysaccharides (such as cellulose and starch)."}, {"url": "http://www.healthy-eating-support.org/carbohydrates-quiz-answers.html", "passage_text": "TRUE or FALSE Question #2. Fruits and vegetables are carbohydrates. Answer: True. Fruits, vegetables and grains are all carbohydrates. TRUE or FALSE Question #3. Table sugar is a complex carbohydrate. Answer: FALSE. Table sugar is a simple carb, as are most sweeteners. Complex carbs are starches and fibers. They can be called polysaccharides (“many sugars”) and are composed of long chains of monosaccharides, (sugars) that can either be straight or branched"}, {"url": "https://en.wikipedia.org/wiki/Polysaccharide", "passage_text": "Their function in living organisms is usually either structure-or storage-related. Starch (a polymer of glucose) is used as a storage polysaccharide in plants, being found in the form of both amylose and the branched amylopectin. In animals, the structurally similar glucose polymer is the more densely branched glycogen, sometimes called 'animal starch'. Polysaccharides contain more than ten monosaccharide units. Definitions of how large a carbohydrate must be to fall into the categories polysaccharides or oligosaccharides vary according to personal opinion."}]