[{"url": "https://en.wikipedia.org/wiki/Araucana", "passage_text": "An Araucana egg (left) with white and brown eggs for comparison. The Araucana or Spanish: Gallina Mapuche is a breed of chicken originating in Chile. It is well known for its blue eggs, which has been a subject of controversy regarding whether or not the breed was developed from birds that arrived pre or post Columbian. "}, {"url": "http://www.mypetchicken.com/chicken-breeds/Ameraucana-B5.aspx", "passage_text": "Ameraucana. The Ameraucana breed was derived from blue egg laying chickens, but they do not have the breeding problems inherent to Araucanas. In addition, rather than ear tufts, they have muffs and a beard, and are very hardy and sweet. They lay eggs in shades of blue, and even have blue (or slate) legs. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080622084705AAILUUo", "passage_text": "Araucanas, whilst hardy birds, generally go off the lay in the late autumn / winter (November to March??). You might get an egg a week or less. They lay more frequently (4-5 per week) in the spring/summer. They are lovely birds with unusual green or blue-shelled eggs and definitely worth keeping. Source(s): I keep hens. So you could safely say that after the start laying, you would get between 300-365 eggs in a year, but don't expect 365, cause they might need a break, or any of the above conditions. P.S. regardless of the breed of chicken, they generally lay an egg a day"}, {"url": "http://www.answers.com/Q/How_many_eggs_does_the_Ameraucana_chicken_breed_lay_per_year", "passage_text": "o ton they lay about 260 eggs a day. Most chickens lay about one egg per day. After the chicken gets around one year old they start to produce less eggs. Chickens do not p … roduce eggs every day. A good hen will produce 320 to 340 per yesr. The best breeds of hen lay once per 24 hour period, many breeds take more time to lay each egg and some breeds only lay one or two eggs per week. The answer you seek would ver … y much depend on the breed of chicken you refer to."}, {"url": "http://howtokeepchickens.co/how-to-keep-chickens/different-types-of-chickens/ameraucana-chickens/", "passage_text": "Good Layers. Ameraucana Chickens are one of the better egg laying chicken breeds because of their extended laying season. It lasts and impressive 10-11 months of the year. Despite the length of their laying season however Ameraucana chickens do have a tendency to go broody. "}, {"url": "http://www.answers.com/Q/How_many_eggs_does_the_Ameraucana_chicken_breed_lay_per_year", "passage_text": "Retired in 2005, breeding Araucana chickens. So many factors influence the rate of lay of any breed but the Ameraucana is a good layer. Given prime conditions they can produce up to 250+ eggs per year. Health, age, feed, housing, light, space and even contentment can be major factors in each hens production. The best breeds of hen lay once per 24 hour period, many breeds take more time to lay each egg and some breeds only lay one or two eggs per week. The answer you seek would ver … y much depend on the breed of chicken you refer to."}, {"url": "http://www.answers.com/Q/How_many_eggs_do_araucanas_lay", "passage_text": "Retired in 2005, breeding Araucana chickens. Good healthy well cared for Araucana hens will lay 200 + eggs per year. Araucana's slow egg laying somewhat during the yearly molt but will often continue offering an egg every second day for the six week molting. It varies according to the species. Some species only lay a single egg. Others lay up to 30. Even within some species there can be considerable variation-for example, … Testudo hermanni boettgeri (the eastern or balkan Hermann's tortoise) usually lays between 6-10 eggs."}, {"url": "https://en.wikipedia.org/wiki/Ameraucana", "passage_text": "The Ameraucana is an American breed of domestic chicken developed in the United States in the 1970s. It derives from Araucana chickens brought from Chile and was bred to retain the blue-egg gene but eliminate the lethal alleles of the parent breed. The breed has both large fowl and bantam varieties. The Ameraucana is one of the few chicken breeds to lay blue eggs. It shows many similarities to the Araucana, including the pea comb and the blue egg gene. It is tailed, muffed and bearded, whereas the Araucana in the United States has earmuffs and is rumpless."}]