[{"url": "http://www.rocktape.com/products/tape/", "passage_text": "RockTape is the world’s best kinesiology tape. It can be used to treat sports and non-sports injuries, including shin splints, plantar fasciitis, runner’s knee and back pain. RockTape microscopically lifts the skin away from the muscle and fascia below, which decompresses the area and promotes blood flow."}, {"url": "http://www.rocktape.com/products/tape/", "passage_text": "RockTape H20 is the world’s best kinesiology tape made even stickier to meet the demands of top athletes and austere environments. It can be used to treat sports and non-sports injuries, including shin splints, plantar fasciitis, runner’s knee and back pain."}, {"url": "http://www.physioworks.com.au/Injuries-Conditions/Treatments/Kinesiology_Taping", "passage_text": "Kinesiology Tape. Kinesiology tape is a thin, stretchy, elastic cotton strip with an acrylic adhesive. Therapeutic kinesiology tape that can benefit a wide variety of musculoskeletal and sports injuries, plus inflammatory conditions."}, {"url": "http://www.physioworks.com.au/Injuries-Conditions/Treatments/How_to_use_kinesio_tape", "passage_text": "Preparing Your Kinesiology Tape. If using a roll of kinesiology tape round every corner when cutting to prevent edges from peeling prematurely. Avoid touching the adhesive side of the tape after removing the backing. 1  Apply anchor end (no tension). 2  Apply therapeutic tension (as instructed by your physiotherapist). 3"}, {"url": "http://www.physioworks.com.au/Injuries-Conditions/Treatments/Kinesiology_Taping", "passage_text": "Kinesiology tape is almost identical to human skin in both thickness and elasticity, which allows kinesio tape to be worn without binding, constricting or restriction of your movement. Kinesiology tape is an that is used for treating athletic injuries and a variety of physical disorders. For the first decade after its introduction practitioners in Japan were the main users of the therapeutic kinesiology tape."}, {"url": "http://www.physioworks.com.au/Injuries-Conditions/Treatments/How_to_use_kinesio_tape", "passage_text": "Precautions for Kinesiology Tape. Do not apply kinesiology tape on any skin surface that is damaged or broken. Individuals with known sensitive skin should apply a sensitive skin test piece for up to 24 hours before a full taping."}]