[{"url": "http://www.thefreedictionary.com/sodium+tripolyphosphate", "passage_text": "Noun. 1. sodium tripolyphosphate-a sodium salt of triphosphoric acid used as a builder in soaps and detergents. builder, detergent builder-a substance added to soaps or detergents to increase their cleansing action. "}, {"url": "https://en.wikipedia.org/wiki/Sodium_triphosphate", "passage_text": "Sodium triphosphate (STP), also sodium tripolyphosphate (STPP), or tripolyphosphate (TPP),) is an inorganic compound with formula Na 5 P 3 O 10. It is the sodium salt of the polyphosphate penta-anion, which is the conjugate base of triphosphoric acid. It is produced on a large scale as a component of many domestic and industrial products, especially detergents. Environmental problems associated with eutrophication are attributed to its widespread use."}, {"url": "http://www.merriam-webster.com/dictionary/sodium%20tripolyphosphate", "passage_text": "Definition of SODIUM TRIPOLYPHOSPHATE. : a crystalline salt Na5P3O10 that is used as a food additive and as a component in some detergents and is suspected of contributing to water pollution. ADVERTISEMENT."}, {"url": "https://uriahsweety.wordpress.com/what-are-common-uses-of-sodium-tripolyphosphatestpp/", "passage_text": "Other Uses As a builder, sodium tripolyphosphate mainly is used in detergents and soaps. This includes dishwasher detergents as well as laundry detergents. It is used in most gel, liquid, tablet, and powder forms of each type of detergent. A Powerful Cleaning Agent Sodium tripolyphosphate(Na5P3O10) is a strong cleaning ingredient that typically can rid dishes and fabrics of soil and spots. Its key function is that it allows surfactants to work at their full potential. Also, it prevents deposition of soil and acts as a pH buffer."}, {"url": "http://www.foodchemadditives.com/products/sodium-tripolyphosphate", "passage_text": "Sodium Tripolyphosphate, CAS# 7758-29-4, is a sodium salt of Phosphoric Acid, available as WHITE GRANULAR. Sodium Tripolyphosphate is widely used as Preservative and Emulsifier in food production. It is widely accepted as safe food additive in many countries. As a Preservative and Emulsifier, Sodium Tripolyphosphate can be used in a wide variety of industries including: food production, beverage, pharmaceutical, agriculture/animal feed, and various other industries. Read more. 1."}, {"url": "https://uriahsweety.wordpress.com/what-are-common-uses-of-sodium-tripolyphosphatestpp/", "passage_text": "Sodium tripolyphosphate(STPP), also known as pentasodium triphosphate, pentasodium tripolyphosphate or sodium triphosphate, is used in a wide range of applications in the manufacture of cleaning products and food preservatives as well as in water treatment facilities. A Powerful Cleaning Agent Sodium tripolyphosphate(Na5P3O10) is a strong cleaning ingredient that typically can rid dishes and fabrics of soil and spots. Its key function is that it allows surfactants to work at their full potential. Also, it prevents deposition of soil and acts as a pH buffer."}, {"url": "https://www.chefsteps.com/ingredients/sodium-tripolyphosphates", "passage_text": "description. Sodium tripolyphosphate (STPP) is an alkaline salt that will raise the pH of meats and seafood, enough to increase their water-holding capacity. STP, STPP. culinary uses. STPP is used as a preservative for poultry, meat, and seafood. It is also added, along with other sodium polyphosphates, to processed cheeses as an emulsifier."}, {"url": "http://www.wisegeek.org/what-is-sodium-tripolyphosphate.htm", "passage_text": "These 10 animal facts will amaze you. Sodium tripolyphosphate (STPP) is a chemical that has many uses in industry, ranging from an ingredient in cleaning products to a food preservative. Because sodium tripolyphosphate can improve the appearance of seafood like shrimp and scallops, there is some concern that unscrupulous salespeople may sell products that are not fresh to consumers who cannot see the signs that the items have started to go bad."}, {"url": "http://www.healththroughdiet.com/watch-out-for-sodium-tropolyphosphate-on-raw-seafood-at-the-grocery-store/", "passage_text": "Sodium Tripolyphosphate is approved by the Food and Drug Administration as a food preservative. It helps retain moisture. That helps products look good longer and keep selling weight higher. It is used in many other things, like detergent and antifreeze, for instance, and it’s in many cleaning products. "}]