[{"url": "http://www.medicinenet.com/endometrial_ablation/article.htm", "passage_text": "1 Endometrial ablation is the surgical destruction of the lining tissues of the uterus. 2  Endometrial ablation is one type of treatment for abnormal uterine bleeding that is due to a benign (non-cancerous) condition. 3  Endometrial ablation must not be performed if pregnancy is desired in the future. Endometrial ablation facts. 1 "}, {"url": "http://www.heartandstroke.com/site/c.ikIQLcMWJtE/b.3831747/k.57D4/Heart_disease__Ablation.htm", "passage_text": "Ablation is a procedure for restoring normal heart rhythm, particularly if the irregular rhythm has not responded to medication. Usually, the heart beats between 60 and 80 times a minute. The pumping action of your heart is triggered by electrical impulses. "}, {"url": "http://www.getsmartaboutafib.com/cardiac-ablation", "passage_text": "Catheter ablation is a non-surgical procedure that is performed by an electrophysiologist (EP). An EP is a cardiologist who focuses exclusively on the diagnosis and treatment of arrhythmias and determines where the abnormal tissue in your heart is located. Cardiac ablation is a nonsurgical procedure that involves two key stages: mapping and ablation. First, a ‘map’ of your heart is made using catheters to identify the location of the abnormal electrical signal that is causing your arrhythmia."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Arrhythmia/PreventionTreatmentofArrhythmia/Ablation-for-Arrhythmias_UCM_301991_Article.jsp", "passage_text": "Catheter ablation is a procedure that uses radiofrequency energy (similar to microwave heat) to destroy a small area of heart tissue that is causing rapid and irregular heartbeats. Destroying this tissue helps restore your heart’s regular rhythm. The procedure is also called radiofrequency ablation. 1 Catheter ablation is a low-risk procedure that is successful in about 90 percent of the people who have it. 2  This procedure takes place in a special hospital room called an electrophysiology (EP) lab or a cardiac catheterization (cath) lab. 3  It takes 2 to 4 hours."}, {"url": "http://www.webmd.com/women/endometrial-ablation-16200", "passage_text": "Guide. Endometrial ablation is a procedure that destroys (ablates) the uterine lining, or endometrium. This procedure is used to treat abnormal uterine bleeding. Sometimes a lighted viewing instrument (hysteroscope) is used to see inside the uterus. Endometrial ablation can be done by: 1  Laser beam (laser thermal ablation). 2  Heat (thermal ablation), using: 3  Radiofrequency."}, {"url": "http://www.mayoclinic.org/tests-procedures/endometrial-ablation/basics/definition/PRC-20014190", "passage_text": "Endometrial ablation is a procedure that surgically destroys (ablates) the lining of your uterus (endometrium). The goal of endometrial ablation is to reduce menstrual flow. In some women, menstrual flow may stop completely. No incisions are needed for endometrial ablation. "}, {"url": "http://www.ehow.com/about_5147793_ablation-surgery.html", "passage_text": "Definition of Ablation Surgery. Ablation surgery is a procedure to destroy abnormal tissues. It is often used in patients who have extra tissue in their hearts that creates abnormal electrical impulses."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/ablation/", "passage_text": "Catheter ablation (ab-LA-shun) is a medical procedure used to treat some types of arrhythmia (ah-RITH-me-ah). An arrhythmia is a problem with the rate or rhythm of the heartbeat. During catheter ablation, a series of catheters (thin, flexible wires) are put into a blood vessel in your arm, groin (upper thigh), or neck. "}, {"url": "http://www.mayoclinic.org/tests-procedures/cardiac-ablation/basics/definition/prc-20022642", "passage_text": "Cardiac ablation is a procedure that can correct heart rhythm problems (arrhythmias). Ablation usually uses long, flexible tubes (catheters) inserted through a vein in your groin and threaded to your heart to correct structural problems in your heart that cause an arrhythmia. Cardiac ablation works by scarring or destroying tissue in your heart that triggers an abnormal heart rhythm. In some cases, ablation prevents abnormal electrical signals from traveling through your heart and, thus, stops the arrhythmia. Cardiac ablation is sometimes done through open-heart surgery, but it's often done using catheters, making the procedure less invasive and shortening recovery times. 1  Why it's done."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/gynecology/endometrial_ablation_92,P07774/", "passage_text": "Endometrial ablation is a procedure to permanently remove a thin tissue layer of the lining of the uterus to stop or reduce excessive or abnormal bleeding in women for whom childbearing is complete. The lining of the uterus is called the endometrium. "}]