[{"url": "http://legal-dictionary.thefreedictionary.com/Fourth+Amendment", "passage_text": "The Fourth Amendment was intended to create a constitutional buffer between U.S. citizens and the intimidating power of law enforcement. It has three components. First, it establishes a privacy interest by recognizing the right of U.S. citizens to be secure in their persons, houses, papers, and effects.."}, {"url": "http://constitutioncenter.org/interactive-constitution/amendments/amendment-iv", "passage_text": "The primary concerns of the generation that ratified the Fourth Amendment were “general warrants” and “writs of assistance.” Famous incidents on both sides of the Atlantic gave rise to placing the Fourth Amendment in the Constitution."}, {"url": "http://thebillofrights4thamendment.weebly.com/history.html", "passage_text": "The 4th Amendment, one of the most contraversial amendments ever drafted, was added to the Bill of Rights on December 15, 1791. The idea of being secure in your home, however, goes back into the Pre-Revolutionary period."}, {"url": "http://thebillofrights4thamendment.weebly.com/history.html", "passage_text": "The History of the 4th Amendment. The 4th Amendment, one of the most contraversial amendments ever drafted, was added to the Bill of Rights on December 15, 1791. The idea of being secure in your home, however, goes back into the Pre-Revolutionary period."}, {"url": "http://legal-dictionary.thefreedictionary.com/Fourth+Amendment", "passage_text": "The U.S. Supreme Court, in United States v. Knights, 534 U.S.112, 122 S. Ct. 587, 151 L. Ed.2d 497 (2002), declined to issue a bright-line rule on this dispute but concluded that when police have reasonable suspicion and the probation agreement authorizes searches, the search is reasonable under the Fourth Amendment."}, {"url": "http://www.loc.gov/law/help/citizenship/fourteenth_amendment_citizenship.php", "passage_text": "Citizenship is defined in the first clause of the first section of the Fourteenth Amendment as: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and the State wherein they reside. The amendment's language was drafted by the Joint Committee on Reconstruction. The language defining citizenship was not in the introduced version of the amendment (H. J. Res. 127), but, was moved by Senator Howard of Michigan on May 30, 1866. It was adopted by the Senate that day and later adopted by the House."}]