[{"url": "http://www.rubythroat.org/questionsnesteggs01.html", "passage_text": "1 In the Ruby-throated Hummingbird, incubation--which is done only by the female--usually lasts 16-18 days, sometimes longer during cool weather. 2  She typically lays one egg, skips a day, and then lays a second; incubation does not start until both eggs are laid. The best way to find a hummer nest is to wait for the female to lead you to it. This may not work, however, since the nest can be up to 1.5km or more from a good feeding area. Among Ruby-throated Hummingbirds, nests may be in hardwoods or evergreens from about one to 20 meters (three to 60 feet) from the ground."}, {"url": "http://hummingbirdmarket.com/hummingbird_articles/raising_baby_hummingbirds.html", "passage_text": "Incubation begins as soon as the eggs are laid. There are a few erroneous reports of an incubation period of only 9 - 12 days. Since the incubating female must leave frequently to forage for her own food, as well as additional nesting materials, incubation takes longer than expected for such tiny eggs. Realistically, it takes about 14 - 17 days and sometimes up to 23 days of incubation before they hatch. If the weather turns nasty, it extends the incubation period. Once the eggs hatch, the almost impossibly small hummingbird babies emerge naked, totally helples"}, {"url": "http://www.rubythroat.org/RTHUReproductionMain.html", "passage_text": "Up to Top of Page. Incubation lasts about 14-16 days--perhaps as long as 21 days in cool weather--during which time the female Ruby-throated Hummingbird is on the nest for about 50-55 minutes out of each hour. When the chicks hatch, they are about 2cm long, altricial (naked), and with very short bills. After spending the winter months in Mexico or Central America, male Ruby-throated Hummingbirds (Archilochus colubris) typically arrive in the United States and Canada beginning in late March--earlier along the Gulf Coast, later in New England and Canada."}, {"url": "http://www.wildbirdsonline.com/a_raisingbabyhbirds2.htm", "passage_text": "Part 2. Incubation begins as soon as the eggs are laid. There are a few erroneous reports of an incubation period of only 9 - 12 days. Since the incubating female must leave frequently to forage for her own food, as well as additional nesting materials, incubation takes longer than expected for such tiny eggs."}, {"url": "http://www.hummingbirdsformom.com/dear_mom/the-gestation-period-of-hummingbird-eggs/", "passage_text": "The answer is because the female hummingbird will not start incubating the eggs until both of them have been laid. The incubation period for hummingbird last usually between 16-18 days, but it can last as long as three weeks if the weather at the time is cooler then usual. The female hummingbird tries to maintain the temperature of the nest at about 96 degrees. So in general, the gestation period of hummingbird eggs is between two and three weeks, depending on the circumstances which are happening at the time. A hummingbird eggs will be white in color and only about the size of a pea or jelly bean."}, {"url": "http://www.hummingbirdworld.com/h/qa/incubation_time.htm", "passage_text": "How long does a mother hummingbird sit on the eggs? How long will it be until they leave the nest after they hatch? - Brian A Dear Brian,It takes about 13-22 days for the eggs to hatch. (It takes longer for some species than for others.) The young birds leave the nest in 19-29 days. (This also depends on the species.) Larry & Terrie."}, {"url": "http://www.wildbirdsonline.com/a_raisingbabyhbirds2.htm", "passage_text": "Realistically, it takes about 14 - 17 days and sometimes up to 23 days of incubation before they hatch. If the weather turns nasty, it extends the incubation period. Once the eggs hatch, the almost impossibly small hummingbird babies emerge naked, totally helpless. There are a few erroneous reports of an incubation period of only 9 - 12 days. Since the incubating female must leave frequently to forage for her own food, as well as additional nesting materials, incubation takes longer than expected for such tiny eggs."}, {"url": "http://wildbirdsonline.com/articles_hummingbirdnesting.html", "passage_text": "These foraging trips may contribute to the relatively long incubation period for such small eggs. In general, the minimal incubation period is from 14 to 17 days, but may be prolonged by inclement weather or harsh nesting conditions. The Andean Hillstar takes 20 to 23 days to incubate its eggs. Incubation of eggs In many cases, the female begins to incubate her eggs as soon as the first one is laid. Usually the eggs are laid in the morning, about 48 hours apart. However, this can vary from 24 to 72 hours. The eggs hatch in approximately the same time sequence as they were laid."}, {"url": "http://www.hummingbirdsformom.com/dear_mom/the-gestation-period-of-hummingbird-eggs/", "passage_text": "Since it is quite difficult to locate a hummingbird’s nest and therefore most of us may never see one for ourselves, I thought I would share with you some information about the hummingbird’s eggs and the length of their gestation period. In most cases, a female hummingbird will lay two eggs. So in general, the gestation period of hummingbird eggs is between two and three weeks, depending on the circumstances which are happening at the time. A hummingbird eggs will be white in color and only about the size of a pea or jelly bean."}]