[{"url": "http://www.worldweatheronline.com/Rio-De-Janeiro-weather-averages/Rio-De-Janeiro/BR.aspx", "passage_text": "Rio in the Winter. Rio's winter climate runs between June and September, and this is the ideal time to visit if you don't do well with extreme heat. It's still very warm at this time of the year, with average highs of around 24°C and nights at a balmy 18°C, but the humidity is lower and visitors feel more comfortable."}, {"url": "https://weatherspark.com/averages/33421/Rio-de-Janeiro-Brazil", "passage_text": "This report describes the typical weather at the Rio de Janeiro-Galeao Galeão International (Airport rio De, Janeiro) brazil weather station over the course of an average. Year it is based on the historical records from 1974 to. 2012 earlier records are either unavailable or. unreliable"}, {"url": "http://www.rio-de-janeiro.climatemps.com/temperatures.php", "passage_text": "Average Temperatures in Rio De Janeiro, Brazil. 1  The mean temperature in Rio De Janeiro, Brazil is fairly hot at 23.7 degrees Celsius (74.7 degrees Fahrenheit). 2  There is a range of mean monthly temperatures of 5.2 C (9.4 F) which is a very low range. 3  The range/ variation of daily average temperatures is 6.2 C (11.2 F)."}, {"url": "https://weatherspark.com/averages/33372/12/Rio-de-Janeiro-Brazil", "passage_text": "Rio de Janeiro has a tropical savanna climate with dry winters. The area within 25 mi of this station is covered by oceans and seas (34%), croplands (31%), built-up areas (22%), forests (7%), and grasslands (6%)."}, {"url": "http://www.weather2travel.com/climate-guides/brazil/rio-de-janeiro.php", "passage_text": "The Rio de Janeiro, Brazil climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine."}, {"url": "https://weatherspark.com/averages/33421/Rio-de-Janeiro-Brazil", "passage_text": "Earlier records are either unavailable or unreliable. Rio de Janeiro has a tropical savanna climate with dry winters. The area within 25 mi of this station is covered by croplands (33%), oceans and seas (27%), built-up areas (23%), forests (11%), and grasslands (7%)."}, {"url": "http://www.holiday-weather.com/rio_de_janeiro/averages/", "passage_text": "Rio de Janeiro: Annual Weather Averages. January is the hottest month in Rio de Janeiro with an average temperature of 27°C (81°F) and the coldest is July at 21°C (69°F) with the most daily sunshine hours at 9 in February. The wettest month is February with an average of 13.8mm of rain."}]