[{"url": "https://en.wikipedia.org/wiki/Global_Entry", "passage_text": "To enroll in Global Entry, applicants must first file an application with Customs and Border Protection, and then submit to an interview and background check. There is a $100 non-refundable fee for the application. During the interview, the applicant's fingerprints are captured and a digital photo is taken. Global Entry is a program being piloted by U.S. Customs and Border Protection that allows pre-approved, low-risk travelers to receive expedited clearance upon arrival into the United States. As of December 2014, Global Entry was available at 42 U.S. airports and 12 preclearance locations."}, {"url": "http://travel.stackexchange.com/questions/6520/what-to-expect-at-a-global-entry-application-interview", "passage_text": "up vote 10 down vote favorite. I applied for the Global Entry program a couple of days ago, and I noticed a few mentions throughout the application process to an interview that I would need to schedule as part of the process. "}, {"url": "http://thepointsguy.com/2013/05/seriously-get-global-entry-already-faq-ways-to-get-it-for-free/", "passage_text": "The application process takes about 10 minutes and you get an email confirmation. Then within usually about a week to 10 days (though it can be as quick as just 1-2 days), you get an email that lets you know you are conditionally approved. It costs $100 and is good for 5 years. However, if you have the Amex Platinum, Mercedex-Benz Platinum or Business Platinum (or Centurion) cards, the fee is refunded to you as a statement credit."}, {"url": "http://travel.stackexchange.com/questions/4020/how-long-does-it-take-for-a-global-entry-application-to-be-approved", "passage_text": "1. The U.S. Customs and Border Protection runs a program called Global Entry, allowing low-risk travelers to complete an application, submit to a background check and interview, and eventually be approved for a fast lane through immigration and customs when arriving in the US from a foreign destination. Although they say The process may take 4-6 weeks , when I did it, it only took a couple of weeks after submitting my application. At that point I had to make an appointment to go down to the airport for an interview. I was able to find an appointment date easily."}, {"url": "http://justwanderlustblog.com/2014/03/global-entry-what-is-it-my-experience-applying-tips/", "passage_text": "Had I known that sooner, I might have applied for Global Entry a long time ago! As a quick note, the application fee for Global Entry is $100 which is non-refundable and independent of whether or not you’re approved. If approved, you can use Global Entry for 5 years. In comparison, TSA Pre-Check costs $85 to apply and is also good for 5 years. Essentially, by paying an extra $15 (or $3/year) you’re getting the additional benefit of expedited security screening which I’d value at way higher than $3/year! I have long heard of Global Entry but I never applied because: 1) the $100 application fee always deterred me, and 2) I usually sit towards the front of the plane and make a habit of speeding out of the plane so that I’m one of the first in line for passport control anyway. I never wait that long."}, {"url": "http://thepointsguy.com/2013/05/seriously-get-global-entry-already-faq-ways-to-get-it-for-free/", "passage_text": "American Express is not the only kid in town giving free Global Entry-if you have the new Citi Prestige card, you also get the fee refunded, and if you are a United Global Services, Premier 1K or Platinum, United will also refund you. How to Apply. It costs $100 and is good for 5 years. However, if you have the Amex Platinum, Mercedex-Benz Platinum or Business Platinum (or Centurion) cards, the fee is refunded to you as a statement credit."}, {"url": "http://millionmilesecrets.com/2015/02/03/how-to-get-a-quicker-global-entry-appointment/", "passage_text": "Bottom Line. With Global Entry you can get through security and customs faster. Global Entry costs $100 and is valid for 5 years. But if you have a card like the American Express Mercedes-Benz Platinum you can get your fee refunded! You may have to wait months for an appointment at a Global Entry center near you. But you may be able to get in quicker at another center in a city you’re traveling to. You can get through security and US customs faster when you have Global Entry. Global Entry Lets You Skip the Long Lines. Sometimes you may have to wait months before you can get an interview at your closest Global Entry center. But there’s a way you can get an appointment quicker!"}, {"url": "http://thepointsguy.com/2013/08/1-things-you-didnt-know-about-global-entry/", "passage_text": "Global Entry is the US government’s expedited immigration program for frequent travelers and helps speed travelers through customs and immigration without having to wait in hours’-long lines that makes the $100 fee (which might be waived if you carry the right credit card – read more below!) more than worth it. Even if you do pay for Global Entry, the $100 is well worth it because of the time saved both in security screening and immigrations lines and it’s one of the top travel tools out there for frequent flyers."}]