[{"url": "http://adele.wikia.com/wiki/Make_You_Feel_My_Love_(song)", "passage_text": "Make You Feel My Love is a song originally recorded by Bob Dylan for his 1997 album Time Out of Mind. In 2008, it was covered by Adele for her debut album, 19. The original studio recording was used for Songs for Japan; the album was criticized for using pre-recorded and previously released songs with the exception of a remix of Lady Gaga 's Born This Way. A live version of Make You Feel My Love, from WXPN, was released on Chimes of Freedom."}, {"url": "http://www.answers.com/Q/Who_wrote_the_song_'To_Make_You_Feel_My_Love'", "passage_text": "Confidence votes 261K. Bob Dylan wrote the song, 'To Make You Feel My Love'. This song is featured on 1997 album 'Time Out of Mind'. Billy Joel also released a version of 'To Make You Feel My Love' in the same year of 1997."}, {"url": "https://en.wikipedia.org/wiki/Make_You_Feel_My_Love", "passage_text": "In 2008, English recording artist Adele recorded Make You Feel My Love for her debut studio album 19 (2008). It was released as the album's fifth and final single on October 27, 2008, both on CD and vinyl, peaking at number 4 on the UK Singles Chart. Garth Brooks covered the song as To Make You Feel My Love in 1998. It appeared on the soundtrack of the 1998 film Hope Floats, along with a cover version by Trisha Yearwood as the first and last tracks."}, {"url": "http://www.youtube.com/watch?v=SJfnDeQsTqQ", "passage_text": "The song was featured on the soundtrack of the 1998 film Hope Floats, In 1997, Billy Joel covered the song as To Make You Feel My Love for his compilation album Greatest Hits Volume III. It was released as the first single from the album and reached #50 on the U.S. Billboard Hot 100. Garth Brooks covered the song. Joel's single was the first recording of the song ever to be released. I did what's in me. What this song feels to me inside my heart Hope ya like it my friends ....Thanks for watching..........Carl. Make You Feel My Love is a song written by Bob Dylan that appeared on his 1997 album Time Out of Mind."}, {"url": "http://adele.wikia.com/wiki/Make_You_Feel_My_Love_(song)", "passage_text": "315 pages on this wiki. Make You Feel My Love is a song originally recorded by Bob Dylan for his 1997 album Time Out of Mind. In 2008, it was covered by Adele for her debut album, 19. It was released as the album's fourth and final single on November 3, 2008. The original studio recording was used for Songs for Japan; the album was criticized for using pre-recorded and previously released songs with the exception of a remix of Lady Gaga 's Born This Way. A live version of Make You Feel My Love, from WXPN, was released on Chimes of Freedom."}, {"url": "http://www.last.fm/music/Adele/_/Make+You+Feel+My+Love", "passage_text": "Make You Feel My Love was originally written and performed by Bob Dylan. This is Adele's favourite song on 19 according to the Make You Feel My Love Songfacts. Originally recorded by Bob Dylan for his 1997 album 'Time Out Of Mind', 'Make You Feel My Love' first became a top thirty hit for twenty-two year old Adele Adkins two years ago."}, {"url": "https://en.wikipedia.org/wiki/Make_You_Feel_My_Love", "passage_text": "In 1997, Billy Joel covered the song as To Make You Feel My Love for his compilation album Greatest Hits Volume III. It was released as the first single from the album and reached number 50 on the U.S. Billboard Hot 100. Garth Brooks covered the song as To Make You Feel My Love in 1998. It appeared on the soundtrack of the 1998 film Hope Floats, along with a cover version by Trisha Yearwood as the first and last tracks."}, {"url": "https://en.wikipedia.org/wiki/Make_You_Feel_My_Love", "passage_text": "Make You Feel My Love  is a song written by Bob Dylan that appeared on his 1997 album Time Out of Mind. It was first released commercially by Billy Joel, under the title To Make You Feel My Love, before Dylan's version appeared later that same year. It has since been covered by numerous performers and has proved to be a commercial success for recording artists such as Adele, Garth Brooks, Bryan Ferry and Kelly Clarkson. Garth Brooks covered the song as To Make You Feel My Love in 1998. It appeared on the soundtrack of the 1998 film Hope Floats, along with a cover version by Trisha Yearwood as the first and last tracks."}]