[{"url": "http://www.webmd.com/parenting/baby/features/protect-baby-whooping-cough", "passage_text": "Pertussis vaccines don’t completely wipe out whooping cough. The protection you get from the childhood vaccine -- or from having whooping cough -- wanes after a while. If you’ve had the vaccine, you may still get whooping cough, but not a severe case. In fact, you may mistake it for a cold. And you can still spread it. A woman should get a Tdap vaccine every time she is pregnant, Edwards says. Get the shot between weeks 27 and 36 of your pregnancy. It helps you build antibodies to fight whooping cough that you pass on to your newborn, protecting him before he can get his first DTaP shot."}, {"url": "http://www.cdc.gov/Features/Pertussis/index.html", "passage_text": "Whooping cough is a serious disease that can cause babies to stop breathing. You can help protect babies from whooping cough by getting your vaccine and making sure your baby gets his vaccines. Whooping cough, which is also called pertussis, is very contagious and most serious for babies. You can provide indirect protection to your baby by making sure everyone who comes in close contact with your baby, from older siblings and cousins to grandparents and caregivers, is up-to-date with their whooping cough vaccine."}, {"url": "http://www.cdc.gov/pertussis/pregnant/mom/vaccinate-baby.html", "passage_text": "Babies do not get the whooping cough vaccine at birth. In fact, there are currently no whooping cough vaccines licensed or recommended for newborns. Several studies found that a dose of the whooping cough vaccine at birth is safe, but a newborn’s immune system is not able to create antibodies until he is 2 months old. 1 Get the whooping cough vaccine while you are pregnant. 2  Encourage those around your baby to be up-to-date with their whooping cough vaccine. 3  Have your baby get DTaP vaccines on time according to CDC's immunization schedule [2 pages] starting at 2 months."}, {"url": "http://immunise.health.gov.au/internet/immunise/publishing.nsf/Content/IT0146-cnt", "passage_text": "1 Newborns are not immune until they have had their whooping cough vaccines. 2  To protect them until they are immune, keep people with a cough away from your baby. 3  The vaccine for babies is given at 2, 4 and 6 months. 4  The first dose can be given as early as 6 weeks. 1. 1  Whooping cough (or pertussis) is a serious respiratory infection that causes a long coughing illness. 2  In babies, it can lead to pneumonia and brain damage. 3  Whooping cough can be life-threatening for babies. 4  Newborns are not immune and they often get extremely sick."}, {"url": "http://www.adultvaccination.org/vpd/pertussis", "passage_text": "1 Vaccination of pregnant women with Tdap is especially important to help protect infants. 2  Pregnant women should get the vaccine late in the second trimester or in the third trimester for each pregancy. 3  All adults age 19 to 64 years need a one-time whooping cough booster vaccine. 1 Once an adult gets the Tdap vaccine, he or she should get the Td (tetanus and diphtheria) booster every 10 years from then on. 2  In adults, whooping cough usually starts like a common cold but then the coughing gets worse and can last for weeks or even months."}, {"url": "http://www.cdc.gov/Features/Pertussis/index.html", "passage_text": "When babies catch whooping cough, the symptoms can be very serious. Young babies could get pneumonia (lung infection), and many have trouble breathing. About half of babies younger than 1 year of age who get whooping cough end up in the hospital, and a few even die from the disease. You can provide indirect protection to your baby by making sure everyone who comes in close contact with your baby, from older siblings and cousins to grandparents and caregivers, is up-to-date with their whooping cough vaccine."}, {"url": "http://www.cdc.gov/pertussis/pregnant/mom/vaccinate-baby.html", "passage_text": "The best way you can protect your baby is to: 1  Get the whooping cough vaccine while you are pregnant. 2  Encourage those around your baby to be up-to-date with their whooping cough vaccine. 3  Have your baby get DTaP vaccines on time according to CDC's immunization schedule [2 pages] starting at 2 months. 1"}, {"url": "http://www.cdc.gov/pertussis/pregnant/mom/vaccinate-baby.html", "passage_text": "Once your baby is old enough (2 months), he needs to get his whooping cough vaccines ― that will be the best way to protect him from whooping cough as he gets older. The whooping cough vaccine for children (2 months through 6 years) is called DTaP. 1 Get the whooping cough vaccine while you are pregnant. 2  Encourage those around your baby to be up-to-date with their whooping cough vaccine. 3  Have your baby get DTaP vaccines on time according to CDC's immunization schedule [2 pages] starting at 2 months."}, {"url": "http://www.babycenter.com/whooping-cough-tdap-vaccine?page=2", "passage_text": "Babies receive the pertussis vaccine as part of the DTaP series (which also protects them against diphtheria and tetanus). The DTaP vaccine is given at 2 months, 4 months, 6 months, and 15 to 18 months, and again at 4 to 6 years of age. Your child's protection against the disease increases with each shot she receives. Tdap is considered safe during pregnancy. Since Tdap was introduced in 2005, studies have found no evidence that pregnant women who get the vaccine are more likely than others to have problems. Getting Tdap while you're pregnant protects your baby by making sure that you don't get pertussis and infect him after birth."}, {"url": "http://www.cdc.gov/Features/Pertussis/index.html", "passage_text": "If you are pregnant, talk with your doctor or midwife about getting the whooping cough shot called Tdap, to protect yourself and your baby. CDC recommends you get your Tdap vaccine between the 27th and 36th week of each pregnancy. You can provide indirect protection to your baby by making sure everyone who comes in close contact with your baby, from older siblings and cousins to grandparents and caregivers, is up-to-date with their whooping cough vaccine."}]