[{"url": "http://xampp.software.informer.com/", "passage_text": "Publisher's description. XAMPP is a free Apache distribution containing MySQL, PHP, and Perl. The goal of XAMPP is to build an easy to install distribution for developers to get into the world of Apache. You can run XAMPP in the cloud using Microsoft Azure, Google Cloud Platform and Amazon Web Services."}, {"url": "http://www.qwhatis.com/what-is-xampp/", "passage_text": "XAMPP is an open-source web server package that works on various platforms. It is actually an acronym with X meaning “cross” platform, A for Apache HTTP server, M for MySQL, P for PHP, and P for Perl."}, {"url": "https://blog.udemy.com/xampp-tutorial/", "passage_text": "XAMPP stands for Cross-Platform (X), Apache (A), MySQL (M), PHP (P) and Perl (P). It is a simple, lightweight Apache distribution that makes it extremely easy for developers to create a local web server for testing purposes."}, {"url": "http://www.keynotesupport.com/websites/xampp-apache-tutorial.shtml", "passage_text": "XAMPP, a free, open source software package produced by the non-profit organization Apache Friends, is the most popular web server software package used for website development."}, {"url": "https://www.apachefriends.org/", "passage_text": "Apache Friends is a non-profit project to promote the Apache web server and is home to the XAMPP project. XAMPP is an easy to install Apache distribution containing MySQL, PHP, and Perl."}, {"url": "https://en.wikipedia.org/wiki/XAMPP", "passage_text": "XAMPP (/ˈzaemp/ ˈzæmp /or.ˈɛks/) aemp æmp is a free and open-source cross platform web server solution stack package Developed By, apache friends consisting mainly Of THE Apache, MySQL server, mysql database and interpreters for scripts written IN the Php and perl. programming languages"}, {"url": "https://www.apachefriends.org/", "passage_text": "XAMPP is the most popular PHP development environment. XAMPP is a completely free, easy to install Apache distribution containing MySQL, PHP, and Perl. The XAMPP open source package has been set up to be incredibly easy to install and to use. Click here for other versions."}, {"url": "http://www.frihost.com/forums/vt-96620.html", "passage_text": "XAMPP is a free and open source cross-platform web server package, consisting mainly of the Apache HTTP Server, MySQL database, and interpreters for scripts written in the PHP and Perl programming languages."}]