[{"url": "http://biology.about.com/od/organsystems/a/aa031706a.htm", "passage_text": "Organ Systems. 1  1. Circulatory System: The main function of this system is to transport nutrients and gasses to cells and tissues throughout body. 2  This is accomplished by the circulation of blood. 3  Cardiovascular: This system is comprised of the heart, blood, and blood vessels. 1 Cardiovascular organs: heart, blood vessels, blood. 2  Lymphatic: This system is a vascular network of tubules and ducts that collect, filter, and return lymph to blood circulation. 3  As a component of the immune system, the lymphatic system produces and circulates immune cells called lymphocytes."}, {"url": "http://www.wisegeek.org/what-is-an-organ-system.htm", "passage_text": "The urinary system is a type of organ system that allows the body to rid itself of waste. The respiratory system is made up of the mouth, throat, nose, sinuses, bronchial tubes, and lungs. The torso houses many of the human body's organ systems. The gonads are the organs that produce gametes, or the body's sex cells. The digestive tract is an organ system. The male reproductive system is quite different from the female system. The female reproductive system is a mostly internal organ system"}, {"url": "https://answers.yahoo.com/question/index?qid=20080305165058AA29Zzt", "passage_text": "In humans, the organ that most directly regulates the concentration of water in the blood is the. a) heart c) pancreas. b) liver d) kidney. Add your answer. Source. Submit Cancel. I think this question violates the Community Guidelines. I think this question violates the Terms of Service. "}, {"url": "http://sciencenetlinks.com/student-teacher-sheets/organ-systems/", "passage_text": "Nervous System. The nervous system is the control center of the human body. It is made up of the brain, spinal cord, and nerves. It receives and interprets stimuli and transmits impulses to organs. Your brain uses the information it receives to coordinate all of your actions and reactions. Digestive System. The purpose of the digestive system is to turn the food you eat into something useful for the body. When you eat, your body uses this system to digest food so your cells can use it to make energy. The organs involved in this system include the mouth, stomach, and intestines."}, {"url": "http://sciencenetlinks.com/student-teacher-sheets/organ-systems/", "passage_text": "Introduction. The human body is made up of several organ systems that all work together as a unit to make sure the body keeps functioning. There are ten major organ systems in the body, each of which plays a different role in helping the body work. Digestive System. The purpose of the digestive system is to turn the food you eat into something useful for the body. When you eat, your body uses this system to digest food so your cells can use it to make energy. The organs involved in this system include the mouth, stomach, and intestines."}, {"url": "http://www.answers.com/Q/Which_organ_system_in_humans_is_most_directly_involved_in_the_transport_of_oxygen", "passage_text": "In Blood. The respiratory system brings in atmospheric air, which is ~21% oxygen, and allows the oxygen to diffuse into the blood stream. This is also where carbon dioxide from the body … is allowed to diffuse out of the blood stream into the lungs where it is then expelled back into the atmosphere. 3 people found this useful. "}, {"url": "http://www.factmonster.com/ipka/A0774536.html", "passage_text": "The circulatory system is the body's transport system. It is made up of a group of organs that transport blood throughout the body. The heart pumps the blood and the arteries and veins transport it. Oxygen-rich blood leaves the left side of the heart and enters the biggest artery, called the aorta. One of the most important systems in your body, the nervous system is your body's control system. It sends, receives, and processes nerve impulses throughout the body. These nerve impulses tell your muscles and organs what to do and how to respond to the environment."}, {"url": "http://www.wisegeek.org/what-is-an-organ-system.htm", "passage_text": "Systems of the human body. Skin and nails are part of the integumentary system that helps protect the body. Earthworms have organ systems that help them move, breathe, and digest food. The endocrine system is responsible for producing and regulating hormones in the bloodstream to control bodily functions. The torso houses many of the human body's organ systems. The gonads are the organs that produce gametes, or the body's sex cells. The digestive tract is an organ system. The male reproductive system is quite different from the female system."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookANIMORGSYS.html", "passage_text": "Most organs have functions in only one organ system. The stomach is involved only in the digestion of food as part of the digestive system. Organ systems, such as the digestive system, are collections of organs that perform a major function for the organism. "}, {"url": "http://www.organsofthebody.com/", "passage_text": "Spleen is the largest lymphatic organ in the human body. Lymphatic or lymphoid organs are the major parts of the immune system of our body. Function of the immune system is to protect the host (i.e. human body) from the invasion of foreign organisms. Out of these 78 organs of a male or female body, skin is the largest organ with respect to its size and weight. The major organ in the body of human beings is the brain which is primarily responsible for performing all the functions and actions of the body."}]