[{"url": "http://www.surnamedb.com/Surname/France", "passage_text": "This interesting surname is of Old French origin, and is an ethnic name for someone from France. The country was so named from the Franks (i.e. the free men), a confederacy of German tribes who fought with the Romans over a long period before finally settling in Gaul in the 5th Century. The first recorded spelling of the family name is shown to be that of Hugo Francus, which was dated 1135, in the Cartulary of Oseney Abbey, Oxfordshire, during the reign of King Henry 1, known as The Lion of Justice, 1100 - 1135."}, {"url": "http://www.ebabynames.com/#!meaning-of-Daxon", "passage_text": "Meaning of Daxon: Daxon is a modern English elaboration of the name Dax, which is originally a surname that was derived from the town of Dax, France. It might also have derived independently from the town of Dax from the Old English name Daecca. Dæcca. tweet"}, {"url": "https://en.wikipedia.org/wiki/Name_of_France", "passage_text": "Modern France is still called Frankreich in German and similar names in some other Germanic languages (such as Frankrijk in Dutch), which means Frank Reich , the Realm of the Franks. The name of the town literally means Roissy in the Pays de France , and not Roissy in the country France. Another example of the use of France in this meaning is the new Stade de France, which was built near Saint-Denis for the 1998 Football World Cup."}, {"url": "http://www.usmemorialday.org/?page_id=2", "passage_text": "History. We cherish too, the Poppy red That grows on fields where valor led, It seems to signal to the skies That blood of heroes never dies. Memorial Day, originally called Decoration Day, is a day of remembrance for those who have died in service of the United States of America. Over two dozen cities and towns claim to be the birthplace of Memorial Day. While Waterloo N.Y. was officially declared the birthplace of Memorial Day by President Lyndon Johnson in May 1966, it’s difficult to prove conclusively the origins of the day."}, {"url": "http://www.moniquescrepes.com/a-brief-history-of-crepes/", "passage_text": "The word crepe crêpe Is french for pancake and is derived from The latin crispus “meaning”. Curled crepes inBrittany (originated. Inbrittany), fr breton in the northwest Region, of france which lies Between The english channel to the north And the Bay of biscay to. The south crepes crêpes were, originally called galettes. meaning flat cakes Crepes crêpes inBrittany (inbrittany. Fr), breton in the northwest region Of, france which lies between The English channel to the north and The bay Of biscay to the. South crepes crêpes were originally, called galettes meaning."}, {"url": "http://www.moniquescrepes.com/a-brief-history-of-crepes/", "passage_text": "The word crepe crêpe Is french for pancake and is derived from The latin crispus “meaning”. Curled crepes inBrittany (originated. Inbrittany), fr breton in the northwest Region, of france which lies Between The english channel to the north And the Bay of biscay to. the south Crepes crêpes inBrittany (inbrittany. Fr), breton in the northwest region Of, france which lies between The English channel to the north and The bay Of biscay to the. South crepes crêpes were originally, called galettes meaning. flat cakes"}, {"url": "https://en.wikipedia.org/wiki/Name_of_France", "passage_text": "Before being named France, the land was called Gaul (Latin: Gallia; French: Gaule). This name continued to be used even after the beginning of the reign of the Franks' Kings Clovis I, Charles Martel, Pepin the Short, and Charlemagne. The name of the town literally means Roissy in the Pays de France , and not Roissy in the country France. Another example of the use of France in this meaning is the new Stade de France, which was built near Saint-Denis for the 1998 Football World Cup."}, {"url": "http://www.surnamedb.com/Surname/France", "passage_text": "The modern surname France may also derive from Fraunce, a pet form of the male given name Francois (Old French), Francis (Middle English). This personal name is particularly well recorded in Cornish Christening Registers, entries including: Fraunce Fysher (November 9th 1550), and Fraunce Hawke (January 29th 1589). The first recorded spelling of the family name is shown to be that of Hugo Francus, which was dated 1135, in the Cartulary of Oseney Abbey, Oxfordshire, during the reign of King Henry 1, known as The Lion of Justice, 1100 - 1135."}, {"url": "https://en.wikipedia.org/wiki/Name_of_France", "passage_text": "The name France comes from Latin Francia, which literally means land of the Franks . Originally it applied to the whole Empire of the Franks, extending from southern France to eastern Germany. The name of the town literally means Roissy in the Pays de France , and not Roissy in the country France. Another example of the use of France in this meaning is the new Stade de France, which was built near Saint-Denis for the 1998 Football World Cup."}, {"url": "http://www.moniquescrepes.com/a-brief-history-of-crepes/", "passage_text": "Breton), in the northwest region of France, which lies between the English Channel to the north and the Bay of Biscay to the south. Crepes crêpes were originally called, galettes meaning flat. Cakes The french pronunciation of both words is with a short, e as in. bed Crepes crêpes inBrittany (inbrittany. Fr), breton in the northwest region Of, france which lies between The English channel to the north and The bay Of biscay to the. South crepes crêpes were originally, called galettes meaning. flat cakes"}]