[{"url": "http://www.weatherquestions.com/What_is_the_greenhouse_effect.htm", "passage_text": "You can think of greenhouse gases as sort of a blanket for infrared radiation -- they keep the Earth's surface and lower layers of the atmosphere warmer, and the upper layers colder, than if the greenhouse gases were not there. About 80-90% of the Earth's natural greenhouse effect is due to water vapor and clouds. Most of the rest is due to carbon dioxide, methane, and a few other minor gases."}, {"url": "http://www.thefreedictionary.com/greenhouse+effect", "passage_text": "greenhouse effect. n. A phenomenon in which the atmosphere of a planet traps radiation emitted by its sun, caused by gases such as carbon dioxide, water vapor, and methane that allow incoming sunlight to pass through but retain heat radiated back from the planet's surface. greenhouse effect. 1. The term given to the heating of the Earth’s surface caused by infrared radiation trapped in the atmosphere. 2."}, {"url": "http://www.audioenglish.org/dictionary/greenhouse_effect.htm", "passage_text": "• GREENHOUSE EFFECT (noun). The noun GREENHOUSE EFFECT has 1 sense: 1. warming that results when solar radiation is trapped by the atmosphere; caused by atmospheric gases that allow sunshine to pass through but absorb heat that is radiated back from the warmed surface of the earth. Familiarity information: GREENHOUSE EFFECT used as a noun is very rare. Dictionary entry details."}, {"url": "https://en.wikipedia.org/wiki/Greenhouse_effect", "passage_text": "Earth’s natural greenhouse effect is critical to supporting life. Human activities, primarily the burning of fossil fuels and clearing of forests, have intensified the natural greenhouse effect, causing global warming. Infrared radiation is absorbed by greenhouse gases in the atmosphere. These gases also radiate energy, some of which is directed to the surface and lower"}, {"url": "https://en.wikipedia.org/wiki/Greenhouse_effect", "passage_text": "A representation of the exchanges of energy between the source (the Sun), the Earth's surface, the Earth's atmosphere, and the ultimate sink outer space. The ability of the atmosphere to capture and recycle energy emitted by the Earth surface is the defining characteristic of the greenhouse effect. Infrared radiation is absorbed by greenhouse gases in the atmosphere. These gases also radiate energy, some of which is directed to the surface and lower"}, {"url": "http://www.thefreedictionary.com/greenhouse+effect", "passage_text": "Noun. 1. greenhouse effect-warming that results when solar radiation is trapped by the atmosphere; caused by atmospheric gases that allow sunshine to pass through but absorb heat that is radiated back from the warmed surface of the earth. greenhouse warming. greenhouse effect. 1. The term given to the heating of the Earth’s surface caused by infrared radiation trapped in the atmosphere. 2."}, {"url": "http://scied.ucar.edu/longcontent/greenhouse-effect", "passage_text": "The greenhouse effect causes some of this energy to be waylaid in the atmosphere, absorbed and released by greenhouse gases. Without the greenhouse effect, Earth’s temperature would be below freezing. It is, in part, a natural process. However, Earth’s greenhouse effect is getting stronger as we add greenhouse gases to the atmosphere. That’s is warming the climate of our planet. "}, {"url": "http://whatsyourimpact.org/greenhouse-effect", "passage_text": "The greenhouse effect is caused by the interaction of the sun's energy with greenhouse gases such as carbon dioxide, methane, nitrous oxide and fluorinated gases in the Earth's atmosphere. The ability of these gases to trap heat is what causes the greenhouse effect. The greenhouse effect increases the temperature of the Earth by trapping heat in our atmosphere. This keeps the temperature of the Earth higher than it would be if direct heating by the Sun was the only source of warming."}, {"url": "https://en.wikipedia.org/wiki/Greenhouse_gas", "passage_text": "A greenhouse gas (sometimes abbreviated GHG) is a gas in an atmosphere that absorbs and emits radiation within the thermal infrared range. This process is the fundamental cause of the greenhouse effect. The primary greenhouse gases in Earth's atmosphere are water vapor, carbon dioxide, methane, nitrous oxide, and ozone. "}, {"url": "http://www.weatherquestions.com/What_is_the_greenhouse_effect.htm", "passage_text": "There is a natural greenhouse effect that keeps the Earth's climate warm and habitable. There is also the man-made greenhouse effect, which is the enhancement of Earth's natural greenhouse effect by the addition of greenhouse gases from the burning of fossil fuels (mainly petroleum, coal, and natural gas). About 80-90% of the Earth's natural greenhouse effect is due to water vapor and clouds. Most of the rest is due to carbon dioxide, methane, and a few other minor gases."}]