[{"url": "http://www.innerbody.com/image/musfov.html", "passage_text": "The main function of the muscular system is movement. Muscles are the only tissue in the body that has the ability to contract and therefore move the other parts of the body. Related to the function of movement is the muscular system’s second function: the maintenance of posture and body position. Attached to the bones of the skeletal system are about 700 named muscles that make up roughly half of a person’s body weight. Each of these muscles is a discrete organ constructed of skeletal muscle tissue, blood vessels, tendons, and nerves."}, {"url": "https://prezi.com/faptd-79nevw/invertebrates-and-vertebrates-muscular/", "passage_text": "Nematodes-a mouth opening into a muscular pharynx (throat) where food is pulled in and crushed leads into a long simple gut cavity lacking any muscles, and then to an anus near the tip of the body that leads into a long simple gut cavity lacking any muscles and then to an anus near the tip of the body. INVERTEBRATES & VERTABRATES. MUSCULAR Porifera-has no muscular system and is limited myocyte capability in some pinacocytes and although sponges have cells with specialized functions they do not have tissues. There is no endoderm, mesoderm, or ectoderm."}, {"url": "http://www.factmonster.com/dk/science/encyclopedia/muscular-system.html", "passage_text": "OTHER MUSCLE TYPES. Skeletal muscle is not the only type of muscle in the body. There are two other types: smooth muscle and cardiac (heart) muscle. Unlike skeletal muscle, these muscles are not under our conscious control. "}, {"url": "http://www.innerbody.com/image/musfov.html", "passage_text": "The muscular system is responsible for the movement of the human body. Attached to the bones of the skeletal system are about 700 named muscles that make up roughly half of a person’s body weight. Each of these muscles is a discrete organ constructed of skeletal muscle tissue, blood vessels, tendons, and nerves."}, {"url": "https://prezi.com/faptd-79nevw/invertebrates-and-vertebrates-muscular/", "passage_text": "Mammals-The muscular system enables animals to move and control movement. The muscular system consists of skeletal muscles which help move the skeleton and control movement, smooth muscles which are involuntary and control the stomach and intestine, and cardiac muscles which include the heart muscles. INVERTEBRATES & VERTABRATES. MUSCULAR Porifera-has no muscular system and is limited myocyte capability in some pinacocytes and although sponges have cells with specialized functions they do not have tissues. There is no endoderm, mesoderm, or ectoderm."}, {"url": "http://encyclopedia2.thefreedictionary.com/Muscular+system", "passage_text": "Muscular system. The muscular system consists of muscular cells, the contractile elements with the specialized property of exerting tension during contraction, and associated connective tissues. The three morphologic types of muscles are voluntary muscle, involuntary muscle, and cardiac muscle. "}, {"url": "http://www.livescience.com/26854-muscular-system-facts-functions-diseases.html", "passage_text": "Three types of muscles. The muscular system can be broken down into three types of muscles: skeletal, smooth and cardiac, according to the NIH. Skeletal muscles are the only voluntary muscle tissue in the human body and control every action that a person consciously performs. Most skeletal muscles are attached to two bones across a joint, so the muscle serves to move parts of those bones closer to each other, according to The Merck Manual."}, {"url": "https://faculty.washington.edu/chudler/invert.html", "passage_text": "Invertebrates are those animals without a backbone (spinal column). Invertebrates include animals such as insects, worms, jellyfish, spiders-these are only a few of the many types of spineless creatures. Invertebrates have played an important role in discoveries about how the nervous system works. "}, {"url": "https://en.wikipedia.org/wiki/Muscular_system", "passage_text": "It permits movement of the body, maintains posture, and circulates blood throughout the body. The muscular system in vertebrates is controlled through the nervous system, although some muscles (such as the cardiac muscle) can be completely autonomous. "}, {"url": "https://en.wikipedia.org/wiki/Muscle", "passage_text": "Muscle is a soft tissue found in most animals. Muscle cells contain protein filaments of actin and myosin that slide past one another, producing a contraction that changes both the length and the shape of the cell. Muscles function to produce force and motion. 1 Smooth muscle or involuntary muscle is found within the walls of organs and structures such as the esophagus, stomach, intestines, bronchi, uterus, urethra, bladder, blood vessels, and the arrector pili in the skin (in which it controls erection of body hair)."}]