[{"url": "http://www.abc.net.au/news/2010-05-10/aged-care-workers-seek-huge-pay-rise/429404", "passage_text": "Map: Australia. Australia's aged care workers have lodged a claim for a massive 60 per cent wage increase which they say is necessary to keep staff in the industry. The proposed pay rise would see wages lifted by up to $10 an hour and the application would also see changes to minimum staff-to-resident ratios. "}, {"url": "http://careercentre.dtwd.wa.gov.au/occupations/Pages/aged-care-worker.aspx", "passage_text": "You can also become qualified to work as an aged care worker by completing a traineeship in Community Services (Aged Care Work). The traineeship usually takes between 12 and 24 months to complete.​. An aged care worker may work with clients who require assistance with movement. This can require the use of equipment such as hoists to lift the client in and out of bed, or swivel cushions to ease getting into and out of cars."}, {"url": "http://www.flinders.edu.au/sabs/nils-files/reports/Compared_to_other_workers.pdf", "passage_text": "Those with more than 10 years on the job are about as likely to be highly paid in hourly terms as those with 1-3 years’ experience. However, both aged care and Australian workers are likely to receive lower rates of pay if they have only worked for a short amount of time in their current job (less than one year). The median female carer in the whole aged care workforce was 45-54 years old, while her counterpart in the recently hired group was 35-44 years old. Comparing the first column in Table 1 with the column second from right, we see that women employed in aged care jobs are generally older than all employed women."}, {"url": "http://www.bls.gov/news.release/pdf/wkyeng.pdf", "passage_text": "Median weekly earnings of the nation's 108.8 million full-time wage and salary workers were $801 in the second quarter of 2015 (not seasonally adjusted), the U.S. Bureau of Labor Statistics reported today. • Median weekly earnings of full-time workers were $801 in the second quarter of 2015. Women had median usual weekly earnings of $726, or 81.9 percent of the $886 median for men."}, {"url": "http://www.opencolleges.edu.au/careers/why-how-to-become-an-aged-care-worker", "passage_text": "Note: These figures are indicative and cannot be used to determine a particular wage rate. Payscale.com lists the wage for an aged care worker (with five years’ experience, living in Sydney) as being between an average of $31 000 to a maximum salary of $55 000. Only 12 per cent have no post school qualifications and 29 per cent have more than one such qualification. An overwhelming 94 per cent of workers are women and 43 per cent of the aged care workers are 45 years or younger, compared with 67 per cent of all Australian workers."}, {"url": "http://www.totaljobs.com/salary-checker/average-care-worker-salary", "passage_text": "Salary results for Care Worker. Here you can see the average salary for the job you entered, based on our most recent job adverts. Our salary calculator also lets you view the highest and lowest salaries recently offered for that job, and how your current salary compares. "}, {"url": "http://careercentre.dtwd.wa.gov.au/occupations/Pages/aged-care-worker.aspx", "passage_text": "On average, aged and disabled care workers can expect to earn between $679.90 and $799 per week ($35 354.80 and $41 599 per year), depending on the organisation they work for and their level of experience. An aged care worker may work with clients who require assistance with movement. This can require the use of equipment such as hoists to lift the client in and out of bed, or swivel cushions to ease getting into and out of cars."}, {"url": "http://www.opencolleges.edu.au/careers/why-how-to-become-an-aged-care-worker", "passage_text": "Aged Care Workers Weekly Work Hours. The graph shows the average weekly hours (by gender and full-time and part-time) worked for this occupation, compared with all occupations. Aged and Disabled Carers have a relatively low proportion of full-time jobs (39.4 per cent). Only 12 per cent have no post school qualifications and 29 per cent have more than one such qualification. An overwhelming 94 per cent of workers are women and 43 per cent of the aged care workers are 45 years or younger, compared with 67 per cent of all Australian workers."}]