[{"url": "http://www.wisegeek.com/what-is-the-relationship-between-positive-feedback-and-homeostasis.htm", "passage_text": "An example of positive feedback and homeostasis is when a person has a cut or damage to a blood vessel. To stop bleeding, a positive feedback response is initiated in which platelets in the blood accumulate and clot around the wound. This relatively quickly stops the cut from bleeding."}, {"url": "http://anatomyandphysiologyi.com/homeostasis-positivenegative-feedback-mechanisms/", "passage_text": "Positive feedback mechanisms. A positive feedback mechanism is the exact opposite of a negative feedback mechanism. With negative feedback, the output reduces the original effect of the stimulus. In a positive feedback system, the output enhances the original stimulus. A good example of a positive feedback system is child birth."}, {"url": "http://anatomyandphysiologyi.com/homeostasis-positivenegative-feedback-mechanisms/", "passage_text": "The control of blood sugar (glucose) by insulin is another good example of a negative feedback mechanism. When blood sugar rises, receptors in the body sense a change. In turn, the control center (pancreas) secretes insulin into the blood effectively lowering blood sugar levels."}, {"url": "http://anatomyandphysiologyi.com/homeostasis-positivenegative-feedback-mechanisms/", "passage_text": "Almost all homeostatic control mechanisms are negative feedback mechanisms. These mechanisms change the variable back to its original state or “ideal value”. A good example of a negative feedback mechanism is a home thermostat (heating system)."}, {"url": "http://www.biologyreference.com/Ho-La/Homeostasis.html", "passage_text": "Negative Feedback and Stability. The usual means of maintaining homeostasis is a general mechanism called a negative feedback loop. The body senses an internal change and activates mechanisms that reverse, or negate, that change. An example of negative feedback is body temperature regulation."}, {"url": "http://anatomyandphysiologyi.com/homeostasis-positivenegative-feedback-mechanisms/", "passage_text": "The biological definition of homeostasis is “the tendency of an organism or cell to regulate its internal environment and maintain equilibrium, usually by a system of feedback controls, so as to stabilize health and functioning”."}, {"url": "http://www.wisegeek.com/what-is-the-relationship-between-positive-feedback-and-homeostasis.htm", "passage_text": "Ad. There are two types of homeostasis — positive feedback and negative feedback. Positive feedback and homeostasis is far less common than negative feedback. When negative feedback occurs, the body senses that a certain level is too high or too low and acts so the level moves in the opposite direction."}, {"url": "http://www.bbc.co.uk/bitesize/higher/biology/control_regulation/homeostatic_control/revision/1/", "passage_text": "Negative feedback is an important type of control that is found in homeostasis. A negative feedback control system responds when conditions change from the ideal or set point and returns conditions to this set point. There is a continuous cycle of events in negative feedback."}]