[{"url": "http://www.wikihow.com/Cure-a-Stomach-Ache", "passage_text": "1 Use a hot pad or a washcloth on your stomach to ease pain and help with gas. 2  Sniffing something minty or even just eating a piece of mint gum helps calm the stomach. 3  Eat crackers and drink some water. 4  Go to the toilet, sit there for a while until you do your business, it's a good way to clean out your stomach. 1 For instance, go for a week without dairy and see if your stomach aches go away. 2  If cutting that food doesn't work, then cut something else until you find the culprit. 3  Keep a food diary and write down everything that you eat for a while. 4  In your food diary, write down the days that you get a stomach ache."}, {"url": "http://www.thedailymeal.com/7-teas-settle-your-stomach/121013", "passage_text": "7 Teas That Settle Your Stomach (Slideshow). Your stomach may be bothering you for a number of reasons, including nerves, an illness, or something you ate that didn’t sit well. Some teas can have a calming effect that can help relieve stomach pain. And the cause of your tummy ache is important for choosing the right kind of tea. You should consult your doctor before trying these tea remedies so that you know the cause of your stomach discomfort."}, {"url": "http://www.wikihow.com/Cure-a-Stomach-Ache", "passage_text": "When you feel a stomach ache coming on, it's hard to take your mind off of the pain and get on with your day. No matter what's causing the problem, you want it to go away fast. If your stomach is bothering you, try some of these steps to get some relief. 1 For instance, go for a week without dairy and see if your stomach aches go away. 2  If cutting that food doesn't work, then cut something else until you find the culprit. 3  Keep a food diary and write down everything that you eat for a while. 4  In your food diary, write down the days that you get a stomach ache."}, {"url": "http://www.health.com/health/gallery/0,,20569920,00.html", "passage_text": "Whether it's nausea, vomiting, or just a general icky feeling due to a stomach bug or something you ate, you want to feel better now. Sadly, your doctor may say that the best treatment is to just wait until the germ or symptoms run their course. "}, {"url": "http://everydayroots.com/stomach-ache-remedies", "passage_text": "Stomach aches, also broadly called “abdominal pain,” are tricky things to find remedies for unless you know the cause. Ranging from indigestion and irritable bowel syndrome to gastritis and GERD, an aching tummy can stem from many things. 1. Enjoy a Cup of Chamomile Tea. Chamomile can help ease the pain of a stomach ache by working as an anti-inflammatory (for example the lining of the stomach can become inflamed as a result common gastritis, caused by bacteria) and by relaxing the smooth muscle of the upper digestive track."}, {"url": "http://www.top10homeremedies.com/home-remedies/home-remedies-stomach-ache.html", "passage_text": "A stomach ache is a very common problem with varying degrees of discomfort and related symptoms. You can experience mild to sharp pain in the stomach or abdomen, stomach cramps, gas, nausea, diarrhea, bloating and vomiting. 1 You can also add a pinch of rock salt. 2  This remedy is equally effective for both a stomach ache and gas. 3  Alternatively, add one teaspoon of asafetida to a cup of warm water. 4  Soak a cotton cloth in the solution and place it on your stomach for 10 to 15 minutes."}, {"url": "http://www.healthgrades.com/symptoms/stomach-ache", "passage_text": "Often, pain or discomfort anywhere in the abdomen is described as a stomach ache, although the stomach may not actually be the source of the pain. Localized pain may be due to the organs near the site of the pain, such as the gallbladder or stomach in the upper abdomen or the appendix in the lower abdomen. Generalized stomach aches may be associated with diet, inflammation, or infection."}, {"url": "http://www.wikihow.com/Cure-a-Stomach-Ache", "passage_text": "1 After treating your stomach ache (ie after drinking a soothing tea, or taking medication) sit or lie down in a comfortable position to allow all blood to flow to your stomach and listen to music. 2  It is proven that music significantly reduces pain. 1 For instance, go for a week without dairy and see if your stomach aches go away. 2  If cutting that food doesn't work, then cut something else until you find the culprit. 3  Keep a food diary and write down everything that you eat for a while. 4  In your food diary, write down the days that you get a stomach ache."}, {"url": "http://www.wisebread.com/12-natural-remedies-for-stomach-pain", "passage_text": "Well, baking soda and apple cider vinegar-if you have gastritis or a small ulcer they will cause you a lot of pain. It is important to know the source of the pain. Aloe vera scrapped from the inside of the plant, not from the bottle, and raw (label has to say raw) honey-are best, taken on an empty stomach. 2. Like ginger, fresh mint works the best to settle the stomach, and all you need is a cup of warm water and a few sprigs of mint to make a tea. Simply chewing on a mint leaf also works, and because mint is technically a weed, it grows well in most environments. You can also buy the tea or peppermint supplements."}]