[{"url": "https://labtestsonline.org/understanding/analytes/osmolality/tab/sample", "passage_text": "Osmolality is a measure of the number of dissolved particles in a fluid. The osmolality test reflects the concentration of substances such as sodium, potassium, chloride, glucose, and urea in a sample of blood, urine, or sometimes stool. "}, {"url": "http://www.rightdiagnosis.com/medical/blood_osmolarity.htm", "passage_text": "Description of Blood osmolarity. Blood osmolarity: measures moles per liter of blood; increases with dehydration and decreases with overhydration; normal osmolarity is contributed to mostly by sodium, chloride, potassium, urea and glucose, as well as other ions and substances in the blood. Source: CRISP. "}, {"url": "http://www.healthline.com/health/osmolality-blood", "passage_text": "The blood osmolality test, also known as a serum osmolality test, measures the amounts of several chemicals in your serum. Serum is the liquid part of your blood. The blood osmolality test identifies how much dissolved blood urea nitrogen, glucose, and sodium are in your serum. When your body is functioning properly, it makes specific adjustments to maintain the correct osmolality. For example, you may need to urinate frequently if your blood osmolality is too low. Osmolality is a measure of how much of one substance has been dissolved in another substance. The greater the concentration of substance dissolved, the higher the osmolality. Very salty water, for example, has higher osmolality than water with just a hint of salt."}, {"url": "http://patient.info/doctor/osmolality-osmolarity-and-fluid-homeostasis", "passage_text": "Osmolality is an estimation of the osmolar concentration of plasma and is proportional to the number of particles per kilogram of solvent; it is expressed as mOsmol/kg (the SI unit is mmol/kg but mOsmol/kg is still widely used). This is what is used when values are measured by a laboratory. Osmolarity is an estimation of the osmolar concentration of plasma and is proportional to the number of particles per litre of solution; it is expressed as mmol/l. This is what is used when a calculated value is derived."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=33419", "passage_text": "Plasma osmolarity: The osmolarity of blood plasma, which is a measure of the hydration status. The plasma osmolarity is sensitive to changes in hydration status during dehydration and rehydration. The normal plasma osmolarity is in the range of 280-300 mOs/kg. "}, {"url": "http://medical-dictionary.thefreedictionary.com/osmolality", "passage_text": "the concentration of a solution in terms of osmoles of solutes per kilogram of solvent. serum osmolality a measure of the number of dissolved particles per unit of water in serum. In a solution, the fewer the particles of solute in proportion to the number of units of water (solvent), the less concentrated the solution. "}, {"url": "http://emedicine.medscape.com/article/2099042-overview", "passage_text": "Description. The serum or plasma osmolality is a measure of the different solutes in plasma. It is primarily determined by sodium and its corresponding anions (chloride and bicarbonate), glucose, and urea. Osmoles per kilogram of water defines osmolality, while osmoles per liter of solution defines osmolarity"}]