[{"url": "http://www.justaddiceorchids.com/Just-Add-Ice-Orchid-Blog/bid/95358/Can-Your-Cat-and-Your-Orchid-Coexist", "passage_text": "Short answer: If you have Phalaenopsis Orchids, yes they can! Many people still believe that nibbling on a beautiful orchid is toxic to Kitty. While it’s never a good idea for your cat to nibble on most plants, these orchids (which are also known as Moth Orchids) are non-toxic to both cats and dogs."}, {"url": "http://www.answers.com/Q/What_Orchids_are_poisonous_to_cats", "passage_text": "The exotic dendrobium orchid is not poisonous to cats. All orchids  are non-toxic to cats, but ingesting a large quantity may cause  unpleasant gastrointestinal symptoms."}, {"url": "http://www.answers.com/Q/Are_orchids_poisonous", "passage_text": "The exotic dendrobium orchid is not poisonous to cats. All orchids  are non-toxic to cats, but ingesting a large quantity may cause  unpleasant gastrointestinal symptoms."}, {"url": "http://www.teleflora.com/floral-facts/pet-friendly-plants-flowers", "passage_text": "Toxic to cats and dogs. Sending a floral bouquet or living plant is a great way to show that you care. Households with pets can pose a bit of a challenge when selecting such a gift, as care needs to be taken that plants are selected that will pose no hazard should the pets decide to munch on a few leaves."}, {"url": "http://www.ehow.com/info_10032809_orchids-poisonous-dogs-cats.html", "passage_text": "Pet dogs and cats tend to get into things they shouldn't, whether indoors or out. Among the most unnerving concerns is knowing which plants in the yard or house are toxic to your furry companions. In the United States, native orchids grow outdoors in sunny fields and woodlands and in shade gardens."}, {"url": "http://www.justaddiceorchids.com/Just-Add-Ice-Orchid-Blog/bid/95358/Can-Your-Cat-and-Your-Orchid-Coexist", "passage_text": "Safe plants commonly seen in homes include (according to ASPCA.com) the Christmas cactus, bamboo, areca or golden palm, the button fern, and more. For a searchable list of toxic and non-toxic houseplants, check out the ASPCA’s searchable database."}, {"url": "http://www.ehow.com/info_10032809_orchids-poisonous-dogs-cats.html", "passage_text": "The genetic lineages of modern orchid hybrids are complex and confusing. While orchids are not considered toxic to dogs and cats, there always is a chance that an orchid hybrid carries that one odd gene that creates a harmful compound in leaves or flowers that could cause sickness in a pet. Medioimages/Photodisc/Photodisc/Getty Images. Plant Lists."}, {"url": "http://www.ehow.com/info_10032809_orchids-poisonous-dogs-cats.html", "passage_text": "Plant Names. The name orchid is not specific unless the plant is in the orchid family, Orchidaceae. Many non-orchid-family plants may be colloquially called orchids or superficially resemble an orchid. Plants that have a common name of orchid but are not in the orchid family may be toxic to dogs or cats."}]