[{"url": "http://www.nhlbi.nih.gov/news/press-releases/supplement/questions-and-answers-the-nih-trial-of-edta-chelation-therapy-for-coronary-heart-disease", "passage_text": "Chelation is a chemical process in which a substance is used to bind molecules, such as metals or minerals, and hold them tightly so that they can be removed from a system, such as the body. In medicine, chelation has been scientifically proven to rid the body of excess or toxic metals. The EDTA chelation therapy or placebo solution was delivered through 40 intravenous infusions that were administered over a 28-month course of treatment. The first 30 infusions were delivered on a weekly basis and the last 10 were delivered every two to eight weeks."}, {"url": "http://umm.edu/health/medical/altmed/supplement/ethylenediaminetetraacetic-acid", "passage_text": "The dose depends on the amount of lead in the child's blood, as well as the child's height and weight. Daily treatment for up to 5 days may be required. Adult. For heavy metal toxicity: EDTA chelation therapy is often given intravenously with calcium, magnesium, and vitamins B and C over a period of 1 to 3 hours. The recommended adult dosage varies depending on the size of the person and the amount of lead or other metal in the body. Evidence that EDTA chelation therapy is effective for heart disease is mixed. Proponents believe it may help people with atherosclerosis (hardening of the arteries) or peripheral vascular disease (decreased blood flow to the legs) by clearing clogged arteries and improving blood flow."}, {"url": "http://chemistry.tutorcircle.com/inorganic-chemistry/chelation.html", "passage_text": "The EDTA solution is also used as the anticoagulant in blood banks as it forms complex with calcium ions which are mainly involved in the coagulation process of the blood. The sodium salt of EDTA 4- is used in the manufacturing of beer and mayonnaise also. "}, {"url": "http://umm.edu/health/medical/altmed/supplement/ethylenediaminetetraacetic-acid", "passage_text": "Chelation therapy is a treatment that involves repeated intravenous (IV) administration of a chemical solution of ethylenediaminetetraacetic acid, or EDTA. It is used to treat acute and chronic lead poisoning by pulling toxins (including heavy metals such as lead, cadmium, and mercury) from the bloodstream. Evidence that EDTA chelation therapy is effective for heart disease is mixed. Proponents believe it may help people with atherosclerosis (hardening of the arteries) or peripheral vascular disease (decreased blood flow to the legs) by clearing clogged arteries and improving blood flow."}, {"url": "http://www.webmd.com/balance/tc/chelation-therapy-topic-overview", "passage_text": "Chelation therapy is a chemical process in which a synthetic solution-EDTA (ethylenediaminetetraacetic acid)-is injected into the bloodstream to remove heavy metals and/or minerals from the body. Chelation means to grab or to bind.. When EDTA is injected into the veins, it grabs heavy metals and minerals such as lead, mercury, copper, iron, arsenic, aluminum, and calcium and removes them from the body. Except as a treatment for lead poisoning, chelation therapy is controversial and unproved. Chelation is a very effective way to treat heavy-metal poisoning. The U.S. Food and Drug Administration (FDA) has approved prescription chelation therapy for the treatment of lead poisoning. Injected EDTA binds with the harmful metal and both are then eliminated from the body through the kidneys."}, {"url": "https://en.wikipedia.org/wiki/Chelation", "passage_text": "The chelate effect describes the enhanced affinity of chelating ligands for a metal ion compared to the affinity of a collection of similar nonchelating (monodentate) ligands for the same metal. In earth science, hot chemical weathering is attributed to organic chelating agents (e.g., peptides and sugars) that extract metal ions from minerals and rocks. Some metal complexes in the environment and in nature are not found in some form of chelate ring (e.g., with a humic acid or a protein)."}, {"url": "http://www.nhlbi.nih.gov/news/press-releases/supplement/questions-and-answers-the-nih-trial-of-edta-chelation-therapy-for-coronary-heart-disease", "passage_text": "In the case of EDTA chelation therapy, the substance that binds and removes metals and minerals are the salts of EDTA (ethylene diamine tetra-acetic acid), a synthetic, or man-made, amino acid that is delivered intravenously (through the veins). The EDTA chelation therapy or placebo solution was delivered through 40 intravenous infusions that were administered over a 28-month course of treatment. The first 30 infusions were delivered on a weekly basis and the last 10 were delivered every two to eight weeks."}, {"url": "http://www.nyrnaturalnews.com/article/qa-what-is-chelation/", "passage_text": "EDTA binds to calcium deposits in the arteries and is used in cases of atherosclerosis, where it has a more than 80% success rate. It can also remove lead (but not mercury) from the body. These substances bind to metals like lead, cadmium and arsenic, as well as other toxic substances, and help remove them from the body. Chelation therapy is extensively documented in the medical literature, and is recognised as a legitimate treatment for lead poisoning."}, {"url": "https://en.wikipedia.org/wiki/Ethylenediaminetetraacetic_acid", "passage_text": "Ethylenediaminetetraacetic acid, widely abbreviated as EDTA (for other names, see Table), is an aminopolycarboxylic acid and a colourless, water-soluble solid. It is widely used to dissolve limescale. Its usefulness arises because of its role as a hexadentate (six-toothed) ligand and chelating agent, i.e., its ability to sequester metal ions such as Ca 2+ and Fe 3+ . After being bound by EDTA, metal ions remain in solution but exhibit diminished reactivity."}, {"url": "https://en.wikipedia.org/wiki/Chelation", "passage_text": "Chelation is useful in applications such as providing nutritional supplements, in chelation therapy to remove toxic metals from the body, as contrast agents in MRI scanning, in manufacturing using homogeneous catalysts, and in fertilizers. In earth science, hot chemical weathering is attributed to organic chelating agents (e.g., peptides and sugars) that extract metal ions from minerals and rocks. Some metal complexes in the environment and in nature are not found in some form of chelate ring (e.g., with a humic acid or a protein)."}]