[{"url": "http://www.emedicinehealth.com/cystic_fibrosis-health/page7_em.htm", "passage_text": "Home care for cystic fibrosis. Home treatment is very important. It can make a person with cystic fibrosis feel better and live longer. Here are some things you can do at home, or help your child do, to help prevent more serious health problems like lung infections: 1  Don't smoke. 2  And avoid secondhand smoke."}, {"url": "http://medical-dictionary.thefreedictionary.com/cystic+fibrosis", "passage_text": "For the CFTR gene, for instance, a person may have two normal copies, or one normal and one mutated copy, or two mutated copies. A person with two mutated copies will develop cystic fibrosis. A person with one mutated copy is said to be a carrier. The glands most affected are those in the pancreas and respiratory system and the sweat glands. Cystic fibrosis is usually recognized in infancy or early childhood, chiefly among Caucasians. The earliest manifestation is meconium ileus, an obstruction of the small bowel by viscid stool."}, {"url": "http://medical-dictionary.thefreedictionary.com/cystic+fibrosis", "passage_text": "cystic fibrosis. Cystic fibrosis (CF) is an inherited disease that affects the lungs, digestive system, sweat glands, and male fertility. Its name derives from the fibrous scar tissue that develops in the pancreas, one of the principal organs affected by the disease. The glands most affected are those in the pancreas and respiratory system and the sweat glands. Cystic fibrosis is usually recognized in infancy or early childhood, chiefly among Caucasians. The earliest manifestation is meconium ileus, an obstruction of the small bowel by viscid stool."}, {"url": "http://www.webmd.com/children/tc/cystic-fibrosis-treatment-overview", "passage_text": "Lab tests can help your doctor know how serious the disease is and how it is affecting your child's body. Your doctor will ask you about your child's immunizations and will schedule any shots that are needed. Children with cystic fibrosis should have all the recommended shots, plus pneumococcal shots."}, {"url": "http://www.webmd.com/children/tc/cystic-fibrosis-topic-overview", "passage_text": "Cystic fibrosis is a genetic disease that causes mucus in the body to become thick and sticky. This glue-like mucus builds up and causes problems in many of the body's organs, especially the lungs and the pancreas. People who have cystic fibrosis can have serious breathing problems and lung disease. "}, {"url": "http://www.webmd.com/children/tc/cystic-fibrosis-treatment-overview", "passage_text": "Your child will likely have ongoing respiratory therapy, digestive therapy, and treatment with medicines such as antibiotics. Regular medical care, home treatment such as postural drainage, and taking steps to reduce infection can help people with cystic fibrosis lead relatively normal lives. Your doctor will ask you about your child's immunizations and will schedule any shots that are needed. Children with cystic fibrosis should have all the recommended shots, plus pneumococcal shots."}, {"url": "http://ghr.nlm.nih.gov/condition/cystic-fibrosis", "passage_text": "Cystic fibrosis is an inherited disease characterized by the buildup of thick, sticky mucus that can damage many of the body's organs. The disorder's most common signs and symptoms include progressive damage to the respiratory system and chronic digestive system problems. Most people with cystic fibrosis also have digestive problems. Some affected babies have meconium ileus, a blockage of the intestine that occurs shortly after birth. Other digestive problems result from a buildup of thick, sticky mucus in the pancreas."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001167/", "passage_text": "Cystic fibrosis is an inherited disease which causes mucus in the lungs to be more sticky than normal, leading to frequent lung infections and lung damage. Pneumococcus is a type of bacteria that can cause infection throughout the body, including in the urine, blood stream, fluid around the brain and in the lungs. The parents likely don't have the disease themselves. CF mainly affects the lungs, pancreas, liver, intestines, sinuses, and sex organs. Overview. Mucus is a substance made by tissues that line some organs and body cavities, such as the lungs and nose. Normally, mucus is a slippery, watery substance."}, {"url": "http://medical-dictionary.thefreedictionary.com/cystic+fibrosis", "passage_text": "The gene that, when defective, causes CF is called the cystic fibrosis transmembrane conductance regulator (CFTR) gene. A defect in this single gene causes all the consequences of CF. There are over 1,600 known defects in the CFTR gene that can cause CF. The glands most affected are those in the pancreas and respiratory system and the sweat glands. Cystic fibrosis is usually recognized in infancy or early childhood, chiefly among Caucasians. The earliest manifestation is meconium ileus, an obstruction of the small bowel by viscid stool."}, {"url": "http://ghr.nlm.nih.gov/condition/cystic-fibrosis", "passage_text": "In people with cystic fibrosis, the body produces mucus that is abnormally thick and sticky. This abnormal mucus can clog the airways, leading to severe problems with breathing and bacterial infections in the lungs. These infections cause chronic coughing, wheezing, and inflammation. Most people with cystic fibrosis also have digestive problems. Some affected babies have meconium ileus, a blockage of the intestine that occurs shortly after birth. Other digestive problems result from a buildup of thick, sticky mucus in the pancreas."}]