[{"url": "https://www.interworks.com/blog/bfair/2011/03/02/getting-service-tag-command-prompt", "passage_text": "The Solution: Open up that command prompt, and type in wmic systemenclosure get serialnumber -- that's the magic spell that will provide you with your service tag. If you have an HP Server or IBM Server, or really any other server, it will provide you with their serial numbers too. Quite handy, it is! "}, {"url": "http://en.community.dell.com/techcenter/storage/f/4466/t/19415182", "passage_text": "Need to find out the EqualLogic PS Array member model from CLI. Like 0. You have posted to a forum that requires a moderator to approve posts before they are publicly available. Posted by DELL-Joe S. on 14 Sep 2011 6:23 AM. aleemq, You can see the model information by using the show member [membername] command. In the output you should see a lable called Product Family. Example: _____________________________ Member Information ______________________________. Name: SupPro Status: online. TotalSpace: 3.48TB UsedSpace: 1.09TB."}, {"url": "http://swuve.com/?p=10", "passage_text": "1 It will start with “SHU”. 2  Go to the Dell Equallogic Serial Number Converter website. 3  Type in the serial number and hopefully you will get a response. 4  Since it probably won’t work, you will need to call 1-800-945-3355 and tell support that you want to find your Equallogic Service Tag number. Dell Equallogic arrays are defined by serial numbers, not service tags. 1  Open up Group Manager. 2  Use grpadmin:grpadmin, if everything is default, to login. 3  Click Members and choose the appropriate array. 4  Go to the versions tab and highlight backplane. 5  Take note of the backplane serial number. 6 "}, {"url": "http://www.dell.com/learn/us/en/04/campaigns/equallogic-software", "passage_text": "Dell EqualLogic software gives you enterprise power with everyday simplicity. Through end-to-end solutions, you can efficiently move the right data to the right place at the right time and for the right cost. Virtual Disk Service (VDS) ProviderVDS Provider simplifies creation and management of EqualLogic volumes using Microsoft Storage Manager. IT managers can use the familiar Microsoft VDS and Microsoft Storage Manager to create and manage EqualLogic volumes."}, {"url": "http://swuve.com/?p=10", "passage_text": "1 Go to the Dell Equallogic Serial Number Converter website. 2  Type in the serial number and hopefully you will get a response. 3  Since it probably won’t work, you will need to call 1-800-945-3355 and tell support that you want to find your Equallogic Service Tag number. Dell Equallogic arrays are defined by serial numbers, not service tags. 1  Open up Group Manager. 2  Use grpadmin:grpadmin, if everything is default, to login. 3  Click Members and choose the appropriate array. 4  Go to the versions tab and highlight backplane. 5  Take note of the backplane serial number. 6  It will start with “SHU”."}, {"url": "http://www.thegeekstuff.com/2010/11/dell-service-tag-for-vmware/", "passage_text": "If you’ve installed VMWare server on a base OS, you can login to the base OS, and use dmidecode to get the service tag as shown below. This is just like how you identify service tag for DELL poweredge servers on a normal non-virtual server that is running a Linux OS. You can also access the ESXi host’s serial number from the command line, if you have the maintenance console enabled. The command. esxcfg-info-w. will give you hardware information for the server, including the Dell service tag (listed as “Serial Number”."}, {"url": "http://swuve.com/?p=10", "passage_text": "Solution: Dell Equallogic arrays are defined by serial numbers, not service tags. 1  Open up Group Manager. 2  Use grpadmin:grpadmin, if everything is default, to login. 3  Click Members and choose the appropriate array. 4  Go to the versions tab and highlight backplane. 5  Take note of the backplane serial number. 6  Go to the Dell Equallogic Serial Number Converter website. Dell Equallogic arrays are defined by serial numbers, not service tags. 1  Open up Group Manager. 2  Use grpadmin:grpadmin, if everything is default, to login. 3  Click Members and choose the appropriate array. 4  Go to the versions tab and highlight backplane. 5  Take note of the backplane serial number. 6  It will start with “SHU”."}, {"url": "http://www.thegeekstuff.com/2010/11/dell-service-tag-for-vmware/", "passage_text": "If you’ve installed VMWare ESXi, there is no Base OS. If you do dmidecode on one of the virtual machine running on that ESXi, you’ll not get the DELL Service TAG. Instead, you’ll get information about the VMware as shown below. To identify DELL service tag on this server, you should login to vSphere client. Fig: DELL Service Tag displayed from vSphere Client. You can also access the ESXi host’s serial number from the command line, if you have the maintenance console enabled. The command. esxcfg-info-w. will give you hardware information for the server, including the Dell service tag (listed as “Serial Number”."}, {"url": "http://en.community.dell.com/techcenter/storage/f/4466/t/19472796", "passage_text": "Hi, I actually very new to Equallogic and just supplied 2unit of Dell Equallogic PS4110E with 6x3TB HDDs to a customer. For some reason, they are not confident of the reliability of the product. I have tried to convince them accordingly but they just don't buy it. "}, {"url": "http://www.dell.com/learn/us/en/04/campaigns/equallogic-software", "passage_text": "Virtual Volumes Support: vSphere Virtual Volumes solution with Dell EqualLogic PS Series can make operations like single VM snapshot-restores nearly instantaneous. It transforms the PS Series from a LUN-centric to a truly VM-aware storage solution by providing data services and data placement at the VM-level. Virtual Disk Service (VDS) ProviderVDS Provider simplifies creation and management of EqualLogic volumes using Microsoft Storage Manager. IT managers can use the familiar Microsoft VDS and Microsoft Storage Manager to create and manage EqualLogic volumes."}]