[{"url": "http://homeguides.sfgate.com/use-quitclaim-deed-6769.html", "passage_text": "A quitclaim deed is a legal document that is used to transfer an interest or ownership in real property, such as a house, raw land or a mobile home, from one individual or party to another. The person selling the property is known as the grantor, and the one buying it, the grantee."}, {"url": "http://real-estate.lawyers.com/residential-real-estate/quitclaim-deed-overview.html", "passage_text": "A quitclaim deed is a type of deed that transfers an interest in real property, like a house, vacant land or a mobile home. The person giving the property is the grantor. The person receiving the property is the grantee. Quitclaim deeds are sometimes referred to as quit claim or quick claim deeds."}, {"url": "http://www.realtor.com/advice/sell/need-quitclaim-deed/", "passage_text": "The legal document that transfers ownership can be a warranty deed or a quitclaim deed. Warranty deed: Used in most real estate sales transactions, a warranty deed says that the grantor (previous owner) is the owner of the property and has the right to transfer the property to you."}, {"url": "http://homeguides.sfgate.com/quit-claim-deed-mean-7167.html", "passage_text": "The meaning of a quitclaim deed lies, literally, within its name. The person, or grantor, giving the deed over to another person or estate, the grantee, is quitting any claim or interest she may have in the real property. Most deeds in real estate, though, are warranty versions."}, {"url": "https://en.wikipedia.org/wiki/Quitclaim_deed", "passage_text": "A quitclaim deed is a legal instrument which is used to transfer interest in real property. The entity transferring its interest is called the grantor, and when the quitclaim deed is properly completed and executed it transfers any interest the grantor has in the property to a recipient, called the grantee."}, {"url": "http://www.investopedia.com/terms/q/quitclaimdeed.asp", "passage_text": "DEFINITION of 'Quitclaim Deed'. A deed releasing a person's interest in a property without stating the nature of the person's interest or rights, and with no warranties of that person’s interest or rights in the property."}, {"url": "http://www.deedclaim.com/quitclaim-deed/", "passage_text": "A quitclaim deed (sometimes called a quick claim deed or quitclaim deed) is a special deed form that transfers property without any warranty of title. When property is transferred by quitclaim deed, the person who receives the property gets whatever title the transferor has."}, {"url": "http://legal-dictionary.thefreedictionary.com/quitclaim+deed", "passage_text": "A quitclaim deed is a release by the grantor, or conveyor of the deed, of any interest the grantor may have in the property described in the deed. Generally a quitclaim deed relieves the grantor of liability regarding the ownership of the property."}, {"url": "http://www.bankrate.com/finance/real-estate/difference-between-quitclaim-and-warranty-deeds.aspx", "passage_text": "What a deed is. A deed is a document that conveys, or passes, real estate from one party to another. Whether you buy a house from a stranger, inherit it from your parents or add your spouse to the home's title, a deed accomplishes the deed of transferring the title."}]