[{"url": "http://www.nailsmag.com/article/766/is-your-pay-structure-the-problem", "passage_text": "It is a given that a spa is deducting 50% commission from a $25 service. Add a 13.5% payroll burden, 4% for supplies, and 2% for credit card fees and the portion of revenues lost is already up to two-thirds. Other hidden problems also accompany this method of pay. We found that we were paying out more than 50% of the average service cost of $42 anyway, but the pay was more evenly distributed among those who worked very hard and those who were just getting by.”. After several quarters of using the team-based pay system the salon returned to a straight commission model."}, {"url": "http://www.nailsmag.com/article/766/is-your-pay-structure-the-problem", "passage_text": "How a salon chooses to pay its staff can make all the difference in employee retention, quality of service, profitability, and your ability to compete. After payroll, salon owners are often left only with their own tip money and revenue from services they've performed. We found that we were paying out more than 50% of the average service cost of $42 anyway, but the pay was more evenly distributed among those who worked very hard and those who were just getting by.”. After several quarters of using the team-based pay system the salon returned to a straight commission model."}, {"url": "http://work.chron.com/commission-work-hair-salon-21357.html", "passage_text": "Many salons have a commission-building system in place to encourage stylists to bring in business and compensate them for their work. While commission is common among salons, the type, amount and structure of the commission varies significantly from salon to salon. Some salons pay stylists on a commission-only basis, meaning they receive no salary or hourly pay. However, this structure can be difficult for newer stylists who may not have a large customer base. Some salons offer a salary or hourly wages for the first few months before switching to commission-only pay."}, {"url": "http://work.chron.com/commission-work-hair-salon-21357.html", "passage_text": "Some salons have different commission rates for salon services and product sales. As with styling services, commission from product sales may work on a set rate or a graduated scale. Some salons pay stylists on a commission-only basis, meaning they receive no salary or hourly pay. However, this structure can be difficult for newer stylists who may not have a large customer base. Some salons offer a salary or hourly wages for the first few months before switching to commission-only pay."}, {"url": "http://work.chron.com/average-salary-nail-technician-certificate-2309.html", "passage_text": "Among industries with more than 300 jobs for nail technicians, the highest-paid positions were in traveler accommodation, with average pay of $13.40 per hour, or $27,860 per full-time year. High-Paying Areas. In some locations, manicurists and pedicurists receive a higher average income. Nail technicians in Arkansas averaged $33,130 per year in 2011, and those in Iowa averaged $32,790 per year, according to the government study."}, {"url": "http://www.thisuglybeautybusiness.com/2013/01/staff-compensation-comparison-of.html", "passage_text": "In the salon environment, you would hire independent contractors to work a special event, performing services that your salon doesn’t typically offer. With employees, you have three options: hourly pay, hourly pay vs commission, hourly pay + bonuses for performance. "}, {"url": "http://blogs.cornell.edu/advancedrevenuemanagement12/2012/03/28/revenue-management-in-nail-salon-industry-selling-your-time-and-space/", "passage_text": "For example, if the nail technician is scheduled for 40 hours per week and is pre-booked for 30 of those hours, she has a 75% station occupancy rate. When that technician is fully booked more than 85% of the time, the salon will consider raising her price. Backbar expenses for most salon business should be between 10 and at most 15% with careful planning and strick management you can reduce that to as low as 7%. I like your blog on this topic is well-written and original."}, {"url": "http://blogs.cornell.edu/advancedrevenuemanagement12/2012/03/28/revenue-management-in-nail-salon-industry-selling-your-time-and-space/", "passage_text": "To figure the minimum charge per service, multiply the product cost for each service by 16.5. The figure is the lowest possible price for a service. For nail salons pricing base on technician, an “85% rule” are commonly accepted. The salon figure station occupancy by dividing hours booked by hours scheduled. Backbar expenses for most salon business should be between 10 and at most 15% with careful planning and strick management you can reduce that to as low as 7%. I like your blog on this topic is well-written and original."}, {"url": "http://www.latimes.com/local/la-me-ff-nail-chat-20130718-dto-htmlstory.html", "passage_text": "In Vietnamese salons, nails, polish and unvarnished opinions. Julie Luu, right, gives a pedicure to a customer at Sun Nails in Silver Lake. Of the 8,000 nail salons in California, about 75% are owned or operated by Vietnamese Americans, according to Nails magazine. More photos."}, {"url": "http://work.chron.com/average-salary-nail-technician-certificate-2309.html", "passage_text": "Average Wages. The average hourly wage for a nail technician was $10.46 as of May 2011, according to the U.S. Bureau of Labor Statistics. This equaled an annual salary of $21,760 for a year of 40-hour weeks. Nail technicians usually work full time, especially in a full-service salon. High-Paying Areas. In some locations, manicurists and pedicurists receive a higher average income. Nail technicians in Arkansas averaged $33,130 per year in 2011, and those in Iowa averaged $32,790 per year, according to the government study."}]