[{"url": "http://spacefem.com/pregnant/charts/duedate6.php", "passage_text": "There are articles all over the web that say the average first time mother goes eight days overdue and doesn't have her baby until 41 weeks, 1 day. I say hold off, people. There's only one study that suggested this median: The length of uncomplicated human gestation (Mittendorf et al). Considering only births resulting from spontaneous labor: 1  The average first time mom had her baby at 39W,5D. 54.9% of first time moms delivered their babies on or before their due date. 2  This is based on 5079 first time moms who filled out the survey."}, {"url": "https://en.wikipedia.org/wiki/Pregnancy", "passage_text": "Pregnancy, also known as gravidity or gestation, is the time during which one or more offspring develops inside a woman. A multiple pregnancy involves more than one offspring, such as with twins. Pregnancy can occur by sexual intercourse or assisted reproductive technology. It usually lasts around 40 weeks from the last menstrual period (LMP) and ends in childbirth. This is just over 9 lunar months, where each month is about 29½ days. When measured from conception it is about 38 weeks. An embryo is the developing offspring during the first 8 weeks following conception, after which, the term fetus is used until birth. Symptom of early pregnancy may include a missed periods, tender breasts, nausea and vomiting, hunger, and frequent urination."}, {"url": "https://en.wikipedia.org/wiki/Pregnancy", "passage_text": "Term pregnancy is 37 weeks to 41 weeks, with early term being 37 and 38 weeks, full term 39 and 40 weeks, and late term 41 weeks. When measured from conception it is about 38 weeks. An embryo is the developing offspring during the first 8 weeks following conception, after which, the term fetus is used until birth. Symptom of early pregnancy may include a missed periods, tender breasts, nausea and vomiting, hunger, and frequent urination."}, {"url": "http://www.transitiontoparenthood.com/ttp/parented/pregnancy/duedate.htm", "passage_text": "In 1990, researchers (Mittendorf, et al) re-examined this issue for modern American women. Results indicated that, for first-time Caucasian moms, an average pregnancy lasts 274 days from conception (approximately 288 days from the last menstrual period). If ultrasound is performed in the first trimester, it can indicate fetal age within a range of 3 5 days. Later in pregnancy, it is less accurate. Up to 20 weeks, the margin of error is 7 10 days. By the third trimester, an ultrasound date can be off by as much as 3 weeks in either direction."}, {"url": "http://www.peteducation.com/article.cfm?c=2+2109&aid=1026", "passage_text": "A. Pregnancy in the dog lasts approximately 63 days. The normal due date can be about 1 week either side of the predicted 63 days. In cases of large litters, length is usually lessened. In cases of small litter numbers, length may increase"}, {"url": "https://answers.yahoo.com/question/index?qid=20071123150206AAkPAtA", "passage_text": "If i remember correctly, i think it's common for a first time pregnancy to go about a week past the due date, and the Doc will induce you NO LATER than 2 weeks past the due date. Remember that this is just typical of MOST first time moms, but you know how pregnancy goes-everyone is completely different. Most doctors will induce at 1-2 weeks past due date. Midwives will let you go longer. I had my first exactly a week before my due date. However, I was induced due to high blood pressure (pre-existing... not caused by the pregnancy.) I was in labor for 2 1/2 days before we did a c-section."}, {"url": "http://yourbirthcoach.com/2011/10/12/induced-labour-induction-of-labor-due-dates-estimated-due-date-natural-childbirth-pitocin-length-of-pregnancy-your-birth-coach-when-are-you-due/", "passage_text": "There are a few things to consider about due dates. This is based on pregnancy lasting approximately 10 moon cycles which would be 40 weeks. The average pregnancy is actually 40 weeks + 3 days and the average first time pregnancy is actually 41 weeks +1 day. Therefore as a first time mom, if you are at 40 weeks + 8 days you haven’t even gone beyond the average. Every pregnancy will last a different amount of time. Anywhere between 37 and 43 weeks is considered normal. 80% of babies are born within the 2 weeks before or after 40 weeks and only about 5% of babies are born on their “due dates”."}, {"url": "http://www.webmd.com/baby/news/20060323/typical-pregnancy-now-39-weeks-not-40", "passage_text": "March 23, 2006 -- The most common length of a pregnancy in the U.S. is a week shorter than it was just over a decade ago, dropping from 40 weeks to 39 weeks, according to a new analysis from the March of Dimes. "}, {"url": "http://www.transitiontoparenthood.com/ttp/parented/pregnancy/duedate.htm", "passage_text": "The standard calculation is called N gele s Rule. This was developed in the 1850 s by a Dr. N gele, who determined that the average human pregnancy was 266 days from conception, or 280 days (40 weeks) from the start of the last menstrual period. To calculate this, begin with the first day of your last period (LMP). Add 7 days, then subtract 3 months. If ultrasound is performed in the first trimester, it can indicate fetal age within a range of 3 5 days. Later in pregnancy, it is less accurate. Up to 20 weeks, the margin of error is 7 10 days. By the third trimester, an ultrasound date can be off by as much as 3 weeks in either direction."}]