[{"url": "http://www.answers.com/Q/What_is_a_female_horse_called", "passage_text": "A mare which is used for breeding can also be called a broodmare or a breeding mare.. When a mare breeds, it is considered the foal's Dam.. 1  An adult female horse is called a mare. 2  A young female horse is called a filly. 3  Under a year, both males and females are also called foals."}, {"url": "http://www.answers.com/Q/What_is_a_female_horse_called", "passage_text": "There are a number of terms, depending on age: A mare which is used for breeding can also be called a broodmare or a breeding mare.. When a mare breeds, it is considered the foal's Dam.. 1  An adult female horse is called a mare. 2  This is usually used for a female horse over 3 years of age. When a mare breeds, it is considered the foal's Dam.. 1  An adult female horse is called a mare. 2  A young female horse is called a filly. 3  Under a year, both males and females are also called foals."}, {"url": "http://www.netvet.co.uk/equine/neutering/spaying-a-mare.htm", "passage_text": "Spaying a mare. The spaying of a female horse, also known as a mare, is an operation called an ovariectomy which is the surgical removal of the ovaries and so preventing the continuation of the oestrus cycle. "}, {"url": "http://www.answers.com/Q/What_is_a_female_horse_called", "passage_text": "1 An adult female horse is called a mare. 2  This is usually used for a female horse over 3 years of age. 3  A young female horse is called a filly. 4  This is typically used until the age of 3 or 4 years. 5  Under a year, both males and females are also called foals. When a mare breeds, it is considered the foal's Dam.. 1  An adult female horse is called a mare. 2  A young female horse is called a filly. 3"}, {"url": "http://www.answers.com/Q/What_is_a_girl_and_a_boy_horse_called", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Missmoon00. Confidence votes 28. A young girl horse is called a filly, and a young male is called a colt. An adult female is called a mare, and an un-castrated adult male is called a stallion. A castrated adu … lt male is called a gelding. "}, {"url": "https://en.wikipedia.org/wiki/Donkey", "passage_text": "The offspring of a zebra-donkey cross is called a zonkey, zebroid, zebrass, or zedonk; zebra mule is an older term, but still used in some regions today. The foregoing terms generally refer to hybrids produced by breeding a male zebra to a female donkey. Small numbers of donkeys are kept for breeding or as pets in developed countries. A male donkey or ass is called a jack, a female a jenny or jennet; a young donkey is a foal. Jack donkeys are often used to mate with female horses to produce mules."}, {"url": "https://answers.yahoo.com/question/index?qid=20061007092310AArc7Oq", "passage_text": "well a baby horse is called a foal and a baby femae hrse is a filly and a baby male hrse is a colt.The male is called a colt until it is turned 4 years.Sam wth the filly. A newly born baby horse is called a foal, when the horse gives birth it's often called foaling and as it gets a little bigger the baby grows into a colt. Kind of like a baby growing into a toddler."}, {"url": "http://www.answers.com/Q/What_is_a_female_horse_called", "passage_text": "1 This is usually used for a female horse over 3 years of age. 2  A young female horse is called a filly. 3  This is typically used until the age of 3 or 4 years. 4  Under a year, both males and females are also called foals. When a mare breeds, it is considered the foal's Dam.. 1  An adult female horse is called a mare. 2  A young female horse is called a filly. 3"}, {"url": "https://answers.yahoo.com/question/index?qid=20080910154344AA15lzb", "passage_text": "A male horse is a stallion. A female horse is a mare. A young male horse is a colt. A young female horse is a filly. A neutered male horse is a gelding."}, {"url": "https://en.wikipedia.org/wiki/Mare", "passage_text": "In Thoroughbred horse racing a mare is defined as a female horse more than four years old, but the word can also be used for other female equine animals, particularly mules and zebras, though a female donkey is usually called a jenny.. A broodmare is a mare used for breeding. A horse's female parent is known as its dam. An uncastrated adult male horse is called a stallion and a castrated male is a gelding. Occasionally the term horse is used in a restrictive sense to designate only a male horse. "}]