[{"url": "http://www.healthline.com/health/cold-flu/sinus-infection-symptoms", "passage_text": "Sinus Discharge. Pain from a sinus infection is no fun, and the nasal discharge isn’t great either. When you have a sinus infection, you may need to blow your nose often because of a greenish-yellow discharge. This comes from your infected sinuses and drains into your nasal passages."}, {"url": "http://www.healthline.com/health/cold-flu/sinus-infection-symptoms", "passage_text": "Pain. The most common symptom of sinusitis, and often the most unpleasant, is pain. You have several different sinuses above and below your eyes, and behind your nose. Any of these can hurt when you have a sinus infection. Inflammation and swelling in the sinuses causes them to ache with a dull pressure."}, {"url": "http://www.emedicinehealth.com/sinus_infection/article_em.htm", "passage_text": "Sinus infection, or sinusitis, is an inflammation of the sinuses and nasal passages. A sinus infection can cause a headache or pressure in the eyes, nose, cheek area, or on one side of the head."}, {"url": "https://en.wikipedia.org/wiki/Sinusitis", "passage_text": "Sinusitis, also known as a sinus infection or rhinosinusitis, is inflammation of the sinuses resulting in symptoms. Common signs and symptoms include thick nasal mucous, a plugged nose, and pain in the face."}, {"url": "http://www.webmd.com/allergies/sinusitis-and-sinus-infection", "passage_text": "Sinusitis is an inflammation, or swelling, of the tissue lining the sinuses. Normally, sinuses are filled with air, but when sinuses become blocked and filled with fluid, germs (bacteria, viruses, and fungi) can grow and cause an infection."}, {"url": "http://www.niaid.nih.gov/topics/sinusitis/Pages/Index.aspx", "passage_text": "Sinusitis is an inflammation of the membranes lining the paranasal sinuses—small air-filled spaces located within the skull or bones of the head surrounding the nose. Sinusitis can be caused by an infection or other health problem, and symptoms include facial pain and nasal discharge."}, {"url": "http://www.healthline.com/health/cold-flu/sinus-infection-symptoms", "passage_text": "Medically termed sinusitis, a sinus infection occurs when the cavities around your nose become swollen and inflamed. Sinusitis is most often caused by a virus and often lasts long after the other upper respiratory symptoms are gone. Rarely, fungus or bacteria may cause a sinus infection."}, {"url": "http://www.healthline.com/health/cold-flu/sinus-infection-symptoms", "passage_text": "The symptoms of sinus infection and allergies can be similar. Both can cause symptoms such as runny nose, congestion, headaches, nighttime cough, and difficulty breathing."}, {"url": "http://www.buzzle.com/articles/sinusitis-sinus-infection-symptoms-treatment.html", "passage_text": "In this case, sinus infection starts with symptoms like stuffy nose, nasal discharge, facial pain and pressure, etc. Some people may experience loss of smell too. As the condition advances, symptoms like fever, fatigue, bad breath, and post nasal drip may occur. Even cough, dental pain, etc., are noted."}, {"url": "http://www.sinusinfectionhelp.com/sinus-infection-symptoms.html", "passage_text": "In general, the symptoms of sinus infection are general weakness and lethargy, nasal congestion, rhinitis or runny nose and it is also common to have fever and headache in all types of sinus infection."}]