[{"url": "http://www.topratedtrumpets.com/bach-stradivarius-trumpet-review/", "passage_text": "Bach Stradivarius Trumpet Features. 1  Medium-fast taper bell produces a brilliant sound with a warm quality makes this a versatile trumpet suitable for jazz to concert or solo playing. 2  Leadpipe design minimizes resistance and effectively centers tone production. Bach Stradivarius Trumpet Gold Trim Kit. If you'd like to really make your Bach Strad standout from the crowd you might consider adding a"}, {"url": "http://www.topratedtrumpets.com/bach-stradivarius-trumpet-review/", "passage_text": "The Bach Stradivarius trumpet is the creme de la creme of professional trumpets and the instrument of choice of most professional orchestral trumpet players (the 180S37 model in particular). Bach Stradivarius Trumpet Gold Trim Kit. If you'd like to really make your Bach Strad standout from the crowd you might consider adding a"}, {"url": "https://en.wikipedia.org/wiki/Stradivarius", "passage_text": "A Stradivarius is one of the violins, violas, cellos and other string instruments built by members of the Stradivari (Stradivarius) family, particularly Antonio Stradivari, during the 17th and 18th centuries. A Stradivarius made in the 1680s, or during Stradivari's Long Pattern period from 1690 to 1700, could be worth hundreds of thousands to several million U.S. dollars at today's prices."}, {"url": "https://en.wikipedia.org/wiki/Vincent_Bach_Corporation", "passage_text": "The Vincent Bach Corporation is an American manufacturer of brass musical instruments that began early in the twentieth century and still exists as a subsidiary of Conn-Selmer, a division of Steinway Musical Instruments. The company was founded in 1918 by Austrian-born trumpeter Vincent Schrotenbach (Vincent Bach). The Bach line of brass instruments continues to be made in Elkhart, Indiana, using the same blueprints and the same techniques as the originals. They are sold as a premium brand under the name “Bach Stradivarius” as well as the student line “Bach” horns."}, {"url": "http://www.topratedtrumpets.com/", "passage_text": "There are lots and lots of excellent professional trumpets on the market. Finding the one that is best for you largely comes down to personal preference. Two pro horns that come highly recommended and that you might consider are the Kanstul 1000 and the Bach Stradivarius. Best Value Professional Trumpet. The Kanstul 1000 trumpet is one of the best values for a professional level trumpet available today, considering overall quality, price and customer satisfaction."}, {"url": "http://www.wikihow.com/Select-a-Good-Trumpet", "passage_text": "1 Some reputable trumpet brands are Yamaha, Bach, Getzen, and Schilke. 2  Try these and many more! 3  Every player is different, what may be amazing for someone else might be terrible for you. 4  Always keep your valves oiled and slides greased; it's extremely difficult to get rid of months of neglect on an instruments valves. Tips. 1  Some reputable trumpet brands are Yamaha, Bach, Getzen, and Schilke. 2  Always keep your valves oiled and slides greased; it's extremely difficult to get rid of months of neglect on an instruments valves. 3  Polishing is key, as silver will tarnish when put in frequent contact with skin oils. 4  Give your trumpet a full cleaning once or twice a year."}, {"url": "http://www.topratedtrumpets.com/bach-stradivarius-trumpet-review/", "passage_text": "The Bach 180S37 Stradivarius has an almost cult-like following and receives rave reviews from professional trumpet player such as these, THE trumpet to buy!. ...this is one of the best professional Bb trumpets on the market. Bach Stradivarius Trumpet Gold Trim Kit. If you'd like to really make your Bach Strad standout from the crowd you might consider adding a"}, {"url": "https://en.wikipedia.org/wiki/Stradivarius", "passage_text": "The name Stradivarius has become a superlative often associated with excellence; to be called the Stradivari of any field is to be deemed the finest there is. The fame of Stradivarius instruments is widespread, appearing in numerous works of fiction. A Stradivarius made in the 1680s, or during Stradivari's Long Pattern period from 1690 to 1700, could be worth hundreds of thousands to several million U.S. dollars at today's prices."}, {"url": "https://en.wikipedia.org/wiki/Stradivarius", "passage_text": "While only about 650 original Stradivari instruments (harps, guitars, violas, cellos, violins) survive today, thousands of violins have been made in tribute to Stradivari, copying his model and bearing labels that read Stradivarius on them. A Stradivarius made in the 1680s, or during Stradivari's Long Pattern period from 1690 to 1700, could be worth hundreds of thousands to several million U.S. dollars at today's prices."}]