[{"url": "http://smallbusiness.chron.com/features-contract-employment-42541.html", "passage_text": "Employment Contracts. For a contract to be valid, it must include an offer, an acceptance and some type of benefit, known as consideration.. Employment contracts are no different. If you're thinking about having new employees sign an employment contract, the benefit they receive is employment. However, existing employees also must be given some type of benefit if you're going to ask them to sign a contract. If you're a small-business owner and you're thinking about having someone sign a contract of employment, you should first become familiar with some key concepts of contract law. Employment contracts can be tailored to include specific features that will protect your business."}, {"url": "http://www.ehow.com/about_5426487_important-employment-contracts.html", "passage_text": "A good employment contract is beneficial to both the employee and the employer. It spells out the rights and obligations of each party, protects the job security of the employee and protects the employer from certain risks such as the release of confidential employer information after the term of employment ends. Most employment contracts set a definite term of employment. This guarantees employees a job as long as they do not violate the terms of the contract, and allows employers to dismiss an employee at the end of the term in jurisdictions that restrict the ability of employers to fire employees."}, {"url": "https://www.gov.uk/employment-contracts-and-conditions/written-statement-of-employment-particulars", "passage_text": "4. Written statement of employment particulars. An employer must give employees a ‘written statement of employment particulars’ if their employment contract lasts at least a month or more. This isn’t an employment contract but will include the main conditions of employment. "}, {"url": "http://employment.findlaw.com/hiring-process/employment-contracts-and-compensation-agreements.html", "passage_text": "Sometimes there is no written or oral agreement, but the behavior of the employer and the employee can be viewed as an implied employment contract. Most employment contracts have common elements such as the employee's start date, salary, and benefits. Other provisions that often appear in employment contracts are listed here, so that you can think about what kind of employment contract is agreeable to you before you sign your next employment agreement."}, {"url": "http://www.citizensinformation.ie/en/employment/employment_rights_and_conditions/contracts_of_employment/contract_of_employment.html", "passage_text": "1 The terms that the courts say are in every contract of employment. 2  Examples include the duty of every employer to provide a safe workplace and the duty of every employee to carry out the job to the best of his/her ability. 3  This part of the contract is occasionally referred to as common law. While the complete contract does not have to be in writing, an employee must be given a written statement of terms of employment within 2 months of starting work-see 'Rules' below. The majority of employees work under open-ended contracts"}, {"url": "http://www.nolo.com/legal-encyclopedia/written-employment-contracts-pros-cons-30193.html", "passage_text": "Disadvantages. An employment contract is not a one-way street. The contract binds both you and the employee, so it limits your flexibility. This may pose a problem if you later decide that you don't like the contract terms or the needs of your business change. In fact, written employment contracts are generally the exception, rather than the rule. In some situations, however, it makes good sense to ask an employee to sign a contract. This article explains the pros and cons of using written contracts with employees."}, {"url": "http://www.nolo.com/legal-encyclopedia/written-employment-contracts-pros-cons-30193.html", "passage_text": "A written employment contract is a document that you and your employee sign setting forth the terms of your relationship. You don't have to enter into a written contract with every employee you hire. In fact, written employment contracts are generally the exception, rather than the rule. In some situations, however, it makes good sense to ask an employee to sign a contract. This article explains the pros and cons of using written contracts with employees."}, {"url": "https://en.wikipedia.org/wiki/Employment_contract", "passage_text": "An employment contract or contract of employment is a kind of contract used in labour law to attribute rights and responsibilities between parties to a bargain. The contract is between an employee and an employer.. It has arisen out of the old master-servant law, used before the 20th century. But generally, the contract of employment denotes a relationship of economic dependence and social subordination. In the words of the controversial labour lawyer Sir Otto Kahn-Freund, A contract of employment usually defined to mean the same as a contract of service. A contract of service has historically been distinguished from a contract for the supply of services, the expression altered to imply the dividing line between a person who is employed and someone who is self-employed."}, {"url": "http://www.ehow.com/about_5426487_important-employment-contracts.html", "passage_text": "Term. Most employment contracts set a definite term of employment. This guarantees employees a job as long as they do not violate the terms of the contract, and allows employers to dismiss an employee at the end of the term in jurisdictions that restrict the ability of employers to fire employees."}]