[{"url": "https://mises.org/library/why-it-matters-if-dollar-reserve-currency", "passage_text": "We refer to the dollar as a “reserve currency” when referring to its use by other countries when settling their international trade accounts. For example, if Canada buys goods from China, China may prefer to be paid in US dollars rather than Canadian dollars. The first truly global reserve currency was the British pound sterling. Because the Pound was “good as gold,” many countries found it more convenient to hold pounds rather than gold itself during the age of the gold standard."}, {"url": "http://www.investopedia.com/terms/s/sdr.asp", "passage_text": "DEFINITION of 'Special Drawing Rights-SDR'. An international type of monetary reserve currency, created by the International Monetary Fund (IMF) in 1969, which operates as a supplement to the existing reserves of member countries. "}, {"url": "http://procinctu.info/global-reserve-currency-status-petrodollar/", "passage_text": "For the last several decades, the U.S. Dollar has held reserve currency status among the world. This means that it is the most widely held currency among all nations and is often the medium of exchange in the global economy. The Petrodollar is THE reason the US dollar still holds global reserve currency status. Oil runs economies all over the world. If they don’t have oil, they need to buy it. If they need to buy it, they need to have US dollars."}, {"url": "http://www.investopedia.com/terms/r/reservecurrency.asp", "passage_text": "BREAKING DOWN 'Reserve Currency'. In 2011, the U.S. dollar was the primary reserve currency used by other countries. As a result, foreign nations closely monitored the monetary policy of the United States in order to ensure that the value of their reserves is not adversely affected by inflation. A large percentage of commodities, such as gold and oil, are usually priced in the reserve currency, causing other countries to hold this currency to pay for these goods."}, {"url": "https://en.wikipedia.org/wiki/Reserve_currency", "passage_text": "By the end of the 20th century, the United States dollar was considered the world's most dominant reserve currency, and the world's need for dollars has allowed the United States government as well as Americans to borrow at lower costs, granting them an advantage in excess of $100 billion per year. The Swiss franc, despite gaining ground among the world's foreign-currency reserves and being often used in denominating foreign loans, cannot be considered as a world reserve currency, since the share of all foreign exchange reserves held in Swiss francs has historically been well below 0.5%."}, {"url": "http://www.imf.org/external/pubs/ft/fandd/2014/03/prasad.htm", "passage_text": "All these factors should have set off an economic decline in the United States and hastened erosion of the dollar’s importance. But the reality is starkly different. The dominance of the dollar as a global reserve currency has been barely affected by the global financial crisis. Not only did the dollar’s share in global foreign currency reserves change only modestly in the decade before the crisis, it has held steady at about 62 percent since the crisis began (see Chart 2). Overall, foreigners have sharply increased their holdings of U.S. financial assets."}, {"url": "https://en.wikipedia.org/wiki/Reserve_currency", "passage_text": "A shakeel currency (or anchor currency) is a currency that is held in significant quantities by governments and institutions as part of their foreign exchange reserves. The reserve currency is commonly used in international transactions and often considered a hard currency or safe-haven currency. The Swiss franc, despite gaining ground among the world's foreign-currency reserves and being often used in denominating foreign loans, cannot be considered as a world reserve currency, since the share of all foreign exchange reserves held in Swiss francs has historically been well below 0.5%."}, {"url": "https://mises.org/library/why-it-matters-if-dollar-reserve-currency", "passage_text": "Threats To the Dollar as Reserve Currency. The causes of this threat to the dollar as a reserve currency are the policies of the Fed itself. There is no conspiracy to “attack” the dollar by other countries, in my opinion. There is, however, a rising realization by the rest of the world that the US is weakening the dollar through its ZIRP and QE programs. The first truly global reserve currency was the British pound sterling. Because the Pound was “good as gold,” many countries found it more convenient to hold pounds rather than gold itself during the age of the gold standard."}, {"url": "http://www.investopedia.com/terms/r/reservecurrency.asp", "passage_text": "DEFINITION of 'Reserve Currency'. A foreign currency held by central banks and other major financial institutions as a means to pay off international debt obligations, or to influence their domestic exchange rate. A large percentage of commodities, such as gold and oil, are usually priced in the reserve currency, causing other countries to hold this currency to pay for these goods."}, {"url": "http://www.davemanuel.com/investor-dictionary/reserve-currency/", "passage_text": "A reserve currency is a currency that is held in significant amounts by governments and institutions in order to help conduct transactions in the global market. The major reserve currency of the planet right now is the US Dollar, which composes upwards of 60% of all forex reserves. The Euro has grown in prominence over the past decade as a reserve currency, and now makes up nearly 30% of all forex reserves through the world. Commodities such as oil and gold are usually priced in a certain type of currency (US Dollars), meaning that governments need to have large pools of US Dollars (or Euros) in their foreign exchange reserves in order to engage in the buying and selling of these commodities."}]