[{"url": "https://www.usps.com/international/passports.htm", "passage_text": "Post Office locations that accept passport applications offer the products and services you need for a first-time passport or renewal passport application. At some locations, you can have your passport photo taken on-site for an additional fee. Get a Passport in a Hurry. Priority Mail Express. 1  Renew Your Passport Renew by Mail You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site."}, {"url": "http://www.onthegosoft.com/passport_renewal.htm", "passage_text": "2) Application form and fee. In most cases, you can visit the website of your country's passport office and get the forms from there. You'll be able to print and fill them at home. Then, you can send these forms by post to be processed. 3) Two new passport photos. In any case, when renewing your passport, you'll need a pair of identical, recent passport photos. You can save money by making them yourself using Passport Photo."}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "Renew by Mail. You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. Renew by Mail Checklist. You can also renew your passport by bringing your prepared renewal application to a Post Office™ location. Get a Passport in a Hurry. Priority Mail Express. 1  Renew Your Passport Renew by Mail"}, {"url": "http://www.us-passport-service-guide.com/us-passport-renewals.html", "passage_text": "It was issued in your current name or you can legally document your name change; If you do not meet the criteria, you cannot apply to renew your passport by mail. You need to submit the application for a new U.S. passport (Form DS-11) and supporting documents in person at an application acceptance facility. 1. Getting your passport renewed fast is essential if your departure date is within 30 days, especially if you need to obtain a travel visa. You can get expedited service by mail in up to 3 weeks or submit the renewal form at a regional center for faster service."}, {"url": "http://www.cic.gc.ca/english/passport/apply/renew/apply-how.asp", "passage_text": "Renew your passport – adults outside Canada and the United States. Submit your application to the nearest Government of Canada passport issuing office abroad. If you happen to be in Canada, you can apply in person at a Passport office and a service fee will apply. To renew your passport you must be a Canadian citizen and 16 years of age and over. If you are in Canada, you may apply in person at a Passport office but you will be required to pick up your passport in person before you leave. You cannot apply at a Service Canada or Canada Post receiving agent. The passport cannot be mailed to your address outside Canada or"}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "1 Renew Your Passport Renew by Mail You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. 2  Renew by Mail Checklist You can also renew your passport by bringing your prepared renewal application to a Post Office™ location. Get a Passport in a Hurry. Priority Mail Express. 1 "}, {"url": "http://www.cic.gc.ca/english/passport/apply/renew/apply-how.asp", "passage_text": "You must send your application by mail. If you happen to be in Canada, you can apply in person at a passport office or a receiving agent (Service Canada or Canada Post) and make arrangements to pick it up for an additional service fee or have the passport delivered to your address in the United States. If you are in Canada, you may apply in person at a Passport office but you will be required to pick up your passport in person before you leave. You cannot apply at a Service Canada or Canada Post receiving agent. The passport cannot be mailed to your address outside Canada or"}, {"url": "http://www.onthegosoft.com/passport_renewal.htm", "passage_text": "1) Your current passport. To renew it, you'll have to have your current passport (and if you have more than one, you'll need to most recent). Make sure that it's in good condition, otherwise, you'll probably have to make a new one. 3) Two new passport photos. In any case, when renewing your passport, you'll need a pair of identical, recent passport photos. You can save money by making them yourself using Passport Photo."}, {"url": "https://www.gov.uk/renew-adult-passport", "passage_text": "Renew or replace your adult passport. You can renew or replace your passport at any time. It costs £72.50, or £82.25 through the Post Office’s Passport Check and Send service. Time left on an existing passport is added to your new one, up to a maximum of 9 months. Unexpired visas. If you’re renewing your passport, send your previous passport with the visa attached to it with your application. Your previous passport will be returned to you. Carry both passports if you want to use the visa in the previous passport."}]