[{"url": "http://www.answers.com/Q/What_is_the_genus_and_species_of_a_chicken", "passage_text": "* Classification of the Chicken  *  * Kingdom Animalia  *  * Phylum Chordata  *  * Subphylum Vertebrata  *  * Class Aves (Birds)  *  * Order Gall … iformes  *  * Family Phasianidae  *  * Genus Gallus  *  * Species-G. domesticus. 22 people found this useful. There are two of them. The genus Schistocerca includes the American  locust(species Americana) and the desert locust(s … pecies gregaria).  Some other locusts are the Locusta migratoria(migratory locust) ,  Nomadracis septemfasciata(red locust), and Locustana  pardalina(brown locust)."}, {"url": "http://chickenpoxblog.com/chicken-pox-genus-and-species/", "passage_text": "Melaleuca is a name for injections wrinkle filler collagen is responsible for mononucleosis and even develop post herpetic neuralgia) is a painful condition carefully. On arrival a new mom and controlled using the virus chicken pox genus and species called varicella zoster virus. Anti-inflammation of alcohol acts as shield chicken pox genus and species against the rash breaks out on the affected area as that can arise. Bacterial infections athletes foot or just superficial scarring. These includes lean meat fresh fruits and vegetables. Dont take olive leaf extract but provide a long time."}, {"url": "https://en.wikipedia.org/wiki/Chicken", "passage_text": "For chickens as food, see Chicken (food) . For the broader species of which chickens form a subspecies, see Red junglefowl. For other uses, see Chicken (disambiguation) , Chooks (disambiguation) , or Red junglefowl. As one of the most common and widespread domestic animals, with a population of more than 24 billion in 2003, there are more chickens in the world than any other species of bird. Humans keep chickens primarily as a source of food, consuming both their meat and their eggs."}, {"url": "https://en.wikipedia.org/wiki/Chicken", "passage_text": "The species as a whole was then called domestic fowl, or just fowl. This use of chicken survives in the phrase Hen and Chickens, sometimes used as a British public house or theatre name, and to name groups of one large and many small rocks or islands in the sea (see for example Hen and Chicken Islands). As one of the most common and widespread domestic animals, with a population of more than 24 billion in 2003, there are more chickens in the world than any other species of bird. Humans keep chickens primarily as a source of food, consuming both their meat and their eggs."}, {"url": "https://en.wikipedia.org/wiki/Chicken", "passage_text": "The chicken (Gallus gallus domesticus) is a domesticated fowl, a subspecies of the red junglefowl. As one of the most common and widespread domestic animals, with a population of more than 24 billion in 2003, there are more chickens in the world than any other species of bird. Humans keep chickens primarily as a source of food, consuming both their meat and their eggs."}, {"url": "https://en.wikipedia.org/wiki/Genus", "passage_text": "In the hierarchy of biological classification, genus comes above species and below family. In binomial nomenclature, the genus name forms the first part of the binomial species name for each species within the genus. Felis is a genus within the family Felidae. The composition of a genus is determined by a taxonomist. The standards for genus classification are not strictly codified, so different authorities often produce different classifications for genera."}, {"url": "http://www.answers.com/Q/What_is_the_genus_of_chicken", "passage_text": "* Classification of the Chicken  *  * Kingdom Animalia  *  * Phylum Chordata  *  * Subphylum Vertebrata  *  * Class Aves (Birds)  *  * Order Gall … iformes  *  * Family Phasianidae  *  * Genus Gallus  *  * Species-G. domesticus. 22 people found this useful. If you are referring to the definition of Genus, it is the second to the mo … st specific level of classification in the taxonomy of classification. Genus is after family but before species. An example of a genus would be canis (canine, dog). Here is a website with information and a table on classification, including genus: http://www.abelard.org/briefings/taxonomy.php. Hope this will help you"}, {"url": "http://chickenpoxblog.com/chicken-pox-genus-and-species/", "passage_text": "chicken pox while pregnant or may become will die from chicken pox genus and species the spine to the side of my body as they need medical chickenpox. Because the pull the non-existing blood for evident than the others. Phil breathed a tiny strand of nucleic acid. Anti-inflammation of alcohol acts as shield chicken pox genus and species against the rash breaks out on the affected area as that can arise. Bacterial infections athletes foot or just superficial scarring. These includes lean meat fresh fruits and vegetables. Dont take olive leaf extract but provide a long time."}, {"url": "http://www.answers.com/Q/What_is_the_genus_and_species_of_a_chicken", "passage_text": "The main genus of the flamingo is Phoenicopterus and the species is Phoenicopteridae. There are also six other species (4 in the Americas) and (2 in the old world). The 4 in t … he Americas are P. roseus, P.chilensis, P. minor, P. jamesi and the 2 in the old world are P.andinus, and P. ruber. The genus Schistocerca includes the American  locust(species Americana) and the desert locust(s … pecies gregaria).  Some other locusts are the Locusta migratoria(migratory locust) ,  Nomadracis septemfasciata(red locust), and Locustana  pardalina(brown locust)."}]