[{"url": "http://www.joslin.org/info/what_is_pre_diabetes.html", "passage_text": "If you have pre-diabetes, you are at high risk of developing type 2 diabetes and also are at increased risk of developing heart disease. Pre-diabetes is a condition in which blood glucose levels are higher than normal, but not high enough to be classified as full-blown diabetes. If your doctor gives you an oral glucose tolerance test, and at two-hours your blood glucose is 140-199 mg/dl, you have  impaired glucose tolerance . Either of these is medical terminology for what your doctor is probably referring to when he says you have pre-diabetes.."}, {"url": "http://www.phac-aspc.gc.ca/cd-mc/diabetes-diabete/prediabetes-prediabete-eng.php", "passage_text": "People who develop type 2 diabetes may be first diagnosed with pre-diabetes. Pre-diabetes means that your blood glucose levels are higher than normal, but lower than if you have type 2 diabetes. Pre-diabetes is also called impaired glucose tolerance or impaired fasting glucose. If you have been diagnosed with pre-diabetes, then you have an increased risk for developing type 2 diabetes. "}, {"url": "http://www.medscape.com/viewarticle/776457", "passage_text": "Prediabetes. Prediabetes is defined by plasma glucose levels that are elevated above the normal range, but below the threshold for diabetes. Early diagnosis of prediabetes identifies persons at risk and prevents progression to type 2 diabetes mellitus (T2DM) and cardiovascular disease. "}, {"url": "http://www.webmd.com/diabetes/type-2-diabetes-guide/what-is-prediabetes-or-borderline-diabetes", "passage_text": "Prediabetes is a wake-up call that you’re on the path to diabetes. But it’s not too late to turn things around. If you have it (like 79 million other Americans), your blood sugar (glucose) level is higher than it should be, but not in the diabetes range. The results are: 1  Normal if your blood sugar is less than 100. 2  Prediabetes if your blood sugar is 100-125. 3  Diabetes if your blood sugar is 126 or higher."}, {"url": "http://www.mayoclinic.org/diseases-conditions/prediabetes/basics/definition/CON-20024420", "passage_text": "At Mayo Clinic, we take the time to listen, to find answers and to provide you the best care. Prediabetes means that your blood sugar level is higher than normal but not yet high enough to be classified as type 2 diabetes. Without intervention, prediabetes is likely to become type 2 diabetes in 10 years or less. If you have prediabetes, the long-term damage of diabetes — especially to your heart and circulatory system — may already be starting."}, {"url": "http://www.diabetes.org/diabetes-basics/diagnosis/", "passage_text": "Doctors sometimes refer to prediabetes as impaired glucose tolerance (IGT) or impaired fasting glucose (IFG), depending on what test was used when it was detected. This condition puts you at a higher risk for developing type 2 diabetes and cardiovascular disease. You usually find out that you have prediabetes when being tested for diabetes. If you have prediabetes, you should be checked for type 2 diabetes every one to two years. Results indicating prediabetes are: 1  An A1C of 5.7% – 6.4%. 2  Fasting blood glucose of 100 – 125 mg/dl."}, {"url": "http://health.cvs.com/GetContent.aspx?token=f75979d3-9c7c-4b16-af56-3e122a3f19e3&chunkiid=81799", "passage_text": "TOP. Prediabetes is a condition that precedes the onset of type 2 diabetes. It is characterized by blood glucose levels that are elevated, though not high enough to be classified as diabetes. Doctors usually refer to prediabetes as impaired glucose tolerance or impaired fasting glucose. "}, {"url": "http://www.healthline.com/health/type-2-diabetes/what-is-prediabetes", "passage_text": "Why Prediabetes is a Serious Problem. Prediabetes, is a serious chronic health condition that can increase your chances of developing diabetes, as well as other chronic diseases. In prediabetes, high blood sugar levels are caused by insulin resistance, whereby the cells of the body are unable to use insulin correctly. Insulin resistance is a risk factor for metabolic syndrome, which can increase the risk for cardiovascular disease. If you or a loved one has recently been diagnosed with prediabetes, you may have a lot of questions. Understanding a prediabetes diagnosis is the first step to taking control of your risk for diabetes and making life choices that can reverse it."}, {"url": "http://www.endocrineweb.com/conditions/pre-diabetes/pre-diabetes", "passage_text": "Prediabetes is a “pre-diagnosis” of diabetes—you can think of it as a warning sign. It’s when your blood glucose level (blood sugar level) is higher than normal, but it’s not high enough to be considered diabetes. 1 If your blood glucose level is between 100 and 125mg/dL, you have prediabetes. 2  You may hear the doctor use the phrase “impaired fasting glucose” or IFG, which is another term for prediabetes when it’s diagnosed with the fasting plasma glucose test."}]