[{"url": "http://www.answers.com/Q/Who_sang_the_song_One_is_the_Loneliest_Number", "passage_text": "Confidence votes 263K. Harry Nilsson wrote and sang the song in 1967. Later on the band Three Dog Night sang One is the Loneliest Number in 1969. (He played the album for John Lennon personally, when they … first met.) One was covered by Three Dog Night, who also covered It's For You, written by Lennon and Paul McCartney but never recorded by the Beatles.   This is not a Beatles song."}, {"url": "https://en.wikipedia.org/wiki/One_(Harry_Nilsson_song)", "passage_text": "1 The song was covered by Aimee Mann for the 1995 Nilsson tribute album For the Love of Harry: Everybody Sings Nilsson. 2  Mann's version also appears in the 1999 film Magnolia and on the film's soundtrack. 1 The song was sung by Nathan Lane and was featured on the soundtrack Stuart Little 2. 2  In 2013, Tracii Guns' League of Gentlemen covered One on the album First Record. 3  Mastodon recorded a cover of the song for the Army of Two trailer."}, {"url": "http://www.answers.com/Q/Who_sang_the_song_One_is_the_Loneliest_Number", "passage_text": "Though often called The Loneliest Number, the song is actually One and was written by Harry Nilsson for his 1967 album Aerial Ballet. In 1969 Three Dog Night covered it, … pushing the song into the top of the charts. (He played the album for John Lennon personally, when they … first met.) One was covered by Three Dog Night, who also covered It's For You, written by Lennon and Paul McCartney but never recorded by the Beatles.   This is not a Beatles song."}, {"url": "https://en.wikipedia.org/wiki/One_(Harry_Nilsson_song)", "passage_text": "One  is a song written by Harry Nilsson and made famous by Three Dog Night whose cover in 1969 reached #5 on the Billboard Hot 100. The song is known for its opening line One is the loneliest number that you'll ever do. Nilsson wrote the song after calling someone and getting a busy signal. He stayed on the line listening to the beep, beep, beep, beep... tone, writing the song. 1 The song was sung by Nathan Lane and was featured on the soundtrack Stuart Little 2. 2  In 2013, Tracii Guns' League of Gentlemen covered One on the album First Record. 3  Mastodon recorded a cover of the song for the Army of Two trailer."}, {"url": "http://www.answers.com/Q/Who_wrote_the_song_one_is_the_loneliest_number", "passage_text": "Harry Nilsson wrote and sang the song in 1967. Later on the band Three Dog Night sang One is the Loneliest Number in 1969. They were the ones to make it popular and send … it to the top of the charts. Answered by The Community. Making the world better, one answer at a time. Though often called The Loneliest Number, the song is actually One and was written by Harry Nilsson for his 1967 album Aerial Ballet. In 1969 Three Dog Night covered it, pushing the song in"}, {"url": "http://www.answers.com/Q/Who_wrote_the_song_one_is_the_loneliest_number", "passage_text": "(He played the album for John Lennon personally, when they … first met.) One was covered by Three Dog Night, who also covered It's For You, written by Lennon and Paul McCartney but never recorded by the Beatles.   This is not a Beatles song. Answered by The Community. Making the world better, one answer at a time. Though often called The Loneliest Number, the song is actually One and was written by Harry Nilsson for his 1967 album Aerial Ballet. In 1969 Three Dog Night covered it, pushing the song into the top of the charts"}, {"url": "http://www.youtube.com/watch?v=d5ab8BOu4LE", "passage_text": "Their first gold record was One (US #5), which had been written and recorded by Harry Nilsson. They had three US number one songs: Mama Told Me Not to Come, which was also their only Top 10 hit in the UK, Joy to the World and Black and White. "}, {"url": "http://www.last.fm/music/The+Beatles/_/One+Is+The+Loneliest+Number", "passage_text": "26 Nov 2010, 4:44am. i have never heard this song dont by the beatles. it was originally written by Harry Nilsson, a member of Three Dog Night, and is titles One thought most people know it as one is the lonliest number. This song was first released on Three Dog Night's first album entitled Three Dog Night. If the Beatles did play this song i would love to hear their version. PortalLover. "}]