[{"url": "http://www.newworldencyclopedia.org/entry/Mediterranean_Sea", "passage_text": "To the northeast the Mediterranean Sea is connected with the Black Sea through the Dardanelles (with a sill depth of 230 feet), the Sea of Marmara, which is often considered to be part of the Mediterranean Sea, and the strait of the Bosporus (sill depth of about three hundred feet)."}, {"url": "http://teachmiddleeast.lib.uchicago.edu/foundations/geography/essay/essay-01.html", "passage_text": "The Middle East is a large and diverse geographical area located in southwest Asia and northeast Africa. It extends over 2,000 miles from the Black Sea in the north to the Arabian Sea in the south, and about 1,000 miles from the Mediterranean Sea in the west to the mountains of Iran."}, {"url": "http://www.ancient.eu/mediterranean/", "passage_text": "The Mediterranean Sea is a sea connected to the Atlantic Ocean surrounded by the Mediterranean region and almost completely enclosed by land: on the north by Anatolia and Europe, on the south by North Africa, and on the east by the Levant."}, {"url": "http://geography.about.com/od/lists/a/Mediterranean-Countries.htm", "passage_text": "Share. By Amanda Briney. The Mediterranean Sea is a large sea that is located between Europe, northern Africa and southwestern Asia. Its total area is 970,000 square miles (2,500,000 sq km) and its greatest depth is located off the coast of Greece at around 16,800 feet (5,121 m) deep."}, {"url": "http://www.answers.com/Q/Where_is_the_Mediterranean_Sea_located", "passage_text": "Mediterranean Sea is located at basically Mediterranean region and enclosed by land, on the north by Europe(Spain, France, Italy,Greece..) and Anatolia (Turkey), on the south … by North Africa, and on the east by the Levant(Syria, Israel..). Des Dichado. 155,003 Contributions."}, {"url": "http://geography.about.com/od/specificplacesofinterest/a/Mediterranean-Sea-geography.htm", "passage_text": "Share. By Amanda Briney. The Mediterranean Sea is a large sea or body of water that is located between Europe, northern Africa and southwestern Asia. Its total area is 970,000 square miles (2,500,000 sq km) and its greatest depth is located off the coast of Greece at around 16,800 feet (5,121 m) deep."}]