[{"url": "http://www.eczema.net/bleach-baths/", "passage_text": "When using bleach baths for eczema treatment, you are asked to take a bleach bath for about 10 minutes twice a week. More frequent baths can be useful for more severe eczema or during specific eczema flare ups."}, {"url": "http://www.eczema.net/bleach-baths/", "passage_text": "Recent research has shown that bleach baths can be extremely significant for children with eczema. 7 year old Ben participated in a trial in 2006 that changed his life according to his mother, Jennifer. He had severe eczema on his calves, and it would crack and swell, causing infections and scarring."}, {"url": "https://nationaleczema.org/eczema/treatment/alternative-therapies/bleach-baths/", "passage_text": "Bleach baths make the tub into a swimming pool! Use ½ cup household bleach for a full bathtub, ¼ cup for a half bath. Soak for about 10 minutes and rinse off. Use 2 – 3 times a week. Bleach baths decrease the bacteria on the skin and decrease bacterial skin infections."}, {"url": "http://www.mayoclinic.org/diseases-conditions/eczema/expert-answers/eczema-bleach-bath/FAQ-20058413", "passage_text": "A bath with a small amount of bleach added to the water may help lessen symptoms of chronic eczema (atopic dermatitis). Eczema is an itchy skin condition, often worsened by a bacterial infection. An eczema bleach bath can kill bacteria on the skin, reducing itching, redness and scaling."}, {"url": "http://www.mayoclinic.org/diseases-conditions/eczema/expert-answers/eczema-bleach-bath/FAQ-20058413", "passage_text": "1 Add 1/2 cup (118 milliliters) of bleach to 40 gallons (151 liters) of warm water — that will fill a U.S.-standard-sized bathtub to the overflow drainage holes. 2  Use household bleach, not concentrated bleach."}, {"url": "http://www.mayoclinic.org/diseases-conditions/eczema/expert-answers/eczema-bleach-bath/FAQ-20058413", "passage_text": "If properly diluted and used as directed, a bleach bath is safe for children and adults. For best results: 1  Add 1/2 cup (118 milliliters) of bleach to 40 gallons (151 liters) of warm water — that will fill a U.S.-standard-sized bathtub to the overflow drainage holes. 2  Use household bleach, not concentrated bleach."}, {"url": "http://www.everydayhealth.com/eczema/bleach-baths-for-eczema-treatment.aspx", "passage_text": "After three months, the children on the regimen of bleach baths and an antibiotic ointment (applied to the inside of the nose) had fewer sores and a decrease in eczema severity, while 70 percent of children with the placebo treatment remained the same and 15 percent were worse."}]