[{"url": "http://foodingredientsinc.com/", "passage_text": "Thank you for considering Food Ingredients! With more than 40 years of experience in the food industry, Food Ingredients knows the mechanics of the food service ingredient distribution business well. We have established relationships with many regional, national, and global food ingredient suppliers. Our customers benefit from these relationships, as well as from the exceptional customer service team that Food Ingredients employs."}, {"url": "http://www.fda.gov/Food/IngredientsPackagingLabeling/FoodAdditivesIngredients/ucm094211.htm", "passage_text": "There are thousands of ingredients used to make foods. The Food and Drug Administration (FDA) maintains a list of over 3000 ingredients in its data base Everything Added to Food in the United States, many of which we use at home every day (e.g., sugar, baking soda, salt, vanilla, yeast, spices and colors)."}, {"url": "http://www.food-ingredients.com/", "passage_text": "CREATE A FREE ACCOUNT. To benefit from features such as advanced search criteria, detailed supplier info and add to favorites. FIND THE RIGHT SUPPLIERS Of food ingredients and contact them directly through our easy message system"}, {"url": "http://www.chsinc.com/food-and-ingredients/food-ingredients", "passage_text": "As a leader in U.S. soybeans and other food ingredients, CHS has a depth of experience and expertise that goes beyond the field. We’ve invested millions in soybean product development. Which means our experts work closely with you to develop specific product attributes that meet the growing needs in world markets. 1 Wheat Flour CHS is a major supplier of durum wheat to Ardent Mills, a joint venture with Cargill and ConAgra Foods. 2  This premier flour milling company is committed to delivering innovative, quality and nutritious ingredients rooted in sustainability and health and wellness."}, {"url": "http://www.fda.gov/Food/IngredientsPackagingLabeling/FoodAdditivesIngredients/ucm094211.htm", "passage_text": "Direct food additives are those that are added to a food for a specific purpose in that food. For example, xanthan gum -- used in salad dressings, chocolate milk, bakery fillings, puddings and other foods to add texture -- is a direct additive. Most direct additives are identified on the ingredient label of foods. The Food and Drug Administration (FDA) maintains a list of over 3000 ingredients in its data base Everything Added to Food in the United States, many of which we use at home every day (e.g., sugar, baking soda, salt, vanilla, yeast, spices and colors)."}, {"url": "http://www.adm.com/en-US/products/food/Pages/default.aspx", "passage_text": "BeveragesADM is a world leader in corn sweeteners, dextrose, crystalline fructose, maltodextrin, cocoa powders, and citric acids, and we also offer nutritional ingredients such as natural-source vitamin E, soy protein, including organic, and even flavorless, textureless and colorless fiber. Confection ADM is one of the world’s premier producers of cocoa powder, cocoa liquor and cocoa butter, including the deZaan™ and Joanes™ brands. We also supply lecithin and other emulsifiers, food acids, corn sweeteners, starches and maltodextrins."}, {"url": "http://www.fda.gov/Food/IngredientsPackagingLabeling/FoodAdditivesIngredients/ucm094211.htm", "passage_text": "For centuries, ingredients have served useful functions in a variety of foods. Our ancestors used salt to preserve meats and fish, added herbs and spices to improve the flavor of foods, preserved fruit with sugar, and pickled cucumbers in a vinegar solution. The Food and Drug Administration (FDA) maintains a list of over 3000 ingredients in its data base Everything Added to Food in the United States, many of which we use at home every day (e.g., sugar, baking soda, salt, vanilla, yeast, spices and colors)."}, {"url": "http://foodingredientsinc.com/", "passage_text": "FOOD INGREDIENTS, INC.Waukesha, Wisconsin. With more than 40 years of experience in the food industry, Food Ingredientsknows the mechanics of the food service ingredient distribution business well. We have established relationships with many regional, national, and global food ingredient suppliers. Our customers benefit from these relationships, as well as from the exceptional customer service team that Food Ingredients employs."}, {"url": "http://www.adm.com/en-US/products/food/Pages/default.aspx", "passage_text": "Food Ingredients. If you’re looking for something new, unique or on-trend for your food business, turn to ADM. Many of the world’s largest and best-known food manufacturers think ADM first for their formulations. Our high-quality ingredients are in thousands upon thousands of the products consumers use and enjoy every day, from grains and meats to salad oils, yogurt and chocolate. To feed your food business, partner with ADM. Confection ADM is one of the world’s premier producers of cocoa powder, cocoa liquor and cocoa butter, including the deZaan™ and Joanes™ brands. We also supply lecithin and other emulsifiers, food acids, corn sweeteners, starches and maltodextrins."}]