[{"url": "http://work.chron.com/average-salary-us-soldier-9060.html", "passage_text": "All members of the Armed Forces, including those in the Army, receive salaries from the monthly basic pay table. For enlisted staff, this table is divided into nine pay grades starting from the lowest of E-1 to the highest of E-9, with each grade representing rank. The wages in each pay grade increase with experience. Averages. As of 2010, a Congressional Budget Office report estimated that the average active duty soldier receives an average $99,000 per year in compensation that includes pay and benefits, with 60 percent of the total being non-cash compensation."}, {"url": "http://work.chron.com/average-salary-us-soldier-9060.html", "passage_text": "Officers. Officer pay is divided into 10 grades, starting from the lowest O-1 and continuing to O-10. For example, as of 2012, the O-1 grade, or second lieutenant, earned $33,941 per year for less than two years of experience, $42,703 annually for four years and $42,703 yearly for six years. Averages. As of 2010, a Congressional Budget Office report estimated that the average active duty soldier receives an average $99,000 per year in compensation that includes pay and benefits, with 60 percent of the total being non-cash compensation."}, {"url": "http://work.chron.com/average-salary-us-soldier-9060.html", "passage_text": "As an example, the Army website broke down the annual $29,380 compensation of a military police sergeant into $29,380 for salary, $16,164 for housing, $3,900 for food allowances, $1,800 for special pay, and tax advantages of $2,716. Averages. As of 2010, a Congressional Budget Office report estimated that the average active duty soldier receives an average $99,000 per year in compensation that includes pay and benefits, with 60 percent of the total being non-cash compensation."}, {"url": "http://work.chron.com/salaries-us-army-soldiers-6496.html", "passage_text": "The starting salary for a U.S. Army soldier with the pay grade of E-1 was $1,491 per month as of the 2012 fiscal year, according to ArmyTimes.com. A soldier with the pay grade of E-4 with more than four years in the service received $2,266.50 per month. The top-ranking enlisted soldier in the U.S. Army is the Command Sergeant Major, who holds a pay grade of E-9. Monthly base pay for a soldier with the pay grade of E-9 with 20 years in service was $5,523.60. A warrant officer with the pay grade of W-1 with fewer than two years of service earned $2,764.50 per month as of the 2012 fiscal year. A soldier with the pay grade of W-3 with more than 10 years of service earned a monthly salary of $4,709.10."}, {"url": "http://www.goarmy.com/benefits/money/basic-pay-active-duty-soldiers.html", "passage_text": "Basic Pay is your base salary as a Soldier on active duty and it counts only as part of your total income. It is distributed on the 1st and 15th of every month, similar to many civilian jobs. Your Army Basic Pay as a Soldier depends on how long you’ve been in the Army and your Army rank (most enlisted Soldiers enter the Army as a private). Your Army base pay will increase as you climb in rank and years of experience"}, {"url": "http://m.goarmy.com/benefits/money/basic-pay-active-duty-soldiers.m.html", "passage_text": "THE FOUNDATION OF YOUR SALARY PACKAGE. Active duty Soldiers and activated Army Reserve Soldiers earn Army Basic Pay. Basic Pay is your base salary as a Soldier on active duty and it counts only as part of your total income. It is distributed on the 1st and 15th of every month, similar to many civilian jobs. "}, {"url": "http://myarmybenefits.us.army.mil/Home/Benefit_Library/Federal_Benefits_Page/Basic_Pay.html?serv=147", "passage_text": "Benefit Fact Sheet. Summary: Basic Pay is the base salary for a Soldier on active duty and counts for part of total military income. Basic Pay is electronically distributed on the 1st and 15th of every month, similar to many civilian jobs. Basic Pay for a Soldier depends on length of service as well as rank (most enlisted Soldiers enter the Army as a private). Eligibility: Active duty officers and enlisted Soldiers are eligible for Basic Pay. Benefit Highlights: The 2015 basic pay tables reflect a 1% raise."}, {"url": "http://www1.salary.com/Military-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Military category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Military jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K. "}]