[{"url": "http://www.baywalk.net/about/faq_refresh_your_browser.php", "passage_text": "When marketing content changes on a website, we will often let you know to refresh your browser. What that means is for you to click your refresh or reload button at the top of your browser window so that it will load the new changes."}, {"url": "http://www.guidingtech.com/10319/how-to-refresh-reset-windows-8-what-they-mean/", "passage_text": "To start the reset process, insert your Windows 8 installation disc in your computer. Launch the Start Screen and search for reset and click on Reset your PC under the Settings section to launch the Metro Control Panel. In the General settings click the Get Started button under the Refresh Your PC option. Windows will tell you what all changes it will make to your computer when you refresh your computer. Just select Next to reboot your computer and start the refresh process."}, {"url": "http://www.thewindowsclub.com/refresh-desktop-folder-windows", "passage_text": "The Desktop is nothing but a folder in the Windows operating system. It is programmed to auto-refresh when its contents change. When the contents of the folder changes, it will auto-refresh. But at times, you may find that the desktop or folder does not auto-refresh. You may then need to refresh your desktop manually in the following circumstances: 1  The desktop does not display the files or folders you just created, moved, deleted, renamed or saved on it. 2  You need to re-align your desktop icons."}, {"url": "http://www.gizmag.com/how-to-windows-8-pc-refresh-reset/32801/", "passage_text": "Refresh your Windows 8 computer. To refresh your Windows 8.x system, go to. Then under Refresh your PC without affecting your files, click the Get started button. Or if you do want to do a PC Reset, click the Get Started button under Remove everything and reinstall Windows.. We'll take the first option."}, {"url": "http://www.howtogeek.com/132428/everything-you-need-to-know-about-refreshing-and-resetting-your-windows-8-pc/", "passage_text": "Both reset your computer to a fresh, factory default sate. Refresh preserves your files and installed Modern programs, while Reset removes everything on your system. When you Refresh your PC: 1  Windows will save your personal files, personalization settings, and Modern apps installed from the Windows Store. 2  Windows will reset your PC settings. 3  Windows will remove all installed desktop programs. 4  A list of the removed programs will be saved to your desktop."}, {"url": "http://www.howtogeek.com/132428/everything-you-need-to-know-about-refreshing-and-resetting-your-windows-8-pc/", "passage_text": "How to Refresh or Reset. If your computer is still working properly, you can refresh or reset it from the PC Settings application within Windows. For Windows 10, go to Settings, Update and Security, and then Recovery. If your computer is not booting properly, you can refresh or reset it from the boot options menu."}]