[{"url": "http://www.brighthub.com/science/medical/articles/114333.aspx", "passage_text": "Some species of cocci bacteria can be either good or bad, depending on the particular strain. Some notable cocci bacteria include: Staphylococcus aureus: These bacteria are often found in the nose and on the skin, and about 20% of humans are carriers. It is capable of causing various minor skin conditions, and it can cause more serious infections, like pneumonia, meningitis, and toxic shock syndrome (TSS). The label cocci bacteria simply describes the shape of the bacteria, therefore it cannot be labeled as good or bad bacteria. Like all types of bacteria, some are commensal (meaning they are found in and on the human body without causing harm) while others are pathogenic (meaning they cause illness)."}, {"url": "http://www.microbeworld.org/types-of-microbes/bacteria", "passage_text": "Tags: Bacteria can be found virtually everywhere. They are in the air, the soil, and water, and in and on plants and animals, including us. A single teaspoon of topsoil contains about a billion bacterial cells (and about 120,000 fungal cells and some 25,000 algal cells). Some bacteria (along with archaea) thrive in the most forbidding, uninviting places on Earth, from nearly-boiling hot springs to super-chilled Antarctic lakes buried under sheets of ice. Microbes that dwell in these extreme habitats are aptly called extremophiles. Read more: Where They’re Found."}, {"url": "http://www.infoplease.com/ipa/A0762206.html", "passage_text": "For example, some bacteria are used beneficially in making cheese and yogurt. Bacteria that cause disease are called “pathogens.” When certain pathogens enter the food supply, they can cause food-borne illness. Only a few types cause millions of cases of food-borne illness each year. Ironically, most cases of food-borne illness can be prevented. "}, {"url": "https://en.wikipedia.org/wiki/Bacterium", "passage_text": "Bacteria were among the first life forms to appear on Earth, and are present in most of its habitats. Bacteria inhabit soil, water, acidic hot springs, radioactive waste, and the deep portions of Earth's crust. Bacteria also live in symbiotic and parasitic relationships with plants and animals. There are typically 40 million bacterial cells in a gram of soil and a million bacterial cells in a millilitre of fresh water. There are approximately 5×10 30 bacteria on Earth, forming a biomass which exceeds that of all plants and animals."}, {"url": "http://www.answers.com/Q/Where_is_bacteria_mostly_found", "passage_text": "Answer by Jessica Zacharias. Confidence votes 5. Bacteria can be found in growing soil, they can also be found in acidic springs, radioactive waste, water, deep into the Earths crust, organic matter, and in living or dead animals and plants. "}, {"url": "https://en.wikipedia.org/wiki/Bacterium", "passage_text": "Bacteria (/baekˈtɪəriə/ ; bækˈtɪəriə: singular) bacterium constitute a large domain of prokaryotic. Microorganisms typically a few micrometres in, length bacteria have a number of, shapes ranging from spheres to rods and. Spirals bacteria were among the first life forms to appear On, earth and are present in most of its. habitats There are typically 40 million bacterial cells in a gram of soil and a million bacterial cells in a millilitre of fresh water. There are approximately 5×10 30 bacteria on Earth, forming a biomass which exceeds that of all plants and animals."}, {"url": "https://en.wikipedia.org/wiki/Bacterium", "passage_text": "The vast majority of the bacteria in the body are rendered harmless by the protective effects of the immune system, and some are beneficial. However, several species of bacteria are pathogenic and cause infectious diseases, including cholera, syphilis, anthrax, leprosy, and bubonic plague. There are typically 40 million bacterial cells in a gram of soil and a million bacterial cells in a millilitre of fresh water. There are approximately 5×10 30 bacteria on Earth, forming a biomass which exceeds that of all plants and animals."}, {"url": "http://www.answers.com/Q/Where_can_bacteria_be_found_living", "passage_text": "And in air, they can be found from sea level up to many tens of thousands of feet. Bacteria are also found inside other living organisms, like the bacteria (E. coli) that inhabit the gut of human beings. Bacteria are surely the most environmentally adaptable life form we know. And it is possible that bacteria will be found extra-terrestrially in the future. Bacteria is found every-where, in the restroom,floor,inside people,and where ever you go. 5 people found this useful. Edit. Share to: 1  The Five Major Parts of the Brain At its most basic, the brain controls the body. 2  Electrical impulses are sent along the nervous system to and from the brain that regulate all movement."}, {"url": "http://www.enchantedlearning.com/subjects/bacterium/", "passage_text": "Where are Bacteria Found: Bacteria are found almost everywhere on Earth, including in the seas and lakes, on all continents (including Antarctica), in the soil, and in tissues of plants and animals. Unlike animals and plants, bacteria have pili, flagella, and most have a cell capsule. Bacterial cells include the following: Diet: Bacteria have a wide range of diets. Some are heterotrophs (they eat other organisms) and others are autotrophs (they make their own food)."}]