[{"url": "http://blog.poolproducts.com/pool-permits-for-your-new-inground-pool-kit/", "passage_text": "Don’t worry if you’re not a licensed contractor, this is a Do-It-Yourself homeowner project, building your own inground pool! As mentioned earlier, make sure you bring your plot plan, a copy of the pool plan (we call it Dig Specs) and a list of all the equipment that is included with the steel or polymer pool kit. Some small towns don’t require permits but I recommend that you check with your local building and zoning commission, so you don’t run into any unexpected problems. Check your local .gov website, and search for “building permits”. Searching for swimming pool permits may lead you to operational permits, not building permits. The office that issues the permit, will need a copy of your plot plan (which is normally located with your mortgage paperwork)"}, {"url": "http://www.cityofpasadena.net/PermitCenter/Pasadena_Construction_Type_Permits/", "passage_text": "A building permit is important to you as both a resident and business owner, because building permits and the inspection process protect you from sub-standard construction that if failed could not only decrease your property value, but bring harm to family, customers, or yourself. Construction Permit Types. A building permit gives you legal permission to construct, alter or add to a structure. Projects usually require plans and specifications. These are reviewed by a city plans examiner to determine compliance with applicable codes."}, {"url": "https://ecityhall.sunnyvale.ca.gov/cd/i_swimmingpool.aspx", "passage_text": "A demolition permit is required for the removal of all pools. Permits are required prior to the demolition work. Following is a listing of the general requirements based on the 2013 California Building Code, 2013 California Residential Code, and 2013 California Plumbing Code. "}, {"url": "http://www.rocklin.ca.gov/depts/develop/building/building_codes_n_standards/pool_regulations.asp", "passage_text": "In addition, to help eliminate safety hazards on existing pools and spas, whenever a building permit is issued for remodeling or modifications of an existing pool or spa, installations of pool anti-entrapment covers are required. "}, {"url": "http://blog.poolproducts.com/pool-permits-for-your-new-inground-pool-kit/", "passage_text": "Yes, you should contact your local building inspector to see if your city or town requires a building permit for an inground vinyl pool. If you have made the decision that you are going to build your own inground pool, it’s never too early to start the process of securing the necessary permit. Some small towns don’t require permits but I recommend that you check with your local building and zoning commission, so you don’t run into any unexpected problems. Check your local .gov website, and search for “building permits”. Searching for swimming pool permits may lead you to operational permits, not building permits. The office that issues the permit, will need a copy of your plot plan (which is normally located with your mortgage paperwork)"}, {"url": "http://permittingservices.montgomerycountymd.gov/DPS/building/SwimmingPoolSpasAndHotTubs.aspx", "passage_text": "A Permit is required for any Private Swimming Pool. A Private Swimming Pool is defined as-Any swimming pool built on the grounds of a single family residence and used solely by the owner, immediate family, tenants, and guests. Additionally, for ANY land disturbance over 5000 sq ft OR 100 cubic yards of earth movement (which applies to most in-ground swimming pools) a Sediment Control Permit is required."}, {"url": "http://www.plano.gov/DocumentCenter/View/1629", "passage_text": "Additionally, permits are not required when replacing fixtures on existing wiring or plumbing. The following is a list of projects for which a permit is required: Construction of a building: Main building Accessory building (including permanent and portable storage sheds, gazebos, carports, patio covers). Building a swimming pool, repairing or filling in a swimming pool. Building a spa (self contained portable plug-in type spas require electrical permit and shall comply with safety glazing requirements, Chapter 24 of 2003 IBC). Demolition of a building. Security bars."}, {"url": "http://dpw.lacounty.gov/general/faq/index.cfm?Action=getAnswers&FaqID=IyI9PzYK&Theme=default", "passage_text": "ANSWER: Permits are required for all of the work necessary to build a swimming pool. In LA County, there are two ways to approach the required permits. The first, and most popular, option is to obtain a Combination Swimming Pool Permit. This Combination permit covers the construction of the swimming pool as well as the electrical, plumbing, and mechanical work directly related to the construction of the swimming pool."}, {"url": "http://dpr.delaware.gov/boards/electrician/documents/HO_Permit_Application.pdf", "passage_text": " A dwelling must be on the site or under construction before a homeowner’s permit is issued.  Homeowner permits cannot be issued for homes that are for sale or rent.  Only owner-occupants who perform the work themselves qualify for homeowner permits.  A homeowner is not permitted to install his or her own internal wiring, electrical work or equipment associated with a hot tub or a swimming pool.  If a homeowner permit is approved for a dwelling on a lot, other structures on the same lot, such as a non-commercial garage, are also covered unless prohibited under Section 14.0 of the Board’s Rules and Regulations. Permits are valid for only one year and are not renewable."}]