[{"url": "http://physics.stackexchange.com/questions/27794/is-a-photon-fixed-in-spacetime", "passage_text": "So even though time might stand still for the photon, space and time are one continuum so space does not stand still. In fact, time might not either but the way we measure time (since we have no other measuring stick) is dependent on the speed of light which is why it comes out to zero for a photon. "}, {"url": "http://www.universetoday.com/111603/does-light-experience-time/", "passage_text": "Just think about that idea. From the perspective of a photon, there is no such thing as time. It’s emitted, and might exist for hundreds of trillions of years, but for the photon, there’s zero time elapsed between when it’s emitted and when it’s absorbed again. It doesn’t experience distance either. Since photons do not experience time, from their point of view everything in their path is at the same place. If that is the case, then perhaps things that are weird for us, like Young’s slits, make perfect sense when considered from the photon’s point of view, the slits and the screen are squished to zero length."}, {"url": "http://www.quora.com/Does-a-photon-experience-time", "passage_text": "If the photon does not have a rest frame, we can't compare it to other reference frames, thus preventing us from telling what is going on there compared to other objects.In conclusion, it's not possible to think of the photon's point of view using our normal ideas of time and length. To us, time doesn't pass at all for a photon, because of time dilation (as speed approaches c, the relative time approaches infinity). But, for a photon, time dilation doesn't happen at all. It, instead, happens to us, and the universe as a whole."}, {"url": "http://study.com/academy/lesson/what-is-a-photon-definition-energy-wavelength.html", "passage_text": "A photon is the quantum of electromagnetic radiation that describes the particle properties of an electromagnetic wave. The energy of a photon is given by the equation E = hf, where E is energy, h is Planck's constant, and f is frequency. Definition of a Photon. A photon is the quantum of electromagnetic radiation. The term quantum is the smallest elemental unit of a quantity, or the smallest discrete amount of something. Thus, one quantum of electromagnetic energy is called a photon"}, {"url": "https://www.newscientist.com/article/dn24473-entangled-toy-universe-shows-time-may-be-an-illusion/", "passage_text": "In one mode of the experiment, one of the photons is treated like a clock with a tick that can alternate between horizontal and vertical polarisation. Because of entanglement, reading this clock will affect the polarisation value of the second photon. Editorial&colon; “ Solving the eternal mystery that is time “. Time is an illusion – at least in a toy model of the universe made of two particles of light. The experiment shows that what we perceive as the passage of time might emerge from the strange property of quantum entanglement."}, {"url": "https://quantumweird.wordpress.com/category/photon-clock/", "passage_text": "The Photon’s Go-Splat World. The photon lives in a “go-splat” world. The clock of a photon completely stops the instant it is emitted and stays stopped throughout its journey. The distance traveled by a photon becomes zero as compared to the distance measured by the stationary observer. Einstein gave us some tools to work with to describe the various space-time relativistic changes as shown in Figure 1. There is a mass equation also, but the mass increase is not a factor here, since we know that the photon has no rest mass."}, {"url": "http://www.quantumtheorys.com/Distance-Time/Photon%20Kinematics.html", "passage_text": "Since a body of matter cannot travel at speed c, a person cannot have a perspective from a reference frame traveling at speed c relative to any other body of matter. However, since light travels at speed c, there is no physical law prohibiting a person from imagining how a photon experiences time and space. One must first read section 4.7 on different here-nows for different reference frames to understand a photonic distance-time."}, {"url": "https://en.wikipedia.org/wiki/Photon", "passage_text": "A photon is an elementary particle, the quantum of light and all other forms of electromagnetic radiation. It is the force carrier for the electromagnetic force, even when static via virtual photons. The photon is the gauge boson for electromagnetism, and therefore all other quantum numbers of the photon (such as lepton number, baryon number, and flavour quantum numbers) are zero. Also, the photon does not obey the Pauli exclusion principle."}]