[{"url": "http://www.worldatlas.com/webimage/countrys/asia/china/cnland.htm", "passage_text": "In the vast western reaches of China-mountains, high plateaus and deserts dominate the landscape, while in the central and east areas, the land slopes into broad plains and deltas."}, {"url": "http://poster.4teachers.org/view/poster.php?poster_id=323061", "passage_text": "China is located in the eastern part of Asia. It is on the west coast of the Pacific Ocean. It is also by the East China Sea, Korea Bay, and Yellow Sea. It is one of the biggest countries in the world next to USA."}, {"url": "http://www.physicalmapofasia.com/countries-of-asia/china/", "passage_text": "China includes a wide variety of geographical features – plains, plateaus, deserts, mountains, and coastlines. This variation allows for a lot of potential in the industrial and agricultural sectors of the country."}, {"url": "http://www.ducksters.com/history/china/geography_of_ancient_china.php", "passage_text": "This enabled the Chinese to develop independently from other world civilizations. Rivers. Perhaps the two most important geographical features of Ancient China were the two major rivers that flowed through central China: the Yellow River to the north and the Yangtze River to the south."}, {"url": "http://www.china.org.cn/english/travel/40495.htm", "passage_text": "China is a mountainous country. Hills, mountains and plateaus cover two-third of the population. More than half of China s counties have mountainous areas. With its vast mountainous regions--high in the west and low in the east--China has a varied topography and diverse physical features."}, {"url": "http://www.yourchildlearns.com/china_history_geography.htm", "passage_text": "China-History and Geography. China from space Ancient China was built along the two main rivers—first the Yellow River (Huang He) in the north, and later the Yangtze in the south."}, {"url": "http://kids.nationalgeographic.com/explore/countries/china/", "passage_text": "Map of China. GEOGRAPHY. Stretching 3,100 miles (5,000 kilometers) from east to west and 3,400 miles (5,500 kilometers) from north to south, China is a large country with widely varying landscapes. Its territory includes mountains, high plateaus, sandy deserts, and dense forests."}]