[{"url": "https://answers.yahoo.com/question/index?qid=20100315113122AANGlH4", "passage_text": "There is a break of 1-2 weeks in July around Independence day. This is how the grades are set up: Inicial- 3 years, you can start when you're 3 years old and finish when you're 5-6. Primaria (Elementary School)- 6 years, you can start when you're 6 years old. Secundari (High School) - 5 years."}, {"url": "http://www.kent.gov.uk/education-and-children/schools/school-age", "passage_text": "Starting school. Most children begin primary school at the start of the school year in which they reach school age (5 years old). All schools must admit children from the September following their 4th birthday. A school year runs from September to the following August."}, {"url": "http://www.answers.com/Q/What_age_do_children_in_peru_start_school", "passage_text": "Answer   Children in urban bhutan start school as early as 3 years ie the day care centers. But all over the country, they are enrolled by the age of 5 or 6 where … they start pre-primary.     sonam, Bhutan."}, {"url": "https://www.justlanded.com/english/United-States/USA-Guide/Education/The-American-school-system", "passage_text": "Most children start school before the age of six, when compulsory schooling usually begins, in a nursery school or a kindergarten. The maximum 13 years of formal elementary and secondary education covers education from 5 to 18, divided into increments called grades (kindergarten to grade 12). 1  Share on Facebook."}, {"url": "http://www.answers.com/Q/What_age_do_children_in_peru_start_school", "passage_text": "In Kindergarten the student must reach age 5 by the 2nd of December. They can start at the beginning of the school year, but must be 5 by December 2nd.   Kindergarten … is not required, but highly recommended. Preschool is good too."}, {"url": "http://www.netmums.com/coffeehouse/netmums-coffeehouse-archives-528/education-school-admissions-advice-ace-216/212323-what-age-do-children-start-primary-school-all.html", "passage_text": "Dear ACE, I would like to know what age do children start Primary School in the UK. And what year will they start in. I have heard about the term when the child turns five. I have also heard about early fives. My son was born on 21/12."}]