[{"url": "https://euglenaprotist.wordpress.com/category/taxonomy/", "passage_text": "Taxonomy and Phylogeny. Euglena are a part of the Protist kingdom which really is a kingdom of mostly unicellular cells like Euglena that do not fit into the other kingdoms. Euglena is a genus with around sixty five different species in the genus with E. viridis and E. gracilis being the most studied. Euglena belong to a very large taxonomic group of unicellular organisms called Euglenozoa. Picture of Euglena under a microscope."}, {"url": "https://euglenaprotist.wordpress.com/", "passage_text": "Taxonomy and Phylogeny. Euglena are a part of the Protist kingdom which really is a kingdom of mostly unicellular cells like Euglena that do not fit into the other kingdoms. Euglena is a genus with around sixty five different species in the genus with E. viridis and E. gracilis being the most studied."}, {"url": "http://euglenabiology.weebly.com/habitat--food.html", "passage_text": "Euglena can inhabit fresh water as well as marine water. However, they are most commonly found in water bodies such as streams, ponds, and lakes."}, {"url": "http://euglenabiology.weebly.com/habitat--food.html", "passage_text": "An idea habitat for Euglena would have plenty of exposure to the sunlight (such as a surface of a pond) for the organism to conduct photosynthesis, as well as be rich in organic matter where it can find carbon-based food."}, {"url": "http://www.metamicrobe.com/euglena/", "passage_text": "Subsequently, Ehrenberg (1830) renamed C. viridis to Euglena viridis, which is now recognized as the type species of the genus Euglena. There are about 65 species in the genus Euglena, and E. viridis and E. gracilis are most studied among them."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/euglena.htm", "passage_text": "Euglena are small organisms in the Protist Kingdom. Euglena gracilis is just one of many species of Euglena. They do not have common names like birds or trees, so we have to refer to them by their scientific name. Euglena are interesting because they are a sort of combination of plant and animal."}]