[{"url": "http://greyhoundtickets.org/one-way-greyhound-bus-tickets", "passage_text": "Restrictions on one way Greyhound tickets : Difference in prices: There may be slight difference between the Greyhound bus ticket prices of two one way tickets and that of round trip ticket for less popular routes as they offer certain discounts on the latter one. If you are traveling and have no intent to return to your departure city then buying one way Greyhound bus tickets is the best option for you. In most cases, purchasing a one way Greyhound ticket is the most affordable and convenient mode of transportation compared to traveling by air."}, {"url": "http://greyhound-tickets.com/bus-tickets-hassle-free-online-booking", "passage_text": "1 You can check the Greyhound website and book your tickets there. 2  You can also find amazing deals at the website itself and you thus don’t have to linger around too much. 3  You can choose from a wide array of buses such as private, AC luxury, Volvo AC, intercity, non-AC luxury and so on. "}, {"url": "http://locations.greyhound.com/bus-routes/destination/houston-tx/ft-worth-tx", "passage_text": "Travel in comfort and style from Houston, TX to Ft Worth, TX with the largest intercity bus service. New buses, premium amenities and convenient boarding make Greyhound the best bus service in TX. Save money and book your Greyhound bus tickets online today! Earn Destination Points each time you travel. Sign up now and receive 10% off your next Greyhound bus ticket purchase and earn points as you ride. "}, {"url": "http://greyhoundtickets.org/one-way-greyhound-bus-tickets", "passage_text": "By far the most popular ticket purchase by passengers is for one way travel. In this write-up brief information is provided about Greyhound bus fares for one way tickets along with their difference compared to Round Trip Greyhound bus tickets prices and restrictions. A little bit about One Way Greyhound tickets : If you are traveling and have no intent to return to your departure city then buying one way Greyhound bus tickets is the best option for you. In most cases, purchasing a one way Greyhound ticket is the most affordable and convenient mode of transportation compared to traveling by air."}, {"url": "http://locations.greyhound.com/bus-routes/destination/miami-fl/orlando-fl", "passage_text": "Travel in comfort and style from Miami, FL to Orlando, FL with the largest intercity bus service. New buses, premium amenities and convenient boarding make Greyhound the best bus service in FL. Save money and book your Greyhound bus tickets online today! Earn Destination Points each time you travel. Sign up now and receive 10% off your next Greyhound bus ticket purchase and earn points as you ride. "}, {"url": "https://greyhound.com.au/express/bookings", "passage_text": "An Express Point-to-Point Ticket offers quick and easy travel from A to B Australia wide. To book your Express Ticket fill in the fields below. If you're planning a return journey, remember to take advantage of our 5% discount for all return tickets when selecting the Flexi fare. "}, {"url": "https://www.greyhound.ca/en/ticketsandtravel/default.aspx", "passage_text": "1 Print at Home tickets allow you to purchase your ticket online and print it at home on your printer and proceed directly to the gate with your printed ticket. 2  Tickets will immediately appear after purchase in a pop-up window. 1 Tickets may not be sent outside of Canada. 2  Both stations must be open at the time of transaction and ticket pick-up. 3  Buyer and recipient should allow three hours from time of purchase to departure time to complete the transaction. 4  Appropriate ID or a password is required to pick up the ticket."}, {"url": "http://greyhound-tickets.com/greyhound-bus-tickets-one-way", "passage_text": "One area where bus trips excel is in one-way travel. Greyhound Bus Tickets for one way trips are a popular option with travelers going in a single direction. Unlike with airlines, Greyhound does not charge a large premium for one way bus tickets. In fact, the price of a Greyhound one way bus ticket is usually half of the price of a Greyhound round trip bus ticket. For many popular routes, booking two, one-way tickets on Greyhound at different times costs exactly the same as booking a full round trip bus ticket. On less popular bus routes there may be a slight discount offered to round trip bus passengers as opposed to those looking for a one way ticket on Greyhound. "}, {"url": "http://greyhoundtickets.org/one-way-greyhound-bus-tickets", "passage_text": "Inconvenience in getting last minute tickets: You may have to wait to book the ticket for your return journey if you buy one way Greyhound bus tickets while traveling from your home. If you are traveling and have no intent to return to your departure city then buying one way Greyhound bus tickets is the best option for you. In most cases, purchasing a one way Greyhound ticket is the most affordable and convenient mode of transportation compared to traveling by air."}]