[{"url": "http://www.hornedlizardcreations.com/index.php?main_page=page&id=1", "passage_text": "Horny toads are not frogs or toads, but a type of reptile? a lizard. Like all reptiles, horned lizards depend primarily on their environment to control their body temperature? and they like it HOT! Most horned lizards live in the desert or semi-arid environments. The numerous species of Horned Lizards, all members of the genus Phrynosoma, have very wide, flattened, toad-like bodies. The tail is short but broad at the base. In most species, the back of the head is a solid bone, horns are not real sharp-well not cut the skin."}, {"url": "http://www.answers.com/Q/FAQ/22776", "passage_text": "The Short-horned Lizard, also known as The Horned Toad or Horny Toad is the reptile known for shooting blood from the corner of its eyes as a defence tacit. When scared it can also inflate so that it looks twice its size, and blood out of special ducts in their eyes. The blood also contains a ch…. Parent Category: Lizards. Horned lizards, often called horned toads, horny toads or horned frogs, are 15 species of lizards belonging to the genus Phrynosoma. They are frequently mistaken for frogs or toads because of their rounded body and blunt snout."}, {"url": "http://animals.nationalgeographic.com/animals/reptiles/horned-toad/", "passage_text": "Some species of short-horned lizards are capable of squirting blood from the corners of their eyes when attacked. Size relative to a tea cup: The short-horned lizard is often referred to as a “horned toad” or “horny toad” because its squat, flattened shape and short, blunt snout give it a toad-ish look. There are over a dozen recognized species found in the deserts and semi-arid environments of North and Central America, from southern Canada to Guatemala. Fast Facts. The short-horned lizard is often referred to as a “horned toad” or “horny toad” because its squat, flattened shape and short, blunt snout give it a toad-ish look."}, {"url": "https://en.wikipedia.org/wiki/Horned_lizard", "passage_text": "(July 2007). Horned lizards are a genus (Phrynosoma) of lizards which are the type genus of the family Phrynosomatidae. The horned lizard is popularly called a  horned toad ,  horny toad  or  horned frog , yet it is neither a toad nor a frog. The popular names come from the lizard's rounded body and blunt snout, which make it resemble a toad or frog (Phrynosoma literally means toad-bodied). Of 15 species of horned lizards in North America, eight are native to the United States. The largest-bodied and most widely distributed of the US species is the Texas horned lizard (P. cornutum). Horned lizards use a wide variety of means to avoid predation."}, {"url": "http://animals.nationalgeographic.com/animals/amphibians/amazon-horned-frog/", "passage_text": "Fast Facts. The first thing that stands out about the Amazon horned frog is its size. These rotund amphibians can grow to 8 inches (20 centimeters) in length and would cover a good-size tea saucer. They are found in freshwater marshes and pools throughout the Amazon Basin, from Colombia to Brazil. Size relative to a tea cup: The first thing that stands out about the Amazon horned frog is its size. These rotund amphibians can grow to 8 inches (20 centimeters) in length and would cover a good-size tea saucer."}, {"url": "https://en.wikipedia.org/wiki/Texas_horned_lizard", "passage_text": "The Texas horned lizard (Phrynosoma cornutum) is one of about 14 North American species of spikey-bodied reptiles called horned lizards. In recent years, the Texas horned lizard has declined by about 30% of its range, though there is some indication it may be making a comeback. The decline is usually blamed on overuse of pesticides and the spread of nonnative, but highly aggressive and fiercely territorial, red imported fire ants."}]