[{"url": "http://www.merckmanuals.com/professional/endocrine-and-metabolic-disorders/pituitary-disorders/pituitary-lesions", "passage_text": "Posterior lobe lesions. The 2 posterior lobe hormones are oxytocin and vasopressin (ADH). In women, oxytocin causes myoepithelial cells of the breast and myometrial cells of the uterus to contract. Oxytocin is present in men but has no proven function. In this disorder, the sella appears empty because it is filled with CSF, which flattens the pituitary gland against the wall of the sella."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/adult/endocrinology/pituitary_tumors_85,P00424/", "passage_text": "Nonfunctional adenomas (null cell adenomas). These tumors are the most common type of pituitary tumor. They do not secrete an extra amount of hormone and, until they become a certain size, the person does not have any symptoms. When the tumor is large enough, they may cause headaches and vision problems. Pituitary tumors can lead to symptoms that are caused by an excess or a reduced production of pituitary hormones. Each individual also experiences symptoms differently, and the symptoms many resemble other conditions or medical problems."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/adult/endocrinology/pituitary_tumors_85,P00424/", "passage_text": "The pituitary gland is a small, pea-sized organ in the brain behind the back of the nose. The pituitary gland produces hormones that affect many other glands in the body. Most pituitary tumors are noncancerous (benign). However, because of the location of the pituitary gland, at the base of the skull, many pituitary tumors will press against the optic nerves, causing vision problems. Pituitary tumors can lead to symptoms that are caused by an excess or a reduced production of pituitary hormones. Each individual also experiences symptoms differently, and the symptoms many resemble other conditions or medical problems."}, {"url": "http://www.cancer.gov/types/pituitary/patient/pituitary-treatment-pdq", "passage_text": "The pituitary gland hormones control many other glands in the body. Hormones made by the pituitary gland include: 1  Prolactin: A hormone that causes a woman’s breasts to make milk during and after pregnancy. 2  Adrenocorticotropic hormone (ACTH): A hormone that causes the adrenal glands to make a hormone called cortisol. 1 These tumors grow very slowly and do not spread from the pituitary gland to other parts of the body. 2  Invasive pituitary adenomas: Benign tumors that may spread to bones of the skull or the sinus cavity below the pituitary gland. 3  Pituitary carcinomas: Tumors that are malignant (cancer)."}, {"url": "http://www.ohsu.edu/xd/health/services/brain/getting-treatment/diagnosis/pituitary-disorders/about/diseases-of-the-pituitary/pituitary-tumors.cfm", "passage_text": "Benign (non-cancerous) tumors called adenomas are the most common type of pituitary tumor. Even though they are not cancerous, these tumors can cause health problems in several ways: 1  By damaging the healthy pituitary gland. 2  By making too many pituitary hormones. 3  By pressing on nerves that control vision or other functions. Craniopharyngiomas are tumors that can damage the hypothalamus, a gland at the base of your brain. They often cause damage in children and young adults, but can occur in adults. These tumors develop from a structure that is present before birth. If the structure does not go away after birth, it can become a tumor."}, {"url": "http://www.cancer.gov/types/pituitary/patient/pituitary-treatment-pdq", "passage_text": "1 The type and size of the tumor. 2  Whether the tumor is making hormones. 3  Whether the tumor is causing problems with vision or other signs or symptoms. 4  Whether the tumor has spread into the brain around the pituitary gland or to other parts of the body. 1 These tumors grow very slowly and do not spread from the pituitary gland to other parts of the body. 2  Invasive pituitary adenomas: Benign tumors that may spread to bones of the skull or the sinus cavity below the pituitary gland. 3  Pituitary carcinomas: Tumors that are malignant (cancer)."}, {"url": "https://www.sharecare.com/health/pituitary-disorders/what-does-pituitary-disorder-mean", "passage_text": "A pituitary disorder means that the pituitary gland, which oversees the production of hormones in the body, is not functioning properly. This generally takes the form of a non-cancerous tumor in the pituitary. A hormone imbalance can affect the body in numerous ways, depending on the type of hormone involved. "}, {"url": "http://www.cancer.gov/types/pituitary/patient/pituitary-treatment-pdq", "passage_text": "1 Growth hormone: A hormone that helps control body growth and the use of sugar and fat in the body. 2  Growth hormone is also called somatotropin. 3  Thyroid-stimulating hormone: A hormone that causes the thyroid gland to make other hormones that control growth, body temperature, and heart rate. 1 These tumors grow very slowly and do not spread from the pituitary gland to other parts of the body. 2  Invasive pituitary adenomas: Benign tumors that may spread to bones of the skull or the sinus cavity below the pituitary gland. 3  Pituitary carcinomas: Tumors that are malignant (cancer)."}, {"url": "http://emedicine.medscape.com/article/343207-overview", "passage_text": "Pituitary adenomas are almost always benign with no malignant potential. In general, pituitary lesions can be subdivided into nonsecretory and secretory tumors of the pituitary gland, other intrasellar tumors, and parasellar tumors. MRI is generally preferred over CT for the diagnosis of pituitary adenomas because of its superior definition of small lesions in the pituitary sella and its improved anatomic definition before surgery. MRI is also preferred for postsurgical surveillance."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=4915", "passage_text": "Pituitary gland: The main endocrine gland. It is a small structure in the head. It is called the master gland because it produces hormones that control other glands and many body functions including growth. The pituitary consists of the anterior and posterior pituitary. The anterior pituitary is the front portion of the pituitary"}]