[{"url": "http://geography.about.com/od/japanmaps/a/japan-geography-history.htm", "passage_text": "Geography and Climate of Japan. Japan is located in eastern Asia (map) between the Sea of Japan and the North Pacific Ocean. Its topography consists mainly of rugged mountains and it is a highly geologically active region. Large earthquakes are not uncommon Japan as it is located near the Japan Trench where the Pacific and North American Plates meet. Lowest Point: Hachiro-gata at -13 feet (-4 m). Japan is an island nation located in eastern Asia in the Pacific Ocean to the east of China, Russia, North Korea and South Korea."}, {"url": "https://en.wikipedia.org/wiki/Sea_of_Japan", "passage_text": "The Sea of Japan is a marginal sea of the western Pacific Ocean, between the Asian mainland, the Japanese archipelago and Sakhalin. It is bordered by Japan, North Korea, Russia and South Korea. Like the Mediterranean Sea, it has almost no tides due to its nearly complete enclosure from the Pacific Ocean. This isolation also reflects in the fauna species and in the water salinity, which is lower than in the ocean."}, {"url": "http://www.mapsofworld.com/japan/", "passage_text": "Explore map of Japan, it is an island nation in Eastern Asia. Located in the Pacific Ocean, Japan is surrounded by Sea of Japan, China, North Korea, South Korea, Russia, Sea of Okhotsk, East China Sea and Taiwan. Japan is an archipelago of 6,852 islands. "}, {"url": "https://en.wikipedia.org/wiki/Japan", "passage_text": "Located in the Pacific Ocean, it lies to the east of the Sea of Japan, the East China Sea, China, North Korea, South Korea and Russia, stretching from the Sea of Okhotsk in the north to the East China Sea and Taiwan in the south. "}, {"url": "http://www.whereig.com/japan/", "passage_text": "The Map showing where is Japan located on the world map. Japan is located in the far east of Asia continent. It is a group of islands nation located in the Pacific Ocean. Japan Sea lies east of Japan that separates from Russia, China and Korean Peninsula. In the south east China Sea lies. In north, La Perouse Strait separates Japan from Sakhalin, Russia and Korea Strait separates Japan from South Korea in the south wes"}, {"url": "http://www.mapsofworld.com/japan/japan-location-map.html", "passage_text": "The islands of Japan lies east of Sea of Japan, and the East China Sea is situated to its south and the Philippine Sea to its southeast. Japan comprises 6852 islands, Honshu, Kyushu, Shikoku and Hokkaido are the largest and prominent islands of Japan. In fact, about 80% of Japan’s population lives on Honshu Island. This island nation of East Asia located in the Pacific Ocean is officially called the Nippon Koku, which means State of Japan."}, {"url": "http://www.answers.com/Q/In_what_ocean_is_Japan_located", "passage_text": "Japan is an archipelago, a collection of more than 6000 islands, including 4 large ones, in the Pacific Ocean off the NE coast of Asia. They are south and southeast of western … Russia, and east of North and South Korea, across the Sea of Japan. The ocean that Japan is located is the Pacific and the other seas are-Sea of Japan (East Sea) East China Sea (Southwest) Korea Strait Sea of Okhotsk (south). Edit. Share to: Answered. In Oceans and Seas."}, {"url": "http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/Japan.html", "passage_text": "Japan, an island nation in east Asia, is an archipelago (large group of islands) located east of the Korean peninsula. It has an area of 377,835 square kilometers (145,882 square miles), which makes it slightly smaller than the state of California. Japan is bordered by the Pacific Ocean on the north and east, by the Philippine Sea and the East China Sea to the south, and by the Sea of Japan / East Sea on the west. It has a coastline of 29,751 kilometers (18,487 miles)"}, {"url": "http://globaledge.msu.edu/countries/japan/", "passage_text": "Japan: Introduction. Japan is an island nation in East Asia. Located in the Pacific Ocean, it borders China, North Korea, South Korea, Russia, Taiwan, the Sea of Japan, the Sea of Okhotsk, and the East China Sea."}]