[{"url": "http://business.gmu.edu/masters-in-management/costs/", "passage_text": "In-State Students - $916 per credit hour for a full tuition cost of $32,976. Out-of-State and International Students - $1,663.25 per credit hour for a full tuition cost of $59,877. "}, {"url": "http://catalog.gmu.edu/content.php?catoid=25&navoid=4885", "passage_text": "Educational Resource Fee: All students are charged a mandatory per-semester fee, $100 for seven credits or more, and $60 for less than seven credits, which allows Mason to maintain essential support services for both full and part-time students. Approved tuition rates and fees are available June 1. For more information, call the Student Accounts Office at 703-993-2484 or go to studentaccounts.gmu.edu. Students are charged tuition rates for registered courses according to their academic level and program; graduate rates vary by academic program."}, {"url": "http://studentaccounts.gmu.edu/tuition-fees/", "passage_text": "Distance Education Fee. $35 per credit hour (may be in addition to other course fees) – Online courses may require a Distance Education Fee, which helps Mason Online provide the software, support, and technical assistance necessary to manage and assure a quality online education experience. Tuition & Fees. Below is a listing of tuition rates and related fees by term. For information on Housing and Meal Plan rates, please visit Housing and Residence Life and Mason Card Office web sites."}, {"url": "http://masononline.gmu.edu/costs/", "passage_text": "Learn about tuition and billing. The tuition and fee billing process for Online Education is very similar to the process for a face to face class. Tuition is billed per credit hour with additional fees as appropriate. If a student is a resident of Virginia, the in state rate will apply. All other students will receive the out of state rate. "}, {"url": "http://www.collegefactual.com/colleges/george-mason-university/paying-for-college/tuition-and-fees/part-time/", "passage_text": "future part time per credit costs with an average annual increase in per credit charges of 5 1 % over the past five years the per credit cost for the 2014 2015 year is expected to be $ 1252 and may reach $ 1453 per credit by the 2017 2018 school year for in state students these costs are estimated to reach $ 430 and $ 486 respectively fees in addition to the per credit costs outlined above colleges typically charge part time students certain fees although these fees are usually not as much as those charged to full time students we recommend contacting george mason university directly for more information about"}, {"url": "http://studentaccounts.gmu.edu/tuition-fees/", "passage_text": "The fees are mandatory, nonrefundable, one-time fees. Fees are charged to the account of every newly admitted, degree-seeking student when registered for classes regardless of orientation attendance or enrollment status. Tuition & Fees. Below is a listing of tuition rates and related fees by term. For information on Housing and Meal Plan rates, please visit Housing and Residence Life and Mason Card Office web sites."}, {"url": "http://www.collegefactual.com/colleges/george-mason-university/paying-for-college/tuition-and-fees/part-time/", "passage_text": "part time per credit costs 4388 of the 20653 undergrads at george mason university take classes part time george mason university s fee per credit hour for part time undergraduate students residing outside the state of virginia was $ 1191 per credit in the 2013 2014 school year fees in addition to the per credit costs outlined above colleges typically charge part time students certain fees although these fees are usually not as much as those charged to full time students we recommend contacting george mason university directly for more information about these costs"}, {"url": "http://www.law.gmu.edu/financing/tuition", "passage_text": "Tuition and Estimated Costs for 2014-15. The following table shows the estimated costs for full-time and part-time students at George Mason for the 2014-15 academic year. These estimates are used in determining financial aid packages for law students. As estimates, these figures may vary slightly from the actual costs. ** Includes room and board, transportation, personal expenses, loan fees, and books. *** In-state residents attending part-time pay $898.25 per credit hour, and out-of-state residents attending part-time pay $1,447.75 per credit hour."}, {"url": "http://www.collegecalc.org/colleges/virginia/george-mason-university/", "passage_text": "George Mason University tuition is $7,562 per year for in-state residents. This is 18% more expensive than the national average public four year tuition of $6,429. The cost is $10,497 and 58% cheaper than the average Virginia tuition of $18,059 for 4 year colleges. The net out-of-pocket total cost you end up paying or financing though student loans is known as the net price. The reported Mason net price for in-state students $16,155* for the 2013/2014 academic year."}, {"url": "http://catalog.gmu.edu/content.php?catoid=19&navoid=4112", "passage_text": "Educational Resource Fee: All students are charged a mandatory per-semester fee, $100 for more than six credits, and $60 for six or fewer credits, which allows Mason to maintain essential support services for both full and part-time students. Approved tuition rates and fees are available June 1. For more information, call the Student Accounts Office at 703-993-2484 or go to studentaccounts.gmu.edu. Students are charged tuition rates for registered courses according to their academic level and program; graduate rates vary by academic program."}]