[{"url": "http://www.mayoclinic.org/tests-procedures/fecal-occult-blood-test/basics/definition/prc-20014429", "passage_text": "The fecal occult blood test (FOBT) is a lab test used to check stool samples for hidden (occult) blood. Occult blood in the stool may indicate colon cancer or polyps in the colon or rectum — though not all cancers or polyps bleed. Typically, occult blood is passed in such small amounts that it can be detected only through the chemicals used in a fecal occult blood test. If blood is detected through a fecal occult blood test, additional tests may be needed to determine the source of the bleeding."}, {"url": "https://en.wikipedia.org/wiki/Stool_test", "passage_text": "One of the most common stool tests, the fecal occult blood test can be used to diagnose many conditions that cause bleeding in the gastrointestinal system including colorectal cancer or stomach cancer. Transport vials filled with human feces for stool testing. Yellow and blue tops for parasite testing, red top for stool cultures and the white top was provided by the patient with the sample. A stool test involves the collection and analysis of fecal matter to diagnose the presence or absence of a medical condition"}, {"url": "http://requestatest.com/stool-testing", "passage_text": "Stool Testing. Stool testing is an effective way to check for conditions which affect the digestive system, liver and pancreas. Infections from bacteria, viruses or parasites, poor nutrient absorption, and some forms of cancer can all be detected by lab tests performed on stool samples. "}, {"url": "http://www.emedicinehealth.com/stool_analysis-health/article_em.htm", "passage_text": "Results. A stool analysis is a series of tests done on a stool (feces) sample to help diagnose certain conditions affecting the digestive tract. The normal values listed here—called a reference range—are just a guide. These ranges vary from lab to lab, and your lab may have a different range for what's normal."}, {"url": "http://www.webmd.com/digestive-disorders/stool-analysis", "passage_text": "Stool Analysis. Guide. A stool analysis is a series of tests done on a stool (feces) sample to help diagnose certain conditions affecting the digestive tract. These conditions can include infection (such as from parasites, viruses, or bacteria), poor nutrient absorption, or cancer. 1 Check for poor absorption of nutrients by the digestive tract (malabsorption syndrome). 2  For this test, all stool is collected over a 72-hour period and then checked for fat (and sometimes for meat fibers). 3  This test is called a 72-hour stool collection or quantitative fecal fat test."}, {"url": "http://www.webmd.com/digestive-disorders/stool-analysis", "passage_text": "For a stool analysis, a stool sample is collected in a clean container and then sent to the laboratory. Laboratory analysis includes microscopic examination, chemical tests, and microbiologic tests. The stool will be checked for color, consistency, amount, shape, odor, and the presence of mucus. 1 Check for poor absorption of nutrients by the digestive tract (malabsorption syndrome). 2  For this test, all stool is collected over a 72-hour period and then checked for fat (and sometimes for meat fibers). 3  This test is called a 72-hour stool collection or quantitative fecal fat test."}, {"url": "http://www.emedicinehealth.com/stool_analysis-health/article_em.htm", "passage_text": "Test Overview. A stool analysis is a series of tests done on a stool (feces) sample to help diagnose certain conditions affecting the digestive tract. These conditions can include infection (such as from parasites, viruses, or bacteria), poor nutrient absorption, or cancer. A stool analysis is a series of tests done on a stool (feces) sample to help diagnose certain conditions affecting the digestive tract. The normal values listed here—called a reference range—are just a guide. These ranges vary from lab to lab, and your lab may have a different range for what's normal."}, {"url": "https://labtestsonline.org/understanding/analytes/stool-culture/tab/sample", "passage_text": "The stool culture is a test that detects and identifies bacteria that cause infections of the lower digestive tract. The test distinguishes between the types of bacteria that cause disease (pathogenic) and the types that are normally found in the digestive tract (normal flora). "}]