[{"url": "https://urogyn.org/cystocele/", "passage_text": "A cystocele is mild (grade 1) when the bladder droops only a short way into the vagina. With more severe (grade 2) cystocele, the bladder sinks far enough to reach the opening of the vagina. The most advanced (grade 3) cystocele occurs when the bladder bulges out through the opening of the vagina. A cystocele may result from muscle straining while giving birth."}, {"url": "https://urogyn.org/cystocele/", "passage_text": "A doctor may be able to diagnose a grade 2 or grade 3 cystocele from a description of symptoms and from physical examination of the vagina because the fallen part of the bladder will be visible. A voiding cystourethrogram is a test that involves taking X-rays of the bladder during urination. With more severe (grade 2) cystocele, the bladder sinks far enough to reach the opening of the vagina. The most advanced (grade 3) cystocele occurs when the bladder bulges out through the opening of the vagina. A cystocele may result from muscle straining while giving birth."}, {"url": "http://www.webmd.com/urinary-incontinence-oab/repair-of-the-bladder-or-urethra", "passage_text": "Guide. Two common forms of pelvic organ prolapse are bladder prolapse (cystocele) and urethral prolapse (urethrocele). A cystocele occurs when the wall of the bladder presses against and moves the wall of the vagina. A urethrocele occurs when the tissues surrounding the urethra sag downward into the vagina. Both conditions are easy for your doctor to see during a physical exam. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/cystocele/basics/definition/con-20026175", "passage_text": "Anterior prolapse, also known as a cystocele (SIS-toe-seel), occurs when the supportive tissue between a woman's bladder and vaginal wall weakens and stretches, allowing the bladder to bulge into the vagina. Anterior prolapse is also called a prolapsed bladder. "}, {"url": "http://www.medicinenet.com/cystocele_fallen_bladder/article.htm", "passage_text": "A cystocele occurs when the wall between a woman's bladder and her vagina weakens and allows the bladder to droop into the vagina. This condition may cause discomfort and problems with emptying the bladder. A bladder that has dropped from its normal position may cause two kinds of problems -- unwanted urine leakage and incomplete emptying of the bladder."}, {"url": "https://en.wikipedia.org/wiki/Cystocele", "passage_text": "The most advanced (grade 3) cystocele occurs when the bladder bulges out through the opening of the vagina. A doctor may be able to diagnose a grade 2 or 3 cystocele from a description of symptoms and from physical examination of the vagina because the fallen part of the bladder will be visible. A cystocele is mild (grade 1) when the bladder droops only a short way into the vagina. With more severe (grade 2) cystocele, the bladder sinks far enough to reac"}, {"url": "http://www.medicinenet.com/cystocele_fallen_bladder/article.htm", "passage_text": "1 A cystocele occurs when the wall between a woman's bladder and her vagina weakens and allows the bladder to droop into the vagina. 2  Symptoms of a cystocele include urine leakage and incomplete emptying of the bladder. This condition may cause discomfort and problems with emptying the bladder. A bladder that has dropped from its normal position may cause two kinds of problems -- unwanted"}, {"url": "http://my.clevelandclinic.org/services/urology-kidney/diseases-conditions/hic-cystocele-fallen-bladder", "passage_text": "normal pelvis. A cystocele―also known as a prolapsed, herniated, dropped, or fallen bladder (where your urine or “water” is stored)―occurs when ligaments that hold your bladder up and the muscle between a woman’s vagina and bladder stretches or weakens, allowing the bladder to sag into the vagina. There are three grades of cystocele: 1  Grade 1 (mild) – The bladder drops only a short way into the vagina. 2  Grade 2 (moderate) – The bladder drops to the opening of the vagina. 3  Grade 3 (severe) – The bladder bulges through"}, {"url": "https://en.wikipedia.org/wiki/Cystocele", "passage_text": "A cystocele (/ˈsɪstəsiːl/ SIS-tə-seel) is a medical condition that occurs when the tough fibrous wall between a woman's bladder and her vagina (the pubocervical fascia) is torn by childbirth, allowing the bladder to herniate into the vagina. Urethroceles often occur with cystoceles. A cystocele is mild (grade 1) when the bladder droops only a short way into the vagina. With more severe (grade 2) cystocele, the bladder sinks far enough to reach the opening of"}, {"url": "http://www.medicinenet.com/cystocele_fallen_bladder/article.htm", "passage_text": "In some women, a fallen bladder stretches the opening into the urethra, causing urine leakage when the woman coughs, sneezes, laughs, or moves in any way that puts pressure on the bladder. A cystocele is mild -- grade 1 -- when the bladder droops only a short way into the vagina. With a more severe-grade 2 - cystocele, the bladder sinks far enough to reach the opening of the vagina. The most advanced -- grade 3 -- cystocele occurs when the bladder bulges out through the opening of the vagina. This condition may cause discomfort and problems with emptying the bladder. A bladder that has dropped from its normal position may cause two kinds of problems -- unwanted urine leakage and incomplete emptying of"}]