[{"url": "https://en.wikipedia.org/wiki/Snowdon", "passage_text": "Snowdon (Welsh: Yr Wyddfa, [əɾ ˈwɨ̞ðva]) is the highest mountain in Wales, at an elevation of 1,085 metres (3,560 ft) above sea level, and the highest point in the British Isles outside the Scottish Highlands. The name Snowdon is from the Old English for snow hill, while the Welsh name – Yr Wyddfa – means the tumulus , which may refer to the cairn thrown over the legendary giant Rhitta Gawr after his defeat by King Arthur."}, {"url": "http://www.visitsnowdonia.info/places_to_stay-3.aspx", "passage_text": "Search for Accommodation. Use the search facility to find quality accommodation in the Snowdonia Mountains and Coast aea which includes the Llŷn Peninsula, Snowdonia National Park and the Cambrian Coastline or download the area accommodation pages. "}, {"url": "https://en.wikipedia.org/wiki/Snowdonia", "passage_text": "From Wikipedia, the free encyclopedia. Snowdonia (Welsh: Eryri) is a region in north Wales and a national park of 823 square miles (2,130 km 2) in area. It was the first to be designated of the three national parks in Wales, in 1951. The English name for the area derives from Snowdon, which is the highest mountain in Wales at 3,560 ft (1,085 m). In Welsh, the area is named Eryri. One assumption is that the name is derived from eryr (eagle), but others state that it means quite simply Highlands, as leading Welsh scholar Sir Ifor Williams proved."}, {"url": "http://www.visitsnowdonia.info/area,_towns_amp_villages-2.aspx", "passage_text": "you have visited: Snowdonia accommodation, things to do, attractions | Area, Towns & Villages. The Snowdonia Mountains and Coast region has been split into 6 areas to help you find information easier. You can search for accommodation, attractions, activities, places to eat and much more by area, village, town or city. Please use the See Also section on the right to move between related pages within this section. Below is a list of the areas together with a linked page for further information."}, {"url": "https://www.expedia.co.uk/Snowdonia-National-Park.d6054294.Holidays-City-Breaks", "passage_text": "Dolgellau. Dolgellau is a historic market town at the southern end of Snowdonia National Park, in north Wales, set at the foot of the rugged slopes of Cader Idris. The town is on the banks of the River Wnion, crossed by an ancient stone bridge, Y Bont Fawr, dating back to 1638. Holywell. Situated on the north coast of Wales along the Menai Straits, Bangor is blessed with a wonderful setting. With views of the Isle of Anglesey and the Menai Suspension Bridge in one direction, and Snowdonia ’s towering peaks in the other, this friendly coastal city packs a powerful scenic punch."}, {"url": "http://travel.nationalgeographic.com/travel/parks/snowdonia-wales/", "passage_text": "• Welsh Tongue More than 26,000 people live in Snowdonia, and more than 60 percent of them speak Welsh, one of Europe’s oldest languages. The tongue is evident in a list of picturesque place-names, such as cwm (valley), bryn (hill), pentre (village), and aber (river mouth). Snowdon, or Yr Wyddfa in the local Welsh tongue, stands at 3,560 feet (1,085 meters) and is the highest point in Wales and England. The Welsh name for the larger park is Eryri (the Highland), and nine mountain ranges cover fully half of Snowdonia with a breathtaking array of jagged peaks, gorges, and windswept uplands."}, {"url": "http://snowdoniapub.com/", "passage_text": "contact us. Use the form on the right to contact us. You can edit the text in this area, and change where the contact form on the right submits to, by entering edit mode using the modes on the bottom right. Email Address *. Message *"}, {"url": "http://wikitravel.org/en/Snowdonia_National_Park", "passage_text": "Drink [edit]. As mentioned in #Eat, most villages and towns in Snowdonia have at least one pub. Generally, pubs in the area open from 11:00 or 12:00 and close at 23:00 or midnight. Some close for 2 or 3 hours in the afternoon but this is less common than in the past. History [edit]. Snowdonia National Park was established in 1951 as the third national park in the UK, and the first in Wales. It covers 2,142km² (840 square miles or 214,200 hectares) of the Snowdonia region of north-western Wales."}]