[{"url": "http://www.raggedmountainrunning.com/facts--trivia-about-running-shoes.html", "passage_text": "Facts & Trivia About Running Shoes. 1. The average cost of a pair of running shoes is currently about $115-120. Unlike most others things in our world (movie tickets, a gallon of gas, college tuition), this price has only slightly changed (by about $15 or about 15%) over the past decade. The average exercise life of a running shoe is about 400 miles. When a shoe “breaks down” it’s usually in the midsole (engine) not the outsole (tires). A dangerous pitfall is to use the outsole wear as your sole (no pun intended) means of gauging the condition of the overall shoe."}, {"url": "http://www.raggedmountainrunning.com/facts--trivia-about-running-shoes.html", "passage_text": "When we opened our doors back in 1982, that average price was in the $30-35 range and the most expensive shoe on the market was the Nike Air Columbia at a stratospheric $64.99! The Nike Pegasus, which now retails for $100, was introduced in 1983 with the hefty price tag of $39.99! The average exercise life of a running shoe is about 400 miles. When a shoe “breaks down” it’s usually in the midsole (engine) not the outsole (tires). A dangerous pitfall is to use the outsole wear as your sole (no pun intended) means of gauging the condition of the overall shoe."}, {"url": "http://www.statista.com/statistics/244506/average-retail-price-of-jogging-running-shoes-in-the-us/", "passage_text": "Average retail price of jogging/running shoes in the U.S. from 2007 to 2014 (in U.S. dollars). This graph depicts the average retail price of jogging/running shoes in the U.S. from 2007 to 2014. In 2007, the average retail price of jogging/running shoes was at 55.96 U.S. dollars. Average price of running/jogging shoes in the U.S. 2014, by distribution channel. Average price of running/jogging shoes in the United States in 2014, by point of sale (in U.S. dollars)."}, {"url": "http://www.nytimes.com/2010/10/23/health/23patient.html", "passage_text": "But some of those dollars may not have been well spent. In 2007, Scottish researchers tested running shoes at three price levels, ranging from $80 to $150, and found that low-and midcost shoes within the same brand cushioned runners’ feet just as well as high-cost ones — sometimes even better. "}, {"url": "http://www.statista.com/statistics/280408/average-price-jogging-running-shoes-us-channel-of-distribution/", "passage_text": "The statistic shows the average price of running/jogging shoes at various points of sale in the United States in 2014. Running/jogging shoes sold for an average of 100.69 U.S. dollars at specialty sport shops. Exclusive Premium statistic. Average price of running/jogging shoes in the United States in 2014, by point of sale (in U.S. dollars)."}, {"url": "http://smallbusiness.chron.com/profit-margin-retail-stores-running-shoes-38940.html", "passage_text": "The pricing and popularity of running shoes helps keep profit margins in the 20 percent range for retail shoe owners who stock them. Demand and profit margins typically depend on how well the owner understands the local marketplace that the store serves, followed by a particular shoe's collectibility and trend appeal. "}, {"url": "http://www.healthynomics.com/2012/07/running-shoes-prices-canada-versus-united-states/", "passage_text": "I like running and I like to buy running shoes. Lots of them. A recent survey of “runners” (run an average of 3.7 times per week) showed that they spend on average $300 per year on running shoes – three pairs at $99 each. I am not the only one with a running shoe fetish! A recent BMO Nesbitt Burns report indicated that running shoes are 36% cheaper in the U.S.! 36%"}]