[{"url": "http://chemistry.about.com/od/howthingsworkfaqs/f/how-brain-freeze-works.htm", "passage_text": "How to Prevent and Treat Brain Freeze. It's sudden chilling or a cycle of chilling and warming that stimulates the nerve and causes pain, so eating ice cream slowly is less likely to cause brain freeze than wolfing it down. If you are eating or drinking something cold, it also helps to keep your mouth cold rather than allow it to warm up. How Brain Freeze Works. When you eat something cold too quickly, your brain doesn't actually freeze, but the temperature change stimulates nerves to cause a stabbing headache. Mike Kemp Images, Getty Images. Anne Marie Helmenstine, Ph.D"}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/brain-freeze", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation. "}, {"url": "http://dictionary.reverso.net/english-definition/brain%20freeze", "passage_text": "n a brain in which the tracts connecting the two halves of the cerebral cortex have been surgically split or are missing from birth. yellow brain fungus. n See → jelly fungus. English Collins Dictionary-English Definition & Thesaurus &nbsp. See also: on the brain, brain coral, brain death, brain drain. beat one's brain out. beat one's brain out. id. "}, {"url": "http://www.medicalnewstoday.com/articles/244458.php", "passage_text": "It is a kind of short-term headache typically linked to the rapid consumption of ice-cream, ice pops, or very cold drinks. Brain freeze can occur if you eat an ice cream too fast. Brain freeze occurs when something extremely cold touches the upper-palate (roof of the mouth). It normally happens when the weather is very hot, and the individual consumes something too fast. Migraine sufferers more susceptible to brain freeze. Dr. Serrador explained that we already know that migraine sufferers are more likely to suffer brain freeze after drinking or eating very cold foods/drinks, compared to people who never have migraines."}, {"url": "http://www.urbandictionary.com/define.php?term=brain%20freeze", "passage_text": "5. Brain Freeze. Brain Freeze is getting a suddenly high-pitched ache in the upper part of the throat (Nearly in the head) because of consumming too quickly a cold drink or a cold food. The pain stays for about 30 seconds, but it's intense cold makes you feel like your brain is going into hypothermia and die. 20 Words related to brain freeze. 1  brain fart. 2  freeze. 3  slurpee. 4  brainfreeze. 5  brain. 6  cold. 7  headache. 8  ice cream headache. 9  pain. 10  sex. 11  brain freezes. 12  frozen. 13  heart freeze. 14  ice. 15  ice cream. 16  throat freeze. 17  conned. 18  frozen brain. 19  icee. 20  slushie."}, {"url": "http://www.merriam-webster.com/dictionary/brain%20freeze", "passage_text": "Definition of BRAIN FREEZE. : a sudden shooting pain in the head caused by ingesting very cold food (as ice cream) or drink. ADVERTISEMENT. "}, {"url": "http://parade.com/104297/marilynvossavant/medical-term-for-brain-freeze-11/", "passage_text": "Create a Parade.com account. Your account was created. An email has been sent to you. Email Address. Please enter a valid email address. Password. Incorrect email/password combination. Get the Parade Daily: celebrity interviews, recipes and health tips in your inbox. By creating an account, you accept the terms and conditions of our User Agreement and Privacy Policy. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Brain+freeze", "passage_text": "brain freeze. (1) A popular term for a brief but intense frontal cranial pain which follows the rapid consumption of cold foods or beverages; ice cream headache. (2) A popular term for the abrupt derailment of one’s train of thought. "}]