[{"url": "http://www.articledashboard.com/Article/Where-does-wholesale-river-rock-come-from/2232137", "passage_text": "Xeriscapes are popular in todays landscaping trends and River Rock plays a huge roll in making this landscaping trend possible. When you make a xeriscape you need natural stone to replace the mulch as a covering in the beds. The stone of choice is River Rock for Xeriscaping. Using River Rock in your Xeriscape makes your mind think of water or a waterway when you approach the landscape. This effect is very pleasing and tranquil so it is preferred for xeriscapes"}, {"url": "https://en.wikipedia.org/wiki/Landscape", "passage_text": "The word landscape (landscipe or landscaef) arrived in England —and therefore into the English language —after the fifth century, following the arrival of the Anglo-Saxons; these terms referred to a system of human-made spaces on the land. An early form of landscape poetry, Shanshui poetry, developed in China during the third and fourth centuries A.D. Shanshui poetry (or Shanshui chi, traditional Chinese: 山水詩; simplified Chinese: 山水诗 lit. mountains and rivers poetry) refers to the movement in poetry, influenced by the shan shui (landscape) painting style."}, {"url": "https://en.wikipedia.org/wiki/Landscape", "passage_text": "Landscape can be as varied as farmland, a landscape park, or wilderness. An early form of landscape poetry, Shanshui poetry, developed in China during the third and fourth centuries A.D. Shanshui poetry (or Shanshui chi, traditional Chinese: 山水詩; simplified Chinese: 山水诗 lit. mountains and rivers poetry) refers to the movement in poetry, influenced by the shan shui (landscape) painting style."}, {"url": "http://www.treeboss.net/mulch-production.htm", "passage_text": "Double and triple shredded mulches are created by regrinding the mulch in a tub grinder, further reducing the particle size. Even though single shredded mulch is much less uniform with more large pieces of bark mixed into the product, it does last the longest when applied to landscape beds. The finer ground mulches are more popular due to their more uniform particle size, but they do tend to break down more rapidly."}, {"url": "http://www.answers.com/Q/What_origin_did_the_word_landscape_come_from", "passage_text": "Landscape is a concatenation of the historic Dutch / German word Land / Laender, länder and The english bastardisation of The dutch Word, scape meaning. Ship some believe it to be akin 'To Land' ahoy of more modern. times The word amateur comes from the Latin amator meaning lover from the verb amare meaning to lovevia the Italian amatore. I expect its current usage in English is due to the fact … that amateurs do things for enjoyment rather than payment."}, {"url": "http://www.treeboss.net/mulch-production.htm", "passage_text": "Single-Double-Triple-Shredded Mulches. Shredded bark mulch is usually sold as single, double or triple shredded, with the single shredded being the coarsest and the triple shredded the finest. Single shredded is the form of mulch that comes directly from the saw mill. Even though single shredded mulch is much less uniform with more large pieces of bark mixed into the product, it does last the longest when applied to landscape beds. The finer ground mulches are more popular due to their more uniform particle size, but they do tend to break down more rapidly."}, {"url": "http://homeguides.sfgate.com/black-lava-rock-mulch-come-from-85860.html", "passage_text": "Mulch Rock. Much of the lava rock sold as mulch is dug from ancient volcano sites from areas such as Utah and New Mexico. When such volcanoes erupted, they spewed out molten lava, which hardens as foamed, porous version of obsidian. This porous material is known as lava rock. "}, {"url": "https://en.wikipedia.org/wiki/Landscape", "passage_text": "Landscape may be further considered under the following categories: landscape art, cultural landscape, landscape ecology, landscape planning, landscape assessment and landscape design. The activity that modifies the visible features of an area of land is named landscaping. An early form of landscape poetry, Shanshui poetry, developed in China during the third and fourth centuries A.D. Shanshui poetry (or Shanshui chi, traditional Chinese: 山水詩; simplified Chinese: 山水诗 lit. mountains and rivers poetry) refers to the movement in poetry, influenced by the shan shui (landscape) painting style."}, {"url": "http://www.answers.com/Q/What_origin_did_the_word_landscape_come_from", "passage_text": "Landscape is a concatenation of the historic Dutch / German word Land / Laender, länder and The english bastardisation of The dutch Word, scape meaning. ship The word amateur comes from the Latin amator meaning lover from the verb amare meaning to lovevia the Italian amatore. I expect its current usage in English is due to the fact … that amateurs do things for enjoyment rather than payment."}, {"url": "https://en.wikipedia.org/wiki/Landscape", "passage_text": "The character of a landscape helps define the self-image of the people who inhabit it and a sense of place that differentiates one region from other regions. It is the dynamic backdrop to people’s lives. An early form of landscape poetry, Shanshui poetry, developed in China during the third and fourth centuries A.D. Shanshui poetry (or Shanshui chi, traditional Chinese: 山水詩; simplified Chinese: 山水诗 lit. mountains and rivers poetry) refers to the movement in poetry, influenced by the shan shui (landscape) painting style."}]