[{"url": "http://animals.mom.me/deer-love-eat-1874.html", "passage_text": "What deer love to eat isn't necessarily what they do get to eat all the time. Deer adore fruits and nuts. They love pecans, hickory nuts and beechnuts acorns in addition to acorns. A couple of favorite fruits are apples, blueberries, blackberries and persimmons. They eat what is easily accessible. In the wintertime food is significantly harder to find, and deer eat a lot of buds, bark and shoots then. During the warmer months they eat nuts, corn and acorns -- and a lot more green matter."}, {"url": "http://homeguides.sfgate.com/there-vegetable-deer-wont-eat-81098.html", "passage_text": "No need to stand guard; deer don't like rhubarb. Some gardeners plant rhubarb for the sensual drama of its long, smooth stalks, candy red like a teddy bear's tongue, in stunning contrast to the dark, kale-like leaves. Others plant it because they dream of tangy rhubarb pies, or because it comes back year after year without much human effort. But you can also plant it because it's the closest thing to a vegetable that deer do not eat"}, {"url": "https://en.wikipedia.org/wiki/Gunnera", "passage_text": "Gunnera is a genus of herbaceous flowering plants, some of them grow extremely large. The genus is the only member of the family Gunneraceae. It is native to Latin America, Australia, New Zealand, Papuasia, Hawaii, insular Southeast Asia, Africa, and Madagascar. "}, {"url": "http://factsaboutdeer.net/what_do_deer_eat/what_do_deer_eat.html", "passage_text": "Even though you can purchase “deer feed” at some stores, deer do not actually eat this food in the wild. When they have the choice, they will choose plants over a bunch of seeds and small nuggets almost every time. Still, not every type of plant provides the right amount of nutritious properties for deer. For that reason, they generally turn to the grasses and forbs. Some common nuts that they do like to eat, however, are hickory nuts, red acorns, beechnuts, and white acorns. If you are trying to feed a deer, then you might find that providing it with nuts is one way to keep it coming around."}, {"url": "http://www.foremosthunting.com/Deer/Library/Whatdowhitetaildeereat/tabid/943/Default.aspx", "passage_text": "In addition to acorns deer also eat beechnuts and hickory nuts. When scouting for deer a good way to find plants that the deer have been eating is to look out for torn vegetation. Deer do not have incisors (front teeth) therefore the vegetation that they graze on often looks ripped when they bite into it. These non woody plants are very important to a deer’s diet especially in the fall. Look for clear cuts, power line and field edges where the grass and brush are often cut back. These areas provide new growth plants which deer love to eat. The whitetail deer is a opportunistic feeder."}, {"url": "http://factsaboutdeer.net/what_do_deer_eat/what_do_deer_eat.html", "passage_text": "However, this is kind of a last resort for the deer and when they do eat them, they only eat the shoots are tender and young. Deer also eat forbs, which are perennial plants that die in the wintertime but come back with new growths in the springtime. For that reason, they generally turn to the grasses and forbs. Some common nuts that they do like to eat, however, are hickory nuts, red acorns, beechnuts, and white acorns. If you are trying to feed a deer, then you might find that providing it with nuts is one way to keep it coming around."}, {"url": "http://homeguides.sfgate.com/there-vegetable-deer-wont-eat-81098.html", "passage_text": "Deer. Rhubarb makes Cornell University's list of plants deer do not like to eat. It could be that the animals sense the oxalic acid in the leaves and are warned away, or maybe the texture just doesn't appeal to them. Deer also tend to avoid root vegetables and those that have pungent odors. Some gardeners plant rhubarb for the sensual drama of its long, smooth stalks, candy red like a teddy bear's tongue, in stunning contrast to the dark, kale-like leaves. Others plant it because they dream of tangy rhubarb pies, or because it comes back year after year without much human effort."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/white-tailed_deer.htm", "passage_text": "White-tailed Deer are herbivores, but they eat a wide variety of foods, including green plants in the Summer; acorns, fruits and nuts in the Fall; and twigs in the Winter. They also eat fungi when they can get it. "}, {"url": "http://animals.mom.me/deer-love-eat-1874.html", "passage_text": "The typical diet of the white-tailed deer does not remain constant all year long. They eat what is easily accessible. In the wintertime food is significantly harder to find, and deer eat a lot of buds, bark and shoots then. During the warmer months they eat nuts, corn and acorns -- and a lot more green matter."}, {"url": "http://factsaboutdeer.net/what_do_deer_eat/what_do_deer_eat.html", "passage_text": "Deer actually prefer woody plants and shrubs. They can feed on these plants year round and are able to eat the twigs and leaves on them. Some examples of woody plants and shrubs include greenbrier, honeysuckle, willow, sassafras, grape, blackberry, dewberry, sumac, rose, and black gum. For that reason, they generally turn to the grasses and forbs. Some common nuts that they do like to eat, however, are hickory nuts, red acorns, beechnuts, and white acorns. If you are trying to feed a deer, then you might find that providing it with nuts is one way to keep it coming around."}]