[{"url": "https://en.wikipedia.org/wiki/Europlug", "passage_text": "The Europlug (CEE 7/16) is a non-rewirable flat, two-pole domestic AC power plug that must be supplied attached to a power cord. The Europlug is compatible with most 2-pin UK shaver sockets, but these are rated for a maximum of 0.2 A. Fused conversion plugs to BS 1363-5 are available for Europlugs, and equipment fitted with these may be legally sold in the UK."}, {"url": "http://electricaloutlet.org/type-c", "passage_text": "Popularly known as the Europlug, the Type C electrical plug is a two-pin unearthed plug used throughout continental Europe, parts of the Middle East, and much of Africa, South America, central Asia, and the former Soviet republics. The type C electrical plug is also pictured and described. Type C electrical outlets accept the types of plugs listed in the information section. If you have another kind of plug, a type C adapter plug may be necessary."}, {"url": "https://en.wikipedia.org/wiki/Europlug", "passage_text": "The Europlug design, intended for use with socket-outlets meeting other standards, appeared first in 1963 as Alternative II of Standard Sheet XVI in the second edition of CEE Publication 7. The Europlug is therefore sometimes also referred to as the CEE 7/16 plug. The Europlug is compatible with most 2-pin UK shaver sockets, but these are rated for a maximum of 0.2 A. Fused conversion plugs to BS 1363-5 are available for Europlugs, and equipment fitted with these may be legally sold in the UK."}, {"url": "https://www.110220volts.com/z-electrical-outlet-type-c.html", "passage_text": "TYPE C. This two-wire plug is ungrounded and has two round prongs. It is popularly known as the euro plug which is described in CEE 7/16. This is probably the single most widely used international plug. It will mate with any socket that accepts 4.0 - 4.8 mm round contacts on 19 mm. The plug is generally limited for use in class II applications that require 2.5 amps or less. This type of plug is very common in most universal adaptor sets. Though the photo shows a circular receptacle, quite often Type C plugs have a rectangular or oblong form factor, as shown above. This two-pin plug is probably the single most widely used international plug, popularly known as the Europlug."}, {"url": "https://www.110220volts.com/z-electrical-outlet-type-c.html", "passage_text": "Type C plug adapter, it's also know as Europlug. It consists of 2 round parallel plugs and it's usually found in Europe, some parts of the Middle East, Africa and South America, central Asia, and Soviet republics. This type of plug is very common in most universal adaptor sets. Though the photo shows a circular receptacle, quite often Type C plugs have a rectangular or oblong form factor, as shown above. This two-pin plug is probably the single most widely used international plug, popularly known as the Europlug."}, {"url": "http://www.iec.ch/worldplugs/typeC.htm", "passage_text": "Plug Type C. Used in: Europe, with the exception of the UK, Ireland, Cyprus and Malta (see complete list of countries on the right). The Type C electrical plug (or Europlug) is a two-wire plug that has two round pins. It fits into any socket that accepts 4.0 – 4.8 mm round contacts on 19 mm centres. They are being replaced by E, F, J, K or N sockets which work perfectly with Type C plugs"}, {"url": "http://www.interpower.com/ic/designers/designing-for-export/national-power-mains/europlug.html", "passage_text": "Europlug. CEE 7/16 (See map below). 2.5A/230V/50Hz. The standard 2-wire plug used in Class II, ungrounded, applications is popularly known as the Europlug, which is described in CEE 7/16. It will mate with any socket that accepts 4.0–4.8mm round contacts on 19mm centers. The Europlug power cord and cordset are designed for high-volume, end-consumer applications. If your application is above 2.5A, you should specify a Continental European power cord or cordset."}, {"url": "http://adaptelec.com/travel-plug-adapters-c-1/wa9c-travel-plug-adapter-for-europe-type-c-cee-716-europlug-p-5.html", "passage_text": "This plug adapter changes the shape of an appliance's plug so that can plug into a Type C European CEE 7/16 Class II non-grounded Europlug socket or a Soviet-era Russian GOST 7396 Class II non-grounded socket. Well, that depends on what you need to plug in. Europlug sockets generally supply electricity at between 220 and 240 volts AC. If you're plugging in an appliance that was built for 220-240 volt electrical input, or an appliance that is compatible with multiple voltages, then an adapter is all you need."}, {"url": "http://adaptelec.com/travel-plug-adapters-c-1/wa9c-travel-plug-adapter-for-europe-type-c-cee-716-europlug-p-5.html", "passage_text": "The plug is non-polarized and non-grounded. Compatibility. This travel plug adapter is compatible with the European CEE 7/16 Class II non-grounded Europlug socket, the Italian CEI 23-5 Class II non-grounded socket and the Soviet-era Russian GOST 7396 Class II non-grounded socket. All three standards are grouped under the general, unofficial Type C classification. Well, that depends on what you need to plug in. Europlug sockets generally supply electricity at between 220 and 240 volts AC. If you're plugging in an appliance that was built for 220-240 volt electrical input, or an appliance that is compatible with multiple voltages, then an adapter is all you need."}]