[{"url": "http://www.aviva.ca/article.asp?articleid=303", "passage_text": "About 30% of the elderly experience tinnitus. It is important to differentiate common tinnitus with Meniere's disease, a serious condition that is characterized by tinnitus, vertigo and hearing loss. Some natural products may be effective in the treatment of tinnitus and Meniere s disease (Ventigoheel). Symptoms of pulsatile tinnitus include a pulsing that is often in rhythm with the heartbeat. Cardiovascular disease, arterial blockages (caused by fibrin, plaque, etc.) and hypertension (high blood pressure) can all be causes of pulsatil"}, {"url": "http://www.entcare.com.au/tinnitus-dizziness-adults-david-lowinger.html", "passage_text": "1 Labyrinthitis-It is an ear disorder that involves inflammation of the middle ear which commonly occurs after a viral infection. 2  Meniere's disease-It is an inner ear disorder that causes severe hearing loss, ringing in the ears and dizziness. 3  The disease can affect one or both ears. A buzzing or ringing type of sound is heard in the ear which is accompanied by a syndrome known as Meniere's disease. Meniere's disease is an inner ear disorder that causes severe hearing loss, ringing in the ears, and dizziness. Diagnosis."}, {"url": "http://www.menieres-disease.ca/tinnitus.htm", "passage_text": "Meniere's Disease and Tinnitus. Persistent tinnitus (ringing in the ears) sometimes accompanies hearing loss, but most of the time, it has its own cause(s). In Meniere's Disease (balance and hearing symptoms) it is very persistent and very unpleasant. And because it is in the person s ear, they cannot remove themselves from it: it always travels with them. Tinnitus is a noise, ringing ears, or a roaring sound in the affected ear. "}, {"url": "http://umm.edu/programs/hearing/services/tinnitus", "passage_text": "Tinnitus is a symptom, not a disease itself. It is frequently, but not always, associated with hearing loss. It can be thought of as a sign of irritation or injury to the hearing system, much like pain or temperature sensations of the skin. Most people experience tinnitus at some point in time. "}, {"url": "http://www.entcare.com.au/tinnitus-dizziness-adults-david-lowinger.html", "passage_text": "Symptoms. A buzzing or ringing type of sound is heard in the ear which is accompanied by a syndrome known as Meniere's disease. Meniere's disease is an inner ear disorder that causes severe hearing loss, ringing in the ears, and dizziness. Diagnosis. Your doctor will diagnose tinnitus condition by a thorough physical examination and a detailed medical history"}, {"url": "http://drjockers.com/are-your-ears-ringing-from-inflammation/", "passage_text": "One of the most common causes of tinnitus is due to inflammation and poor circulation within the inner ear. When the body is chronically inflamed certain inflammatory mediating prostaglandins are secreted in high amounts (5). Inflammation is the body’s natural response to tissue damage. It can be a very good thing. The Most Common Causes of Tinnitus: Tinnitus can be caused by a number of different conditions including build-up of inner ear wax, ear infections, vestibular disorders, exposure to loud noises, Meniere’s disease, low thyroid function, hypertension, allergies, and on very rare cases a tumor."}, {"url": "http://www.medicalnewstoday.com/articles/156286.php", "passage_text": "If an underlying cause of the tinnitus is found, a doctor will treat that condition and the tinnitus usually subsides. This may include removing earwax, treating blood vessel conditions, or changing medication regimens. In many cases, however, the underlying cause cannot be identified. Tinnitus tends to improve with direct treatment or treatment of an underlying cause. Though it rarely progresses into a serious problem, the condition is linked to fatigue, stress, sleep problems, concentration difficulty, memory problems, depression, anxiety and irritability."}, {"url": "http://www.entcare.com.au/tinnitus-dizziness-adults-david-lowinger.html", "passage_text": "1 Meniere's disease-It is an inner ear disorder that causes severe hearing loss, ringing in the ears and dizziness. 2  The disease can affect one or both ears. 3  Acoustic neuroma-It is a non-cancerous tumor of the ear causing ringing in the ears, hearing loss and dizziness and balance problems. 4  Trauma to the inner ear. A buzzing or ringing type of sound is heard in the ear which is accompanied by a syndrome known as Meniere's disease. Meniere's disease is an inner ear disorder that causes severe hearing loss, ringing in the ears, and dizziness. Diagnosis."}, {"url": "http://www.medicalnewstoday.com/articles/156286.php", "passage_text": "Knowledge center. Tinnitus (from the Latin tinnitus or ringing) is a condition characterized by ringing, swishing, or other noises that appear to be originating in the ear or head. Not normally a dangerous or serious problem, tinnitus is usually a symptom of some other underlying condition and most often considered a nuisance. Tinnitus tends to improve with direct treatment or treatment of an underlying cause. Though it rarely progresses into a serious problem, the condition is linked to fatigue, stress, sleep problems, concentration difficulty, memory problems, depression, anxiety and irritability."}, {"url": "http://www.medicalnewstoday.com/articles/156286.php", "passage_text": "Tinnitus is a symptom of a variety of health conditions, blood vessel disorders, and effects from medications. The most common causes of tinnitus are age-related hearing loss, exposure to loud noises, earwax blockage in the ear canal, and abnormal bone growth in the ear. Tinnitus tends to improve with direct treatment or treatment of an underlying cause. Though it rarely progresses into a serious problem, the condition is linked to fatigue, stress, sleep problems, concentration difficulty, memory problems, depression, anxiety and irritability."}]