[{"url": "https://helpx.adobe.com/acrobat/using/saving-pdfs.html", "passage_text": "Open a single PDF, or select one or more PDFs in a PDF Portfolio. Save As Other. Select the version compatibility that you need. If you’re certain that all your users use Acrobat DC or Adobe Acrobat Reader DC, limiting compatibility to the latest version can further reduce file size. To save a copy of a PDF Portfolio Save As Other PDF Portfolio. If you are viewing a PDF in a web browser, the Acrobat File menu is not available. Use the Save A Copy button in the Acrobat toolbar to save the PDF. To the top."}, {"url": "https://helpx.adobe.com/acrobat/using/file-format-options-pdf-export.html", "passage_text": "Adobe PDF options (Acrobat Pro DC). You can resave PDFs as optimized PDFs, using settings in the PDF Optimizer dialog box. The PDF Optimizer lets you change the compatibility version of your PDFs so they can be viewed using older versions of Acrobat DC or Acrobat Reader DC. If you want to use the same settings every time you convert PDFs to a particular format, specify those settings in the Preferences dialog box. In the Convert From PDF panel, select a file format from the list and click Edit Settings."}, {"url": "https://helpx.adobe.com/acrobat/using/saving-pdfs.html", "passage_text": "In Acrobat Reader DC Save As Save As. To save a copy of a PDF Portfolio Save As Other PDF Portfolio. If you are viewing a PDF in a web browser, the Acrobat File menu is not available. Use the Save A Copy button in the Acrobat toolbar to save the PDF. To the top."}, {"url": "http://wwwimages.adobe.com/www.adobe.com/content/dam/Adobe/en/products/acrobat/pdfs/adobe-acrobat-xi-create-pdf-files-tutorial-ue.pdf", "passage_text": "Internet Explorer 1. In the top left of your browser window, click the Acrobat Convert button. Select Convert Web Page to Adobe PDF.2. Type a name for your file, and click Save. Chrome 1. At the end of the Search Toolbar, click the Acrobat PDF icon. Select Convert Web Page to Adobe PDF.2. Adobe Acrobat 1. In Acrobat, click the Create button on the left side of the task bar and select PDF From File.2. Browse to the desired file. Click open.3. Click the Save button. Type a name for your file, and click Save. Tip: The first time you open your browser with Adobe Acrobat installed, you must agree to enable the Adobe PDF add-on. For more options when converting HTML to PDF, such as adding your page to an existing PDF file, access the submenu with the drop-down arrow"}, {"url": "https://helpx.adobe.com/acrobat/using/file-format-options-pdf-export.html", "passage_text": "When you export PDFs to different file formats using the Export PDF tool, each file format includes unique conversion settings. This document provides instructions for Acrobat DC. If you're using Acrobat Reader DC, see What can I do with Adobe Reader. If you're using Acrobat XI, see Acrobat XI Help. If you want to use the same settings every time you convert PDFs to a particular format, specify those settings in the Preferences dialog box. In the Convert From PDF panel, select a file format from the list and click Edit Settings."}, {"url": "http://www.techrepublic.com/blog/windows-and-office/export-pdfs-to-powerpoint-with-adobe-acrobat-pro-xi/", "passage_text": "This new Adobe Acrobat feature follows a very similar export process. To convert a PDF back to PowerPoint: 1  Open Adobe Acrobat XI Pro. 2  The main window appears. 3  Open the presentation PDF that you want to export to PowerPoint. . 4  Click Tools. 5  The Tools menu opens in the sidebar. 6  Click Content Editing. 7  The Content Editing sub-menu appears (Figure A)"}, {"url": "https://helpx.adobe.com/acrobat/using/saving-pdfs.html", "passage_text": "You can save your changes to an Adobe PDF or PDF Portfolio in the original PDF or in a copy of the PDF. You can also save individual PDFs to other file formats, including text, XML, HTML, and Microsoft Word. To save a copy of a PDF Portfolio Save As Other PDF Portfolio. If you are viewing a PDF in a web browser, the Acrobat File menu is not available. Use the Save A Copy button in the Acrobat toolbar to save the PDF. To the top."}]