[{"url": "http://www.bobsredmill.com/tapioca-flour.html", "passage_text": "Tapioca flour, also known as tapioca starch, is a starchy white flour that has a slight sweet flavor to it. Tapioca flour is an alternative to traditional wheat flours and has a variety of uses in baking. Tapioca flour is an extremely smooth flour, which makes for a great thickener in sauces, pies and soups since it never discolors and contains no discernible taste or smell. It can also be used to replace corn starch (use 2 Tbsp tapioca flour for each 1 Tbsp corn starch)."}, {"url": "http://organicpotatostarch.com/starches-applications/", "passage_text": "Starches & Applications. Potato starch. Potato starch – also known as potato flour – is extracted from potatoes. The cells of the root tubers of the potato plant contain starch granules (leucoplasts). To extract the starch, the potatoes are crushed and the starch grains are released from the cells. The starch is then washed out and dried to powder."}, {"url": "http://www.bobsredmill.com/tapioca-flour.html", "passage_text": "Details. Tapioca flour, also known as tapioca starch, is a starchy white flour that has a slight sweet flavor to it. Tapioca flour is an alternative to traditional wheat flours and has a variety of uses in baking. The flour is made from the starch extracted from the South American cassava plant. Tapioca flour is an extremely smooth flour, which makes for a great thickener in sauces, pies and soups since it never discolors and contains no discernible taste or smell. It can also be used to replace corn starch (use 2 Tbsp tapioca flour for each 1 Tbsp corn starch)."}, {"url": "http://cornstarchs.com/index.html", "passage_text": "Corn Starch. The powdery, fine starch made from corn is known as Corn starch which is also called cornflour. The endosperm of corn is crushed, washed and dried up until it becomes a fine powder. Corn starch or Maize starch contains low ash and protein. It has its use in many baked good recipes. Corn starch is often used with flour and lends a good texture to wheat flour and makes it soft. In sugar wafer shells and ice cream cones it adds a reasonable strength. Cornstarch cornflour is used as a dusting agent in a number of baking recipes."}, {"url": "http://www.starch.dk/isi/starch/maize.asp", "passage_text": "FLOUR corn, also called soft corn or squaw corn, has kernels shaped like those of flint corn and composed almost entirely of soft starch. It is known by the scientific name Zea mays amylacea. USA grows small amounts of blue flour corn to make tortillas, chips, and baked goods. Amylopectin is a branched form of starch of high molecular weight, while amylose is a smaller unbranched or linear form of starch. Waxy corn is processed in wet milling to produce waxy cornstarch which slowly retrogrades back to the crystalline"}, {"url": "http://www.innovateus.net/food/are-corn-starch-and-corn-flour-same", "passage_text": "Main Image: Cornstarch, also known as Corn flour is a starch derived from corn. It is a fine, powdery starch that is produced from ground corn. Cornstarch is essentially made from the endosperm of the corn, which makes up most of the corn kernels. Cornstarch, also known as Corn flour is a starch derived from corn. It is a fine, powdery starch that is produced from ground corn."}, {"url": "http://www.starch.dk/isi/starch/maize.asp", "passage_text": "Maize (also known as corn), common name for a cereal grass widely grown for food and livestock fodder. Maize ranks with wheat and rice as one of the worlds chief grain crops. More starch is produced from maize than any other crop. Amylopectin is a branched form of starch of high molecular weight, while amylose is a smaller unbranched or linear form of starch. Waxy corn is processed in wet milling to produce waxy cornstarch which slowly retrogrades back to the crystalline"}, {"url": "https://en.wikipedia.org/wiki/Starch", "passage_text": "This polysaccharide is produced by most green plants as an energy store. It is the most common carbohydrate in human diets and is contained in large amounts in staple foods such as potatoes, wheat, maize (corn), rice, and cassava. Starch can be hydrolyzed into simpler carbohydrates by acids, various enzymes, or a combination of the two. The resulting fragments are known as dextrins. The extent of conversion is typically quantified by dextrose equivalent (DE), which is roughly the fraction of the glycosidic bonds in starch that have been broken."}, {"url": "https://en.wikipedia.org/wiki/Starch", "passage_text": "If starch is subjected to dry heat, it breaks down to form dextrins, also called pyrodextrins in this context. This break down process is known as dextrinization. (Pyro)dextrins are mainly yellow to brown in color and dextrinization is partially responsible for the browning of toasted bread. Starch can be hydrolyzed into simpler carbohydrates by acids, various enzymes, or a combination of the two. The resulting fragments are known as dextrins. The extent of conversion is typically quantified by dextrose equivalent (DE), which is roughly the fraction of the glycosidic bonds in starch that have been broken."}]