[{"url": "http://www.answers.com/Q/Why_was_the_Globe_theatre_closed_in_1642", "passage_text": "The Globe Theatre was a theatre in London associated with William Shakespeare. It was built in 1599 by Shakespeare's playing company, the Lord Chamberlain's Men, and was destr … oyed by fire on 29 June 1613. A second Globe Theatre was built on the same site by June 1614 and closed in 1642. But neither of those theatres is Shakespeare's Globe Theatre. Confidence votes 58. In 1642 the parliament ordered the theaters to close. The cause of this was that the Puritans had been gaining power and at this point civil war broke out between the parliamentarians--who were Puritan--and the Royalists."}, {"url": "https://en.wikipedia.org/wiki/Globe_Theatre", "passage_text": "A second Globe Theatre was built on the same site by June 1614 and closed in 1642. A modern reconstruction of the Globe, named  Shakespeare's Globe , opened in 1997 approximately 750 feet (230 m) from the site of the original theatre. Like all the other theatres in London, the Globe was closed down by the Puritans in 1642. It was pulled down in 1644-45,the commonly cited document dating the act to 15 April 1644 has been identified as a probable forgery—to make room for tenements."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070419082851AAPp11C", "passage_text": "· just now. Report Abuse. Disasters which closed the Globe Theatre-the Puritans The Puritans had been the source of many problems within the early English theatre. The first Globe Theatre was built due to the refusal of a puritan called Giles Allen to renew the lease of the 'Theatre'."}, {"url": "https://en.wikipedia.org/wiki/Globe_Theatre", "passage_text": "The Globe Theatre was a theatre in London associated with William Shakespeare. It was built in 1599 by Shakespeare's playing company, the Lord Chamberlain's Men, on land owned by Thomas Brend and inherited by his son, Nicholas Brend and grandson Sir Matthew Brend, and was destroyed by fire on 29 June 1613. Like all the other theatres in London, the Globe was closed down by the Puritans in 1642. It was pulled down in 1644-45,the commonly cited document dating the act to 15 April 1644 has been identified as a probable forgery—to make room for tenements."}, {"url": "http://www.history.com/this-day-in-history/the-globe-theater-burns-down", "passage_text": "A+E Networks. The Globe Theater, where most of Shakespeare’s plays debuted, burned down on this day in 1613. The Globe was built by Shakespeare’s acting company, the Lord Chamberlain’s Men, in 1599 from the timbers of London’s very first permanent theater, Burbage’s Theater, built in 1576."}, {"url": "http://www.bardstage.org/globe-theatre-closed.htm", "passage_text": "Disasters which closed the Globe Theatre-the Bubonic Plague The next disaster which closed the Globe theatre was the fire of 1613. The Globe theatre fire accident occurred on 29 June 1613 and the original Globe burned to the ground. The facts surrounding the fire disaster are as follows: Globe Theatre Closed There were various occasions when the great Globe Theatre was closed. There were terrible disasters which closed the globe theatre and normal events during the everyday lives of Elizabethans. The little known reasons why the Globe Theatre closed:"}, {"url": "https://en.wikipedia.org/wiki/Globe_Theatre", "passage_text": "The Globe was built in 1599 using timber from an earlier theatre, The Theatre, which had been built by Richard Burbage's father, James Burbage, in Shoreditch in 1576. The Burbages originally had a 21-year lease of the site on which The Theatre was built but owned the building outright. Like all the other theatres in London, the Globe was closed down by the Puritans in 1642. It was pulled down in 1644-45,the commonly cited document dating the act to 15 April 1644 has been identified as a probable forgery—to make room for tenements."}, {"url": "http://www.answers.com/Q/Why_was_the_Globe_theatre_closed_in_1642", "passage_text": "The Globe Theatre was a theatre in London, England. The Globe was  built in 1599 using timber from an earlier theatre. It was built by  members of William Shakespeare's play … ing company, the Lord  Chamberlain's Men. Confidence votes 58. In 1642 the parliament ordered the theaters to close. The cause of this was that the Puritans had been gaining power and at this point civil war broke out between the parliamentarians--who were Puritan--and the Royalists."}]