[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=6954", "passage_text": "b.i.d. (on prescription): Seen on a prescription, b.i.d. means twice (two times) a day. It is an abbreviation for bis in die which in Latin means twice a day. The abbreviation b.i.d. is sometimes written without a period either in lower-case letters as bid or in capital letters as BID"}, {"url": "http://www.answers.com/Q/What_does_blood_sugar_ACHS_mean", "passage_text": "That is a reading that is so low you would likely be unconscious and need emergency hospital treatment. If alert and able to swallow without choking, use a glucose tablet or s … ugar candy immediately and call 911 if you are diabetic and on oral hypoglycemic medications or insulin. 1 Also referred to as ALA, it is found in many foods, and also in a number of skin care products. 2  In addition…. 3  Diabetic Dogs: What to Do When Your Dog Has a Seizure A seizure can be a very scary event. 4  Seeing your dog losing control over her body and acting in a completely foreign way is heartbreaking."}, {"url": "http://www.medilexicon.com/medicalabbreviations.php?keywords=achs&search=abbreviation", "passage_text": "achs. The acronyms/abbreviations matching your exact search criteria are shown below (limited to 200 results): If you find an abbreviation that is missing from our database, please use our feedback form to send it to us. Percentage figures relate to popularity"}, {"url": "http://www.abbreviations.com/term/351543", "passage_text": "This page is about the meanings of the acronym/abbreviation/shorthand ACHS in the Medical field in general and in the Hospitals terminology in particular. Ammonoosuc Community Health Services. "}, {"url": "http://www.answers.com/Q/What_does_BS_ACHS_mean", "passage_text": "Making the world better, one answer at a time. BS means blood sugars and ACHS is usually AC/HS. AC stands for ante cibum which means before meals and HS stands for hours of sleep. Basically if you see BS ACHS on a Dr.'s order it means to check the patients blood sugars before meals and at bedtime. Answer Ballistic Skill (BS) is a stat that represents a character's skill at hitting your target .When using anything that basically looks like a ballistic weapon, such as l … ance, rapid fire and heavy weapons."}, {"url": "http://www.medicinenet.com/medterms-medical-dictionary/article.htm", "passage_text": "Search MedTerms: If you know the spelling, use the search function above to look up the meaning of the medical term in MedTerms and find related medical articles on MedicineNet.com. If you're not sure of the spelling (medical misspellings are common), type the first few letters, followed by an asterisk(*). "}, {"url": "http://www.answers.com/Q/What_does_blood_sugar_ACHS_mean", "passage_text": "It means that your diabetes is not under control for that day and time--it is way over the normal 120. You are harming your arteries and other parts of your circulatory system … . Make sure that you are eating balanced and timely meals and taking your regularly scheduled medications. 1 Also referred to as ALA, it is found in many foods, and also in a number of skin care products. 2  In addition…. 3  Diabetic Dogs: What to Do When Your Dog Has a Seizure A seizure can be a very scary event. 4  Seeing your dog losing control over her body and acting in a completely foreign way is heartbreaking."}, {"url": "http://www.answers.com/Q/What_does_blood_sugar_ACHS_mean", "passage_text": "What does blood sugar ACHS mean? already exists. already exists as an alternate of this question. exists and is an alternate of. How will married couples-even ones in gratifying relationships-relate to My Man Is a Loser? What is the medical term meaning pertaining to sugar in the blood? What does blood sugar reading of 262 mean If your a diabetic? 1 Also referred to as ALA, it is found in many foods, and also in a number of skin care products. 2  In addition…. 3  Diabetic Dogs: What to Do When Your Dog Has a Seizure A seizure can be a very scary event. 4  Seeing your dog losing control over her body and acting in a completely foreign way is heartbreaking."}]