[{"url": "http://smallbusiness.chron.com/can-groupthink-affect-organization-26044.html", "passage_text": "William H. Whyte, author of the classic sociological commentary The Organization Man, coined the term groupthink in a 1952 article that appeared in Fortune magazine in reference to the culture of conformity that shaped many corporations after World War II. "}, {"url": "http://rationalwiki.org/wiki/Groupthink", "passage_text": "The term 'groupthink' was coined by the famous social psychologist Irving Janis in 1972, although others suggest the term originated with William H. Whyte of Fortune Magazine in 1952. Groupthink (or communal reinforcement) happens when a desire for conformity within a group transcends rational thought and issues of right and wrong."}, {"url": "https://en.wikiquote.org/wiki/Groupthink", "passage_text": "Quotes [edit]. I use the term groupthink as a quick and easy way to refer to the mode of thinking that persons engage in when concurrence-seeking becomes so dominant in a cohesive ingroup that it tends to override realistic appraisal of alternative courses of action. ~ William H. Whyte, Jr. Groupthink is a psychological phenomenon that occurs within a group of people, in which the desire for harmony or conformity in the group results in an incorrect or deviant decision-making outcome."}, {"url": "http://www.psysr.org/about/pubs_resources/groupthink%20overview.htm", "passage_text": "A group is especially vulnerable to groupthink when its members are similar in background, when the group is insulated from outside opinions, and when there are no clear rules for decision making. References (also see annotated bibliography of books, articles and websites below). Janis, Irving L. (1972). Examples of Groupthink: Past and Present. Examples of groupthink fiascoes studied by Janis include US failures to anticipate the attack on Pearl Harbor, the Bay of Pigs invasion, the escalation of Vietnam war, and the ill-fated hostage rescue in Iran."}, {"url": "http://www.psysr.org/about/pubs_resources/groupthink%20overview.htm", "passage_text": "Groupthink, a term coined by social psychologist Irving Janis (1972), occurs when a group makes faulty decisions because group pressures lead to a deterioration of mental efficiency, reality testing, and moral judgment (p. 9). Examples of Groupthink: Past and Present. Examples of groupthink fiascoes studied by Janis include US failures to anticipate the attack on Pearl Harbor, the Bay of Pigs invasion, the escalation of Vietnam war, and the ill-fated hostage rescue in Iran."}, {"url": "https://en.wikipedia.org/wiki/Groupthink", "passage_text": "Groupthink is a term of the same order as the words in the newspeak vocabulary George Orwell used in his dismaying world of 1984. In that context, groupthink takes on an invidious connotation. Groupthink being a coinage-and, admittedly, a loaded one-a working definition is in order. We are not talking about mere instinctive conformity-it is, after all, a perennial failing of mankind."}, {"url": "https://en.wikipedia.org/wiki/Groupthink", "passage_text": "Groupthink is a psychological phenomenon that occurs within a group of people, in which the desire for harmony or conformity in the group results in an irrational or dysfunctional decision-making outcome. Groupthink being a coinage-and, admittedly, a loaded one-a working definition is in order. We are not talking about mere instinctive conformity-it is, after all, a perennial failing of mankind."}, {"url": "https://en.wikipedia.org/wiki/Groupthink", "passage_text": "I use the term groupthink as a quick and easy way to refer to the mode of thinking that persons engage in when concurrence-seeking becomes so dominant in a cohesive ingroup that it tends to override realistic appraisal of alternative courses of action. Groupthink being a coinage-and, admittedly, a loaded one-a working definition is in order. We are not talking about mere instinctive conformity-it is, after all, a perennial failing of mankind."}]