[{"url": "http://www.statista.com/statistics/232265/mean-age-of-the-chinese-population/", "passage_text": "Median age of the population in China from 1950 to 2100 (in years). The graph shows the median age of the population in China from 1950 to 2100. In 2010, the median age in China was at about 35 years. Exclusive Premium statistic. You need a Premium membership to access this"}, {"url": "http://www.economist.com/node/21553056", "passage_text": "In 1980 China's median (the age at which half the population is younger, half older) was 22. That is characteristic of a young developing country. It is now 34.5, more like a rich country and not very different from America's, which is 37. But China is ageing at an unprecedented pace."}, {"url": "http://www.tradingeconomics.com/china/wages", "passage_text": "In China, wages are benchmarked using the average salary. This page provides-China Average Yearly Wages-actual values, historical data, forecast, chart, statistics, economic calendar and news. Content for-China Average Yearly Wages-was last refreshed on Thursday, October 15, 2015."}, {"url": "http://www.lek.com/sites/default/files/L.E.K._ChinasAutomotiveAftermarket_AStrategicOpportunity_0.pdf", "passage_text": "The average warranty period for vehicles in China is typically 3 years. Currently we estimate that by 2017 the average age of cars will increase from 3 years to 4.5 years, the age when spending on aftermarket parts and services typically peaks."}, {"url": "http://www.answers.com/Q/What_is_the_average_age_of_chinese", "passage_text": "So, according to the result, Chinese people's average age will increase to about 51.2 in 2015A according to that, China should loosen the law of the born limitation in order to slow down the hyper-age problem."}, {"url": "http://www.worldometers.info/world-population/china-population/", "passage_text": "1 China ranks number 1 in the list of countries by population. 2  The population density in China is 145 people per Km2. 3  54% of the population is urban (756,300,115 people in 2014). 4  The median age in China is 35.7 years."}]