[{"url": "http://www.divorcedebbie.com/dr-phil-mcgraw-divorce-debbie-higgins-mccall-robin/", "passage_text": "Dr. Phil McGraw with Robin and sons, Jay with wife Erica and Jordan. 5 Signs your Man is Cheating on you. 6 Things You should never say to women. Dr. Phil McGraw met his second and present wife Robin, in 1973, when he was in the process of getting a divorce from his first wife. Dr. Phil McGraw has guided many troubled marriages, so it comes as an unpleasant surprise to many that he seems to have not conducted his two marriages with equal ease or pleasantness. His second marriage with his wife of nearly thirty eight years, Robin, seems to have been in turmoil even back in 2008."}, {"url": "http://www.nationalenquirer.com/celebrity/dr-phil-secret-divorce-deal/", "passage_text": "-A +A. Published on: April 13, 2009. In the ultimate betrayal, Dr. Phil McGraw 's wife Robin is writing a tell-all book that exposes his darkest secrets, sources say. Robin's warts-and-all memoir about their 32-year marriage could bring her a whopping $3 million advance, according to publishing insiders. Robin already writes about the couple's ups and downs on the Dr. Phil show Web site, and she recently revealed that they discussed divorce less than a year into their marriage. As The ENQUIRER has reported, that woman was a 19-year-old college student."}, {"url": "http://www.people.com/people/archive/article/0%2C%2C20221810%2C00.html", "passage_text": "When talk show host Dr. Phil McGraw and his wife, Robin, celebrated their 32nd wedding anniversary on Aug. 14, they did what they do most nights: had dinner and then cuddled under comforters in their home theater with their beloved Korean Jindo dog Maggie beside them. PHIL: It got to the point that someone went up to my 83-year-old mother at church and said, Oh, Mrs. McGraw, I'm so sorry to hear about Dr. Phil and Robin.."}, {"url": "http://www.nationalenquirer.com/celebrity/dr-phil-secret-divorce-deal/", "passage_text": "Robin reveals how Phil has humiliated her by his cheating and lying, a friend of 55-year-old Robin told The ENQUIRER. She's also written about their secret divorce deal-which is already done-and disclosed the real reason he hates his talk-show mentor Oprah Winfrey !. Robin already writes about the couple's ups and downs on the Dr. Phil show Web site, and she recently revealed that they discussed divorce less than a year into their marriage. As The ENQUIRER has reported, that woman was a 19-year-old college student."}, {"url": "http://www.divorcedebbie.com/dr-phil-mcgraw-divorce-debbie-higgins-mccall-robin/", "passage_text": "Rumors persist of a troubled marriage to his second wife of thirty-eight years, Debbie. Dr. Phil McGraw with present wife, Robin. Dr. Phil McGraw has made a career out of dispensing psychological advice on television to folks who seem to be suffering from myriad problems, be it marital or something else. Dr. Phil McGraw has guided many troubled marriages, so it comes as an unpleasant surprise to many that he seems to have not conducted his two marriages with equal ease or pleasantness. His second marriage with his wife of nearly thirty eight years, Robin, seems to have been in turmoil even back in 2008."}, {"url": "http://www.childcustodycoach.com/blog/?p=148", "passage_text": "Reportedly, the report that Robin McGraw and Dr. Phil McGraw were divorcing first surfaced from the Globe’s Website, with the headline reading Dr. Phil Divorce Blow-up! Reportedly, rumors suggesting that Robin and Dr Phil are getting a divorce have been dismissed by friends who are close to the couple. The Ladies Home Journal story that broke would also question the Dr Phil McGraw divorce rumors where the couple claimed “Divorce is not an option.”. Reportedly, Dr Phil McGraw’s first marriage and subsequent divorce was not publicized until a 2002 Newsweek cover story. The “secret first wife of Dr. Phil” was ex-cheerleader and homecoming queen Debbie Higgins McCall, who married McGraw in 1970"}, {"url": "https://www.lamonacalaw.com/blog/dr-phils-divorce-readiness-test/", "passage_text": "Dr. Phil’s Divorce Readiness Test. Dr. Phil believes that many people get divorced too quickly when problems arise, and he says that you should not pursue a divorce unless and until you have asked yourselves the following questions:"}, {"url": "http://www.huffingtonpost.com/2013/08/16/divorce-advice-_n_3769151.html", "passage_text": "In a video uploaded to Dr. Phil's YouTube channel on Thursday, the famous TV psychologist offers solid advice to divorcing parents, and all in under a minute. There is life after divorce but you have to create it, and you have to be an example for your children, he says. "}, {"url": "https://en.wikipedia.org/wiki/Phil_McGraw", "passage_text": "The Making of Dr. Phil is a biography by Sophia Dembling, a reporter from the Dallas Morning News, and Lisa Gutierrez, a reporter from The Kansas City Star. The book probes McGraw's history, with interviews of his childhood friends and former classmates. McGraw was born in Vinita, Oklahoma, the son of Anne Geraldine Jerry (nee Née) stevens And Joseph. J McGraw, Mcgraw. Jr he grew up with two older, Sisters deana And, donna and younger Sister brenda in the oilfields Of North texas where his father was an equipment. supplier"}]