[{"url": "http://canine-epilepsy-guardian-angels.com/annual_vacs.htm", "passage_text": "He vaccinated them for rabies, parvo, kennel cough and distemper and then exposed them to the disease-causing organisms after three, five and seven years. The animals remained healthy, validating his hunch. He continued his experiment by measuring antibody levels in the dogs' blood nine and 15 years after vaccination."}, {"url": "http://www.dogster.com/answers/question/why_do_dogs_need_a_distemper_vaccine_if_they_are_house_pets-2805", "passage_text": "Definitely get that vaccine for any and all dogs which you're responsible for. And, all dogs should be allowed access to the outdoors, whether it be in your own backyard or on a leash for a walk. Distemper and parvo are two highly transmittable diseases that can be given to a dog without actual dog to dog contact."}, {"url": "http://www.vcfishhawk.com/uncategorized/rabies-distemper-bordetella-oh/", "passage_text": "The distemper/parvo vaccination is typically given at 6-8 weeks of age and boosted 2 times at three week intervals, and again a year later. Like rabies, after the first year, distemper/parvo can be given as a 3 year vaccine, ONLY if the pet has stayed on a veterinarian recommended vaccine schedule."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20060926203305AAc8eEw", "passage_text": "Rabies at 6 months, then at 1 year with a Distemper/Parvo booster at 1 year also. Then Rabies every 3 years (required by law, not because I believe in it's necessity), and that is it. I do not revaccinate for anything else ever again. I have raised 4 dogs like this, and my new puppy is on the same protocol."}, {"url": "http://www.vcfishhawk.com/uncategorized/rabies-distemper-bordetella-oh/", "passage_text": "What is the Distemper/Parvo vaccine? Distemper and parvo viruses are deadly and can be spread via airborne or direct contact of bodily fluids. Distemper/parvo is not a vaccine required by law, however it is considered a core vaccine (a vaccine that should be given to all animals of a certain species). Both dogs and cats receive some form of the distemper/parvo vaccine. In cats, distemper is known as panleukopenia."}, {"url": "http://canine-epilepsy-guardian-angels.com/annual_vacs.htm", "passage_text": "Not only are these vaccines unnecessary, they're causing harm to pets.. Just as humans don't need a measles shot every year, neither do dogs or cats need annual injections for illnesses such as parvo, distemper or kennel cough. Even rabies shots are effective for at least three years."}]