[{"url": "http://www.job-interview-site.com/interview-questions-what-motivates-you-define-success.html", "passage_text": "Personal motivation is the key to success in what ever we want to achieve in out life, however it is also the hardest concept to explain. As a job seeker, one of the most common job interview questions you may face are related to your motivation and the way you define success in your job. The questions can phrase: “what motivates you to put forth your greatest effort”, “what motivates you to work hard”, “what motivates you in your career” or “what are you passionate about”."}, {"url": "http://www.everydayinterviewtips.com/common-interview-question-what-motivates-you/", "passage_text": "You get the basic idea. If you are asked a question about what motivates you, you should focus on qualities that reflect highly on your character. Motivation caused by the potential for growth, or the ability to reach goals, or the fun of challenging yourself are all great answers to any questions about motivation. Take Away Interview tips. If you are asked what motivates you at work, you should choose something intangible. You should choose something that is true, and accurately represents what you need to succeed, but isn’t something that appears greedy or selfish. Below are some examples of good answers to this type of interview question."}, {"url": "http://www.business2community.com/human-resources/answer-motivates-interview-question-01124689", "passage_text": "This is a good approach to take when you’re preparing an answer to this popular interview question. Think honestly about what motivates you (other than money!), and what part of your job you get the most satisfaction out of and use this to form your answer. "}, {"url": "http://www.youtube.com/watch?v=KEf49Ls057s", "passage_text": "Job Interview Question 1 - What motivates you to do your best work? Having the right answers in the interview is important in order to get the job. "}, {"url": "http://www.best-job-interview.com/top-interview-questions.html", "passage_text": "Questions and Answers. Prepare for the top interview questions you can expect in your job interview. Use the sample interview answers to be ready with winning interview answers to these frequently asked interview questions. Good preparation is the key to interview success. Here are some sample answers to top interview questions about your motivation. Use them as a guide to help you prepare your own answers: I am motivated by the challenge of difficult tasks and projects.My previous manager gave me more and more responsibility as I proved myself, I found this very motivating.."}, {"url": "https://targetjobs.co.uk/careers-advice/interview-questions/320333-what-motivates-you-tricky-graduate-interview-question", "passage_text": "Find out what recruiters want to hear in your answer. The current vogue in the graduate recruitment world for strengths-based interviews (which focus on what you enjoy doing and what you do well) means that you’re more likely to come across this old interview question than ever before. This question helps recruiters to find out more about you as a person. Your answer can give them some insight into: 1  What makes you tick. 2  What you enjoy doing and what you value. 3  Whether you would do well in the job role. 4  How you would fit into their team."}, {"url": "http://www.indiabix.com/hr-interview/what-motivates-you-to-do-good-job/", "passage_text": "It is your mind that motivates you to do good job. If you will think about high level responsibility you will be automatically motivated because you always want to learn more in your life. Comments Received: Please give your suggestions and feedback: Your Name *: No comments yet | Your comments please ... My past motivates me to do a good job because having seen my past I do my present for my bright futur"}, {"url": "http://www.best-job-interview.com/top-interview-questions.html", "passage_text": "In your job interview answer describe the good points and perceptions but also discuss one or two areas that you are aware need attention. Emphasize what you have done to improve on these areas. This makes your answer both real and insightful. Here are some sample answers to top interview questions about your motivation. Use them as a guide to help you prepare your own answers: I am motivated by the challenge of difficult tasks and projects.My previous manager gave me more and more responsibility as I proved myself, I found this very motivating.."}, {"url": "http://resume.naukri.com/articles/how-to-answer-what-motivates-you-interview-question/", "passage_text": "This question lets you talk about your strengths, things which you are good at and what makes you go that extra mile to accomplish something. You are asked this question to see if you think on the same lines as the prospective employer and whether you’ll fit into the company and do a good job. When they ask what stimulates you, they hope to hear some of your personal motivations that are related to the role you have applied for. "}]