[{"url": "http://www2.fiu.edu/~longoria/gly3034-sp/gly3034sp/volcanoes.html", "passage_text": "The gas and magma blast out an opening called the central vent Most magma and other volcanic materials then erupt through this vent The materials gradually pile up around the vent, forming a volcanic mountain, or volcano. After the eruption stops, a bowl like crater generally forms at the top of the volcano. The beginning of a volcano. A volcano begins as magma, melted rock inside the earth, Magma results from the extreme heat of the earth's interior. The eruption of a volcano. The gas filled magma in the reservoir is under great pressure from the weight of the solid rock around it. This pressure causes the magma to blast or melt a conduit (channel) in a fracture, or weakened part of the rock. The magma moves up through the conduit to the surface"}, {"url": "http://www.mrescience.com/earth_stuff/earth_lecture_07.pdf", "passage_text": "6-1 Volcanoes and Plate Tectonics A volcano is a weak spot in the crust where molten material, or magma, comes to the surface. Magma is a molten mixture of rock-forming substances, gases, and water from the mantle. When magma reaches the surface, it is called lava. When lava has cooled, it forms solid rock. Inside a volcano, magma collects in a pocket called a magma chamber. The magma moves through a pipe, a long tube that connects the magma chamber to Earth's surface. There, the magma leaves the volcano through an opening called a vent. The area covered by lava as it pours out of a vent is called a lava flow."}, {"url": "http://www2.fiu.edu/~longoria/gly3034-sp/gly3034sp/volcanoes.html", "passage_text": "Lava is the name for magma that has reached the earth's surface. When lava comes to the surface, it is red hot and may have a temperature of more than 2012 F. (1100 C). Highly fluid lava flows rapidly down a volcano's slopes. Sticky lava flows more slowly. The beginning of a volcano. A volcano begins as magma, melted rock inside the earth, Magma results from the extreme heat of the earth's interior. The eruption of a volcano. The gas filled magma in the reservoir is under great pressure from the weight of the solid rock around it. This pressure causes the magma to blast or melt a conduit (channel) in a fracture, or weakened part of the rock. The magma moves up through the conduit to the surface"}, {"url": "http://www.scholastic.com/browse/article.jsp?id=3754105", "passage_text": "Lava and other material, such as ash and rock fragments, ultimately build up to form a volcanic cone. Types of Volcanoes. Some volcanoes are large mountains with summits, or peaks, reaching 20,000 feet (6,000 meters) or more above sea level. Scientists recognize four main types of volcanoes: stratovolcanoes, shield volcanoes, cinder cones, and ashflow calderas. Stratovolcanoes. Stratovolcanoes, or composite volcanoes, get their name from the different layers, or strata, of ash and lava that form them. Most stratovolcanoes are irregularly shaped mountains formed by material ejected from both a central vent and other vents on the sides of the mountain"}, {"url": "http://www.scholastic.com/browse/article.jsp?id=3754105", "passage_text": "Shield volcanoes, formed when large flows of lava spread rapidly from central vents or rows of vents, are the largest volcanoes. Because the lava moves rapidly and spreads out in a broad area, it does not form a tall, steep cone. Instead, shield volcanoes are dome-shaped mountains with broad bases and gentle slopes. Scientists recognize four main types of volcanoes: stratovolcanoes, shield volcanoes, cinder cones, and ashflow calderas. Stratovolcanoes. Stratovolcanoes, or composite volcanoes, get their name from the different layers, or strata, of ash and lava that form them. Most stratovolcanoes are irregularly shaped mountains formed by material ejected from both a central vent and other vents on the sides of the mountain"}, {"url": "http://www.divediscover.whoi.edu/hottopics/lavaflows.html", "passage_text": "What is Lava? When a volcano erupts, the molten rock (or magma) that comes out of the Earth is called lava. Because lava is so hot (more than 1,100 degrees C, over 2,000 degrees F), it remains molten and flows across the ground until it cools and hardens into rock. "}, {"url": "http://www.mlhi.org/science09/period4/What%20is%20a%20volcano.htm", "passage_text": "A volcano is an opening in the Earths surface through which lava, hot gasses, and rock fragments erupt. This kind of opening forms when melted rocks deep within the earth blasts through the surface. Most volcanoes are mountains, particularly cone-shaped one, are built up around the opening by lava and other materials thrown out during eruption. The lava gradually builds up a low, broad dome shaped mountain. The famous Mauna Loa in Hawaii is a shield volcano. Thousands of separate, over lapping lava flows, each less then 50 ft thick, formed Mauna Loa. This picture demonstrates the"}, {"url": "http://www.mlhi.org/science09/period4/What%20is%20a%20volcano.htm", "passage_text": "Shield volcanoes are formed when a large amount of free-flowing lava spills from a vent and spreads widely. The lava gradually builds up a low, broad dome shaped mountain. The famous Mauna Loa in Hawaii is a shield volcano. Thousands of separate, over lapping lava flows, each less then 50 ft thick, formed Mauna Loa. This picture demonstrates the shield volcano."}]