[{"url": "http://www.willamette.edu/~fthompso/pubfin/Cost_Analysis.html", "passage_text": "For example, if 1000 units are in work-in-process at the end of the period and are considered 80% complete, the equivalent production is 800 units. The equivalent unit cost of an item equals the total cost divided by the equivalent units. If the total cost of the item was $2400, the unit cost would be $3 ($2400/800)."}, {"url": "http://classes.bus.oregonstate.edu/fall-06/ba422/Management%20Accounting%20Chapter%204.htm", "passage_text": "The first chart shows that fixed costs remain $50,000 at all production levels from 100 units to 1,000 units. The second chart shows that the fixed cost per unit decreases as production increases. Hence, when 100 units are manufactured, the fixed cost per unit is $500 ($50,000 100)."}, {"url": "http://www.unf.edu/~dtanner/dtch/dt_ch5.htm", "passage_text": "Step 4: Plug your answers to steps 2 and 3 into the cost formula by replacing the slope with the variable cost per unit and the Y-intercept with total fixed costs: Y = 44.25x + 2,900. The cost equation indicates that the total cost of cleaning homes is $44.25 per home plus a monthly cost of $2,900."}, {"url": "http://classes.bus.oregonstate.edu/fall-06/ba422/Management%20Accounting%20Chapter%204.htm", "passage_text": "The fixed component in this example is $3,000 per month. The variable cost component is $10 per unit of output. Hence, at a production level of 500 units, the total electric cost is $8,000 [$3,000 + ($10 x 500)]. The mixed cost illustrated in the above chart is called a step function. An example of such cost behavior would be the total salary expense for shift supervisors."}, {"url": "http://www.unf.edu/~dtanner/dtch/dt_ch5.htm", "passage_text": "Mixed costs contain both a fixed component and a variable component. In order to determine the two components, managers must separate the mixed cost into the two cost components---fixed costs and variable costs. Breaking mixed costs into fixed and variable portions allows managers to use the costs to predict and plan for the future given the insight on that cost behavior provides."}, {"url": "http://www.unf.edu/~dtanner/dtch/dt_ch5.htm", "passage_text": "Cost estimation methods are necessary only for costs that are identified as mixed costs. There is no need to apply an estimation method to break a cost into fixed and variable portions if you have already determined it is solely fixed or solely variable."}, {"url": "http://www.theaccountant-online.com/news/investors-favour-mixed-measurement-model", "passage_text": "This is dramatically different to the International Accounting Standards Board’s (IASB) financial instruments standard, which contains a mixed measurement model where fair value and amortised cost are used in different circumstances."}]