[{"url": "http://www.answers.com/Q/What_was_the_Schlieffen_Plan", "passage_text": "The Schieffen Plan was Germany's key war plan for invading France at the start of World War 1. It involved marching through Belgium in order to knock France out of the war quickly. The plan was devised by Alfred von Schlieffen. It involved attacking France through Belgium in the event of war with France. Due to the failure of the schlieffen plan, Germany was forced to fight World War One on two fronts and Germany's attempt to swiftly move through Belgium also forced Britain to join the war effort against Germany."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/history/mwh/ir1/schlieffenplanrev3.shtml", "passage_text": "The Schlieffen Plan. Germany had been preparing for war long before 1914. In fact, Germany had started drawing up a plan for war-the Schlieffen Plan-in 1897. It took nine years to finalise, but it was based on the theory that Germany would be at war with France and Russia at the same time. It did not prepare for many of the events that occured in July and August 1914."}, {"url": "http://www.historylearningsite.co.uk/world-war-one/causes-of-world-war-one/the-schlieffen-plan/", "passage_text": "In 1905, Schlieffen was chief of the German General Staff. Europe had effectively divided into two camps by this year – Germany, Austria and Italy (the Triple Alliance) on one side and Britain, France and Russia (the Triple Entente) on the other. The Schlieffen Plan was the operational plan for a designated attack on France once Russia, in response to international tension, had started to mobilise her forces near the German border."}, {"url": "https://en.wikipedia.org/wiki/Schlieffen_Plan", "passage_text": "Count Alfred von Schlieffen in 1906. The Schlieffen Plan (German: Schlieffen-Plan, [ʃliːfən plaːn]) was adopted as Aufmarsch I (Deployment [Plan] I) in 1905 (later Aufmarsch I West) and modelled a Franco-German war, which would not involve Russia but was expected to include Italy and Austria-Hungary as German allies. [...] Moltke followed the trajectory of the Schlieffen plan, but only up to the point where it was painfully obvious that he would have needed the army of the Schlieffen plan to proceed any further along these lines."}, {"url": "http://www.mtholyoke.edu/~jedzi20h/classweb/The%20Schlieffen%20Plan.html", "passage_text": "The Schlieffen Plan was the German army’s plan for war against France and Russia. It was created by the German Chief of Staff Alfred von Schlieffen in 1903 the request of Kaiser Wilhelm II. It was revised in 1905. "}, {"url": "http://alphahistory.com/worldwar1/schlieffen-plan/", "passage_text": "1. The Schlieffen Plan was Germany’s tactical solution for avoiding a two-front war with France and Russia. 2. Under this plan, drawn up in 1905, France would be forced to a quick surrender by a German invasion in the north. The Germans embraced a workaround to this impasse called the Schlieffen Plan. It was named for its inventor, Count von Schlieffen, who constructed the plan in 1905 after studying the Russian military’s performance in its ill-fated war with Japan (1904-5)."}, {"url": "https://answers.yahoo.com/question/index?qid=20101220232525AAEqbF8", "passage_text": "Best Answer: The Schlieffen Plan was the German General Staff's early 20th century overall strategic plan for victory in a possible future war where it might find itself fighting on two fronts: France to the west and Russia to the east. When Helmuth von Moltke replaced Alfred von Schlieffen as German Army Chief of Staff in 1906, he modified the plan by proposing that Holland was not invaded."}, {"url": "http://www.historylearningsite.co.uk/world-war-one/causes-of-world-war-one/the-schlieffen-plan/", "passage_text": "The Schlieffen Plan. The Schlieffen Plan was created by General Count Alfred von Schlieffen in December 1905. The Schlieffen Plan was the operational plan for a designated attack on France once Russia, in response to international tension, had started to mobilise her forces near the German border. The execution of the Schlieffen Plan led to Britain declaring war on Germany on August 4th, 1914"}, {"url": "http://alphahistory.com/worldwar1/schlieffen-plan/", "passage_text": "The Schlieffen Plan. Count von Schlieffen, the architect of the German war plan activated in 1914. The Schlieffen Plan was a battle plan, drawn up by German tacticians, to secure victory against both France and Russia. The Germans embraced a workaround to this impasse called the Schlieffen Plan. It was named for its inventor, Count von Schlieffen, who constructed the plan in 1905 after studying the Russian military’s performance in its ill-fated war with Japan (1904-5)."}, {"url": "https://answers.yahoo.com/question/index?qid=20101220232525AAEqbF8", "passage_text": "Schlieffen's plan involved using 90% of Germany's armed forces to attack France. Fearing the French forts on the border with Germany, Schlieffen suggested an attack through Holland, Belgium and Luxembourg into northern France. When Helmuth von Moltke replaced Alfred von Schlieffen as German Army Chief of Staff in 1906, he modified the plan by proposing that Holland was not invaded."}]