[{"url": "http://legal-dictionary.thefreedictionary.com/Legislation", "passage_text": "Legislative Bills. Legislation begins with the submission of a bill to the legislature for consideration. A bill is a draft, or tentative version, of what might become part of the written law. A bill that is enacted is called an act or statute."}, {"url": "https://en.wikipedia.org/wiki/Legislation", "passage_text": "Legislation is usually proposed by a member of the legislature (e.g. a member of Congress or Parliament), or by the executive, whereupon it is debated by members of the legislature and is often amended before passage. Most large legislatures enact only a small fraction of the bills proposed in a given session."}, {"url": "https://en.wikipedia.org/wiki/Legislation", "passage_text": "Legislation (or  statutory law ) is law which has been promulgated (or  enacted ) by a legislature or other governing body or the process of making it."}, {"url": "http://legal-dictionary.thefreedictionary.com/Legislation", "passage_text": "Most legislation is enacted by Congress and state legislatures. Implementation of legislation is left to other entities, both public and private, such as law enforcement agencies, the courts, community leaders, and government agencies."}, {"url": "http://www.merriam-webster.com/dictionary/legislation", "passage_text": "Full Definition of LEGISLATION. 1. : the action of legislating; specifically: the exercise of the power and function of making rules (as laws) that have the force of authority by virtue of their promulgation by an official organ of a state or other organization. 2. : the enactments of a legislator or a legislative body. 3."}, {"url": "http://www.merriam-webster.com/dictionary/legislative", "passage_text": "Full Definition of LEGISLATIVE. 1. a: having the power or performing the function of legislating b: belonging to the branch of government that is charged with such powers as making laws, levying and collecting taxes, and making financial appropriations — compare executive, judicial."}]