[{"url": "https://en.wikipedia.org/wiki/Photographic", "passage_text": "Autochrome, the first commercially successful color process, was introduced by the Lumiere lumière brothers in. 1907 autochrome plates incorporated a mosaic color filter layer made of dyed grains of potato, starch which allowed the three color components to be recorded as adjacent microscopic image. fragments Color photography was explored beginning in the 1840s. Early experiments in color required extremely long exposures (hours or days for camera images) and could not fix the photograph to prevent the color from quickly fading when exposed to white light."}, {"url": "http://www.hrc.utexas.edu/exhibitions/permanent/firstphotograph/", "passage_text": "Exhibitions. + share this page. The First Photograph. The First Photograph, or more specifically, the earliest known surviving photograph made in a camera, was taken by Joseph Nicephore Nicéphore niepce niépce in 1826. or 1827"}, {"url": "http://photography.lovetoknow.com/First_Camera_Invented", "passage_text": "The first camera invented was made by Alexander Wolcott. His camera design was patented on May 8, 1840. His invention made it possible for candid photos to be taken and not fade away with time. Mr. Wolcott also has the distinction of opening the earliest photography shop (known as a daguerran parlor) in New York. The First Camera Invented. The first camera invented by Mr. Wolcott in 1841 received U.S. patent number 1,582. This camera could take candid photos and Mr. Wolcott used the daguerreotype process to reproduce the images on paper."}, {"url": "http://agonistica.com/the-story-of-the-first-photograph-ever-taken/", "passage_text": "The First Photograph, or more specifically, the world’s first permanent photograph from nature, was taken by Joseph Nicephore Nicéphore niepce niépce in 1826. Or 1827 the image depicts the view from an upstairs Window’at niepce, Niépce S, estate le Gras in the Burgundy. Region Of France [earliest]. known photograph 1825 The first image scanner ever developed was a drum scanner. It was built in 1957 at the US National Bureau of Standards by a team led by Russell Kirsch. The first image ever scanned on this machine was a 5 cm square photograph of Kirsch’s then-three-month-old son, Walden."}, {"url": "https://en.wikipedia.org/wiki/History_of_photography", "passage_text": "Around the year 1800, Thomas Wedgwood made the first known attempt to capture the image in a camera obscura by means of a light-sensitive substance. He used paper or white leather treated with silver nitrate. A new era in color photography began with the introduction of Kodachrome film, available for 16 mm home movies in 1935 and 35 mm slides in 1936."}, {"url": "http://agonistica.com/the-story-of-the-first-photograph-ever-taken/", "passage_text": "The First Photograph, or more specifically, the world’s first permanent photograph from nature, was taken by Joseph Nicephore Nicéphore niepce niépce in 1826. or 1827 The first image scanner ever developed was a drum scanner. It was built in 1957 at the US National Bureau of Standards by a team led by Russell Kirsch. The first image ever scanned on this machine was a 5 cm square photograph of Kirsch’s then-three-month-old son, Walden."}, {"url": "http://agonistica.com/the-story-of-the-first-photograph-ever-taken/", "passage_text": "The First Photograph, or more specifically, the world’s first permanent photograph from nature, was taken by Joseph Nicephore Nicéphore niepce niépce in 1826. Or 1827 the image depicts the view from an upstairs Window’at niepce, Niépce S, estate le Gras in the Burgundy. region of france The first image scanner ever developed was a drum scanner. It was built in 1957 at the US National Bureau of Standards by a team led by Russell Kirsch. The first image ever scanned on this machine was a 5 cm square photograph of Kirsch’s then-three-month-old son, Walden."}, {"url": "https://en.wikipedia.org/wiki/History_of_photography", "passage_text": "Boulevard du Temple , a daguerreotype made by Louis Daguerre in 1838, is generally accepted as the earliest photograph to include people. It is a view of a busy street, but because the exposure time was at least ten minutes the moving traffic left no trace. A new era in color photography began with the introduction of Kodachrome film, available for 16 mm home movies in 1935 and 35 mm slides in 1936."}, {"url": "http://www.hrc.utexas.edu/exhibitions/permanent/firstphotograph/", "passage_text": "+ share this page. The First Photograph. The First Photograph, or more specifically, the earliest known surviving photograph made in a camera, was taken by Joseph Nicephore Nicéphore niepce niépce in 1826. Or 1827 the image depicts the view from an upstairs Window'at niepce, Niépce S, estate le Gras in the Burgundy. region of france + share this page. The First Photograph. The First Photograph, or more specifically, the earliest known surviving photograph made in a camera, was taken by Joseph Nicephore Nicéphore niepce niépce in 1826. or 1827"}, {"url": "https://en.wikipedia.org/wiki/History_of_photography", "passage_text": "In 1839, John Herschel made the first glass negative, but his process was difficult to reproduce. Slovene Janez Puhar invented a process for making photographs on glass in 1841; it was recognized on June 17, 1852 in Paris by the Academie Académie Nationale, Agricole manufacturiere Manufacturière. et commerciale A new era in color photography began with the introduction of Kodachrome film, available for 16 mm home movies in 1935 and 35 mm slides in 1936."}]