[{"url": "http://www.hcg411.info/2011/03/stopping-hcg-diet-early.html", "passage_text": "Usually a typical round on the HCG Weight Loss Diet will last between 23 to 40 days. It is then followed by 3 days of the 500 calorie diet after stopping the HCG. You then move onto Phase 3, which is also known as Maintenance. However, things don't always work out the way they are supposed to. Sometimes, for various different reasons, a person will have to cut the diet short. Absolutely not! It is never a good idea to do the HCG Diet for less than 23 days. Not only that, but 23 days is the minimum amount of time that the protocol allows. Some people believe that if they have lost a good amount of weight the diet is over-This couldn't be further from the truth."}, {"url": "http://www.hcgweightloss.com/hcg-injections-side-effects/comment-page-2/", "passage_text": "HCG is also used as a diet aid and this has drawn considerable attention to the possible HCG injection side effects (side effects of HCG shot) that may exist. HCG is presently relied upon as a medication for fertility and it is also used to safely promote the production of testosterone in males. However, the amount differences between HCG used for Weight Loss (125 IU to 200IU) and HCG for fertility purpose (10,000 IU) is significantly different. So there are rarely side effects reported while using HCG diet injections, or oral hCG for weight loss."}, {"url": "http://www.hcgdietdrops.com/hcg-injections-side-effects.html", "passage_text": "Remember that these are the side effects of HCG at the high doses used for fertility treatment. The side effects of HCG injections may be less serious due to the smaller dosage. The side effects of HCG drops and the HCG diet itself are also different. The side effects of HCG injections are potentially very serious and should not be taken lightly. These are NOT the same side effects as homeopathic HCG drops or the HCG diet itself. HCG stands for human chorionic gonadotropin."}, {"url": "http://www.livestrong.com/article/545952-how-to-quit-the-hcg-diet-early/", "passage_text": "The hCG diet restricts this number even further, recommending only 500 calories per day. Most diet courses last from a few weeks to 40 days. If you want to quit the hCG diet early, there are some rules to follow to avoid regaining weight rapidly. Quit the hCG diet safely and start eating again. Photo Credit Thomas Northcut/Digital Vision/Getty Images. The hCG diet uses a combination of hormone injections and a very low calorie diet, or VLCD, to promote rapid weight loss."}, {"url": "http://hcgchica.com/the-72-hours-before-phase-3-starts-hcg-diet/", "passage_text": "Phase 2 – taking hCG and eating 500 VLCD diet LDW – last day of taking hCG, your weight you will be trying to stabilize within 2 lbs (see when that ain’t gonna happen here, here, and here) 72 hours – not taking hCG, continuing 500 VLCD diet Phase 3 starts – eating according to new P3 rules. "}, {"url": "http://www.hcgweightloss.com/hcg-injections-side-effects/comment-page-2/", "passage_text": "People on HCG Weight Loss Program may worry about HCG side effects. For those of you who are unfamiliar with what HCG is; HCG is actually an acronym which means Human Chorionic Gonadotropin. However, the amount differences between HCG used for Weight Loss (125 IU to 200IU) and HCG for fertility purpose (10,000 IU) is significantly different. So there are rarely side effects reported while using HCG diet injections, or oral hCG for weight loss."}, {"url": "http://nuimagemedical.com/hcg-diet-blog/can-you-quit-the-hcg-diet-early/", "passage_text": "Quitting the diet early will result in less weight loss of course, but the HCG diet is so effective that you can start it right back up and start seeing results as soon as you begin. Quitting the HCG diet early is not recommended unless you absolutely have to, and you should definitely talk to your medical provider before you make a final decision to quit the diet."}, {"url": "http://www.hcgdietcafe.com/hcg-phase-3.html", "passage_text": "First you stop taking your supplement and it takes about 3 weeks to flush out the hormone from your body. Exciting part, is that you can have any food you want as long as it is not a starch or carbohydrate for three weeks. Starches are such things as potatoes, chips, corn, rice, bread... you get the idea. If you are taking the natural homeopathic form of HCG, you listen to your body and determine when to quit. Say you have been losing an average of 6 pounds per week, and you notice that the last week or so, you have dropped to 4 pounds."}]