[{"url": "http://www.sciencedirect.com/science/article/pii/S002252231200877X", "passage_text": "Very long-term results (up to 17 years) with the double-orifice mitral valve repair combined with ring annuloplasty for degenerative mitral regurgitation. Read at the 92nd Annual Meeting of The American Association for Thoracic Surgery, San Francisco, California, April 28-May 2, 2012. In conclusion, our clinical and echocardiographic data confirm that the DO mitral valve repair, combined with ring annuloplasty, provides very satisfactory long-term results in patients with degenerative MR in the setting of BLP and ALP."}, {"url": "http://www.sciencedirect.com/science/article/pii/S002252231200877X", "passage_text": "Therefore, we decided to assess the long-term (up to 17.5 years) clinical and echocardiographic outcomes of DO mitral valve repair adopted specifically for patients with pure degenerative, severe MR undergoing concomitant ring annuloplasty. In conclusion, our clinical and echocardiographic data confirm that the DO mitral valve repair, combined with ring annuloplasty, provides very satisfactory long-term results in patients with degenerative MR in the setting of BLP and ALP."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0003497515006323", "passage_text": "Restrictive mitral annuloplasty with a rigid annuloplasty ring is the preferred treatment for secondary mitral regurgitation 1 and 2. A high recurrence rate of mitral regurgitation has led physicians to use smaller annuloplasty ring sizes [3] . It appears therefore that the small annuloplasty ring is, at the very least, not harmful. It seems that exercise performance by our patients might be limited by an array of other factors, including preexisting heart disease, which, in cases of functional mitral regurgitation, is primary to a valvular problem."}, {"url": "http://medical-dictionary.thefreedictionary.com/annuloplasty", "passage_text": "Supply of surgical heart valves, annuloplasty rings, cardiovascular ... by Mena Report. Valtech Cardio Ltd, a medical device company that develops solutions for mitral valve repair and replacement, announced today that 11 patients have been treated with the company's transcatheter (transfemoral) Cardioband(TM). Contract notice: Supply of surgical heart valves, rings, cardiovascular sutures, surgical clips like bulldog, removable jaws drills called punch aortic, heart and cardiovascular pulls microsurgical knives and related services for all institutions of public assistance-paris hospitals."}, {"url": "http://www.sciencedirect.com/science/article/pii/S002252231200877X", "passage_text": "The very long-term results of the double-orifice mitral valve repair are unknown. The aim of this study was to assess the late clinical and echocardiographic outcomes of this technique in patients with degenerative mitral regurgitation. In conclusion, our clinical and echocardiographic data confirm that the DO mitral valve repair, combined with ring annuloplasty, provides very satisfactory long-term results in patients with degenerative MR in the setting of BLP and ALP."}, {"url": "https://en.wikipedia.org/wiki/Annuloplasty", "passage_text": "Annuloplasty devices usually come in different sizes. The surgeon can estimate the dimensions of the patient’s mitral valve and decide on an appropriate ring size. Depending on the disease etiology, different approaches are taken. Surgeons can decide to undersize the device, truesize the device, or oversize it. The goal of mitral valve annuloplasty is to regain mitral valve competence by restoring the physiological form and function of the normal mitral valve apparatus. Under normal conditions the mitral valve undergoes significant dynamic changes in shape and size throughout the cardiac cycle"}, {"url": "https://en.wikipedia.org/wiki/Annuloplasty", "passage_text": "Mitral valve annuloplasty is a surgical technique for the repair of leaking mitral valves. Due to various factors, the two leaflets normally involved in sealing the mitral valve to retrograde flow may not coapt properly. The goal of mitral valve annuloplasty is to regain mitral valve competence by restoring the physiological form and function of the normal mitral valve apparatus. Under normal conditions the mitral valve undergoes significant dynamic changes in shape and size throughout the cardiac cycle"}, {"url": "https://en.wikipedia.org/wiki/Annuloplasty", "passage_text": "Mitral regurgitation is the most common form of mitral valve dysfunction. Today more than 2.5 million Americans are estimated to be affected by mitral regurgitation. This number is expected to double by the year 2030. The goal of mitral valve annuloplasty is to regain mitral valve competence by restoring the physiological form and function of the normal mitral valve apparatus. Under normal conditions the mitral valve undergoes significant dynamic changes in shape and size throughout the cardiac cycle"}, {"url": "http://www.heart-valve-surgery.com/heart-surgery-blog/2009/12/15/annuloplasty-rings/", "passage_text": "Her question focuses on the use of annuloplasty rings to treat leaky heart valves. Regina writes, “Hi Adam – Although I’m 58, I was recently diagnosed with mitral valve regurgitation. My cardiologist thinks I may need surgery in the next year. The disease is categorized as moderate-to-severe. Well… It makes sense that if the diameter of the valve opening is larger than the extent to which the valve leaflets close, this can be a serious risk to the patient due to heart valve leakage. The picture above shows an actual annuloplasty ring implanted during a heart valve repair."}]