[{"url": "http://www.audioenglish.org/dictionary/reticulated_python.htm", "passage_text": "• RETICULATED PYTHON (noun). The noun RETICULATED PYTHON has 1 sense: 1. of southeast Asia and East Indies; the largest snake in the world. Familiarity information: RETICULATED PYTHON used as a noun is very rare."}, {"url": "http://www.audioenglish.org/dictionary/python_reticulatus.htm", "passage_text": "• PYTHON RETICULATUS (noun). The noun PYTHON RETICULATUS has 1 sense: 1. of southeast Asia and East Indies; the largest snake in the world. Familiarity information: PYTHON RETICULATUS used as a noun is very rare. "}, {"url": "http://www.merriam-webster.com/dictionary/reticulated%20python", "passage_text": "Definition of RETICULATED PYTHON. : a very large python (Python reticulatus) of southeastern Asia that is usually considered the largest of recent snakes. ADVERTISEMENT. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis"}, {"url": "http://www.reptilesmagazine.com/Snakes/Snake-Care/Reticulated-Python-Care-Tips/", "passage_text": "The reticulated python has the largest natural range of any python species, living in a variety of habitats throughout southeast Asia. It is the largest species of snake and reaches exceptional sizes more consistently than other snake species. By Bob Clark. In the last 20 years, there has been an evolution in the captive reticulated python (Python reticulatus reticulatus), certainly in the public perception, and in a physical sense, as well."}, {"url": "https://en.wikipedia.org/wiki/Reticulated_python", "passage_text": "This species is the largest snake native to Asia. More than a thousand wild reticulated pythons in southern Sumatra were studied and estimated to have a length range of 1.5 to 6.5 m (4.9 to 21.3 ft) and a weight range of 1 to 75 kg (2.2 to 165.3 lb). Reticulated pythons with lengths more than 6 m (19.7 ft) are rare, though according to the Guinness Book of World Records, it is the only extant snake to regularly exceed that length."}, {"url": "http://www.reptilesmagazine.com/Snakes/Snake-Care/Reticulated-Python-Care-Tips/", "passage_text": "The name “reticulated” means net-like, and it refers to the snake’s pattern of irregular, geometric markings on a contrasting background. The pattern and coloration has evolved, as it has in many animals, to allow them to be less conspicuous to potential predators and prey alike. By Bob Clark. In the last 20 years, there has been an evolution in the captive reticulated python (Python reticulatus reticulatus), certainly in the public perception, and in a physical sense, as well."}, {"url": "http://www.thefreedictionary.com/reticulated", "passage_text": "reticulate. adj. 1. (Biology) in the form of a network or having a network of parts: a reticulate leaf. 2. resembling, covered with, or having the form of a net. vb. 3. to form or be formed into a net. [C17: from Late Latin rēticulātus made like a net]. (adj. rɪˈtɪk yə lɪt, -ˌleɪt; v. -ˌleɪt). adj., v. -lat•ed, -lat•ing. adj. reticulate-resembling or forming a network; the reticulate veins of a leaf; a reticulated highway system. reticular. nonreticulate-not resembling or forming a network."}, {"url": "http://www.thefreedictionary.com/reticulated+python", "passage_text": "- the longest species of snake in the world-and tips the scale at around 60 kilograms. How do you give a python an ultrasound by Daily Post (Conwy, Wales). The rules would also apply to. , green anaconda, Beni anaconda and DeSchauensee's anaconda. "}, {"url": "https://en.wikipedia.org/wiki/Reticulated_python", "passage_text": "The reticulated python (Python reticulatus) is a species of python found in Southeast Asia. They are the world's longest snakes and longest reptiles, but are not the most heavily built. Like all pythons, they are nonvenomous constrictors and normally not considered dangerous to humans. Reticulated pythons with lengths more than 6 m (19.7 ft) are rare, though according to the Guinness Book of World Records, it is the only extant snake to regularly exceed that length."}, {"url": "https://en.wikipedia.org/wiki/Reticulated_python", "passage_text": "An excellent swimmer, P. reticulatus has been reported far out at sea and has colonized many small islands within its range. The specific name, reticulatus, is Latin meaning net-like, or reticulated, and is a reference to the complex color pattern. Reticulated pythons with lengths more than 6 m (19.7 ft) are rare, though according to the Guinness Book of World Records, it is the only extant snake to regularly exceed that length."}]