[{"url": "http://ghr.nlm.nih.gov/condition/sickle-cell-disease", "passage_text": "Sickle cell disease is a group of disorders that affects hemoglobin, the molecule in red blood cells that delivers oxygen to cells throughout the body. People with this disorder have atypical hemoglobin molecules called hemoglobin S, which can distort red blood cells into a sickle, or crescent, shape. Mutations in the HBB gene cause sickle cell disease. Hemoglobin consists of four protein subunits, typically, two subunits called alpha-globin and two subunits called beta-globin. The HBB gene provides instructions for making beta-globin. Various versions of beta-globin result from different mutations in the HBB gene."}, {"url": "http://www.news-medical.net/health/Sickle-Cell-Disease-Genetics.aspx", "passage_text": "Sickle-Cell Disease Genetics. By Yolanda Smith, BPharm. Sickle-cell disease is caused by a gene mutation that leads to the production of Sickle haemoglobin, which affects the function of the red blood cells in the body. This mutation is inherited from the parents of an individual in an autosomal recessive pattern. "}, {"url": "http://sickle.bwh.harvard.edu/hemoglobinopathy.html", "passage_text": "1 Sickle/beta-thalassemia. 2  In this condition, the patient has inherited a gene for hemoglobin S from one parent and a gene for beta-thalassemia from the other. 3  The severity of the condition is determined to a large extent by the quantity of normal hemoglobin produced by the beta-thalassemia gene. 1 Hemoglobin C. Hemoglobin C results from a mutation in the beta globin gene and is the predominant hemoglobin found in people with hemoglobin C disease (a 2 b 2). 2  Hemoglobin C disease is relatively benign, producing a mild hemolytic anemia and splenomegaly."}, {"url": "http://sickle.bwh.harvard.edu/hemoglobinopathy.html", "passage_text": "1 People who have one sickle mutant gene and one normal beta gene have sickle cell trait which is benign. 2  Hemoglobin C. Hemoglobin C results from a mutation in the beta globin gene and is the predominant hemoglobin found in people with hemoglobin C disease (a 2 b 2). 1 Hemoglobin C. Hemoglobin C results from a mutation in the beta globin gene and is the predominant hemoglobin found in people with hemoglobin C disease (a 2 b 2). 2  Hemoglobin C disease is relatively benign, producing a mild hemolytic anemia and splenomegaly."}, {"url": "http://ghr.nlm.nih.gov/gene/HBB", "passage_text": "Beta-globin is a component (subunit) of a larger protein called hemoglobin, which is located inside red blood cells. In adults, hemoglobin normally consists of four protein subunits: two subunits of beta-globin and two subunits of another protein called alpha-globin, which is produced from another gene called HBA. More than 10 mutations in the HBB gene have been found to cause methemoglobinemia, beta-globin type, which is a condition that alters the hemoglobin within"}, {"url": "http://ghr.nlm.nih.gov/gene/HBB", "passage_text": "methemoglobinemia, beta-globin type-caused by mutations in the HBB gene. More than 10 mutations in the HBB gene have been found to cause methemoglobinemia, beta-globin type, which is a condition that alters the hemoglobin within red blood cells."}, {"url": "http://medical-dictionary.thefreedictionary.com/sickle+cell+disease", "passage_text": "Description. The most common and best-known type of sickle cell disease is sickle cell anemia, which is also called meniscocytosis, sicklemia, or SS disease. All types of sickle cell disease are caused by a genetic change in hemoglobin, the oxygen-carrying protein inside the red blood cells. Carriers of the sickle cell gene are said to have sickle cell trait. Unlike sickle cell disease, sickle cell trait does not cause health problems. In fact, sickle cell trait is protective against malaria, a disease caused by blood-borne parasites transmitted through mosquito bites."}, {"url": "http://ghr.nlm.nih.gov/gene/HBB", "passage_text": "Sickle cell anemia, a common form of sickle cell disease, is caused by a particular mutation in the HBB gene. This mutation results in the production of an abnormal version of beta-globin called hemoglobin S or HbS. In this condition, hemoglobin S replaces both beta-globin subunits in hemoglobin. More than 10 mutations in the HBB gene have been found to cause methemoglobinemia, beta-globin type, which is a condition that alters the hemoglobin within red blood cells."}, {"url": "http://evolution.berkeley.edu/evolibrary/article/mutations_06", "passage_text": "Sickle cell anemia is a genetic disease with severe symptoms, including pain and anemia. The disease is caused by a mutated version of the gene that helps make hemoglobin  a protein that carries oxygen in red blood cells. People with two copies of the sickle cell gene have the disease. People who carry only one copy of the sickle cell gene do not have the disease, but may pass the gene on to their children. This is a chain of causation. What happens at the DNA level propagates up to the level of the complete organism. DNA and Mutations : A case study of the effects of mutation: Sickle cell anemia. The mutations that cause sickle cell anemia have been extensively studied and demonstrate how the effects of mutations can be traced from the DNA level up to the level of the whol"}, {"url": "http://sickle.bwh.harvard.edu/hemoglobinopathy.html", "passage_text": "1 In this condition, the patient has inherited a gene for hemoglobin S from one parent and a gene for beta-thalassemia from the other. 2  The severity of the condition is determined to a large extent by the quantity of normal hemoglobin produced by the beta-thalassemia gene. 1 Hemoglobin C. Hemoglobin C results from a mutation in the beta globin gene and is the predominant hemoglobin found in people with hemoglobin C disease (a 2 b 2). 2  Hemoglobin C disease is relatively benign, producing a mild hemolytic anemia and splenomegaly."}]