[{"url": "http://www.answers.com/Q/Part_of_diencephalon_that_forms_lower_walls_and_floor_of_third_ventricle", "passage_text": "Diencephalon includes thalamus, pineal gland, hypothalamus, and a part of the pituitary gland. Globus pallidus (a part of basal ganglia) also … originated from diencephalon. In the embryo the walls of the diencephalon forms at neural tube  that begins the process of the fore brain."}, {"url": "https://en.wikipedia.org/wiki/Diencephalon", "passage_text": "The diencephalon or interbrain is one of the major regions of the brain in vertebrates. It consists of several structures between the brainstem and the cerebrum, including the thalamus, hypothalamus, epithalamus, pituitary gland, and pineal gland. Embryologically, the diencephalon begins as the region of the embryonic vertebrate neural tube that gives rise to posterior forebrain structures. "}, {"url": "http://discovery.lifemapsc.com/library/review-of-medical-embryology/chapter-153-the-diencephalon-second-vesicle", "passage_text": "1 The diencephalon develops from the median portion of the prosencephalon and consists of a roof plate, 2 alar plates, and the third ventricle. 2  There is a question of whether it has a floor or basal plate. 1 THE ROOF PLATE consists of a single layer of ependymal cells covered by vascular mesenchyme (meninges). 2  The 2 layers later combine to form the choroid plexus of the third ventricle, which closes it from above."}, {"url": "http://www.answers.com/Q/The_floor_of_the_diencephalon_is_formed_by_the", "passage_text": "In the embryo the walls of the diencephalon forms at neural tube  that begins the process of the fore brain. In adults, the  diencephalon is located towards the upper end of … the brain stem. Blood on the dance floor was started in 2007 orriganally as LOVE THE FASHION but the former keyboard player came up with botdf(blood on the dance floor)..And the name just stu … ck.."}, {"url": "http://medical-dictionary.thefreedictionary.com/hypothalamus", "passage_text": "[hypo- + thalamus]. /hy·po·thal·a·mus/ (-thal´ah-mus) the part of the diencephalon forming the floor and part of the lateral wall of the third ventricle, including the optic chiasm, mammillary bodies, tuber cinereum, and infundibulum; the pituitary gland is also in this region but is physiologically distinct. The part of the brain that lies below the thalamus, forming the major portion of the ventral region of the diencephalon, and that regulates bodily temperature, certain metabolic processes, and other autonomic activities."}, {"url": "https://en.wikipedia.org/wiki/Third_ventricle", "passage_text": "The third ventricle is bounded by the thalamus and hypothalamus on both the left and right sides. The lamina terminalis forms the anterior wall. The floor is formed by hypothalamic structures. The roof is formed by the ependyma, lining the undersurface of the tela choroidea of the third ventricle. The third ventricle (ventriculus tertius) is one of four connected fluid-filled cavities comprising the ventricular system within the human brain."}, {"url": "http://medical-dictionary.thefreedictionary.com/hypothalamus", "passage_text": "hypothalamus. the portion of the diencephalon lying beneath the thalamus at the base of the cerebrum, and forming the floor and part of the lateral wall of the third ventricle. The part of the brain that lies below the thalamus, forming the major portion of the ventral region of the diencephalon, and that regulates bodily temperature, certain metabolic processes, and other autonomic activities."}, {"url": "http://www.upright-health.com/third-ventricle.html", "passage_text": "The third ventricle is surrounded by the structures of the diencephalon of the brain. The diencephalon is part of the central processing unit or motherboard of the brain. It connects and coordinates the lobes of the brain on its rostral (top) end, to the brainstem, cerebellum and spinal cord on its caudal (lower) end. The posterior perforated substance is the area of the floor of the third ventricle that is penetrated by many blood vessels. The subthalamus portion of the floor of the third ventricle is located beneath the thalamus toward the rear and flanks of the hypothalamus."}, {"url": "http://www.cerebromente.org.br/n02/fundamentos/ventriiii_i.htm", "passage_text": "The roof of the third ventricle is formed by a thin layer of ependyma. The lateral walls are formed mainly by the medial surfaces of the 2 thalami.The lower lateral wall and the floor of the ventricle are formed by the hypothalamus and subthalamus. The Third Ventricle. The third ventricle (in blue) is a narrow vertical cleft between the 2 lateral ventricles. It possesses a roof, a floor and four walls: anterior, posterior and two lateral. The roof is formed by the tela choroidea. The floor is made up of the optic chiasm, the tuber cinereum and the infundibulum, the mamilary bodies, the posterior perforated substance and the upermost part of the mesencephalic tegmentum. The anterior wall is the delicate lamina terminali"}]