[{"url": "http://www.thecalculatorsite.com/articles/units/how-big-is-an-acre.php", "passage_text": "It is important to realise that an acre can be measured in any shape-from rectangles to circles or even hexagons-so long as the total area of land is 43,560 square feet. The most common shape for an acre is 1 furlong by 1 chain, or 660 feet by 66 feet. "}, {"url": "https://en.wikipedia.org/wiki/Acre", "passage_text": "To be more exact, one acre is 90.75 percent of a 100 yards (91.44 metres) long by 53.33 yards (48.76 metres) wide American football field (without the end zones). The full field, including the end zones, covers approximately 1.32 acres (0.53 ha). For residents of other countries, the acre might be envisaged as approximately 56.68 percent of a 105 metres (344.49 feet) long by 68 metres (223.10 feet) wide association football (soccer) pitch. Originally, an acre was understood as a selion of land sized at forty perches (660 ft, or 1 furlong) long and four perches (66 ft) wide; this may have also been understood as an approximation of the amount of land a yoke of oxen could plough in one day."}, {"url": "http://sizes.com/units/acre_FAQ.htm", "passage_text": "It is purely an area of 43,560 square feet. The two sides of a 1-acre rectangular lot can be any lengths as long as multiplying one by the other gives 43,560 (if they are measured in feet). For example, imagine a sidewalk 5 feet wide. If it were (43560 ÷ 5 =) 8712 feet long it would take up an acre, a long skinny acre. On the other hand, if the 1-acre lot were a square, its sides would be only 208.7 feet. 2."}, {"url": "http://sizes.com/units/acre.htm", "passage_text": "It is purely an area of 43,560 square feet. The two sides of a 1-acre rectangular lot can be any lengths as long as multiplying one by the other gives 43,560 (if they are measured in feet). For example, imagine a sidewalk 5 feet wide. If it were (43560 ÷ 5 =) 8712 feet long it would take up an acre, a long skinny acre. On the other hand, if the 1-acre lot were a square, its sides would be only 208.7 feet long. A square plot of ground 208.7 feet on a side will cover an acre. An American football field, 360 feet by 160 feet, is about 1.3 acres; 12 high school basketball courts are a little more than 1 acre."}, {"url": "http://www.answers.com/Q/How_wide_is_a_acre_of_land_and_how_long", "passage_text": "A traditional Acre was a Furlong; meaning Furrows length (220 Yards or 660 Feet) long by a Chain (22 Yards or 66 Feet) wide. So 1 square Furlong (todays' city block) is 10 Acres. 8 Furlongs to a Mile. An Acre is 43,560 square feet. An Acre was originally the amount of land an ox could plough in one day   and was 1 chain wide by 10 chains long, or 22yds x 220yds or 66ft x   660ft. In modern measur … ements an acre is 43,500 square feet. 3 acres would be 130,680 square feet. The square root of 130,680 is 361.5 (361.496887953 rounded up) So if the 3 acres were perfectly square this would be measure 361.5 feet long and 361.5 feet wide. However, acres are not typically in perfect squares"}, {"url": "http://www.infoplease.com/askeds/dimensions-acre.html", "passage_text": "The Answer: Because an acre is a measure of area, not length, it is defined in square feet. An acre can be of any shape—a rectangle, a triangle, a circle, or even a star—so long as its area is exactly 43,560 square feet. The most standard shape for an acre is one furlong by one chain, or 660 feet by 66 feet. To find the linear measurements of other rectangular acres, just divide 43,560 by the number of feet you want on one side."}, {"url": "http://sizes.com/units/acre.htm", "passage_text": "One acre is about 4,046.873 square meters. A square plot of ground 208.7 feet on a side will cover an acre. An American football field, 360 feet by 160 feet, is about 1.3 acres; 12 high school basketball courts are a little more than 1 acre."}, {"url": "http://www.infoplease.com/askeds/dimensions-acre.html", "passage_text": "A square-shaped acre would then be about 208.7 by 208.7 feet (because 208.7 x 208.7 = ~43,560). An acre 100 feet wide would be 435.6 feet long (100 x 435.6 = 43,560) and an acre 1 foot wide would be 43,560 feet long. The most standard shape for an acre is one furlong by one chain, or 660 feet by 66 feet. To find the linear measurements of other rectangular acres, just divide 43,560 by the number of feet you want on one side."}, {"url": "http://www.answers.com/Q/How_long_and_how_wide_is_an_acre_in_feet", "passage_text": "A traditional Acre was a Furlong; meaning Furrows length (220 Yards or 660 Feet) long by a Chain (22 Yards or 66 Feet) wide. So 1 square Furlong (todays' city block) is 10 Acres. 8 Furlongs to a Mile. An Acre is 43,560 square feet. Acre comes from the old English word meaning open field.. "}]