[{"url": "http://hypertextbook.com/facts/2003/ChrisDAmbrose.shtml", "passage_text": "Humans cannot hear sounds of every frequency. The range of hearing for a healthy young person is 20 to 20,000 hertz. The hearing range of humans gets worse with age. People lose the ability to hear sounds of high frequency as they get older."}, {"url": "http://www.outdoorchannel.com/article.aspx?id=3703", "passage_text": "Normal human hearing ranges from 20 hertz to 20,000 hertz. Low-frequency sounds, below 20 hertz, are referred to as “infrasound” and travel farther than high-frequency sounds. Frequencies above the range of human hearing (20,000 hertz) are referred to as “ultrasonic.”."}, {"url": "http://www.chloes-hearing-aid-shop.com/frequency-of-the-human-voice/", "passage_text": "The human voice and the human ear are a precisely tuned set of instruments. Theoretically, the human ear can hear from 20 hertz (Hz) to 20,000 Hz, but is most sensitive in the range of 300 Hz and 3000 Hz; a person with normal hearing should be able to distinguish more than 250,000 separate sounds."}, {"url": "https://en.wikipedia.org/wiki/Hearing_range", "passage_text": "The commonly stated range of human hearing is 20 Hz to 20 kHz. Under ideal laboratory conditions, humans can hear sound as low as 12 Hz. Humans are most sensitive to (i.e. able to discern at lowest intensity) frequencies between 2,000 and 5,000 Hz."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=4599", "passage_text": "As you may already know, the SI unit for frequency is Hertz (Hz); an event that repeats once per second has a frequency of 1 Hz. According to most sources, the human hearing (frequency) range is between 20 Hz and 20,000 Hz (bats can hear up to 100,000 Hz!). What does that mean? Sound is a mechanical wave that propagates through a medium (air, water), and the frequency of a sound wave determines its tone and pitch."}, {"url": "http://www.cdc.gov/NCBDDD/hearingloss/sound.html", "passage_text": "Frequency is measured in hertz (Hz). A person who has hearing within the normal range can hear sounds that have frequencies between 20 and 20,000 Hz. The most important sounds we hear every day are in the 250 to 6,000 Hz range. Speech includes a mix of low and high frequency sounds:"}]