[{"url": "http://www.lifehacker.com.au/2015/03/foxtel-iq3-when-to-buy-it-and-when-to-avoid-it/", "passage_text": "For existing Foxtel customers, the IQ3 costs $125. If you choose to install it yourself, there’s a $25 fee; if a Foxtel technician installs it, that’s $75. (In some locations, you might not have the option of self-installation; Foxtel should advise you of this when you order.) Your existing plan pricing will remain. As ever, what you’ll pay depends on what channels you’ve signed up for, and whether you’ve included additional options such as home broadband, phone calls, or non-cable services like Foxtel Play or Presto. The absolute cheapest new plan you can score that includes IQ3 will cost $450 over 12 months."}, {"url": "http://www.techguide.com.au/reviews/bddvd-reviews/hands-on-with-foxtel-iq3-set-top-box-plus-full-pricing-for-new-and-existing-customers/", "passage_text": "Minimum cost for new customers will be $500 (including $125 equipment fee and $75 standard install fee) or $450 (including the $125 equipment fee and the $25 self-install fee) on a 12-month direct debit plan based on the Entertainment pack with a Foxtel iQ3. Hands-on with Foxtel iQ3 set-top box plus full pricing for new and existing customers. Home Reviews BD/DVD Hands-on with Foxtel iQ3 set-top box plus full pricing for new and existing customers. Foxtel has announced pricing for its new iQ3 set-top box which is available from today for new and current subscribers."}, {"url": "https://www.foxtel.com.au/got/support/moving-house.html", "passage_text": "When you move home, there may be some costs associated. Costs will vary depending on the type of Move Home transfer and you will be advised of this prior to carrying out the transfer. For example, if you require a technician, fees will apply for the technician's time. If you wish to have your TV equipment moved, a standard $100 fee will apply, however if you self-install your existing Foxtel TV box at your new address, you won't have to pay this fee. We will let you know if a self-install is possible when you contact us about your move house arrangements. 1 We will then organise the switch off date at your existing address and the switch on date at your new address. 2  Please note, if you are moving multiple Foxtel services, you may not be able to have all your services connected on the same 'switch on' date."}, {"url": "http://if.com.au/2015/03/22/article/Netflix-and-Foxtel-iQ3-reveal-pricing/LCJHKCBXUQ.html", "passage_text": "Concurrently Foxtel announced the pricing for its new iQ3 set-top box, which combines pay-TV, free-to-air and the internet, and Telstra launched Presto on its T-Box, offering a free six-month subscription to both services which normally cost $9.99 individually or $14.99 combined. Netflix and Foxtel iQ3 reveal pricing. [Mon 23/03/2015 8:27 AM]. By Don Groves. Australians can subscribe to Netflix’s Australian service, which launches on Tuesday, for as little as $8.99 per month, undercutting its rivals Stan, Presto Movies, Presto TV and Quickflix by a dollar."}, {"url": "http://forums.whirlpool.net.au/archive/1946972", "passage_text": "Reason for foxtel satellite install, foxtel cable is the 1st preference for foxtel, if they can't find your street on their system then you get satellite, and also when there's no cable in street, there is no taps left on the cable system ($3000 upgrade out of your wallet if you want cable). I work for a contractor, I believe we're a good helpful team and here to give you a guide on installations and what the technician can and can't do. We don't do bodgy or crap jobs, this is what a professional install looks like. I do not know what your building looks like, so dont ask stupid questions."}, {"url": "https://www.foxtel.com.au/got/support/moving-house.html", "passage_text": "1 Click here for instructions if you wish to self-install your Foxtel services. 2  When you contact us for information on what TV and Broadband services are available at your new address (see above), we will let you know whether of not it will be possible for you to self-install any or all of your Foxtel services. 1 We will then organise the switch off date at your existing address and the switch on date at your new address. 2  Please note, if you are moving multiple Foxtel services, you may not be able to have all your services connected on the same 'switch on' date."}, {"url": "http://if.com.au/2015/03/22/article/Netflix-and-Foxtel-iQ3-reveal-pricing/LCJHKCBXUQ.html", "passage_text": "For the iQ3 upgrade, Foxtel subscribers will pay $125 for the unit plus $25 for a self-installation kit, or $125 plus $75 for installation by a Foxtel technician. The STB incorporates Foxtel, free-to-air and movie and TV rentals. Netflix and Foxtel iQ3 reveal pricing. [Mon 23/03/2015 8:27 AM]. By Don Groves. Australians can subscribe to Netflix’s Australian service, which launches on Tuesday, for as little as $8.99 per month, undercutting its rivals Stan, Presto Movies, Presto TV and Quickflix by a dollar."}, {"url": "http://www.techguide.com.au/reviews/bddvd-reviews/hands-on-with-foxtel-iq3-set-top-box-plus-full-pricing-for-new-and-existing-customers/", "passage_text": "Tech Guide had a hands-on look at the device, the new remote control, the new features and the redesigned interface. The new Foxtel iQ3 box will cost an additional $125 plus an additional $25 for either a self-installation kit or $75 for installation by a Foxtel technician. Current customers can upgrade through My Account on the Foxtel website or by calling 131 999. Hands-on with Foxtel iQ3 set-top box plus full pricing for new and existing customers. Home Reviews BD/DVD Hands-on with Foxtel iQ3 set-top box plus full pricing for new and existing customers. Foxtel has announced pricing for its new iQ3 set-top box which is available from today for new and current subscribers."}]