[{"url": "http://home.costhelper.com/terrazzo-flooring.html", "passage_text": "1 (Smaller projects generally cost more per square foot.) Stone Business Online reports that a terrazzo kitchen floor in a luxury apartment cost about $60,000. 2  A do-it-yourself poured terrazzo installation project is challenging but not impossible, and material costs can be minimal. 1 A do-it-yourself poured terrazzo installation project is challenging but not impossible, and material costs can be minimal. 2  A Florida homeowner used white cement, fine sand, scraps from a marble wholesaler, a small rock crusher and a homemade grinder to set his own terrazzo floors for about $200."}, {"url": "http://costowl.com/home-improvement/flooring-terrazzo-cost.html", "passage_text": "1 Terrazzo tile, at around $15 to $30 per square foot installed, is a much more affordable option. 2  While they don’t allow for the high level of customization that traditional terrazzo does, these tiles are available in a wide range of colors and textures. 1 A typical residential job (say, a 15’ x 15’ kitchen) might only cost $25 to $50 per square foot (or, roughly $5,500 to $11,000). 2 "}, {"url": "http://costowl.com/home-improvement/flooring-terrazzo-cost.html", "passage_text": "1 Installed onsite by professionals, terrazzo floors might cost $20 to $100 per square foot. 2  Accounting for this large price range is the scope of the job (smaller jobs tend to cost more), the level of detail (custom patterns demand significantly more, as well as skilled, labor), and the exact components of the aggregate. 1 A typical residential job (say, a 15’ x 15’ kitchen) might only cost $25 to $50 per square foot (or, roughly $5,500 to $11,000). 2  Terrazzo tile, at around $15 to $30 per square foot installed, is a much more affordable option."}, {"url": "http://nurazzo.com/", "passage_text": "Terrazzo floors have always been known for their classic look, durability, longevity, and low cost of maintenance. With Nurazzo ® hand-crafted terrazzo tile, you get the long-lasting, visual appeal of a poured-in-place floor-without the high cost or troublesome, messy installation. – ENVIRONMENTALLY FRIENDLY –. "}, {"url": "http://homewyse.com/costs/cost_of_terrazzo_flooring.html", "passage_text": "Terrazzo Flooring-Pricing and Installation Cost Notes. Homewyse cost estimates are approximate ranges for basic work in typical conditions. The estimates should only be used for preliminary planning. Homewyse estimates are NOT substitutes for quotes from qualified vendors. Do you need to know the average cost to install Terrazzo Flooring in your zip code? Do you need an easy-to-understand 2015 estimate of Terrazzo Flooring job options and costs? Get pricing INSTANTLY. Enter your options and zip code above-then select Update."}, {"url": "http://www.homewyse.com/services/cost_to_install_terrazzo_flooring.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Terrazzo Flooring Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Terrazzo Flooring ranges between $8.58 - $11.88 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. 2."}, {"url": "http://www.improvenet.com/r/costs-and-prices/terrazzo-flooring", "passage_text": "There is one way to keep the costs of terrazzo flooring down, and that is to use terrazzo tile. These are pre-made tiles using the terrazzo technique. Instead of having to hire a contractor to make the entire floor using small pieces, homeowners can hire contractors to lay down the tiles. Minimum cost - $20 per square foot. Maximum cost - $100 per square foot. The cost of terrazzo flooring is directly related to the materials out of which the floor itself is made."}, {"url": "http://www.improvenet.com/r/costs-and-prices/terrazzo-flooring", "passage_text": "The Costs. Minimum cost - $20 per square foot. Maximum cost - $100 per square foot. The cost of terrazzo flooring is directly related to the materials out of which the floor itself is made. Since terrazzo flooring is made out of little chips and pieces of other materials, some terrazzo flooring costs more than other"}, {"url": "http://home.costhelper.com/terrazzo-flooring.html", "passage_text": "1 Terrazzo tiles come in a wide variety of color and texture combinations, and can cost $6-$20 or more a square foot, or $2,400-$8,000 for 20'x20'. 2  Professional installation can add another $6-$10 a square foot, bringing total costs for labor and materials to $12-$30 or more a square foot, or $4,800-$12,000 for 20'x20'. 1 A do-it-yourself poured terrazzo installation project is challenging but not impossible, and material costs can be minimal. 2  A Florida homeowner used white cement, fine sand, scraps from a marble wholesaler, a small rock crusher and a homemade grinder to set his own terrazzo floors for about $200."}, {"url": "http://home.costhelper.com/terrazzo-flooring.html", "passage_text": "1 A terrazzo floor has a high initial price, but can last for generations with no replacement costs. 2  Professionally installed poured-in-place terrazzo can cost $20-$50 a square foot ($8,000-$20,000 for a 20'x20'; $40,000-$100,000 for 2,000 square feet) but can go as high as $60-$80 or more a square foot. 1 A do-it-yourself poured terrazzo installation project is challenging but not impossible, and material costs can be minimal. 2  A Florida homeowner used white cement, fine sand, scraps from a marble wholesaler, a small rock crusher and a homemade grinder to set his own terrazzo floors for about $200."}]