[{"url": "http://articles.chicagotribune.com/2012-07-13/business/sc-cons-0712-started-20120713_1_young-investors-stock-market-double-digit-stock-returns", "passage_text": "I asked the folks at Morningstar to calculate the projected growth of retirement savings for a young investor. We assumed that a 25-year-old who earns $40,000 today would save 15 percent of his salary every year for the next 40 years. His salary would grow annually by the rate of inflation. "}, {"url": "http://www.gallup.com/poll/168707/average-retirement-age-rises.aspx", "passage_text": "The majority of all age groups expect to retire at age 65 or older. This includes 62% of 18- to 29-year-olds, 62% of 30- to 49-year-olds, and 58% of 50- to 64-year-olds. At the same time, an optimistic 15% of the youngest age group expect to retire before age 60. Adults closer to that age are naturally less likely to think they will be ready for retirement by that point. WASHINGTON, D.C. -- The average age at which U.S. retirees report retiring is 62, the highest Gallup has found since first asking Americans this question in 1991. This age has increased in recent years, while the average age at which non-retired Americans expect to retire, 66, has largely stayed the same"}, {"url": "http://www.fool.com/investing/general/2014/03/08/peter-lynchs-tips-for-young-investors.aspx", "passage_text": "Mar 8, 2014 at 12:04PM. One of the greatest advantages a young investor has is time. Investing legend Peter Lynch, who saw average annual returns of 29% during his tenure managing Fidelity's Magellan fund from 1977 to 1990, encourages all investors to start investing young by saving money in a retirement account. If you start by investing $1,200 in the stock market every year and gain an average of 9% annually -- the stock market's historical average annual return -- your portfolio would grow to a total of $121,136 after 25 years."}, {"url": "http://www.investopedia.com/articles/younginvestors/09/common-mistakes-young-investors.asp", "passage_text": "5. Not Investing As mentioned earlier, an investor has the best ability to seek a higher return and take on higher risk when they have a long-term time horizon. Investors have their longest time horizons, and therefore a high tolerance for risk, when they are young. Perhaps the investor rightly develops an opinion that an asset priced at $25 should be worth $50. If it moves up to $50 before he or she buys it, the investor may artificially revise the price target to $60 in order to rationalize the purchase. 2. The young investor will look for a replacement."}, {"url": "http://www.gallup.com/poll/180341/one-four-investors-started-young-saving-retirement.aspx", "passage_text": "Results for the Wells Fargo/Gallup Investor and Retirement Optimism Index survey are based on questions asked Nov. 14-23, 2014, on the Gallup Daily tracking survey, of a random sample of 1,009 U.S. adults having investable assets of $10,000 or more. About a quarter of nonretired investors who are currently saving for their retirement say they could not possibly save any more each month than they already do. Most of the rest (69%), however, believe they could -- with the median additional estimated savings among this group being $250 more each month."}, {"url": "http://www.gallup.com/poll/180341/one-four-investors-started-young-saving-retirement.aspx", "passage_text": "Another 23% began between the ages of 25 and 29, meaning about half of today's investors started the process of saving for retirement before turning 30. About a quarter of nonretired investors who are currently saving for their retirement say they could not possibly save any more each month than they already do. Most of the rest (69%), however, believe they could -- with the median additional estimated savings among this group being $250 more each month."}, {"url": "http://www.gallup.com/poll/168707/average-retirement-age-rises.aspx", "passage_text": "Meanwhile, the average age at which non-retired Americans expect to retire has also increased over time, from 60 in 1995 to 66 this year. Furthermore, in 1995, more non-retired Americans expected to retire younger -- 15% expected to retire before age 55, compared with 4% in 2014. WASHINGTON, D.C. -- The average age at which U.S. retirees report retiring is 62, the highest Gallup has found since first asking Americans this question in 1991. This age has increased in recent years, while the average age at which non-retired Americans expect to retire, 66, has largely stayed the same"}, {"url": "http://www.gallup.com/poll/180341/one-four-investors-started-young-saving-retirement.aspx", "passage_text": "This question was asked of all retired investors and the 91% of nonretired investors who say they are saving for their retirement. The average age at which all of these investors started saving is 30, while it is slightly higher among retirees (age 35) than nonretirees (age 29). About a quarter of nonretired investors who are currently saving for their retirement say they could not possibly save any more each month than they already do. Most of the rest (69%), however, believe they could -- with the median additional estimated savings among this group being $250 more each month."}, {"url": "http://www.moneyunder30.com/asset-allocation-for-investors-under-thirty", "passage_text": "There’s a common formula (and many variations) out there to find your target asset allocation for retirement savings: 100 – Age = Percentage of stocks. So if you’re 20, you would invest 80 percent in stocks and 20 percent in bonds. If you’re 60, you would invest 40 percent in stocks and 60 percent in bonds. This formula is an oversimplification, but I like it because it gives you the idea of how your asset allocation should change as you age. Some young, aggressive investors will want to invest in 90 or even 100 percent stocks whereas many conservative investors will never own 70 percent stocks at age 30, and that’s OK. "}]