[{"url": "https://www.facebook.com/HatfieldAndMcCoyFeud/posts/603860046308778", "passage_text": "SARAH SALLY McCOY was born in 1829 in Pike County, Kentucky. She married her first cousin, RANDOLPH OLD RANDALL McCOY, the leader of the clan in the Hatfield/McCoy feud (b: 30 Oct 1825 in Pike Co., Ky.)."}, {"url": "http://www.genealogy.com/ftm/r/a/y/Anita-H-Ray/GENE4-0008.html", "passage_text": "Sarah Sally McCoy (Samuel, William, Richard) was born 1829 in Pike Co., KY, and died WFT Est. 1875-1924 in Pike Co., KY.She married Randolph McCoy, Sr. December 9, 1849 in Pike Co., KY, son of Daniel McCoy and Margaret Taylor.He was born October 30, 1825 in Pike Co., KY, and died March 28, 1914 in Pike Co., KY. Tolbert McCoy, born June 16, 1854 in Pike Co., KY; died August 9, 1882 in Pike Co., KY. +217v. Samuel McCoy, born December 10, 1855 in Pike Co., KY; died 1916 in Pike Co., KY. 218vi. Lilburn McCoy, born 1856 in Pike Co., KY; died WFT Est. 1857-1946."}, {"url": "https://en.wikipedia.org/wiki/Randolph_McCoy", "passage_text": "Randolph McCoy married his first cousin, Sarah Sally McCoy (born 1829; died in the 1890s), daughter of Samuel McCoy and Elizabeth Davis, on December 9, 1849 in Pike County, Kentucky. They had 16 children together. Their children were: He was born the fourth of thirteen children to Daniel McCoy (1790–1885) and Margaret Taylor McCoy (1800–1868) and lived mostly on the Kentucky side of Tug Fork, a tributary of the Big Sandy River."}, {"url": "http://www.wikitree.com/wiki/McCoy-2631", "passage_text": "Sally McCoy was born in 1829 in Pike County, Kentucky. She married her first cousin, Randolph McCoy Sr. They had the following 16 children: 1 Family Search-United States Census,1870 index and images, FamilySearch Sarah Mccoy in household of Randolph Mccoy, Kentucky, United States; citing p. 19, family 121, NARA microfilm publication M593 (Washington D.C.: National Archives and Records Administration, n.d.); FHL microfilm 545,994."}, {"url": "http://www.biography.com/people/randall-mccoy-20824891#!", "passage_text": "McCoy grew up in poverty. His father, Daniel, had little interest in work, so his mother, Margaret, had to struggle to care for, feed and clothe the family. In 1849, McCoy married his first cousin, Sarah Sally McCoy. Sally inherited land from her father a few years after they married. They settled on this 300-acre spread in Pike County, Kentucky, where they had 16 children together. During the Civil War, McCoy served as a soldier for the Confederacy. "}, {"url": "http://www.hausegenealogy.com/mccoy.html", "passage_text": "ADDISON ATT MCCOY, was born in July of 1855, in Virginia. Att became a farmer and married ELIZABETH BESTSY ESTEP, daughter of John Frazier Estep (1812-1896) and Mary Ann Rains (1815-1858), who was born in Pike, Kentucky, on May 8, 1857. John Frazier Estep of Pike County, Kentucky was the son of Sarah Frazier. 1 ELIZABETH McCOY was born in 1786, in Maryland. 2  She married William Scott and they had 10 children: Mary, Nancy, Andrew, John, Acton or Axton, Daniel, Barnabus, Evan, James T. & Rebecca. 3  Charles Manson is a descendant, through son Andrew Scott."}, {"url": "http://www.wikitree.com/wiki/McCoy-542", "passage_text": "Biography. Sarah Sally McCoy was born in 1829 in Pike, Kentucky. She died about 1890. She married Randolph McCoy in 1849 in Logan, Logan County, West Virginia. 1 WikiTree profile McCoy-542 created through the import of Coley Wolford Stayton McCarroll Bond.ged on Aug 7, 2011 by Tom Coley. 2  Prior to import, this record was last changed 17:50 4 Jul 2011."}, {"url": "http://www.hausegenealogy.com/mccoy.html", "passage_text": "1 POLLY McCOY was born 30 May 1891. 2  She married WILBURN WILLIE WOLFORD (7 Feb 1884 - 12 Dec 1963) on 27 Mar 1909 in Pike, Kentucky. 3  He was the grandson of DANIEL BOONE WOLFORD and SARAH SALLY DOTSON, through their son, DANIEL WOLFORD (1863 - 1932) and NANCY HURLEY (b. 1867). 1 ELIZABETH McCOY was born in 1786, in Maryland. 2  She married William Scott and they had 10 children: Mary, Nancy, Andrew, John, Acton or Axton, Daniel, Barnabus, Evan, James T. & Rebecca. 3  Charles Manson is a descendant, through son Andrew Scott."}, {"url": "http://www.helfrichjosey.com/pages/McCoy-Final-Ancestors.htm", "passage_text": "Samuel McCoy had 18 children and one of them was Sarah (Sally) McCoy born in 1829. She married Randolph Randel McCoy. Another one of Samuel's sons was Asa McCoy, born in 1810 & he was Charles Goble McCoy's granddad. Uriah and Nancy (Nannie) Gibboney Barnett McCoy This picture was found in Chuck's mother's photo albums and on the back, it said This is your grandma and grandpa McCoy, so we are assuming that meant Mary Elizabeth McCoy Helfrich's dad's parents. Uriah and Nannie were married August 24, 1866 in Tazewell County, VA."}]