[{"url": "https://en.wikipedia.org/wiki/Dissociative_disorder", "passage_text": "Dissociative disorders (DD) are conditions that involve disruptions or breakdowns of memory, awareness, identity, or perception. People with dissociative disorders use dissociation, a defense mechanism, pathologically and involuntarily. Dissociative identity disorder (multiple personality disorder). Cause: People with dissociative identity disorder usually have close relatives who have also had similar experiences. Treatment: Long-term psychotherapy that helps the patient merge his/her multiple personalities into one personality."}, {"url": "https://www.psychologytoday.com/conditions/dissociative-identity-disorder-multiple-personality-disorder", "passage_text": "Dissociative Identity Disorder, formerly referred to as Multiple Personality Disorder, is a condition wherein a person's identity is fragmented into two or more distinct personalities. Sufferers of this rare condition are usually victims of severe abuse. 1  Definition. Dissociative Identity Disorder (DID) is a severe condition in which two or more distinct identities, or personality states, are present in—and alternately take control of—an individual. The person also experiences memory loss that is too extensive to be explained by ordinary forgetfulness."}, {"url": "https://www.nami.org/Learn-More/Mental-Health-Conditions/Dissociative-Disorders", "passage_text": "Dissociative disorders are characterized by an involuntary escape from reality characterized by a disconnection between thoughts, identity, consciousness and memory. People from all age groups and racial, ethnic and socioeconomic backgrounds can experience a dissociative disorder. Causes. Dissociative disorders usually develop as a way of dealing with trauma. Dissociative disorders most often form in children exposed to long-term physical, sexual or emotional abuse. Natural disasters and combat can also cause dissociative disorders."}, {"url": "https://en.wikipedia.org/wiki/Dissociative_disorder", "passage_text": "The dissociative disorders listed in the American Psychiatric Association's DSM-5 are as follows: 1  Dissociative identity disorder (formerly multiple personality disorder): the alternation of two or more distinct personality states with impaired recall among personality states. Dissociative identity disorder (multiple personality disorder). Cause: People with dissociative identity disorder usually have close relatives who have also had similar experiences. Treatment: Long-term psychotherapy that helps the patient merge his/her multiple personalities into one personality."}, {"url": "https://www.nami.org/Learn-More/Mental-Health-Conditions/Dissociative-Disorders", "passage_text": "Symptoms and signs of dissociative disorders include: 1  Significant memory loss of specific times, people and events. 2  Out-of-body experiences, such as feeling as though you are watching a movie of yourself.3  Mental health problems such as depression, anxiety and thoughts of suicide.auses. Dissociative disorders usually develop as a way of dealing with trauma. Dissociative disorders most often form in children exposed to long-term physical, sexual or emotional abuse. Natural disasters and combat can also cause dissociative disorders."}, {"url": "https://www.nami.org/Learn-More/Mental-Health-Conditions/Dissociative-Disorders", "passage_text": "Symptoms. Symptoms and signs of dissociative disorders include: 1  Significant memory loss of specific times, people and events. 2  Out-of-body experiences, such as feeling as though you are watching a movie of yourself. 3  Mental health problems such as depression, anxiety and thoughts of suicide. Causes. Dissociative disorders usually develop as a way of dealing with trauma. Dissociative disorders most often form in children exposed to long-term physical, sexual or emotional abuse. Natural disasters and combat can also cause dissociative disorders."}, {"url": "http://www.webmd.com/mental-health/dissociative-identity-disorder-multiple-personality-disorder", "passage_text": "Dissociative identity disorder is characterized by the presence of two or more distinct or split identities or personality states that continually have power over the person's behavior.owever, dissociative identity disorder is a severe form of dissociation, a mental process which produces a lack of connection in a person's thoughts, memories, feelings, actions, or sense of identity."}, {"url": "https://en.wikipedia.org/wiki/Dissociative_disorder", "passage_text": "1 Dissociative identity disorder (formerly multiple personality disorder): the alternation of two or more distinct personality states with impaired recall among personality states. Dissociative identity disorder (multiple personality disorder). Cause: People with dissociative identity disorder usually have close relatives who have also had similar experiences. Treatment: Long-term psychotherapy that helps the patient merge his/her multiple personalities into one personality."}, {"url": "http://www.mayoclinic.org/diseases-conditions/dissociative-disorders/basics/causes/con-20031012", "passage_text": "Causes. Dissociative disorders usually develop as a way to cope with trauma. The disorders most often form in children subjected to long-term physical, sexual or emotional abuse or, less often, a home environment that's frightening or highly unpredictable. The stress of war or natural disasters also can bring on dissociative disorders. Personal identity is still forming during childhood."}, {"url": "http://www.aamft.org/iMIS15/AAMFT/Content/Consumer_Updates/Dissociative_Identity_Disorder.aspx", "passage_text": "Formerly known as Multiple Personality Disorder, Dissociative Identity Disorder (DID) is a condition in which a person has two or more distinct identity or personality states, which may alternate within the individual's conscious awareness. "}]