[{"url": "http://saltwatercrocodiles.homestead.com/crocodiledeathroll.html", "passage_text": "At some crocodile farms handlers will show tourists the death roll. By throwing a soft object tied to a rope they are able to make the crocodile go into a death roll by pulling on the rope making the crocodile think the object is trying to get away. The crocodile will then go into a death roll as it's instinct tells it that it has to drown what it has in it's mouth. One handler I witnessed does this every day as a means of giving the crocodile a daily work out and to show tourists the power of the crocodile."}, {"url": "http://www.youtube.com/watch?v=6ZhHHVsAnI4", "passage_text": "A crocodile bites down on a man's arm and performs a Death Roll during a routine stunt in this clip from Animal Planet's Untamed & Uncut. | For more Untamed and Uncut, visit http://animal.discovery.com/tv-shows/..."}, {"url": "http://saltwatercrocodiles.homestead.com/crocodiledeathroll.html", "passage_text": "The death roll is also how a crocodile will separate limbs from the torso of large prey twisting and turning until it can rip off the limb or chunks of it's victim into section the crocodile can swallow."}, {"url": "http://saltwatercrocodiles.homestead.com/crocodiledeathroll.html", "passage_text": "The death roll performs a number of functions for the Saltwater Crocodile. When it grabs very large prey the crocodile has to drag it into the water and drown it so the crocodile will use it's advantage in the water and it's own body weight to roll over and over again to drown it's prey."}, {"url": "http://www.answers.com/Q/What_does_a_crocodile_death_roll_mean", "passage_text": "Making the world better, one answer at a time. it is when; the crocodile has grabed its prey using is jaw. It then basically does a sidewards roll several times still grabbing hold of its victim. It tends to do this more so in water than on land, or it is used to drag the victim in to the water. The prey has no chance of survival."}]