[{"url": "http://www.nature.com/scitable/definition/general-transcription-factor-transcription-factor-167", "passage_text": "transcription factor / transcription factors. Transcription factors are proteins involved in the process of converting, or transcribing, DNA into RNA. Transcription factors include a wide number of proteins, excluding RNA polymerase, that initiate and regulate the transcription of genes. Some transcription factors bind to a DNA promoter sequence near the transcription start site and help form the transcription initiation complex. Other transcription factors bind to regulatory sequences, such as enhancer sequences, and can either stimulate or repress transcription of the related gene."}, {"url": "https://answers.yahoo.com/question/index?qid=20100513181035AAnkSqf", "passage_text": "Answers. Best Answer: Transcription factors are proteins that bind to DNA and determine whether the DNA sequence is transcribed into mRNA (and then later into proteins). They are important because they regulate what proteins the cell is manufacturing. Sorry, something has gone wrong. Best Answer: Transcription factors are proteins that bind to DNA and determine whether the DNA sequence is transcribed into mRNA (and then later into proteins)."}, {"url": "https://en.wikipedia.org/wiki/Transcription_factor", "passage_text": "Often, for gene transcription to occur, a number of transcription factors must bind to DNA regulatory sequences. This collection of transcription factors, in turn, recruit intermediary proteins such as cofactors that allow efficient recruitment of the preinitiation complex and RNA polymerase. Transcription factors bind to either enhancer or promoter regions of DNA adjacent to the genes that they regulate. Depending on the transcription factor, the transcription of the adjacent gene is either up-or down-regulated."}, {"url": "https://en.wikipedia.org/wiki/Transcription_factor", "passage_text": "Transcription factors perform this function alone or with other proteins in a complex, by promoting (as an activator), or blocking (as a repressor) the recruitment of RNA polymerase (the enzyme that performs the transcription of genetic information from DNA to RNA) to specific genes. Transcription factors bind to either enhancer or promoter regions of DNA adjacent to the genes that they regulate. Depending on the transcription factor, the transcription of the adjacent gene is either up-or down-regulated."}, {"url": "https://en.wikipedia.org/wiki/Transcription_factor", "passage_text": "Transcription factors are one of the groups of proteins that read and interpret the genetic blueprint in the DNA. They bind to the DNA and help initiate a program of increased or decreased gene transcription. As such, they are vital for many important cellular processes. Transcription factors bind to either enhancer or promoter regions of DNA adjacent to the genes that they regulate. Depending on the transcription factor, the transcription of the adjacent gene is either up-or down-regulated."}, {"url": "https://www.broadinstitute.org/education/glossary/transcription-factor", "passage_text": "Transcription Factor. A transcription factor (blue) binds to DNA (red) and alters which genes are turned on, or expressed. Image courtesy of David S. Goodsell, RCSB Protein Data Bank. Transcription factors are proteins that control which genes are turned on or off in the genome. They do so by binding to DNA and other proteins. Once bound to DNA, these proteins can promote or block the enzyme that controls the reading, or “transcription,” of genes, making genes more or less active"}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc731/transcript/transcript1.htm", "passage_text": "Although transcription is performed by RNA Polymerase, the enzyme needs other proteins to produce the transcript. These factors are either associated directly with RNA Polymerase or add in building the actual transcription apparatus. The general term for these associated proteins is transcription factor. "}]