[{"url": "https://www.mnemonic-device.com/biology/taxonomy/domain-kingdom-phylum-class-order-family-genus-species/", "passage_text": "Explanation: Mnemonic devices to remember KPCOFGS taxonomy (the proper ordering of the biological groupings/categories): DOMAIN, Kingdom, Phylum, Class, Order, Family, Genus, Species. Taxonomy for humans would be: Animalia, Chordata, Mammalia, Primate, Hominidae, Homo sapiens. "}, {"url": "https://en.wikipedia.org/wiki/Phylum", "passage_text": "In biology, a phylum (/ˈfaɪləm/ ; plural: phyla) is a taxonomic rank below kingdom and above class. Traditionally, in botany the term division was used instead of phylum, although from 1993 the International Code of Nomenclature for algae, fungi, and plants accepted the designation phylum. Furthermore, organisms in the stem group of a phylum can possess the body plan of the phylum without all the characteristics necessary to fall within it."}, {"url": "http://www.answers.com/Q/What_is_the_kingdom_phylum_class_order_family_genus_and_species_of_humans", "passage_text": "* Classification of the Chicken  *  * Kingdom Animalia  *  * Phylum Chordata  *  * Subphylum Vertebrata  *  * Class Aves (Birds)  *  * Order Gall … iformes  *  * Family Phasianidae  *  * Genus Gallus  *  * Species-G. domesticus. 22 people found this useful. Species: sapiens. our scientific names is just Homo sapiens. Depending on the level of study you're doing, you may require different answers. If you're just looking for the name of the human species, it's Homo sapiens, but if you're looking for a full classification, for say, GCSE level, it's:"}, {"url": "http://www.urbandictionary.com/define.php?term=K-P-C-O-F-G-S", "passage_text": "The acronym used to remember the breakdown of species classification, with the genus and species comprising the scientific name. (ex. Human= Homo (Genus) Sapien (Species)). King......Kingdom. "}, {"url": "https://en.wikipedia.org/wiki/Human_taxonomy", "passage_text": "Human taxonomy is the classification of the species Homo sapiens (Latin : knowing man), or the modern hominin, humans. Homo, the human genus, includes the past genetic tree of humanity, with Neanderthals, Denisovans, and other extinct species of hominin. H. sapiens is the only surviving species of the genus Homo. Extinct Homo species include archaic humans. Current humans have been designated as subspecies Homo sapiens sapiens, differentiated from the direct ancestor, Homo sapiens idaltu"}, {"url": "http://www.acronymfinder.com/KPCOFGS.html", "passage_text": "Kings Play Chess on Fat Girls' Stomachs (mnemonic for taxonomy order: Kingdom, Phylum, Class, Order, Family, Genus, Species). KPCOFGS. Kings Play Chess on Fat Green Stools (mnemonic for taxonomy order: Kingdom, Phylum, Class, Order, Family, Genus, Species). King Phillip Came Over For Good Soup (mnemonic for taxonomy order: Kingdom, Phylum, Class, Order, Family, Genus, Species). KPCOFGS. Kings Play Chess On Fine Glass Surface"}, {"url": "http://www.answers.com/Q/What_is_the_kingdom_phylum_class_order_family_genus_and_species_of_humans", "passage_text": "kingdom: Animal   phylum: chordata   class:vertebrata   order: primates   family: hominidae   genus: homo   species: sapien as of 2007. The genus of hu … man beings is Homo and  species is Homo Sapiens. 2 people found this useful. Species: sapiens. our scientific names is just Homo sapiens. Depending on the level of study you're doing, you may require different answers. If you're just looking for the name of the human species, it's Homo sapiens, but if you're looking for a full classification, for say, GCSE level, it's:"}, {"url": "http://www.acronymfinder.com/KPCOFGS.html", "passage_text": "Kangaroos Play Cellos, Orangutans Fiddle, Gorillas Sing (mnemonic for taxonomy order: Kingdom, Phylum, Class, Order, Family, Genus, Species). KPCOFGS. King Phillip Came Over From Germany Stoned (mnemonic for taxonomy Order: Kingdom, Phylum, Class, Order, Family, Genus, Species). King Phillip Came Over For Good Soup (mnemonic for taxonomy order: Kingdom, Phylum, Class, Order, Family, Genus, Species). KPCOFGS. Kings Play Chess On Fine Glass Surfaces"}, {"url": "http://www.ducksters.com/science/scientific_classification.php", "passage_text": "Finally, you get to the species, which is sort of like getting to the book in the library. 7 Major Levels of Classification. There are seven major levels of classification: Kingdom, Phylum, Class, Order, Family, Genus, and Species. The two main kingdoms we think about are plants and animals. "}, {"url": "http://www.livescience.com/43559-black-mamba.html", "passage_text": "The black mamba is one of four species of mambas, according to the Integrated Taxonomic Information System (ITIS). Others are Jameson’s mamba, eastern green mamba and western green mamba. Mambas are in the same family, Elapidae, as coral snakes and cobras. "}]