[{"url": "http://www.answers.com/Q/What_is_the_main_function_of_the_immune_system", "passage_text": "Share to: The function of the immune system is to protect your body from infection by pathogens and foreign invaders, or what the body perceives as invading germs."}, {"url": "http://www.answers.com/Q/What_is_the_main_function_of_the_immune_system", "passage_text": "When look at the function of cilia in the immune system, you mainly refer to the cilia present in the respiratory system. Cilia, along with mucus, are part of the innate immun … ity your body has. Mucus in respiratory tubes traps most microbes and dust that get past the nasal filter (nasal hair)."}, {"url": "http://primaryimmune.org/about-primary-immunodeficiencies/relevant-info/the-immune-system/", "passage_text": "Organization and Development of the Immune System. The immune system is a wonderful collaboration between cells and proteins that work together to provide defense against infection. These cells and proteins do not form a single organ like the heart or liver. Instead, the immune system is dispersed throughout the body to provide rapid responses to infection (Figure 1)."}, {"url": "http://primaryimmune.org/about-primary-immunodeficiencies/relevant-info/the-immune-system/", "passage_text": "A. Bone marrow: The site in the body where most of the cells of the immune system are produced as immature or stem cells. B. Stem cells: These cells have the potential to differentiate and mature into the different cells of the immune system."}, {"url": "http://www.med-health.net/What-Is-The-Function-Of-The-Immune-System.html", "passage_text": "The immune system attacks these disease causing organisms through a sequence of steps referred to as the immune response. The immune system is composed of a number of cells, tissues and organs that work in association and attacks the disease causing microorganisms and protect the human body. The cells of the immune system are the leukocytes or the white blood cells."}, {"url": "http://www.niaid.nih.gov/topics/immuneSystem/Pages/overview.aspx", "passage_text": "The immune system can distinguish between normal, healthy cells and unhealthy cells by recognizing a variety of danger cues called danger-associated molecular patterns (DAMPs). Cells may be unhealthy because of infection or because of cellular damage caused by non-infectious agents like sunburn or cancer."}]