[{"url": "http://nytrafficticket.com/how-much-does-a-new-york-speeding-ticket-cost/", "passage_text": "The literal answer for a first conviction is that a New York speeding ticket costs between $45 and $600. For speeding 1 to 10 mph over the limit the range is $45 to $150. For speeding 11 mph to 30 mph, the range is $90 to $300. Finally, for speeding 31 mph or more, the range is $180 to $600. Because points from New York transfer to Ontario, we recommend that you fight this speeding ticket. This is an 8-point ticket in New York and transfers as 6 demerit points in Ontario. It also carries roughly a $300 fine plus a $450 Driver Assessment Fee."}, {"url": "http://www.safeny.ny.gov/spee-ndx.htm", "passage_text": "Save Money: A speed fine could cost you over a thousand dollars. Save Your License: Speed violation points range from 3 to 11. Your license will be suspended at 11 points. New York City is lowering the speed limit to 25 mph for a safer NYC. "}, {"url": "http://newyorkspeedingfines.com/", "passage_text": "You are being charged with going 35 MPH over the speed limit. That charge means 8 points to your license, a $600 fine and an $85 mandatory NYS surcharge. In addition you will be paying another penalty called the DMV Driver Responsibility Assessment which in your case at 8 points will be $150 per year for 3 years. The DRA is a separate fine charged to you when you reach 6 points against your license in New York. At 6 points you will be fined $100 each year for 3 years. Each point that you get over 6 points is an additional $25 a"}, {"url": "http://www.ign.com/wikis/need-for-speed-most-wanted/Speed_Points", "passage_text": "Speed Points represent your street credibility. You acquire Speed Points for breaking Security Gates, crashing through Billboards, winning Races, evading police in High Speed Chases, finding Cars at Jack Spots, triggering Speed Cameras, and meeting Milestones. Challenging members of the Most Wanted Top Ten requires a minimum number of Speed Points. Speed Points for online races are only awarded if you activate the EA Online Pass that is supplied with every new copy of the game, or if you purchase the Online Pass via XBL or PSN (the cost is $10, or equivalent). You also gain speed Points for participating in online events"}, {"url": "http://www.njpoints.com/speeding/", "passage_text": "Points for NJ Speeding Tickets. Here are a few examples of the points you will receive for speeding in New Jersey: 1  1 to 14 MPH over speed limit = 2 points. 2  15 to 29 MPH over speed limit = 4 points."}, {"url": "http://www.newyorksafetycouncil.com/articles/how-much-does-speeding-cost-you-in-new-york.aspx", "passage_text": "Speeding Ticket Costs. For a first conviction, the cost of a New York speeding ticket can range between $45 and $600. For example, if you're speeding less than 10 miles over the limit, your ticket will usually be between $45 and $150. If you are speeding between 11 and 30 miles over the limit, your ticket will be in the $90 to $300 range. So how much does a speeding ticket really cost you in New York? For a first conviction, the cost of a New York speeding ticket can range between $45 and $600."}, {"url": "http://newyorkspeedingfines.com/", "passage_text": "Hi Megan, You are being charged with a 4 point speeding ticket, which is a $300 fine and an $85 surcharge. If you get 6 points on your license you will be required to pay the DMV fine known as the Driver Responsibility Assessment at $100 a year for 3 years. The DRA is a separate fine charged to you when you reach 6 points against your license in New York. At 6 points you will be fined $100 each year for 3 years. Each point that you get over 6 points is an additional $25"}]