[{"url": "http://www.sauditodayonline.com/useful-articles/desert-diamonds/", "passage_text": "Desert Diamonds actually consist of an extremely high grade Quartz, which when correctly cut and treated have the appearance and lustre of far more costly real diamonds. When ‘rough’ they look similar to the pebbles that you would find in a river, except that when held up to the light they are translucent. Something the whole family can enjoy in the fresh air and get a long lasting memento or two, free of charge at the same time. Why not go on a desert diamond hunt. Don’t forget to take a picnic and plenty of water."}, {"url": "https://www.facebook.com/desertdiamondswhatwomenwant", "passage_text": "We are thrilled to introduce Tutti Frutti our Summer Collection by Desert Diamonds-Flirtatious, Feminine, Vivacious and Delicious! Brighten your summer with a splash of summer colors, inspired by the tantalizing flavors of summer fruits! Desert Diamonds-What Women Want added 2 new photos. Let's meet our Beautiful Holiday Gifts  Simply Gems Collection. As these are the last time left of this stunning. Collection we are offering these pieces at Special Clearance Pricing."}, {"url": "http://www.sauditodayonline.com/useful-articles/desert-diamonds/", "passage_text": "The best time to search for Desert Diamonds is when the sun is at its strongest, and many experienced gathers believe that the hours leading up to midday or the late afternoon are the most productive as this is when you should see the best refraction of light from the raw stones. Something the whole family can enjoy in the fresh air and get a long lasting memento or two, free of charge at the same time. Why not go on a desert diamond hunt. Don’t forget to take a picnic and plenty of water."}, {"url": "http://ddcaz.com/tucson/", "passage_text": "Rock & Roll Hall of Fame band Heart is coming to the Diamond Center. Ann and Nancy Wilson first showed the world that women can rock when their band, Heart, stormed the charts in the ‘70’s with hits like “Crazy on You,” “Magic Man,” “Barracuda,” “Straight On,” and so many more. "}, {"url": "http://www.desertdiamondimports.com/", "passage_text": "Our commitment to fine craftsmanship can be seen in every detail in each piece. The modern bezel setting really showcases the luster, fire and brilliance of our Desert Diamonds. Our custom design service allows you to create your own one-of-a-kind ring or pendant that is made exclusively for you. Our jeweler has access to all precious gems. Pair them with our Desert Diamonds and the end result is a customized piece that reflects your taste and style. Desert Diamond Imports, an Accessible Luxury. "}, {"url": "http://ddcaz.com/", "passage_text": "Rock & Roll Hall of Fame band Heart is coming to the Diamond Center. Ann and Nancy Wilson first showed the world that women can rock when their band, Heart, stormed the charts in the ‘70’s with hits like “Crazy on You,” “Magic Man,” “Barracuda,” “Straight On,” and so many more."}, {"url": "http://www.desertdiamondindustries.com/", "passage_text": "Desert Diamond Industries. Desert Diamond Industries is the largest supplier of Diamond Saw Blades for government agencies in the United States and Canada. Desert Diamond Industries offers the only Life Time Operator Error Warranty™ in the diamond blade industry. It protects you against operator damage for the life of your diamond blade, grinder or core bit. We know that accidents happen."}, {"url": "http://www.eteamz.com/desertdiamonds/", "passage_text": "Desert Diamonds Bling Bling!!! We need more pictures for the website, please email any you have taken to promises77@aol.com. The Desert Diamonds Softball Travel Program is designed to offer girls the opportunity to experience softball on a more competitive level against teams throughout Arizona and Southern California."}, {"url": "http://www.desertdiamondindustries.com/", "passage_text": "Desert Diamond Industries is the one and only home of The Safety Blade ™ - the safest, most versatile and fastest cutting diamond blade that you can buy! The Safety Blade™ will not shatter or explode like abrasive blades, nor will it emit hazardous silicon carbide fibers during cutting. Desert Diamond Industries offers the only Life Time Operator Error Warranty™ in the diamond blade industry. It protects you against operator damage for the life of your diamond blade, grinder or core bit. We know that accidents happen."}, {"url": "http://www.desertdiamondsco.com/", "passage_text": "The collection is a splash of colors inspired by summer fruits. Colored Simulant and natural stones are representing the colors of summer. The collection is set in 925 Sterling Silver/ Rhodium Plated, Yellow or Rose gold plating and each piece has been embedded with our exclusive and unique signature DD Simulant. Tutti Fruitti Summer Collection."}]