[{"url": "http://www.nature.com/scitable/topicpage/eukaryotic-cells-14023963", "passage_text": "© 2010 Nature Education All rights reserved. In addition to the nucleus, eukaryotic cells may contain several other types of organelles, which may include mitochondria, chloroplasts, the endoplasmic reticulum, the Golgi apparatus, and lysosomes. Each of these organelles performs a specific function critical to the cell's survival. "}, {"url": "http://www.answers.com/Q/In_which_types_of_cells_are_mitochondria_found_in", "passage_text": "Well this is a pretty simply question for a very complex topic. Mitochondria can vary within a cell type depending on environmental and life history variables. Some cell types … have high mitochondria density, but are quite small (sperm) and some have lower mitochondrial density but are much larger (muscle cells). Other cells, like intestinal wall lining for example, also contain a lot of mitochondria. "}, {"url": "https://en.wikipedia.org/wiki/Mitochondrial_fusion", "passage_text": "Mitochondrial fusion is a process mediated by several large GTPases whose combined effects lead to the dynamic mitochondrial networks seen in many cell types. Mitochondria are dynamic organelles with the ability to fuse (fusion) and divide (fission), forming constantly changing tubular networks in most eukaryotic cells. "}, {"url": "http://www.nature.com/scitable/topicpage/mitochondria-14053590", "passage_text": "Therefore, power-hungry cells have more mitochondria than cells with lower energy needs. For example, repeatedly stimulating a muscle cell will spur the production of more mitochondria in that cell, to keep up with energy demand. Mitochondria cannot be made from scratch because they need both mitochondrial and nuclear gene products. These organelles replicate by dividing in two, using a process similar to the simple, asexual form of cell division employed by bacteria. Video microscopy shows that mitochondria are incredibly dynamic."}, {"url": "http://ghr.nlm.nih.gov/chromosome/MT", "passage_text": "Mitochondria are structures within cells that convert the energy from food into a form that cells can use. Although most DNA is packaged in chromosomes within the nucleus, mitochondria also have a small amount of their own DNA. This genetic material is known as mitochondrial DNA or mtDNA. "}, {"url": "http://www.umdf.org/site/c.8qKOJ0MvF7LUG/b.7934627/k.3711/What_is_Mitochondrial_Disease.htm", "passage_text": "Mitochondrial diseases result from failures of the mitochondria, specialized compartments present in every cell of the body except red blood cells. Mitochondria are responsible for creating more than 90% of the energy needed by the body to sustain life and support growth. "}, {"url": "https://en.wikipedia.org/wiki/Mitochondrion", "passage_text": "The mitochondrion (plural mitochondria) is a double membrane-bound organelle found in most eukaryotic cells. The word mitochondrion comes from the Greek μίτος, mitos, i.e. thread, and χονδρίον, chondrion, i.e. granule or grain-like. Mitochondria range from 0.5 to 1.0 μm in diameter. In humans, 615 distinct types of protein have been identified from cardiac mitochondria, whereas in rats, 940 proteins have been reported. The mitochondrial proteome is thought to be dynamically regulated. Although most of a cell's DNA is contained in the cell nucleus, the mitochondrion has its own independent genome."}, {"url": "https://en.wikipedia.org/wiki/Mitochondrion", "passage_text": "Several characteristics make mitochondria unique. The number of mitochondria in a cell can vary widely by organism, tissue, and cell type. For instance, red blood cells have no mitochondria, whereas liver cells can have more than 2000. The organelle is composed of compartments that carry out specialized functions. In humans, 615 distinct types of protein have been identified from cardiac mitochondria, whereas in rats, 940 proteins have been reported. The mitochondrial proteome is thought to be dynamically regulated. Although most of a cell's DNA is contained in the cell nucleus, the mitochondrion has its own independent genome."}, {"url": "http://www.nature.com/scitable/topicpage/mitochondria-14053590", "passage_text": "Mitochondria are unusual organelles. They act as the power plants of the cell, are surrounded by two membranes, and have their own genome. They also divide independently of the cell in which they reside, meaning mitochondrial replication is not coupled to cell division. Mitochondria cannot be made from scratch because they need both mitochondrial and nuclear gene products. These organelles replicate by dividing in two, using a process similar to the simple, asexual form of cell division employed by bacteria. Video microscopy shows that mitochondria are incredibly dynamic."}, {"url": "http://micro.magnet.fsu.edu/cells/mitochondria/mitochondria.html", "passage_text": "Mitochondria Mitochondria are rod-shaped organelles that can be considered the power generators of the cell, converting oxygen and nutrients into adenosine triphosphate (ATP). ATP is the chemical energy currency of the cell that powers the cell's metabolic activities."}]