[{"url": "http://orvillejenkins.com/peoples/scotsenglishirish.html", "passage_text": "Highland Scots, with their distinctive Scottish culture, are Celtic. The Scots were Irish who settled islands between Ireland and Great Britain and the northwestern coast of the main island of Great Britain, finally conquering the whole northern part of Britain. The Scots began raids on what is now western Scotland in the late 400s of the Christian Era (CE). Similarities and Differences. These are just some of the fascinating details indicating the lines of similarity along with the great differences and long-standing animosities between the English, Scots and Irish peoples."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_Scottish_and_Irish", "passage_text": "1 Religion is a major difference: most Scots are Presbyterians; most Irish are Catholics. 2  The Catholic minority in Scotland is largely Irish in origin. 3  The Presbyterians of Northern Ireland are mostly Scottish in origin. 1 The Catholic minority in Scotland is largely Irish in origin. 2  The Presbyterians of Northern Ireland are mostly Scottish in origin. 3  The reason there are so many Presbyterians in Scotland is because of the 1707 act of Union,The Cromwell Invasion, and forced conversion of Scottish Catholics by the covenanters."}, {"url": "https://en.wikipedia.org/wiki/Genetic_history_of_the_British_Isles", "passage_text": "The genetic history of the British Isles is the subject of research within the larger field of human population genetics. It has developed in parallel with DNA testing technologies capable of identifying genetic similarities and differences between populations. "}, {"url": "http://www.differencebetween.net/miscellaneous/difference-between-scottish-and-irish/", "passage_text": "So what are some of the basic differences between the Irish and the Scottish that you ought to learn? You’re certainly already aware of their geography, and no doubt you know something of their histories, and their people. There is still one more thing you need to learn about the Scottish and Irish. Now, about 60,000 people in Ireland can speak fluent Gaelic. SUMMARY: 1.A â Both Scottish gaelic And Irish gaelic came the same: Root. celts.2 Scottish gaelic is spoken widely on the northern part Of, scotland Whereas Irish gaelic is spoken widely on the western part of The irish. region"}, {"url": "https://answers.yahoo.com/question/index?qid=20071009200900AATIQRQ", "passage_text": "Best Answer: So far Jock has given the best answer, but I would still elaborate. The simple answer to what is the difference between Scottish and Irish is that one refers to people and things from Scotland while the other refers to people and things from Ireland. She did not address your question as to the difference between Scottish and Irish. However, she did make a good point: if you want to know where your ancestors came from you need to trace them back."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_Scottish_and_Irish", "passage_text": "1 Scottish people come from Scotland, and Irish people come from Ireland. 2  Religion is a major difference: most Scots are Presbyterians; most Irish are Catholics. 3  The Catholic minority in Scotland is largely Irish in origin. 4  The Presbyterians of Northern Ireland are mostly Scottish in origin. 1 The Catholic minority in Scotland is largely Irish in origin. 2  The Presbyterians of Northern Ireland are mostly Scottish in origin. 3  The reason there are so many Presbyterians in Scotland is because of the 1707 act of Union,The Cromwell Invasion, and forced conversion of Scottish Catholics by the covenanters."}, {"url": "http://orvillejenkins.com/peoples/scotsenglishirish.html", "passage_text": "Anglian (Anglish). The Lowland Scots language is the direct descendant of the Anglian (or Anglish) language spoken there, with a distinct history and identity to the modern times, accounting for the difference between the Scots language and the English language. Similarities and Differences. These are just some of the fascinating details indicating the lines of similarity along with the great differences and long-standing animosities between the English, Scots and Irish peoples."}, {"url": "http://www.differencebetween.net/miscellaneous/difference-between-scottish-and-irish/", "passage_text": "Scottish vs. Irish. There are a range of differences between the Scottish and the Irish. There are differences in the people themselves, their literature, their heritage, their food and their culture, to name just a few things. Now, about 60,000 people in Ireland can speak fluent Gaelic. SUMMARY: 1.A â Both Scottish gaelic And Irish gaelic came the same: Root. celts.2 Scottish gaelic is spoken widely on the northern part Of, scotland Whereas Irish gaelic is spoken widely on the western part of The irish. region"}, {"url": "http://www.khazaria.com/genetics/irish.html", "passage_text": "The Celtic Irish people of the emerald isle of Ireland are closely related to the Scottish people of nearby Scotland, and Irish and the partly Frisian-Anglo-Saxon English people from England are also significantly related. They also have more specialized projects like R-L21 South Irish and Munster Irish. Order a DNA kit from FTDNA's headquarters in the USA 23andMe: Genetic Testing Service You can test your autosomal DNA here and look for Irish and non-Irish matches in their extensive database."}]