[{"url": "http://www.tastefulgarden.com/store/pc/Worm-Castings-d114.htm", "passage_text": "The castings are rich in water-soluble plant nutrients, and contain more than 50% more humus than what is normally found in topsoil. Worm Castings are packed with minerals that are essential for plant growth, such as concentrated nitrates, phosphorus, magnesium, potassium and calcium. It also contains manganese, copper, zinc, cobalt, borax, iron, carbon and nitrogen. Because Worm Castings will never burn plants, you can use as much of it as you like. Benefits of Worm Castings. 1  The humus in the worm castings extracts toxins and harmful fungi and bacteria from the soil. 2  Worm Castings therefore have the ability to fight off plant diseases."}, {"url": "http://www.organicrosecare.org/articles/worm_castings.php", "passage_text": "Several universities have researched the benefits of worm castings, but specific knowledge by the general public and even trained agriculture scientists is still very limited. A goal for this series of articles is to provide education about worm castings and show that that they can provide benefits for all plants. Worm castings are not actually compost. The vermiculture process is a cool temperature digestion that allows a wide array of beneficial biology to survive in the finished product. "}, {"url": "http://www.swedelakebusinesses.com/empoweredearthwormcastings/faq/", "passage_text": "Castings are a great additive to compost. As well as including all the nutrients and microbes only worm castings can provide, they also can neutralize the smell of the compost within days. Add about 10-20% worm castings to your compost. Castings help the plants and the overall health of the soil. They contain readily available and slow-releasing micro and macro nutrients that your plants need. They also help to aerate the soil and hold water due to their unique shape, which helps root growth immensely."}, {"url": "http://www.wormsetc.com/worms-etc-blog/2010/04/worm-castings/", "passage_text": "Even though worm castings are a very concentrated fertilizer and soil amendment, they will never burn your plants like synthetic based fertilizers will. Also worm castings provide all the micro-nutrients necessary for plant growth that cheaper fertilizers may not. "}, {"url": "http://highyieldorganics.net/products/worm-castings", "passage_text": "Worm castings are a disease free, odorless means to condition your soil and an organic and all natural way to provide your plants with the nutrients they need, when they need them. Worm castings work extremely well in promoting healthy, strong, thriving plants. "}, {"url": "http://www.swedelakevermiculture.com/FAQ.html", "passage_text": "Castings are a great additive to compost. As well as including all the nutrients and microbes only worm castings can provide, they also neutralize the smell of the compost within days. Add about 10-20% worm castings to your compost. 18. Castings have a favorable shape for holding water and aerating soil and will not be washed away by rain, in contrast to compost. Castings are coated with a special oil from the worms that ensures a slow release of nutrients; compost does not have a similar mechanism."}, {"url": "https://www.vermiculture.com/earthworm-castings", "passage_text": "As well as an abundance of available nutrients, Wiggle Worm Soil Builder™ Pure Earthworm Castings also provide a perfect mix of nutrients that are not readily available, but present for long term nutritional needs. This allows plants to feed as needed for weeks and months at a time, depending on the plant. "}, {"url": "http://www.wormladies.com/pages/aboutourworms.html", "passage_text": "Our castings are perfect for use on vegetables or flowers. Incorporate 1 part of castings to 10 parts of soil for vegetable and a little less for flowers. As little as a tablespoon of pure worm castings provide enough organic plant nutrients to feed an 8-10 inch plant for more than two months. Make a “tea” of worm castings to use when watering household plants, flowers, and vegetables."}, {"url": "http://www.fertilizeronline.com/wormcast.php", "passage_text": "The castings slowly release nutrients needed for healthy plant growth and increased production rates for fruits and vegetables. Agrowinn's Organic Worm Castings are especially good for herbs, fruits, and vegetables. This allows plants to feed as needed for weeks and months at a time, as the worm castings release their precious nutrients into the surrounding soil. Chemical fertilizers usually provide only synthetic nutrients, much of which are quickly lost into the soil during watering."}, {"url": "http://www.tastefulgarden.com/store/pc/Worm-Castings-d114.htm", "passage_text": "Therefore, castings are supplied with available nutrients. The nutrients are also water-soluble and immediately available to the plant. You will find that most potting soils have a nutrient life for 2 to 5 days, where worm castings will last up to 6 times as long. Because Worm Castings will never burn plants, you can use as much of it as you like. Benefits of Worm Castings. 1  The humus in the worm castings extracts toxins and harmful fungi and bacteria from the soil. 2  Worm Castings therefore have the ability to fight off plant diseases."}]