[{"url": "http://www.food.com/recipe/roasted-turkey-legs-165587", "passage_text": "Directions. 1  Preheat oven to 350 degrees F. rinse the turkey legs and pat dry. 2  Stand the turkey legs upright (as if turkey were standing). 3  Roast uncovered for 1 1/2 to 2 hours, until legs are golden brown and the internal temperature is 180 degrees F when taken with a meat thermometer."}, {"url": "http://allrecipes.com/recipe/84456/roasted-turkey-legs/", "passage_text": "1 Preheat the oven to 350 degrees F (175 degrees C). 2  Rinse the turkey legs and pat dry. 3  Stand the turkey legs upright (as if the turkey were standing). 4  Press a knife downward into the deep tissue, creating 2 or 3 long pockets. 5  Press a piece of celery into each opening."}, {"url": "http://www.divinedinnerparty.com/cooking-turkey-drumsticks.html", "passage_text": "Add turkey legs (only a couple at a time-- don't crowd them in the pan) and brown lightly on all sides. Transfer turkey legs to a large casserole dish or baking pan (4-6 quart capacity). Add onions and garlic to the hot oil already in the skillet."}, {"url": "http://www.justapinch.com/recipes/main-course/turkey/baked-turkey-legs.html", "passage_text": "Directions Step-By-Step. Preheat oven to 250 Wash turkey legs under cold running water place in baking dish and season according to taste. Add remaining ingredients and seal tightly with aluminun foil. Place in a preheated oven and allow to cook over 4 hours."}, {"url": "http://thepioneerwoman.com/cooking/caveman-pops-aka-roasted-turkey-legs/", "passage_text": "Cover the container and brine in the refrigerator for 4 to 6 hours, more if you have time. Preheat oven to 400 degrees. Mix the dry rub ingredients. Remove the turkey legs from the brine and rinse them under cold water."}, {"url": "http://www.justapinch.com/recipes/main-course/turkey/baked-turkey-legs.html", "passage_text": "Preheat oven to 250 Wash turkey legs under cold running water place in baking dish and season according to taste. Add remaining ingredients and seal tightly with aluminun foil. Place in a preheated oven and allow to cook over 4 hours."}, {"url": "http://www.divinedinnerparty.com/cooking-turkey-drumsticks.html", "passage_text": "Heat olive oil in a large skillet over medium heat. Add turkey legs (only a couple at a time-- don't crowd them in the pan) and brown lightly on all sides. Transfer turkey legs to a large casserole dish or baking pan (4-6 quart capacity). Add onions and garlic to the hot oil already in the skillet. Cook until softened."}]