[{"url": "https://en.wikipedia.org/wiki/Behaviour_therapy", "passage_text": "Behavior therapy is a broad term referring to psychotherapy, behavior analytical, or a combination of the two therapies. In its broadest sense, the methods focus on either just behaviors or in combination with thoughts and feelings that might be causing them. In a broad sense, this could be called behavior therapy whenever the behavior itself was conceived as the therapeutic agent. Ancient writings contain innumerable behavioral prescriptions that accord with this broad conception of behavior therapy."}, {"url": "http://www.healthline.com/health/behavioral-therapy", "passage_text": "Behavioral therapy is a treatment that helps change potentially self-destructing behaviors. It is also called behavioral modification or cognitive behavioral therapy. Medical professionals use this type of therapy to replace bad habits with good ones. The therapy also helps you cope with difficult situations. It is most often used to treat anxiety disorders."}, {"url": "http://www.thefreedictionary.com/behavior+therapy", "passage_text": "Noun. 1. behavior therapy-psychotherapy that seeks to extinguish or inhibit abnormal or maladaptive behavior by reinforcing desired behavior and extinguishing undesired behavior. behavior modification. psychotherapy-the treatment of mental or emotional problems by psychological means. reciprocal inhibition, reciprocal-inhibition therapy-a method of behavior therapy based on the inhibition of one response by the occurrence of another response that is mutually incompatible with it; a relaxation response might be conditioned to a stimulus that previously evoked anxiety."}, {"url": "http://www.simplypsychology.org/cognitive-therapy.html", "passage_text": "Cognitive behavioral therapy (CBT) can be used to treat people with a wide range of mental health problems. is based on the idea that how we think (cognition), how we feel (emotion) and how we act (behavior) all interact together. Specifically, our thoughts determine our feelings and our behavior. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Cognitive-behavioral+therapy", "passage_text": "Rational-emotive behavior therapy (REBT) is a popular variation of cognitive-behavioral therapy developed in 1955 by psychologist Albert Ellis. REBT is based on the belief that a person's past experiences shape their belief system and thinking patterns. cognitive therapy (cognitive-behavioral therapy) a directive form of psychotherapy based on the theory that emotional problems result from distorted attitudes and ways of thinking that can be corrected."}, {"url": "http://www.merriam-webster.com/dictionary/cognitive%20therapy", "passage_text": "Medical Definition of COGNITIVE THERAPY. : psychotherapy especially for depression that emphasizes the substitution of desirable patterns of thinking for maladaptive or faulty ones—compare behavior modification. — cognitive therapist noun. "}, {"url": "http://behavioraltech.org/resources/whatisdbt.cfm", "passage_text": "Dialectical Behavior Therapy (DBT) is a cognitive behavioral treatment that was originally developed to treat chronically suicidal individuals diagnosed with borderline personality disorder (BPD) and it is now recognized as the gold standard psychological treatment for this population. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Cognitive-behavioral+therapy", "passage_text": "Cognitive-behavioral therapy is an action-oriented form of psychosocial therapy that assumes that maladaptive, or faulty, thinking patterns cause maladaptive behavior and negative emotions. cognitive therapy (cognitive-behavioral therapy) a directive form of psychotherapy based on the theory that emotional problems result from distorted attitudes and ways of thinking that can be corrected."}, {"url": "https://en.wikipedia.org/wiki/Cognitive_behavioral_therapy", "passage_text": "Cognitive behavioral therapy (CBT) is a form of psychotherapy. It was originally designed to treat depression, but is now used for a number of mental disorders. It works to solve current problems and change unhelpful thinking and behavior. The name refers to behavior therapy, cognitive therapy, and therapy based upon a combination of basic behavioral and cognitive principles. Cognitive emotional behavioral therapy (CEBT) is a form of (CBT) developed initially for individuals with eating disorders but now used with a range of problems including anxiety, depression, obsessive compulsive disorder (OCD), post traumatic stress disorder (PTSD) and anger problems."}]