[{"url": "http://www.wisegeek.org/what-is-socialism.htm", "passage_text": "Socialism is an economic concept that advocates public ownership of all resources. The production and distribution of resources with a society are then controlled by members of that society collectively or by the government that represents that society."}, {"url": "https://en.wikipedia.org/wiki/History_of_socialism", "passage_text": "Socialism aims to liberate the peoples from dependence on a minority which owns or controls the means of production. It aims to put economic power in the hands of the people as a whole, and to create a community in which free men work together as equals... Socialism has become a major force in world affairs."}, {"url": "http://www.libertynewsonline.com/article_301_30989.php", "passage_text": "Socialism is defined to be a modern system of economics where property and the means of production are controlled by the state; where it is said that socialism stands in contrast with capitalism and free market economics."}, {"url": "http://www.philosophybasics.com/branch_socialism.html", "passage_text": "History of Socialism Back to Top Certain elements of socialist thought long predate the socialist ideology that emerged in the first half of the 19th Century. For example, Plato's The Republic and Sir Thomas More's Utopia, dating from 1516, have been cited as including Socialist or Communist ideas."}, {"url": "https://answers.yahoo.com/question/index?qid=20081028101047AATnstZ", "passage_text": "Best Answer: Seeing how there are several different branches of socialism, this is a silly question, but Auguste Blanqui would be an appropriate answer. Blanqui helped lead the Revolution of 1830 in France, as well as influenced the Revolution of 1848 and the Paris Commune of 1871, the first successful Socialist state."}, {"url": "https://answers.yahoo.com/question/index?qid=20110321202759AAog5AG", "passage_text": "Karl Marx and Friedrich Engels. This might tell you a bit about it: http://en.wikipedia.org/wiki/Communism Socialism is usually credited to Robert Owen. Pierre Leroux and Marie Roch Louis Reybaud are credited as well, however, Robert Owen has been given the title father of the cooperative movement, by some."}, {"url": "http://www.wisegeek.org/what-is-socialism.htm", "passage_text": "Socialism, or as we call it in Europe social-democracy is different in terms from the socialism of Latin America. In Spain, the socialism of Latin America we call communism that even exists but it's a minority."}, {"url": "http://www.emersonkent.com/history_dictionary/communism.htm", "passage_text": "The Origin of the Term Communism The following is a quote from the 2002 book Communism in History and Theory-From Utopian Socialism to the Fall of the Soviet Union by Donald F. Busky."}]