[{"url": "http://www.doityourself.com/stry/calculating-how-deep-to-bury-outdoor-electrical-wire", "passage_text": "You may plan to install electrical wire outdoors for operation of pumps, lighting, and other apparatuses. Whatever the purpose, you can run your wiring overhead or in a below-ground trench. If you choose a trench, you will need to know what types of wiring and conduits you can use and how deep to bury them. For example, if you have a run of cable that is partly buried and partly above the ground, and you prefer not to splice your burial cable to a length of above-ground cable, you can use UF cable for the full cable run."}, {"url": "http://www.familyhandyman.com/electrical/wiring/how-to-bury-underground-cable/view-all", "passage_text": "Dig 24 inches. At 24 inches you can bury underground feeder cable, using PVC conduit to 18 in. below ground only where the wire comes up. If you're considering running a power lineunderground through your yard, you have four options. Your choice depends on how much power you want. Decide how much digging you're prepared to do, which determines the type of wire you need to use. At 6 in. deep, use galvanized metal rigid electrical conduit (1/2-in.-diameter is large enough for the water feature) and run individual conductors inside."}, {"url": "http://heightslibrary.org/materials/hrrc/15-Electrical_Repairs/WIRING/BURYING_ELEC_WIRING.pdf", "passage_text": "While most of the retail building supply companies sell Schedule 40 PVC, they usually do not carry Schedule 80. You will need to locate an electrical supply house to purchase Schedule 80. Code also requires that no low-voltage wires be placed in conduit with 120/240-volt circuits. On the other hand, if you use conduit, the trench needs to be only 18 inches below the surface. Another advantage is that the conduit can carry several wires – wires to control garage lights from switches inside the house, as well as the power supply wires. Not all types of conduit can be buried in the soil."}, {"url": "http://electricalwire.biz/MC_Cable/Underground_Cable_UFB_Electrical_Cable.html", "passage_text": "THHN wire is another type of wire used quite a bit in the industry. THHN / THWN wire is used in all Romex cables and UFB cables with different protective jackets that allow it to be used in different applications. THHN wire has a PVC insulation with a nylon coating to protect against weather, gas and solvents. It can be used outdoors or in conduit but it cannot be direct buried without the use on conduit. Our underground cables listed in awg sizes above are very useful and not that expensive. UFB cable can be used in any way you need outdoors because weather and moisture have no change on penetrating the UFB jacket."}, {"url": "http://www.doityourself.com/stry/calculating-how-deep-to-bury-outdoor-electrical-wire", "passage_text": "Although UF cable is designed to be buried, you can also use it above ground. For example, if you have a run of cable that is partly buried and partly above the ground, and you prefer not to splice your burial cable to a length of above-ground cable, you can use UF cable for the full cable run."}, {"url": "http://heightslibrary.org/materials/hrrc/15-Electrical_Repairs/WIRING/BURYING_ELEC_WIRING.pdf", "passage_text": "Code specified that Schedule 40 PVC can be used underground, where the conduit passes through the house, or where it passes inside a lamppost. A thicker-walled PVC conduit (called Schedule 80) is required where the conduit is exposed above grade (above the soil) on the side of the house and/or garage. On the other hand, if you use conduit, the trench needs to be only 18 inches below the surface. Another advantage is that the conduit can carry several wires – wires to control garage lights from switches inside the house, as well as the power supply wires. Not all types of conduit can be buried in the soil."}, {"url": "http://www.intercountyenergy.net/content/faqs-about-electrical-service", "passage_text": "For 400 amp service entrance conduit shall be 3. All conduit(s) shall be SCH 40 PVC, with the exception: SCH 80 PVC shall be used under all roadways, from the elbow to the meter base, and for the first 10' of exposed conduit left uninstalled for the transformer pole. Q. Q. Is additional conduit required beyond what is installed in the ditch? A. If the service is being supplied from a utility pole, the member is required to supply 1-10' section of SCH 80 PVC and 2-10' sections of SCH 40 PVC to be left near the base of the pole for installation by the power company up the pole."}, {"url": "http://www.southwire.com/support/BuriedConduitChooseJktsThatResistMoisture.htm", "passage_text": "Choose Jackets that Resist Moisture. Water is ubiquitous in buried conduit. Cable jackets can help protect insulation. Putting cable in buried conduit keeps the cable out of sight, and it's protected mechanically. But there is also a downside to underground conduit: water. "}, {"url": "http://garages.about.com/od/garageconversions/a/How-To-Install-Underground-Cable.htm", "passage_text": "Types of Conduit. PVC conduit needs to be buried at least 18 inches deep unless it will be covered by concrete, in which case it can be buried 12 inches deep. Rigid metal conduit can be buried as little as 6 inches deep, with or without a concrete cap. Be sure to check with your local code before you start installing underground cable. "}]