[{"url": "http://www.chegg.com/homework-help/two-basic-types-cost-accounting-systems-job-order-costing-p-chapter-19-problem-49mcq-solution-9780077338268-exc", "passage_text": "The two basic types of cost accounting systems are: A. Job order costing and perpetual costing. B. Job order costing and customized product costing. C. Job order costing and customized service costing. D. Job order costing and process costing. E. Job order costing and periodic costing."}, {"url": "http://www.inc.com/encyclopedia/costs.html", "passage_text": "The cost of a fixed asset used in production is measured in terms of depreciation. The cost of capital used to purchase fixed assets is measured in terms of the interest expense associated with raising the capital. Businesses are vitally interested in measuring their costs."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/question-1-2-points-basic-types-cost-accounting-systems-question-1-options-job-order-cost--q5594849", "passage_text": "Question 7 options: Are relevant only when a company is engaged in manufacturing activities. Are determined in job order cost systems but cannot be computed when a process cost system is in use. Are relevant in manufacturing, merchandising, and service industries, regardless of the type of cost accounting system in use. Are determined by relating manufacturing costs to the number of units sold."}, {"url": "http://www.investopedia.com/terms/c/cost-accounting.asp", "passage_text": "Cost accounting is a type of accounting process that aims to capture a company's costs of production by assessing the input costs of each step of production as well as fixed costs such as depreciation of capital equipment."}, {"url": "http://www.mccc.edu/~horowitk/documents/VanDerbeck_ch01.pdf", "passage_text": "Learning Objectives (cont.) Describe the relationship of cost accounting to financial and management accounting.Identify the three basic elements of manufacturing costs.Illustrate basic cost accounting procedures.Distinguish between the two basic of cost accounting systems.Illustrate a job order cost system."}]