[{"url": "http://www.answers.com/Q/Where_do_horsefield_tortoises_come_from", "passage_text": "I believe leopard tortoises are somewhat similar, although the coloring is much different and leopard tortoises are the 5th largest tortoises in the world. Actually, none, s … orry. Desert Tortoises are all too often carriers of Mycoplasma Agassizii and other tortoise species have no built in defense against that. "}, {"url": "http://www.planetozkids.com/oban/animals/animal-facts-tortoise.htm", "passage_text": "Description. The tortoise is the third member of the Chelonian family – along with turtles and terrapins. Chelonians are also reptiles, which means they are cold-blooded and warm themselves by drawing heat from their environment. They have four legs and a shell that is joined down the sides. "}, {"url": "https://en.wikipedia.org/wiki/Turtle", "passage_text": "The smallest turtle is the speckled padloper tortoise of South Africa. It measures no more than 8 cm (3.1 in) in length and weighs about 140 g (4.9 oz). Two other species of small turtles are the American mud turtles and musk turtles that live in an area that ranges from Canada to South America. Turtle may either refer to the order as a whole, or to particular turtles that make up a form taxon that is not monophyletic. The meaning of the word turtle differs from region to region. In North America, all chelonians are commonly called turtles, including terrapins and tortoises. In Great Britain, the word turtle is used for sea-dwelling species, but not for tortoises"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061219074142AA4491s", "passage_text": "There can be a variety of answers to this. 1) Tortoises can be found in many places around the world. 2) Tortoises hatch from eggs that are laid by its mother. 3) Tortoises are also one of the most ancient animals in the world, as they've been around since the time of the dinosaurs, around 200 million years ago. So, an evolutionary answer would be that modern tortoises evolved from earlier forms of tortoises. They haven't changed much in millions of years. 4) Also, they come from land."}, {"url": "http://www.lllreptile.com/info/library/animal-care-sheets/turtles-and-tortoises/-/russian-tortoise/", "passage_text": "Russian tortoises come from parts of the world with long and harsh dry seasons. As a result, they only drink water opportunistically when it is present. For this reason, most captive tortoises will rarely, if ever, seek out a source of standing water and drink from it. "}, {"url": "https://en.wikipedia.org/wiki/Tortoise", "passage_text": "Tortoises (/ˈtɔr.təs.ɨz/) are a family, Testudinidae, of land-dwelling vertebrates in the order Testudines. Tortoises are shielded from predators by a shell. The top part of the shell is the carapace, the underside is the plastron, and the two are connected by the bridge. Female tortoises dig nesting burrows in which they lay from one to 30 eggs. Egg-laying typically occurs at night, after which the mother tortoise covers her clutch with sand, soil, and organic material. The eggs are left unattended, and depending on the species, take from 60 to 120 days to incubate."}, {"url": "https://en.wikipedia.org/wiki/Tortoise", "passage_text": "Baby tortoise feeding on lettuce. Most land-based tortoises are herbivores, feeding on grasses, weeds, leafy greens, flowers, and some fruits, although some omnivorous species are in this family. Pet tortoises typically require diets based on wild grasses, weeds, leafy greens and certain flowers. Female tortoises dig nesting burrows in which they lay from one to 30 eggs. Egg-laying typically occurs at night, after which the mother tortoise covers her clutch with sand, soil, and organic material. The eggs are left unattended, and depending on the species, take from 60 to 120 days to incubate."}, {"url": "https://en.wikipedia.org/wiki/Turtle", "passage_text": "Some languages do not have this distinction, as all of these are referred to by the same name. For example, in Spanish, the word tortuga is used for turtles, tortoises, and terrapins. A sea-dwelling turtle is tortuga marina, a freshwater species tortuga de rio, río and a tortoise tortuga. terrestre Turtle may either refer to the order as a whole, or to particular turtles that make up a form taxon that is not monophyletic. The meaning of the word turtle differs from region to region. In North America, all chelonians are commonly called turtles, including terrapins and tortoises. In Great Britain, the word turtle is used for sea-dwelling species, but not for tortoises."}]