[{"url": "http://www.drpaulwong.com/meaning-seeking-self-transcendence-and-well-being/", "passage_text": "This definition echoes Frankl’s emphasis on self-transcendence. A general sense of calling, regardless of one’s occupation, is the call to devote one’s life to serving others and to improving oneself in order to fulfill one’s potential. Self-Transcendence, Aging and Well-Being. Logotherapy or meaning therapy is uniquely designed to meet the spiritual and existential needs of the aging population. In the areas of aging and spiritual care, self-transcendence is a central issue."}, {"url": "http://www.soulprogress.com/html/Glossary/SelfTranscendenceGlossary.html", "passage_text": "Self-transcendence. Self-transcendence: 1. The act or condition of going/being beyond ego or egoity, usually as a result of love, service, non-egoic discipline, or undivided attention for another. 2. An evolutive practice or technique which involves moving beyond prior conceptual, presumptive, or behavioral limitations"}, {"url": "https://en.wikipedia.org/wiki/Self-transcendence", "passage_text": "Self-transcendence is a personality trait associated with experiencing spiritual ideas such as considering oneself an integral part of the universe. It is one of the character dimensions of personality assessed in Cloninger 's Temperament and Character Inventory. Although there has not been a great deal of research into the validity of self-transcendence as a measure of spirituality, one study found that self-transcendence was significantly related to a number of areas of belief and experience that have been traditionally considered spiritual."}, {"url": "https://en.wikipedia.org/wiki/Self-transcendence", "passage_text": "Self-transcendence is distinctive as the first trait concept of a spiritual nature to be incorporated into a major theory of personality. High self-transcendence has been linked to psychotic tendencies, such as schizotypy and mania, particularly in individuals low in both self-directedness and cooperativeness. Although there has not been a great deal of research into the validity of self-transcendence as a measure of spirituality, one study found that self-transcendence was significantly related to a number of areas of belief and experience that have been traditionally considered spiritual."}, {"url": "http://www.jenniferchien.com/library/DEFINITIONS.pdf", "passage_text": "DEFINITIONS OF SELF-TRANSCENDENCE Self-transcendence refers to the direct experience of a fundamental connection, harmony, or unity with others and the world. The self which is transcended is the personality or ego-self, the collection of self-concepts, self-images, and roles which develops through one's interactions. The notion of self-transcendence is a key part of [psychologist Abraham] Maslow's thinking and the roots of transpersonal psychology. Toward the end of his career, Maslow's transpersonal interests led him to add a sixth level to his widely-known Hierarchy of Needs."}, {"url": "https://en.wikipedia.org/wiki/Transcendence_(philosophy)", "passage_text": "In philosophy, the adjective transcendental and the noun transcendence convey the basic ground concept from the word's literal meaning (from Latin), of climbing or going beyond, albeit with varying connotations in its different historical and cultural stages. Jean-Paul Sartre also speaks of transcendence in his works. In Being and Nothingness, Sartre utilizes transcendence to describe the relation of the self to the object oriented world, as well as our concrete relations with others. For Sartre, the for-itself is sometimes called a transcendence"}, {"url": "https://en.wikipedia.org/wiki/Transcendence_(philosophy)", "passage_text": "The first meaning, as part of the concept pair transcendence/ immanence, is used primarily with reference to God 's relation to the world and is particularly important in theology. Jean-Paul Sartre also speaks of transcendence in his works. In Being and Nothingness, Sartre utilizes transcendence to describe the relation of the self to the object oriented world, as well as our concrete relations with others. For Sartre, the for-itself is sometimes called a transcendence"}, {"url": "http://medical-dictionary.thefreedictionary.com/Self-transcendence", "passage_text": "self-transcendence, the ability to focus attention on doing something for the sake of others, as opposed to self-actualization, in which doing something for oneself is an end goal. See also altruism. "}]