[{"url": "http://hepatitis.emedtv.com/havrix/havrix.html", "passage_text": "The prescription drug Havrix is an injectable vaccine that provides protection against the virus that causes hepatitis A. It works by exposing the body to a weakened form of the virus, which causes a specific immune system response. Havrix ® (hepatitis A vaccine) is used to provide protection against hepatitis A. People who are concerned about exposure to this substance can be confident that this vaccine has no thimerosal -- not even trace amounts. Some people also are concerned about the aluminum content of vaccines. This vaccine contains 0.5 mg of aluminum per mL per adult dose and 0.25 mg of aluminum per pediatric dose."}, {"url": "http://www.rxlist.com/havrix-drug/indications-dosage.htm", "passage_text": "INDICATIONS. HAVRIX® is indicated for active immunization against disease caused by hepatitis A virus (HAV). HAVRIX is approved for use in persons 12 months of age and older. Primary immunization should be administered at least 2 weeks prior to expected exposure to HAV. Shake well before use. With thorough agitation, HAVRIX is a homogeneous, turbid, white suspension. Do not administer if it appears otherwise. Parenteral drug products should be inspected visually for particulate matter and discoloration prior to administration, whenever solution and container permit."}, {"url": "http://hepatitis.emedtv.com/havrix/havrix.html", "passage_text": "Havrix does not contain thimerosal (a mercury-containing preservative). People who are concerned about exposure to this substance can be confident that this vaccine has no thimerosal -- not even trace amounts. Some people also are concerned about the aluminum content of vaccines. This vaccine contains 0.5 mg of aluminum per mL per adult dose and 0.25 mg of aluminum per pediatric dose."}, {"url": "https://en.wikipedia.org/wiki/Havrix", "passage_text": "Hepatitis A vaccine is a vaccine against the hepatitis A virus. The first successful vaccine against it was invented by Maurice Hilleman at Merck. The vaccine protects against the virus in more than 95% of cases and provides protection from the virus for at least fifteen years. The initial dose of the vaccine should be followed up by a booster six to twelve months later. Protection against hepatitis A begins approximately two to four weeks after the initial vaccination. Protection is proven to last at least 15 years and is estimated to last at least 25 years if the full course is administered."}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-a.html", "passage_text": "Hepatitis A is a serious liver disease caused by the hepatitis A virus (HAV). HAV is found in the stool of people with hepatitis A. It is usually spread by close personal contact and sometimes by eating food or drinking water containing HAV. A person who has hepatitis A can easily pass the disease to others within the same household. "}, {"url": "https://en.wikipedia.org/wiki/Havrix", "passage_text": "The vaccine should be given in the muscle of the upper arm and be given in two doses for the best protection. The initial dose of the vaccine should be followed up by a booster six to twelve months later. Protection against hepatitis A begins approximately two to four weeks after the initial vaccination. Protection is proven to last at least 15 years and is estimated to last at least 25 years if the full course is administered."}, {"url": "https://www.gsksource.com/pharma/content/dam/GlaxoSmithKline/US/en/Prescribing_Information/Havrix/pdf/HAVRIX.PDF", "passage_text": "HAVRIX is approved for use in persons 12 months of age and older. Primary immunization should be administered at least 2 weeks prior to expected exposure to HAV. (1) ----------------------- DOSAGE AND ADMNISTI RATONI ---------------- • HAVRIX is administered by intramuscular injection. Because many drugs are excreted in human milk, caution should be exercised when HAVRIX is administered to a nursing woman. 8.4 Pediatric Use The safety and effectiveness of HAVRIX, doses of 360 EL.U. or 720 EL.U., have been evaluated in more than 22,000 subjects 1 year to 18 years of age."}, {"url": "http://www.rxlist.com/havrix-drug.htm", "passage_text": "HAVRIX (Hepatitis A Vaccine) is a sterile suspension of inactivated virus for intramuscular administration. The virus (strain HM175) is propagated in MRC -5 human diploid cells. After removal of the cell culture medium, the cells are lysed to form a suspension. From the manufacturing process, HAVRIX also contains residual MRC-5 cellular proteins (not more than 5 mcg/mL), formalin (not more than 0.1 mg/mL), and neomycin sulfate (not more than 40 ng/mL), an aminoglycoside antibiotic included in the cell growth media. HAVRIX is formulated without preservatives."}, {"url": "http://www.rxlist.com/havrix-drug.htm", "passage_text": "Here is a collection of user reviews for the medication Havrix sorted by most helpful. See User Reviews. Report Problems to the Food and Drug Administration. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit the FDA MedWatch website or call 1-800-FDA-1088. From the manufacturing process, HAVRIX also contains residual MRC-5 cellular proteins (not more than 5 mcg/mL), formalin (not more than 0.1 mg/mL), and neomycin sulfate (not more than 40 ng/mL), an aminoglycoside antibiotic included in the cell growth media. HAVRIX is formulated without preservatives."}]