[{"url": "http://www.brighthub.com/money/home-buying/articles/95017.aspx", "passage_text": "The Average. The average cost per acre of land can vary across the United States, but does have a general range. According to the Lincoln Institute and the Federal Housing Authority figures, an acre of land in 2010 sold for an average of $1,000. This is unimproved land without utilities or any structures or easements. In New Jersey, farmland can have an average cost of $8,000, while in Wyoming the same size acre can be purchased for one-tenth the same price. While there is an “average” cost per acre for land, there are various other costs and considerations that can drive the price upwards. slide 2 of 7."}, {"url": "http://www.msn.com/en-us/money/generalmoney/what-us-land-is-really-worth-state-by-state/ar-BBkTfZS", "passage_text": "Arizona. With more than 72 million acres, Arizona was one of the largest states in the country. However, much of the land was undeveloped and unusable for agricultural purposes, leading to a valuation of just $315 billion, or $4,300 per acre, nearly one-third the value of an average acre in the lower 48 states. "}, {"url": "http://farmdocdaily.illinois.edu/2012/12/per-acre-non-land-costs-of-grain-farms.html", "passage_text": "Farms between 1000 and 4000 acres have non-land costs between $186 per acre and $200 per acre (see Table 1). These farms have roughly 70% of their acres cash rented, with average cash rents ranging from $206 per acre up to $242 per acre. This occurs because a larger portion of farmland is cash-rented (77% for over 4000 acre farms compared to 71% or less for lower farm sizes) and cash rents are higher for farms with over 4000 acres ($276 per acre for over 4000 acre farms while smaller categories average $241 per acre or less)."}, {"url": "http://www.extension.iastate.edu/article/farmland-value-reaches-historic-8296-statewide-average", "passage_text": "AMES, Iowa — Average Iowa farmland value is estimated to be $8,296 per acre, an increase of 23.7 percent from 2011, according to results of the Iowa Land Value Survey conducted in November. This is the third year in a row where values have increased more than 15 percent. The 2012 values are historical peaks. "}, {"url": "http://www.howmuchisit.org/acre-of-land-cost/", "passage_text": "1 Mentioned below are factors and land estimates to consider. 2  Farmlands can have an average cost between $5,000 to $8,000 per acre. 3  There can be cheaper land in some locations with an average cost of around $1,000-$5,000 per acre. 4  These are areas that have no timber or structures. 1 The pricing is very hard to pinpoint, unless you know exactly where you want to search. 2  Mentioned below are factors and land estimates to consider. 3  Farmlands can have an average cost between $5,000 to $8,000 per acre. 4"}, {"url": "http://www.howmuchisit.org/acre-of-land-cost/", "passage_text": "1 Farmlands can have an average cost between $5,000 to $8,000 per acre. 2  There can be cheaper land in some locations with an average cost of around $1,000-$5,000 per acre. 3  These are areas that have no timber or structures. 4  The geographical location is going to greatly influence the overall price per acre. 1 The pricing is very hard to pinpoint, unless you know exactly where you want to search. 2  Mentioned below are factors and land estimates to consider. 3  Farmlands can have an average cost between $5,000 to $8,000 per acre. 4"}, {"url": "http://extension.missouri.edu/p/G403", "passage_text": "For example, the state average value for farmland in Missouri was $217 per acre in 1969, $224 per acre in 1970, $236 per acre in 1971, and $384 per acre in 1974. Of the $167 increase between 1969 and 1974, $7, or 4.19 percent, occurred between 1969 and 1970. $7 ÷ $167 × 100 = 4.19%. "}, {"url": "http://www.agweb.com/land/farmland-value-guide/", "passage_text": "The Mountain region had the lowest farm real estate value at $1,100 per acre. The United States cropland value increased by $30 per acre (0.7 percent) to $4,130 per acre from the previous year. In the Southern Plains region, the average cropland value increased 9.2 percent from the previous year. However, in the Corn Belt region, cropland values decreased by 2.3 percent. The United States farm real estate value, a measurement of the value of all land and buildings on farms, averaged $3,020 per acre for 2015, up 2.4 percent from 2014 values."}, {"url": "http://farmfutures.com/story-outlook-farmland-prices-cash-rents-2015-0-116606", "passage_text": "Cash rents provide one meaningful measure of farmland returns. Generally, prospects of permanently increased cash rents lead to increases in farmland prices. Since 2006, average cash rents in Illinois increased from $132 per acre in 2006 to $234 per acre in 2014, representing an increase of 77%. "}]