[{"url": "http://www.urbandictionary.com/define.php?term=Geechee", "passage_text": "Geechee is another term for the Gullah people who live in the Lowcountry region of South Carolina and Georgia including both the coastal plain and the Sea Islands. They are Black/African Americans."}, {"url": "http://www.definition-of.com/geechy", "passage_text": "(Adjective) A person that is country/Southern to an extreme. Typically a very country person of African-American decent from the Florida, Georgia, South Carolina, and Alabama areas but they can dwell in other states as well."}, {"url": "http://www.definition-of.com/geechy", "passage_text": "(Noun) A geechy is a person usually of English/French Huguenot (caucasian) descent and resides in the South Carolina Lowcountry. NOT TO BE CONFUSED WITH GULLAH--a person of African-American (black) descent residing in South Carolina Lowcountry region."}, {"url": "http://www.urbandictionary.com/define.php?term=Geechee", "passage_text": "Geechee. Without too much of a history lesson, a Geechee or Geechie person is someone of a Gullah descent. Gullah is the mixture of the English and African languages, that was spoken by slaves who were required to learn English, but still didn't want the masters to know exactly what they were saying."}, {"url": "http://www.urbandictionary.com/define.php?term=geechie", "passage_text": "4. geechie. Geechie is a term commonly referring to the African descendants of Sierra Leone, Liberia, Gambia,and Senegal who reside on coastal South Carolina, Georgia, and Florida. Geechie people often have a thick accent referred to as Gullah, and are commonly mistaken for Jamaicans by those who aren't familiar."}, {"url": "http://www.urbandictionary.com/define.php?term=geechie", "passage_text": "geechie. Geechie commonly refers to a person of white descent whose family has long roots in the South Carolina lowcountry, mostly between Beaufort and Georgetown; centered around Charleston. They speak Geechie which is a heavily accented dialect of English with Gullah influences."}]