[{"url": "http://history.howstuffworks.com/historical-events/berlin-wall6.htm", "passage_text": "Berlin Wall Torn Down. The official opening of the border with West Berlin occurred in a strange, confused way -- not much of a hammer blow at all. On Nov. 9, 1989, an East German official announced that East Germans would be allowed permanent departure or travel abroad. They could get passports or exit visas freely. "}, {"url": "http://www.whyguides.com/why-was-the-berlin-wall-taken-down.html", "passage_text": "The reasons why the Berlin Wall was taken down initially had nothing to do with German policies. The events in the Soviet Union led to its fall. In 1985, Mikhail Gorbachev became the leader of the USSR. It was only in July 1990 when the last piece was removed. Free Elections and Reunification. Another reason why the Berlin Wall was taken down included a shift over to the democratic way of life. In March 1990, free elections were held in East Germany. This would pave the way for reunification talks"}, {"url": "https://en.wikipedia.org/wiki/Tear_down_this_wall", "passage_text": "Tear down this wall!  was the challenge issued by United States President Ronald Reagan to Soviet Union leader Mikhail Gorbachev to destroy the Berlin Wall, in a speech at the Brandenburg Gate near the Berlin Wall on June 12, 1987, commemorating the 750th anniversary of Berlin. "}, {"url": "http://www.telegraph.co.uk/news/worldnews/europe/germany/11216520/When-the-Berlin-Wall-came-down.html", "passage_text": "Comments. On the evening of November 9 1989, East Germans began to walk through the Berlin Wall. Now, with hindsight, it seems inevitable that their story would end happily, that East and West Germany would reunite, that Berlin would become one city as it is so triumphantly today. "}, {"url": "http://news.bbc.co.uk/onthisday/hi/witness/november/9/newsid_3241000/3241641.stm", "passage_text": "The Wall was finally breached by jubilant Berliners on 9 November 1989, unifying a city that had been divided for over 30 years. Some of you were in Berlin the night The Wall came down and sent your stories: I was in Berlin on 9 November 1989. I was a US Army intelligence officer working for Allied Forces. We heard on the TV that some border points had opened and I left my wife and young daughter to see what was going on at Check Point Charlie."}, {"url": "http://www.dailysoft.com/berlinwall/history/fall-of-berlinwall.htm", "passage_text": "It was the first mass exodus of East Germans after the erection of the Berlin Wall in 1961. Mass demonstrations against the government and the system in East Germany begun at the end of September and took until November 1989. Erich Honecker, East Germany's head of state, had to resign on October 18, 1989. "}, {"url": "https://en.wikipedia.org/wiki/Berlin_Wall", "passage_text": "Constructed by the German Democratic Republic (GDR, East Germany), starting on 13 August 1961, the wall completely cut off (by land) West Berlin from surrounding East Germany and from East Berlin until it was opened in November 1989. After several weeks of civil unrest, the East German government announced on 9 November 1989 that all GDR citizens could visit West Germany and West Berlin. Crowds of East Germans crossed and climbed onto the wall, joined by West Germans on the other side in a celebratory atmosphere."}, {"url": "http://history1900s.about.com/od/coldwa1/a/berlinwall.htm", "passage_text": "The Berlin Wall was both the physical division between West Berlin and East Germany from 1961 to 1989 and the symbolic boundary between democracy and Communism during the Cold War. Dates: August 13, 1961 -- November 9, 1989. Also Known As: Berliner Mauer (in German). "}, {"url": "https://simple.wikipedia.org/wiki/Berlin_Wall", "passage_text": "The Berlin Wall (German: Berliner Mauer) separated the city of Berlin in Germany from 1961 to 1989. It separated the eastern half from the western half. Many people thought it was a symbol of the Cold War. The Berlin Wall was taken down on November 9, 1989. The Berlin Wall was about 168 km (104 miles) long. It was built to prevent people from escaping from the eastern half of Berlin"}]