[{"url": "http://www.telegraph.co.uk/news/worldnews/1569133/France-yearns-for-Belgiums-Wallonia-region.html", "passage_text": "France yearns for Belgium's Wallonia region. By Henry Samuel. 12:01AM GMT 12 Nov 2007. French-speaking Belgium should become part of France in the event of a split with its Dutch-speaking half, a poll suggests. 1  Champs Elysees elysées 'becoming-vice', ridden says Senior french.  policeman"}, {"url": "http://www.answers.com/Q/There_is_a_region_of_belgium_that_speaks_french_what_is_it_called", "passage_text": "There are 3 official languages in Belgium: Dutch, French and German. Dutch is spoken by +-60% of the people, living in the Northern Flemish region. French is spoken by +- … 40% of the people, living in the Southern Walloon region. German is spoken by less than 1% of the Belgians, living in a small eastern region. Most people speak at least one foreign language since everyone learns the second major language on school from (at least) the age of 10."}, {"url": "http://www.nytimes.com/2010/07/16/world/europe/16belgium.html", "passage_text": "WEMMEL, Belgium — Most of the families living in this well-to-do community on the outskirts of Brussels are French-speaking. But the law for this region of Belgium says that all official town business must be conducted in Flemish. That means that police reports must be written in Flemish. "}, {"url": "http://www.telegraph.co.uk/news/worldnews/1569133/France-yearns-for-Belgiums-Wallonia-region.html", "passage_text": "Fifty-four per cent of people questioned in France over the issue want the mainly French-speaking southern region of Wallonia incorporated into France if a split with Dutch-speaking Flanders was to occur. Relations between France and Belgium are close. French-speaking Belgium should become part of France in the event of a split with its Dutch-speaking half, a poll suggests."}, {"url": "http://wikitravel.org/en/Belgium", "passage_text": "The bilingual capital region of the country and headquarters of the EU. Wallonia. The southern, French-speaking region, incorporating a small German speaking region in the east near the German border. The Walloon provinces are (from west to east): Hainaut, Walloon Brabant, Namur, Liege liège And. luxembourg "}, {"url": "https://en.wikipedia.org/wiki/Communities,_regions_and_language_areas_of_Belgium", "passage_text": "Belgium is a federal state comprising three communities, three regions, and four language areas. For each of these subdivision types, the subdivisions together make up the entire country; in other words, the types overlap. The three communities are: 1  the Dutch-speaking Vlaamse Gemeenschap (Flemish Community). 2  the French-speaking Communaute Communauté (Francaise Française). 3  french Community-the German Speaking (Deutschsprachige-gemeinschaft German).  speaking community"}, {"url": "https://en.wikipedia.org/wiki/Communities,_regions_and_language_areas_of_Belgium", "passage_text": "The three regions are: 1  the Brussels-Capital Region (Brussels). 2  the Flemish Region (Flanders). 3  the Walloon Region (Wallonia). The three communities are: 1  the Dutch-speaking Vlaamse Gemeenschap (Flemish Community). 2  the French-speaking Communaute Communauté (Francaise Française). 3  french Community-the German Speaking (Deutschsprachige-gemeinschaft German).  speaking community"}, {"url": "http://www.answers.com/Q/There_is_a_region_of_belgium_that_speaks_french_what_is_it_called", "passage_text": "In the Flemish region, Dutch is the only official language. In the Wallon region, French is the only official language. The Brussels Capital Region is official bi-lingual French/Dutch. There is also a part of people who speak no one of the official languages. French is spoken by +- … 40% of the people, living in the Southern Walloon region. German is spoken by less than 1% of the Belgians, living in a small eastern region. Most people speak at least one foreign language since everyone learns the second major language on school from (at least) the age of 10."}, {"url": "https://en.wikipedia.org/wiki/French_Community_of_Belgium", "passage_text": "French speakers who live in the Flemish Region are not included in the official numbers for the French-speaking Community, since the French Community has no jurisdiction in that region. Their number is unknown, given the absence of sub-nationality status and the discouragement of linguistic criteria in census-taking. Wallonia is home to 80% of all Francophone Belgians, with the remaining 20% residing in Brussels, which is the seat of parliament of the French Community."}, {"url": "https://en.wikipedia.org/wiki/Communities,_regions_and_language_areas_of_Belgium", "passage_text": "The Flemish Region and the Walloon Region each comprise five provinces. The Brussels-Capital Region is not a province, nor does it contain any. The three regions are further subdivided into 589 municipalities, which in general consist of several sub-municipalities. The three communities are: 1  the Dutch-speaking Vlaamse Gemeenschap (Flemish Community). 2  the French-speaking Communaute Communauté (Francaise Française). 3  french Community-the German Speaking (Deutschsprachige-gemeinschaft German).  speaking community"}]