[{"url": "https://en.wikipedia.org/wiki/Strategic_sourcing", "passage_text": "The steps in a strategic sourcing process were defined, in 1994, as: 1  Assessment of a company's current spending (what is bought, where, at what prices?). 2  Assessment of the supply market (who offers what?). 3  Total cost analyses (how much does it cost to provide those goods or services?). 4  Identification of suitable suppliers. 5  Development of a 6  ... Nego As strategic sourcing is put in place and practiced over time, many large, sophisticated organizations will modify the process to better meet their individual corporate needs. Outsourcing a business practice to another company may also be incorporated into a sourcing strategy for services."}, {"url": "http://www.indeed.com/q-Strategic-Sourcing-Specialist-jobs.html", "passage_text": "The Sourcing Specialist will work closely with the Sourcing and Procurement teams for the timely and cost-effective strategic sourcing of goods and services in... 3 days ago-save job-email-more... 1  View all Quardev jobs in Seattle, WA-Seattle jobs. 2  Salary Search: Sourcing Specialist salaries in Seattle, WA. We are seeking a Sourcing Specialist that will work closely with the Strategic Sourcing Manager to manage sourcing and procurement of the Facilities... Easily apply. 11 days ago-save job-email-more... 1  View all HireTalent jobs in Menlo Park, CA-Menlo Park jobs"}, {"url": "https://www.recruiter.com/i/sourcing/", "passage_text": "Get daily via email Share this with your friends. Sourcing is the process of finding resumes within the recruitment process. Recruiters, both third party and corporate, need to find qualified candidates for their open job orders, oftentimes with very unique or niche work experience. "}, {"url": "http://www.purchasing.colostate.edu/documents/Strategic%20Sourcing%20Specialist%20Job%20Description-FINAL.PDF", "passage_text": "This new Strategic Sourcing Specialist position within Procurement Services provides a unique and exciting opportunity for the right person to make significant changes in the purchasing process by using data driven analysis to focus on the total cost of ownership and achieving the best value for CSU. Application Procedures: The Strategic Sourcing Specialist Search Committee will accept confidential applications and nominations until the position is filled. For full consideration, complete applications must be received by 5:00 p.m."}, {"url": "https://en.wikipedia.org/wiki/Strategic_sourcing", "passage_text": "In the services industry, strategic sourcing refers to a service solution, sometimes called a Strategic Partnership, that is specifically customized to meet the client's individual needs. In a production environment, it is often considered one component of supply chain management. As strategic sourcing is put in place and practiced over time, many large, sophisticated organizations will modify the process to better meet their individual corporate needs. Outsourcing a business practice to another company may also be incorporated into a sourcing strategy for services."}, {"url": "https://en.wikipedia.org/wiki/Strategic_sourcing", "passage_text": "Strategic sourcing is an institutional procurement process that continuously improves and re-evaluates the purchasing activities of a company. As strategic sourcing is put in place and practiced over time, many large, sophisticated organizations will modify the process to better meet their individual corporate needs. Outsourcing a business practice to another company may also be incorporated into a sourcing strategy for services."}, {"url": "http://www.purchasing.colostate.edu/documents/Strategic%20Sourcing%20Specialist%20Job%20Description-FINAL.PDF", "passage_text": "The Strategic Sourcing Specialist is a key member of the Procurement Services team that is committed to excellence and is dedicated to achieving the University’s mission to set the standard for public higher education in teaching, research, and service. Application Procedures: The Strategic Sourcing Specialist Search Committee will accept confidential applications and nominations until the position is filled. For full consideration, complete applications must be received by 5:00 p.m."}, {"url": "https://careers.slb.com/recentgraduates/engineering/eng_man_sus/sourcing_jd.aspx", "passage_text": "Sourcing Specialist. Job Summary. The Sourcing Specialist implements sourcing plans and tactics to effectively manage the assigned portfolio and associated activities. An important aspect of this role is maximizing supplier performance and supporting the company’s business plan for our advanced oilfield products. Essential Responsibilities and Duties"}]