[{"url": "http://www.imdb.com/title/tt0088939/reviews", "passage_text": "Spielberg's 1st Serious Film Is Beautiful and Powerful... A film that can make you shed tears of sadness and tears of joy would be considered quite a step in the career of a common filmmaker. The fact is, Steven Spielberg, probably our greatest story-teller, has been doing this in various movie formats for years. The color purple stands for the beauty of the fields and flowers surrounding these poor people. There really is something to live for, but love triumphs over all. Spielberg bashers take note: the guy can make an unforgettable classic without any cute aliens."}, {"url": "https://en.wikipedia.org/wiki/The_Color_Purple_%28film%29", "passage_text": "The Color Purple is a 1985 American period drama film directed by Steven Spielberg, based on the Pulitzer Prize-winning novel of the same name by Alice Walker. It was Spielberg's eighth film as a director, and was a change from the summer blockbusters for which he had become famous. The film was also the first feature-length film directed by Spielberg for which John Williams did not compose the music. The film starred Danny Glover, Desreta Jackson, Margaret Avery, Oprah Winfrey (in her film debut), Adolph Caesar, Rae Dawn Chong, and introduced Whoopi Goldberg as Celie Harris-Johnson"}, {"url": "http://www.dreamhomedecorating.com/psychological-effects-color-purple.html", "passage_text": "... for more info about color psychology, please go to the general psychology of color article. Some of the psychological effects of the color purple are purely historic: In Europe, purple color has a long-standing reputation as the color of royalty and power. For centuries, the intended psychological effect of the color purple was to show that the wearer was a VIP. Psychological Effects Of The Color Purple. Use the psychological effects of the color purple to create a rich, luxurious feel for your home. Purple is the color of kings. Despite this 'royal' association, the color purple is seated right amongst all the other colors on the utterly democratic Color Wheel-between red and blue, to be precise. Purple comes in warm, reddish, more 'passionate' hues and in cooler, complex plum and indigo ones"}, {"url": "https://en.wikipedia.org/wiki/The_Color_Purple", "passage_text": "The Color Purple is a 1982 epistolary novel by American author Alice Walker that won the 1983 Pulitzer Prize for Fiction and the National Book Award for Fiction. It was later adapted into a film and musical of the same name. "}, {"url": "https://en.wikipedia.org/wiki/The_Color_Purple_%28film%29", "passage_text": "The Color Purple was a success at the box office, staying in U.S. theaters for 21 weeks, and grossing over $142 million worldwide. In terms of box office income, it ranked as the #1 rated PG-13 movie released in 1985, and #4 overall. It was Spielberg's eighth film as a director, and was a change from the summer blockbusters for which he had become famous. The film was also the first feature-length film directed by Spielberg for which John Williams did not compose the music."}, {"url": "https://en.wikipedia.org/wiki/The_Color_Purple_%28film%29", "passage_text": "The Color Purple (film). From Wikipedia, the free encyclopedia. The world of Celie and the others is created so forcibly in this movie that their corner of the South becomes one of those movie places — like Oz, like Tara, like Casablanca — that lay claim to their own geography in our imaginations. It was Spielberg's eighth film as a director, and was a change from the summer blockbusters for which he had become famous. The film was also the first feature-length film directed by Spielberg for which John Williams did not compose the music."}, {"url": "http://www.imdb.com/title/tt0088939/reviews", "passage_text": "In spite of the seemingly hopeless situation the film's plot provides Celie with, the Color Purple is not a tale of her despair, but rather her triumph, one which is immensely inspiring. The color purple stands for the beauty of the fields and flowers surrounding these poor people. There really is something to live for, but love triumphs over all. Spielberg bashers take note: the guy can make an unforgettable classic without any cute aliens."}, {"url": "http://www.rogerebert.com/reviews/great-movie-the-color-purple-1985", "passage_text": "Celie's rebirth provides the spiritual center of The Color Purple, even if one detail (she opens a shop selling one-size-fits-all pants) seems unlikely. It is enough for her to find self-respect, love and joy; she need not succeed in retail. "}, {"url": "http://www.teachwithmovies.org/guides/color-purple.html", "passage_text": "COLOR PURPLE. Description: Adapted from the prize-wining novel, The Color Purple chronicles the story of Celie, a young black woman living in poverty in rural Georgia who is subjected to racism, sexism, sexual abuse, and family dysfunction."}]