[{"url": "http://csn.cancer.org/node/157498", "passage_text": "Re: CEA levels-what is normal. Biologically CEA is not a marker that can be used for populations but for some individuals there is a relationship between CEA levels and cancer expression. I know that on the web it says that CEA levels of 2.5 for non-smokers and 5.0 for smokers are considered normal. It also mentioned that there are a few different ways to measure cea levels. My CEA is 3.4 - I live in Boston and go to Mass General-I was stage 3."}, {"url": "http://www.medicalhealthtests.com/askquestion/313/what-is-cea-test-normal-range.html", "passage_text": "CEA is a protein marker indicative of several types of cancers, especially colon cancer. The CEA normal levels are different for smokers and nonsmokers. Usually, for adult nonsmokers, the normal CEA levels range from 0 to 2.5 mcg/l. For adult smokers, the levels are slightly higher, and normal levels range from 0 to 5.0 mcg/l. This difference in normal values is because smokers usually produce more CEA than nonsmokers. The CEA test is performed to monitor the severity of cancer or tumors in the patients. The values obtained after the CEA test indicates the response of body to the therapy. So, CEA values are used as a marker mainly for"}, {"url": "http://www.medicinenet.com/carcinoembryonic_antigen/article.htm", "passage_text": "CEA is a type of glycoprotein molecule that is produced by cells of the gastrointestinal tract during embryonic development. It is produced in very small amounts after birth. The level of CEA in the bloodstream is thus relatively low unless certain diseases-including certain forms of cancer-are present. When the CEA level is abnormally high before surgery or other treatment, it is expected to fall to normal following successful surgery to remove all of the cancer. A rising CEA level indicates progression or recurrence"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=8722", "passage_text": "CEA is tested in blood. The normal range is. Benign conditions that can increase CEA include smoking, infection, inflammatory bowel disease, pancreatitis, cirrhosis of the liver, and some benign tumors (in the same organs which have cancers with increased CEA). Benign disease does not usually cause a CEA increase over 10 ng/ml. The main use of CEA is as a tumor marker, especially with intestinal cancer. The most common cancers that elevate CEA are in the colon and rectum. Others: cancer of the pancreas, stomach, breast, lung, and certain types of thyroid and ovarian cancer."}, {"url": "http://www.medicinenet.com/carcinoembryonic_antigen/article.htm", "passage_text": "Both benign (harmless) and malignant (cancerous) conditions can increase the CEA level. The most frequent cancer which causes an increased CEA is cancer of the colon and rectum. Others include cancers of the pancreas, stomach, breast, lung, and medullary carcinoma of the thyroid and ovarian cancer. When the CEA level is abnormally high before surgery or other treatment, it is expected to fall to normal following successful surgery to remove all of the cancer. A rising CEA level indicates progression or recurrence"}, {"url": "https://labtestsonline.org/understanding/analytes/cea/tab/test", "passage_text": "The CEA test may be used: 1  To monitor the treatment of people diagnosed with colon cancer. 2  It may also be used as a marker for medullary thyroid cancer and cancers of the rectum, lung, breast, liver, pancreas, stomach, and ovaries. 3  An initial CEA test is typically ordered prior to treatment as a baseline value. A CEA test may be used in combination with other tumor markers in the evaluation of cancer. Not all cancers produce CEA, and a positive CEA test is not always due to cancer. Therefore, CEA is not recommended for screening the general population."}, {"url": "http://www.medicinenet.com/carcinoembryonic_antigen/article.htm", "passage_text": "The best use of CEA is as a tumor marker, especially for cancers of the gastrointestinal tract. When the CEA level is abnormally high before surgery or other treatment, it is expected to fall to normal following successful surgery to remove all of the cancer. A rising CEA level indicates progression or recurrence of the cancer."}, {"url": "https://labtestsonline.org/understanding/analytes/cea/tab/test", "passage_text": "For treatment, recurrence monitoring: When CEA levels are initially elevated and then decrease to normal after therapy, it means the cancer has been successfully treated. A steadily rising CEA level is often the first sign of tumor recurrence. A CEA test may be used in combination with other tumor markers in the evaluation of cancer. Not all cancers produce CEA, and a positive CEA test is not always due to cancer. Therefore, CEA is not recommended for screening the general population."}, {"url": "https://labtestsonline.org/understanding/analytes/cea/tab/test", "passage_text": "1 To monitor the treatment of people diagnosed with colon cancer. 2  It may also be used as a marker for medullary thyroid cancer and cancers of the rectum, lung, breast, liver, pancreas, stomach, and ovaries. 3  An initial CEA test is typically ordered prior to treatment as a baseline value. A CEA test may be used in combination with other tumor markers in the evaluation of cancer. Not all cancers produce CEA, and a positive CEA test is not always due to cancer. Therefore, CEA is not recommended for screening the general population."}, {"url": "http://www.healthline.com/health/cea", "passage_text": "Carcinoembryonic Antigen Test (CEA). A carcinoembryonic antigen (CEA) test is a blood test used to help diagnose and manage certain types of cancers, especially cancer of the colon. The test measures the amount of CEA present in the blood. If you already have cancer, this test helps a doctor determine if the treatment for the cancer is working. "}]