[{"url": "http://www.copyright.gov/circs/circ01.pdf", "passage_text": "Copyright is a form of protection provided by the laws of the United States (title 17, U. S. Code) to the authors of “original works of authorship,” including literary, dramatic, musical, artistic, and certain other intellectual works. This protection is available to both published and unpublished works. *note: Sound recordings are defined in the law as “works that result from the fixation of a series of musical, spoken, or other sounds, but not including the sounds accompanying a motion picture or other audiovisual work.” Common. Copyright Basics · 2. examples include recordings of music, drama, or lectures."}, {"url": "http://www.copyright.gov/circs/circ01.pdf", "passage_text": "The law provides that in no case would the term of copyright for works in this category expire before December 31, 2002, and for works published on or before December 31, 2002, the term of copyright will not expire before December 31, 2047. *note: Sound recordings are defined in the law as “works that result from the fixation of a series of musical, spoken, or other sounds, but not including the sounds accompanying a motion picture or other audiovisual work.” Common. Copyright Basics · 2. examples include recordings of music, drama, or lectures."}, {"url": "https://en.wikipedia.org/wiki/Copyright", "passage_text": "Copyright is a legal right created by the law of a country that grants the creator of an original work exclusive rights for its use and distribution. This is usually only for a limited time. The exclusive rights are not absolute but limited by limitations and exceptions to copyright law, including fair use. Copyright is a form of intellectual property, applicable to certain forms of creative work. Under US copyright law, legal protection attaches only to fixed representations in a tangible medium"}, {"url": "https://www.copyrightservice.co.uk/copyright/", "passage_text": "Our most popular fact sheets, ‘P-01 UK copyright law’, ‘P-03 Using copyright notices’, ‘P-27 Using the work of others’ and ‘P-05 Copyright infringement’ are available in a free to reproduce PDF format for educational establishments, libraries, advice centres and other non-commercial organisations. Information pack. Our information pack is available free of charge and contains our primary fact sheets about legislation and protection advice, as well as the registration form F-01. Copyright law UK: A summary. UK copyright information, about UK law, the duration of cover, rights of the author and what types of work are covered. Common copyright questions. The answers to our most commonly asked questions about copyright"}, {"url": "http://www.novagraaf.com/en/services/copyright-covers-a-wide-area/examples-of-copyright", "passage_text": "Examples of copyright. Copyright law protects a wide range of creations. The most obvious examples of works that are protected by copyright are, of course, text, books, art, music and photos. However, there are many other manifestations that are eligible for copyright protection. When we describe copyright in more straightforward terms, the main types of work that it covers are as follows: 1  books, brochures and newspapers; 2  theatrical works; 3  oral presentations; 4  choreographic works; 5  music (with or without words); 6  drawings, paintings, buildings and sculptures; 7  designs;"}, {"url": "http://www.ehow.com/about_7495424_there-different-types-copyrights.html", "passage_text": "Save. Copyright is a protection that the federal government gives to authors for their original works. Original works of authorship include literature, music, visual art and other art forms, published or unpublished. GNU is a type of license that applies to copyrighted works that have a notice from the copyright holder that says the work can be distributed under the terms of a GNU license. This notice grants a worldwide and unlimited duration to use that work under certain conditions, such as making copies of the work."}, {"url": "http://www.copyright.gov/circs/circ01.pdf", "passage_text": "However, registration is not a condition of copyright protection. Even though registration is not a requirement for protection, the copyright law provides several inducements or advantages to encourage copyright owners to make regis­tration. *note: Sound recordings are defined in the law as “works that result from the fixation of a series of musical, spoken, or other sounds, but not including the sounds accompanying a motion picture or other audiovisual work.” Common. Copyright Basics · 2. examples include recordings of music, drama, or lectures."}]