[{"url": "http://www.cdc.gov/pertussis/about/signs-symptoms.html", "passage_text": "Espanol: Español signos y. Sintomas (síntomas pertussis) whooping cough can cause serious illness, in, babies, children teens. And adults symptoms of pertussis usually develop within 5 to 10 days after, being exposed but sometimes not for as long as. 3 weeks "}, {"url": "http://answers.webmd.com/answers/5011236/how-soon-after-exposure-to-the-flu-virus-do-symptoms-appear", "passage_text": "FollowingUnfollow SUCCESS! FollowingUnfollow. cspencer. 5 Answers. 85 Helpful Votes. A. It takes approximately 24-48 hours for initial symptoms to appear after exposure to the influenza virus. If you suspect you have the flu, seek medical treatment quickly. Tamiflu, if taken within the first 48 hours of symptoms occurring, can reduce the time it takes to heal and can reduce symptoms. "}, {"url": "http://www.mamapedia.com/article/child-exposed-to-croup", "passage_text": "Croup itself is not contagious. The cold that brings on croup is just like any other cold. Some children are prone to croup whether they get a cold or not and some will never get croup. Once she's exposed, it's probably too late. My daughter suffered from croup for years, she was very susceptible to it. If your daughter wakes up with an awful barking cough unlike nothing you've ever heard before, that's croup. Steam up your bathroom and take her in to let her breathe the air."}, {"url": "http://www.mamapedia.com/article/child-exposed-to-croup", "passage_text": "The first time my son got croup, we took him to the ER and I was very scared. He was a little better by the time we got to the ER, which they said was due to the fresh air he got going in and out of the car. It is scary at first, but knowing what helps makes a big difference. Once she's exposed, it's probably too late. My daughter suffered from croup for years, she was very susceptible to it. If your daughter wakes up with an awful barking cough unlike nothing you've ever heard before, that's croup. Steam up your bathroom and take her in to let her breathe the air."}, {"url": "https://www.healthtap.com/topics/how-long-after-being-exposed-do-pink-eye-symptoms-appear", "passage_text": "Pink eye!: Lots of reasons for pink eye or red eye. Infections, both viral & bacterial, are common causes of conjunctivitis. Patients typically complain of an irritation, sometimes gritty, sometimes burning, often w/purulent discharge such that their lids are glued shut in the morning & crusted over. Get help from a doctor now ›. Depends: Assuming the pink eye is caused by a viral infection (most likely), the time from contracting the virus to showing symptoms can be anywhere from 4-10 days. If it was a bacterial infection, symptoms usually being sooner."}, {"url": "http://www.empowher.com/community/ask/how-soon-after-being-diagnosed-croup-can-other-chlidren-be-affected", "passage_text": "Croup is an upper respiratory infection that transmits similar to colds or influenza, and generally affects kids up to the age of 5. Once exposed, it can take roughly 2-5 days to develop symptoms. Croup typically can last 3-7 days. I found the information on both the Mayo Clinic website, and on this Healthy Children page: http://www.healthychildren.org/english/tips-tools/symptom-checker/pages/... The Mayo Clinic page has information on how to deal with symptoms (night wheezing, etc.), and when to see the doctor (high fever, or signs of poor oxygenation): http://www.mayoclinic.com/health/croup/DS00312/DSECTION=symptoms. Good luck, and hope both kids are back to playing together in no time"}, {"url": "http://www.ndhealth.gov/Disease/Documents/faqs/Croup.pdf", "passage_text": "Croup features a barking cough. Most children have what appears to be a mild cold for several days before the cough becomes evident. This condition is generally much worse at night and often lasts five or six nights, but the first night or two are usually the most severe. Croup is swelling around the vocal cords that causes difficulty breathing and is accompanied by a “barking” cough. One of the most common causes of croup is a virus called parainfluenza. Who is at risk for croup? People of all ages are at risk for croup, but it is most common among infants and children between the ages of 3 months and 5 years. Some children are prone to croup and may get it several times"}]