[{"url": "https://support.apple.com/en-us/HT201564", "passage_text": "&NewLine;An Apple software upgrade means a major, standalone version of a software product. Such products are usually something you purchase. OS X upgrades are sometimes also called  reference releases .. &NewLine; &NewLine;For example, OS X Mountain Lion is an upgrade that is available from the Mac App Store."}, {"url": "http://www.askdeb.com/technology/what-is-a-software-patch/", "passage_text": "Use a Google search for “software patch” and the name of the program, such as “Windows XP”. Software patches are usually free to download right to your computer. Installing a Software Patch. Installing a software patch is easier now than it has ever been. Gone are the days when you had to manually type in pages of commands and other instructions just to get your patch to work properly."}, {"url": "http://oss-watch.ac.uk/resources/softwarepatch", "passage_text": "Introduction. A patch is a record of changes made to a set of resources. Typically a patch will add a new feature, fix a bug, or add documentation to the project. A popular means of creating a patch is by using diff, a tool that is commonly available on Linux and Unix systems."}, {"url": "http://oss-watch.ac.uk/resources/softwarepatch", "passage_text": "This document provides a simple overview of a software patch. It does not deal with the mechanics of creating and processing patches, which are better handled by the documentation of the patch management tool chosen."}, {"url": "http://pcsupport.about.com/od/termsp/g/patch-fix.htm", "passage_text": "A patch, sometimes just called a fix, is a small piece of software that's used to correct a problem, sometimes called a bug, with a software program or even an operating system. A collection of usually already-released patches is often called a service pack."}, {"url": "http://oss-watch.ac.uk/resources/softwarepatch", "passage_text": "Once the contributor is satisfied that the patch is worthy of consideration by the project maintainers, a patch must be created. How the contributor creates the patch depends on which development environment they are using and on which version control system the project is using."}, {"url": "https://en.wikipedia.org/wiki/Patch_(computing)", "passage_text": "A patch is a piece of software designed to update a computer program or its supporting data, to fix or improve it. This includes fixing security vulnerabilities and other bugs, with such patches usually called bugfixes or bug fixes, and improving the usability or performance."}, {"url": "http://www.askdeb.com/technology/what-is-a-software-patch/", "passage_text": "A software patch is a piece of code designed to fix glitches, bugs, or compatibility issues between the software and commonly used hardware or operating systems. When a piece of software is released to the general public, it gets put through its paces."}]