[{"url": "http://www.ancient-egypt-online.com/ancient-egypt-houses.html", "passage_text": "Ancient Egypt Houses. For the most part ancient Egypt houses were constructed using materials that were handy and plentiful. This meant that the design of houses in ancient Egypt varied little, even among the wealthy. This makes it very easy to imagine what Egyptian houses look like."}, {"url": "https://en.wikipedia.org/wiki/Ancient_Egypt", "passage_text": "Egypt reached the pinnacle of its power during the New Kingdom, in the Ramesside period where it rivalled the Hittite Empire, Assyrian Empire and Mitanni Empire, after which it entered a period of slow decline. In the aftermath of Alexander the Great 's death, one of his generals, Ptolemy Soter, established himself as the new ruler of Egypt. This Greek Ptolemaic Kingdom ruled Egypt until 30 BC, when, under Cleopatra, it fell to the Roman Empire and became a Roman province."}, {"url": "http://www2.sptimes.com/Egypt/EgyptCredit.4.2.html", "passage_text": "Egypt: Daily Life. Ancient Egypt was a narrow strip of land along the Nile River. Each year the river flooded its banks, leaving behind a fertile fringe of soil they called the Black Land, while the desert all around the Nile valley was called the Red Land.. It was here the Ancient Egyptians built their homes."}, {"url": "http://www.ancient.eu/egypt/", "passage_text": "Egypt is a country in North Africa, on the Mediterranean Sea, and is among the oldest civilizations on earth. The name 'Egypt' comes from the Greek Aegyptos which was the Greek pronunciation of the Egyptian name 'Hwt-Ka-Ptah' (which means House of the Spirit of Ptah, who was a very early God of the Ancient Egyptians). "}, {"url": "http://www.livescience.com/27941-egyptian-commoners-did-backbreaking-work.html", "passage_text": "An analysis of more than 150 skeletons from a 3,300-year-old cemetery at the ancient Egyptian city of Amarna reveals fractures, wear and tear from heavy lifting, and rampant malnutrition amongst the city's commoners. Overnight city. For a brief, 17-year period, the center of Egypt was Amarna, a small city on the banks of the Nile, about 218 miles (350 kilometers) south of Cairo. The pharaoh Akhenaten relocated his capital city to Amarna to build a pure, uncontaminated cult of worship dedicated to the sun god Aten."}, {"url": "https://en.wikipedia.org/wiki/Ancient_Egypt", "passage_text": "Ancient Egypt was a civilization of ancient Northeastern Africa, concentrated along the lower reaches of the Nile River in what is now the modern country of Egypt. It is one of six civilizations globally to arise independently. In the aftermath of Alexander the Great 's death, one of his generals, Ptolemy Soter, established himself as the new ruler of Egypt. This Greek Ptolemaic Kingdom ruled Egypt until 30 BC, when, under Cleopatra, it fell to the Roman Empire and became a Roman province."}, {"url": "http://www.livescience.com/27941-egyptian-commoners-did-backbreaking-work.html", "passage_text": "The discovery, detailed in the March issue of the journal Antiquity, could shed light on how the non-elites of ancient Egyptian society lived. Overnight city. For a brief, 17-year period, the center of Egypt was Amarna, a small city on the banks of the Nile, about 218 miles (350 kilometers) south of Cairo. The pharaoh Akhenaten relocated his capital city to Amarna to build a pure, uncontaminated cult of worship dedicated to the sun god Aten."}, {"url": "https://en.wikipedia.org/wiki/Ancient_Egypt", "passage_text": "Egypt was invaded or conquered by a succession of foreign powers, such as the Canaanites / Hyksos, Libyans, the Nubians, the Assyrians, Babylonians, the Achaemenid Persians, and the Macedonians in the Third Intermediate Period and the Late Period of Egypt. In the aftermath of Alexander the Great 's death, one of his generals, Ptolemy Soter, established himself as the new ruler of Egypt. This Greek Ptolemaic Kingdom ruled Egypt until 30 BC, when, under Cleopatra, it fell to the Roman Empire and became a Roman province."}, {"url": "https://profyasser.wordpress.com/2009/11/27/daily-life-of-the-ancient-egyptian-commoners/", "passage_text": "Daily life of the ancient Egyptian commoners. The author: Professor Yasser Metwally. http://yassermetwally.com. Most ancient Egyptians were farmers tied to the land. Their dwellings were restricted to immediate family members, and were constructed of mud-brick designed to remain cool in the heat of the day. "}, {"url": "http://www.livescience.com/27941-egyptian-commoners-did-backbreaking-work.html", "passage_text": "While an Egyptian pharaoh built majestic temples filled with sparkling treasures, the lower classes performed backbreaking work on meager diets, new evidence suggests. Overnight city. For a brief, 17-year period, the center of Egypt was Amarna, a small city on the banks of the Nile, about 218 miles (350 kilometers) south of Cairo. The pharaoh Akhenaten relocated his capital city to Amarna to build a pure, uncontaminated cult of worship dedicated to the sun god Aten."}]