[{"url": "https://en.wikipedia.org/wiki/Florence", "passage_text": "Florence (/ˈflɒrəns/ FLOR-əns; Italian: Firenze [fiˈrɛntse]. , alternative obsolete form: Fiorenza [fjoˈrɛntsa] ; Latin: Florentia) is the capital city of the Italian region of Tuscany and of the province of Florence. It is the most populous city in Tuscany, with approximately 382,000 inhabitants, expanding to over 1,520,000 in the metropolitan area. The city also contains numerous museums and art galleries, such as the Uffizi Gallery and the Palazzo Pitti, and still exerts an influence in the fields of art, culture and politics. Due to Florence's artistic and architectural heritage, it has been ranked by Forbes as one of the most beautiful cities in the world."}, {"url": "http://www.mapsofworld.com/italy/regions.html", "passage_text": "1 Florence: This famous historical city is the capital of the Tuscany region of Italy. 2  Florence has many monuments and museums that attract visitors to this city on regular basis. 3  Rome: The capital of Italy as well as the the Lazio region, Rome became part of unified Italy in 1870. Italy constitudes 20 regions as the administrative divisions, out of which 5 are considered autonomous. The constitution of 1948 granted a certain degree of autonomy to the regions of Italy and specified that the Constitution is supposed to recognize, promote and protect local autonomy of these regions."}, {"url": "https://en.wikipedia.org/wiki/Tuscany", "passage_text": "Tuscany has over 120 protected nature reserves, making Tuscany and its capital Florence popular tourist destinations that attract millions of tourists every year. In 2012, the city of Florence became the world's 89th most visited city, with over 1.834 million arrivals. Tuscany (/ˈtʌskəni/ TUSK-ə-nee; Italian: Toscana, [tosˈkaːna]) is a region in central Italy with an area of about 23,000 square kilometres (8,900 sq mi) and a population of about 3.8 million inhabitants (2013). The regional capital is Florence (Firenze). Tuscany is known for its landscapes, traditions, history, artistic legacy and its influence on high culture"}, {"url": "https://en.wikipedia.org/wiki/Florence", "passage_text": "Florence is an important city in Italian fashion, being ranked in the top 51 fashion capitals of the world; furthermore, it is a major national economic centre, as a tourist and industrial hub. In 2008, the city had the 17th highest average income in Italy. The city also contains numerous museums and art galleries, such as the Uffizi Gallery and the Palazzo Pitti, and still exerts an influence in the fields of art, culture and politics. Due to Florence's artistic and architectural heritage, it has been ranked by Forbes as one of the most beautiful cities in the world."}, {"url": "http://www.mapsofworld.com/italy/regions.html", "passage_text": "Located in southern Europe, Italy is comprised of the Italian Peninsula and a number of islands. Italy shares borders with four countries: Switzerland, France, Austria, and Slovenia. It also surrounds two landlocked countries, San Marino and Vatican City. Italy constitudes 20 regions as the administrative divisions, out of which 5 are considered autonomous. The constitution of 1948 granted a certain degree of autonomy to the regions of Italy and specified that the Constitution is supposed to recognize, promote and protect local autonomy of these regions."}, {"url": "https://en.wikipedia.org/wiki/Florence", "passage_text": "The Historic Centre of Florence attracts millions of tourists each year, and Euromonitor International ranked the city as the world's 89th most visited in 2012, with 1.8 million visitors. It was declared a World Heritage Site by UNESCO in 1982. The city also contains numerous museums and art galleries, such as the Uffizi Gallery and the Palazzo Pitti, and still exerts an influence in the fields of art, culture and politics. Due to Florence's artistic and architectural heritage, it has been ranked by Forbes as one of the most beautiful cities in the world."}, {"url": "http://www.italia.it/en/discover-italy/tuscany.html", "passage_text": "The provinces of the region are: Florence (regional capital), Arezzo, Grosseto, Livorno, Lucca, Massa Carrara, Pisa, Pistoia, Prato and Siena. Tuscany hosts innumerable astounding localities, many of which are also named UNESCO World Heritage Sites; of course, one must begin with Florence. Tuscany is located in central Italy and stretches from the Apennines to the Tyrrhenian Sea. Its landscape, artistic heritage and stand-out cities-first among them Florence-make Tuscany an unquestioned protagonist of international tourism."}, {"url": "http://www.mapsofworld.com/italy/regions/tuscany.html", "passage_text": "Description: Map displaying the major cities, region capital, roads, province and regional boundary of Tuscany(Toscana) in Italy. "}, {"url": "http://www.travelonline.com/italy/regions.html", "passage_text": "Florence-Tuscany Region. Florence the capital of Tuscany is one of the most visited cities in Italy. Crossed by the Arno river this Renaissance city has numerous museums, hundreds of historic churches and wonderful masterpieces of art. Eternal Rome, strategically located in the middle of the Italian peninsula, is one of the most visited cities in Europe. A bustling city where the history buffs meet with the fashion minded shoppers and the lovers of Italian cuisine."}]