[{"url": "http://www.aidsmap.com/HIV-antibodies/page/1322961/", "passage_text": "Antibodies are protein molecules produced by the immune system in response to allergens, infectious organisms (including viruses, bacteria, fungi and parasites), and sometimes (in autoimmune disorders) the body's own components. Infectious organisms and allergens display characteristic proteins called antigens. "}, {"url": "http://health.howstuffworks.com/human-body/systems/lymphatic/lymph-system.htm", "passage_text": "Antibodies are manufactured by the lymph system. Antibodies are specialized proteins that the body produces in response to invasion by a foreign substance. The process of antibody formation begins when an antigen stimulates specialized lymphocytes, called B cells, into action. "}, {"url": "http://biology.about.com/od/molecularbiology/ss/antibodies.htm", "passage_text": "Antibodies recognize specific antigens by identifying certain areas on the surface of the antigen known as antigenic determinants. Once the specific antigenic determinant is recognized, the antibody will bind to the determinant. The antigen is tagged as an intruder and labeled for destruction by other immune cells. Antibodies protect against substances prior to cell infection. Antibodies are produced by a type of white blood cell called a B cell (B lymphocyte). B cells develop from stem cells in bone marrow. When B cells become activated due to the presence of a particular antigen, they develop into cells called plasma"}, {"url": "http://www.answers.com/Q/What_produces_antibodies", "passage_text": "Antibodies are manufactured by the lymph system. Antibodies are specialized proteins that the body produces in response to invasion by a foreign substance. The process of anti … body formation begins when an antigen stimulates specialized lymphocytes, called B cells, into action. Mahesh Ramaswamy. The white blood cells then produce antibodies to match the shape of the antigens.   The antigens on the surface of pathogenic cells are different from those on the surface of your own cells."}, {"url": "https://en.wikipedia.org/wiki/Autoantibody", "passage_text": "An autoantibody is an antibody (a type of protein) produced by the immune system that is directed against one or more of the individual's own proteins. Antibodies are produced by B cells in two ways: (i) randomly, and (ii) in response to a foreign protein or substance within the body. Initially, one B cell produces one specific kind of antibody"}, {"url": "https://en.wikipedia.org/wiki/Antibody", "passage_text": "Each antibody binds to a specific antigen; an interaction similar to a lock and key. An antibody (Ab), also known as an immunoglobulin (Ig), is a large, Y-shape protein produced by plasma cells that is used by the immune system to identify and neutralize pathogens such as bacteria and viruses. The antibody recognizes a unique molecule of the harmful agent, called an antigen, via the variable region. Though strictly speaking, an antibody is not the same as an immunoglobulin; B cells can produce two types of immunoglobulins-surface immunoglobulins, which are B cell receptors; and secreted immunoglobulins, which are antibodies. So antibodies are one of two classes of immunoglobulins."}, {"url": "http://www.answers.com/Q/What_produces_antibodies", "passage_text": "Antibodies are specialized proteins that the body produces in response to invasion by a foreign substance. The process of anti … body formation begins when an antigen stimulates specialized lymphocytes, called B cells, into action. The white blood cells then produce antibodies to match the shape of the antigens.   The antigens on the surface of pathogenic cells are different from those on the surface of your own cells."}]