[{"url": "http://www.bmyers.com/public/938.cfm", "passage_text": "Starting with the right cell phone. To connect to the internet with a cell phone, you need a cell phone that: 1  Is either Dual Mode or Tri Mode-To connect to the internet, you need a cell phone that works in digital format. 2  A dual mode phone is all digital and operates on two digital networks (1900 MHz and 800 MHz). Connecting your laptop to the internet using your cell phone can be surprisingly easy-if you have the right phone, the right cell service provider, and a simple connection cable. The good news is that the three major cell phone carriers in the US all make it relatively easy to connect."}, {"url": "https://community.verizonwireless.com/thread/776023", "passage_text": "Can't connect to my home wifi. Just switched to Verizon from AT&T, and I am having some problems. I am trying to access my home wifi, and my Razr maxx won't connect! I am able to connect with my other devices without any problems. Here's what happens when I try to connect: It says Obtaining IP address.... Then, after a while, it says: Remembered, secured with WPA/WPA2PSK."}, {"url": "http://www.bmyers.com/public/938print.cfm", "passage_text": "Connecting the cell phone and laptop to the internet. Connecting your laptop to the internet using your cell phone can be surprisingly easy-if you have the right phone, the right cell service provider, and a simple connection cable. The good news is that the three major cell phone carriers in the US all make it relatively easy to connect."}, {"url": "http://internethelp.centurylink.com/internethelp/wireless-setup-phones.html", "passage_text": "If you are uncertain how to connect to a wireless network on your mobile phone, please consult its documentation, user manual or call support (usually 611) from your cell phone for instructions on how to connect to the internet using Wi-Fi on your cell phone. "}, {"url": "http://www.techrepublic.com/blog/smartphones/troubleshoot-wi-fi-connections-on-your-android-phone/", "passage_text": "When you need to connect to a wireless network from your Android phone, you can usually open the settings, select the network, and you're off and running. In the rare instances when wireless doesn't cooperate, there are tricks you can use to troubleshoot the issue. "}, {"url": "http://www.bmyers.com/public/938.cfm", "passage_text": "Connecting the cell phone and laptop to the internet. Connecting your laptop to the internet using your cell phone can be surprisingly easy-if you have the right phone, the right cell service provider, and a simple connection cable. The good news is that the three major cell phone carriers in the US all make it relatively easy to connect."}, {"url": "http://www.youtube.com/watch?v=8XurHgNoZhs", "passage_text": "Watch More: http://www.youtube.com/ehowtech. Connecting a phone to the internet using the Wi-Fi wireless can make life a lot easier for most cell phone users. Start by going into the settings menu, then select Wi-Fi and from there it's time to find the network to join. Make sure the password is known before trying to join any network."}, {"url": "https://community.verizonwireless.com/thread/458498/", "passage_text": "When on WiFi, phone cannot connect to internet. I don't know if this is a phone issue or something with my home WiFi. I am using a password on my router, so I don't believe I'm connecting to someone else's router. Also, I've connected using the WPS button, which again leads me to believe I'm connecting to my own router. Verizon Wireless Community. Please enter a title. You can not post a blank message. Please type your message and try again."}, {"url": "http://www.pcmag.com/article2/0,2817,2402566,00.asp", "passage_text": "Once you've told your phone how to connect to your Wi-Fi networks at home, work, and school, you'll have covered a lot of your day. Advanced Wi-Fi for Android users Two third-party apps take things a step farther: DeviceScape's DataBooster and Boingo Wi-Finder, both of which are available for free from Google Play. Once you've connected to a network once, your phone should automatically reconnect to that same network. Sometimes it won't. If it doesn't, reconnect by hand. Remember, every byte you use of Wi-Fi is a byte you're saving from your mobile data plan."}, {"url": "http://www.bmyers.com/public/938print.cfm", "passage_text": "Starting with the right cell phone. To connect to the internet with a cell phone, you need a cell phone that: 1  Is either Dual Mode or Tri Mode-To connect to the internet, you need a cell phone that works in digital format. 2  A dual mode phone is all digital and operates on two digital networks (1900 MHz and 800 MHz). Connecting your laptop to the internet using your cell phone can be surprisingly easy-if you have the right phone, the right cell service provider, and a simple connection cable. The good news is that the three major cell phone carriers in the US all make it relatively easy to connect."}]