[{"url": "http://www.virtualweberbullet.com/meatrest.html", "passage_text": "Just a 10 minute rest resulted in a 60% decrease in lost liquid, and a 40 minute rest resulted in a 90% decrease of lost liquid and even after 40 minutes, the internal meat temperature was still hot enough to serve. "}, {"url": "http://www.ehow.com/decision_6886800_long-steaks-rest-after-cooking_.html", "passage_text": "Five to Ten Minutes. Other chefs suggest letting a steak rest for five to ten minutes, to make sure the juices have time to redistribute throughout the meat and are not lost on the plate when the steak is cut. A drawback of resting the meat longer, however, is that the steak can get cold before serving. Bottom Line. The cooking and resting time of a steak largely depends on its thickness. According to grilling enthusiast Chris Allingham, thinner steaks may need to rest for five minutes, while a thicker steak should be rested longer."}, {"url": "http://www.ehow.com/decision_6886800_long-steaks-rest-after-cooking_.html", "passage_text": "Other chefs suggest letting a steak rest for five to ten minutes, to make sure the juices have time to redistribute throughout the meat and are not lost on the plate when the steak is cut. Bottom Line. The cooking and resting time of a steak largely depends on its thickness. According to grilling enthusiast Chris Allingham, thinner steaks may need to rest for five minutes, while a thicker steak should be rested longer."}, {"url": "http://culinaryarts.about.com/od/beefporkothermeats/a/Resting-A-Steak.htm", "passage_text": "Guidelines for Resting Steaks. A useful guideline for resting a steak is to let it rest for approximately as long as you cooked it. Another guideline is to let it rest for five minutes for every inch of thickness. (The perfect steak is 1½ inches thick.) Some cooks talk about resting meats 10 minutes for each pound of meat. As you can see, all of these guidelines are basically saying the same thing"}, {"url": "https://answers.yahoo.com/question/index?qid=20090604153708AADQ6mE", "passage_text": "you should let a steak rest AFTER cooking it not before and as for seasoning only do the salt and pepper just before cooking not before as it draws out the moisture in the meat. Lessels28 · 6 years ago. Thumbs up. Now I do it all the time and my steaks or meat come out great. Resting the meat refers to when you let the juices of the meat redistribute in the meat itself before serving. If you cut into it right after cooking, the juices will run all over the plate and you will end up with dry meat."}, {"url": "http://cooking.stackexchange.com/questions/13814/how-long-can-i-let-a-steak-rest-after-seasoning-and-before-cooking", "passage_text": "Once the steak has reached room temperature, about 20-30 minutes, it should be cooked. You can put the rub on the steak and refrigerate it for several hours, or overnight, but it should be rest 20-30 minutes before cooking. No longer than that. share | improve this answer. answered Aug 15 '13 at 19:41."}, {"url": "http://amazingribs.com/tips_and_technique/mythbusting_resting_meat.html", "passage_text": "He got about two tablespoons. He let the other steak rest for five minutes and then gave it the Otto treatment. Only a few drops emerge. So the difference was a 1/2 an ounce by volume (also about 1/2 ounce by weight) from a whole steak that probably weighs 10 to 12 ounces total. Depending on how hot and how long you cook, there might be 10 to 25% water loss, mostly due to evaporation and dripping. Let's call it 15%. So a properly cooked steak is down to about 60% water, but most of it cannot escape when the meat is cut because it is bound by proteins and held by capillary action."}, {"url": "http://www.seriouseats.com/2013/06/the-food-lab-7-old-wives-tales-about-cooking-steak.html", "passage_text": "The steak started at 38°F and the ambient air in my kitchen was at 70°F. I then took temperature readings of its core every ten minutes. After the first 20 minutes—the time that many chefs and books will recommend you let a steak rest at room temperature—the center of the steak had risen to a whopping 39.8°F. Not even a full two degrees. So I let it go longer. 30 minutes. 50 minutes. 1 hour and 20 minutes. After 1 hour and 50 minutes, the steak was up to 49.6°F in the center. Still colder than the cold water comes out of my tap in the summer, and only about 13% closer to its target temperature of a medium-rare 130°F than the steak in the fridge"}, {"url": "http://culinaryarts.about.com/od/beefporkothermeats/a/Resting-A-Steak.htm", "passage_text": "Rest your steak for five to seven minutes before slicing it. The way I like to rest my steaks is to take the steaks off the grill, transfer them to a cutting board and then tent them under a big piece of foil. You can then use these five to seven minutes to prepare a sauce, make up a salad, get your baked potatoes ready, set the table or whatever. Another guideline is to let it rest for five minutes for every inch of thickness. (The perfect steak is 1½ inches thick.) Some cooks talk about resting meats 10 minutes for each pound of meat."}]