[{"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00081", "passage_text": "Beta thalassemia is caused by abnormal or missing genes that affect the beta chain of the hemoglobin molecule. There is one beta chain gene on each #11 chromosome, and a total of two #11 chromosomes per person, one inherited from each parent. Beta thalassemia major (Cooley’s anemia) . Both #11 chromosomes that an affected person has inherited are abnormal. Both of the chromosomes have abnormal genes that do not direct the body to make normal beta chains or normal amounts of beta chains."}, {"url": "http://www.webmd.com/a-to-z-guides/thalassemia-topic-overview", "passage_text": "Thalassemia (say thal-uh-SEE-mee-uh) is an inherited blood disorder that causes your body to make less hemoglobin or abnormal hemoglobin. Hemoglobin helps red blood cells spread oxygen through your body. Low levels of hemoglobin may cause anemia, an illness that makes you feel weak and tired. Beta thalassemia occurs when one or both of the two genes that make beta-globin don't work or only partly work as they should. 1  If you have one damaged gene, you may have mild anemia and probably won't need treatment. 2  This is called beta thalassemia minor or beta thalassemia trait."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/hematology_and_blood_disorders/beta_thalassemia_cooleys_anemia_85,P00081/", "passage_text": "Thalassemia is an inherited disorder that affects the production of normal hemoglobin (a type of iron-rich protein in red blood cells that carries oxygen to the tissues of the body). Thalassemia includes a number of different forms of anemia, which are classified as either alpha thalassemias or beta thalasemias. Beta thalassemia major (Cooley’s anemia) . Both #11 chromosomes that an affected person has inherited are abnormal. Both of the chromosomes have abnormal genes that do not direct the body to make normal beta chains or normal amounts of beta chains."}, {"url": "https://en.wikipedia.org/wiki/Beta-thalassemia", "passage_text": "(Redirected from Beta-thalassemia). Beta thalassemias (β thalassemias) are a group of inherited blood disorders. They are caused by reduced or absent synthesis of the beta chains of hemoglobin that result in variable outcomes ranging from severe anemia to clinically asymptomatic individuals. Beta thalassemia (β thalassemia) is a form of thalassemia caused by mutations in the HBB gene on chromosome 11, inherited in an autosomal recessive fashion. The severity of the disease depends on the nature of the mutation. HBB blockage over time leads to decreased Beta-chain synthesis."}, {"url": "http://www.mayoclinic.org/diseases-conditions/thalassemia/basics/definition/CON-20030316", "passage_text": "Definition. Thalassemia (thal-uh-SEE-me-uh) is an inherited blood disorder characterized by less hemoglobin and fewer red blood cells in your body than normal. Several types of thalassemia exist, including alpha-thalassemia, beta-thalassemia intermedia, Cooley's anemia and Mediterranean anemia"}, {"url": "http://ghr.nlm.nih.gov/condition/beta-thalassemia", "passage_text": "Beta thalassemia is a blood disorder that reduces the production of hemoglobin. Hemoglobin is the iron-containing protein in red blood cells that carries oxygen to cells throughout the body. In people with beta thalassemia, low levels of hemoglobin lead to a lack of oxygen in many parts of the body. Affected individuals also have a shortage of red blood cells (anemia), which can cause pale skin, weakness, fatigue, and more serious complications. Beta thalassemia is classified into two types depending on the severity of symptoms: thalassemia major (also known as Cooley's anemia) and thalassemia intermedia. Of the two types, thalassemia major is more severe. The signs and symptoms of thalassemia major appear within the first 2 years of life."}, {"url": "http://www.healthline.com/health/thalassemia", "passage_text": "Thalassemia is a blood disorder passed down through families (inherited) in which the body makes an abnormal form of hemoglobin, the protein in red blood cells that carries oxygen. The disorder results in excessive destruction of red blood cells, which leads to anemia. "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00081", "passage_text": "Thalassemia is an inherited disorder that affects the production of normal hemoglobin (a type of iron-rich protein in red blood cells that carries oxygen to the tissues of the body). Beta thalassemia major (Cooley’s anemia) . Both #11 chromosomes that an affected person has inherited are abnormal. Both of the chromosomes have abnormal genes that do not direct the body to make normal beta chains or normal amounts of beta chains."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/hematology_and_blood_disorders/beta_thalassemia_cooleys_anemia_85,P00081/", "passage_text": "Beta thalassemia is caused by abnormal or missing genes that affect the beta chain of the hemoglobin molecule. There is one beta chain gene on each #11 chromosome, and a total of two #11 chromosomes per person, one inherited from each parent. Beta thalassemia major (Cooley’s anemia) . Both #11 chromosomes that an affected person has inherited are abnormal. Both of the chromosomes have abnormal genes that do not direct the body to make normal beta chains or normal amounts of beta chains."}]