[{"url": "http://www.nytimes.com/2012/03/06/health/rise-in-preschool-cavities-prompts-anesthesia-use.html", "passage_text": "The cost to parents for dental restoration under general anesthesia for a child ranges from $2,000 to $5,000 or more, depending on insurance coverage and the amount of work, several dentists said. "}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 Placing an abutment and a dental crown on a single implant typically adds $500-$3,000 to the cost of just the implant, for a total of $1,500-$13,000 or more. 1 Another reader was quoted $75,000 by a private dentist but paid about $20,000 to have the work done at the University of Medicine and Dentistry in New Jersey. 2  The National Institute of Dental and Craniofacial Research provides tips for finding low-cost dental care."}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 Two to six implants topped with a partial or full-mouth dental bridge can cost $3,500-$30,000 or more, depending on the number of implants, bridge size and materials, and any other needed procedures. 1 Another reader was quoted $75,000 by a private dentist but paid about $20,000 to have the work done at the University of Medicine and Dentistry in New Jersey. 2  The National Institute of Dental and Craniofacial Research provides tips for finding low-cost dental care."}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 A single implant typically costs $2,400-$3,000, but can be $4,000-$10,000 or more if additional procedures like extractions, bone grafts, 2  Placing an abutment and a dental crown on a single implant typically adds $500-$3,000 to the cost of just the implant, for a total of $1,500-$13,000 or more. 1 Another reader was quoted $75,000 by a private dentist but paid about $20,000 to have the work done at the University of Medicine and Dentistry in New Jersey. 2  The National Institute of Dental and Craniofacial Research provides tips for finding low-cost dental care."}, {"url": "http://beautysetter.com/dental-implant-cost", "passage_text": "$ 5 300. India has the lowest average cost of tooth implant at $600, with lowest price at $130; while Singapore is the most expensive one among the countries at an average of $3 700. The cost of dental implants is an important factor to take into consideration. Dental implants are quite expensive."}, {"url": "http://www.truedentaldiscounts.com/dental-procedures/discount-oral-surgery.php", "passage_text": "To find the best rates for oral examinations, patients usually get quotes from several dentists, asking for a comprehensive breakdown of the fees and the estimated total costs. The average cost for a oral surgery is between $149 and $240+ . However, with a discount dental plan, you could save on average 15% - 50% for the same procedure. Costs will vary depending on where you live and your need"}, {"url": "http://www.bracesinfo.com/dentalcosts/", "passage_text": "By using dental inflation, us average price and dental geographic multiplier, we are able to price common dental services such as Dental Implant, How Much Do Braces Cost, Fillings, Veneers, Oral Surgery and more by major city. Learn more about the methodology of the calculation. The Dental Cost for June 2015 have been updated with the latest Consumer Price Index for All Urban Consumers (CPI-U): U.S. city average, by expenditure category and commodity and service group: Dental Services. Calculate the average cost and price of dental care in your hometown."}, {"url": "http://www.bracesinfo.com/dentalcosts/", "passage_text": "2014 Dental Cost Calculator-Average Pricing Of Dental Care. New! The Dental Cost for June 2015 have been updated with the latest Consumer Price Index for All Urban Consumers (CPI-U): U.S. city average, by expenditure category and commodity and service group: Dental Services. Calculate the average cost and price of dental care in your hometown."}, {"url": "http://beautysetter.com/dental-implant-cost", "passage_text": "As an example, the cost of dental implant in Cupertino, California is about $ 6,500, while a dentist in Cleveland, Ohio said that single tooth implant procedure that includes surgery and restoration costs $3,000 to $4000. This accounts for almost 100% savings if you have your dental implant in Cleveland. India has the lowest average cost of tooth implant at $600, with lowest price at $130; while Singapore is the most expensive one among the countries at an average of $3 700. The cost of dental implants is an important factor to take into consideration. Dental implants are quite expensive."}, {"url": "http://health.costhelper.com/dental-implant.html", "passage_text": "1 Two to six implants with a removable denture plate can cost $3,500-$30,000 or more depending on the number and type of implants (mini-implants are less expensive), denture materials (in some cases an existing denture plate can be adapted for use with implants) and any other procedures needed. 1 Another reader was quoted $75,000 by a private dentist but paid about $20,000 to have the work done at the University of Medicine and Dentistry in New Jersey. 2  The National Institute of Dental and Craniofacial Research provides tips for finding low-cost dental care."}]