[{"url": "http://www.sheknows.com/baby-names/name/nairi", "passage_text": "The name Nairi is an Armenian baby name. In Armenian the meaning of the name Nairi is: From Armenia. SoulUrge Number: 1. Expression Number: 6. People with this name have a deep inner desire to use their abilities in leadership, and to have personal independence. They would rather focus on large, important issues, and delegate the details. for harmony and balance in their lives, and respond positively to beautiful things"}, {"url": "http://www.babynology.com/meaning-nairi-f4.html", "passage_text": "Another thing to keep in mind when naming your baby is whether the name is currently popular and trendy or not? Names like Calista and Leonardo are of all the rage, thanks to Ally McBeal-the hit TV series and Titanic-the movie. New born don’t have the reflex to blink. Correctly said, new born babies don’t have very good reflex actions. An example of the same is that they don’t blink their eyes very often as adults do, this may be the reason you will always lose in the eye blink game."}, {"url": "http://www.meaning-of-names.com/armenian-names/nairi.asp", "passage_text": "Meaning of Nairi. Armenian name. In Armenian, the name Nairi means-land of canyons.The name Nairi originated as an Armenian name. The name Nairi is most often used as a girl name or female name. Armenian Name Meaning-land of canyons. Origin-Armenia."}, {"url": "http://www.ourbabynamer.com/meaning-of-Nairi.html", "passage_text": "Nairi is generally used as a girl's name. It consists of 5 letters and 2 syllables and is pronounced Nai-ri. In the U.S. in 2014, it ranked 14026 in baby name popularity for girls with 7 occurrences. Less than 5 boys were given the name. View the Nairi Name Popularity Page to see how the popularity trend for Nairi has changed since 1880, or to compare the popularity of Nairi to other names. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own. As you see it can go both ways, so just keep this point in mind as you examine the different possibilities."}, {"url": "http://www.babynamespedia.com/meaning/Nairi", "passage_text": "[ syll. nai-ri, na-iri ] The baby girl name Nairi is pronounced as N EH-Riy †. Nairi is of Armenian origin. The meaning of the name is 'land of rivers'. Variations of Nairi include Naira, Naire, Nairea, Nairee, Nairey, Nairie, Nairy, and Nayra."}, {"url": "http://www.ourbabynamer.com/meaning-of-Nairi.html", "passage_text": "Last year this name was ranked as one of the top 1000 most popular names within its gender. Keep in mind how popular a name is. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own. As you see it can go both ways, so just keep this point in mind as you examine the different possibilities."}, {"url": "http://www.babynamespedia.com/meaning/Nairi", "passage_text": "Nairi is rare as a baby girl name. It is not listed in the top 1000. Baby names that sound like Nairi include Nairee, Nairey, Nairie, Neri, Nara, Nari, Nera, Ngaire, Niree, Nora, Norah, Noreh, Norey, Nori, Norrie, Norry, Nory, Noura, Nura, and Nuray. Variations of Nairi include Naira, Naire, Nairea, Nairee, Nairey, Nairie, Nairy, and Nayra."}, {"url": "http://www.babynology.com/meaning-nairi-f4.html", "passage_text": "Foetus responds. Absolutely, everyone knows that the foetus present inside the womb of the mother can hear. But something which you did not know is that foetus responds to sound properly i.e. in a similar manner as they respond to any kind of internal stimulation. New born don’t have the reflex to blink. Correctly said, new born babies don’t have very good reflex actions. An example of the same is that they don’t blink their eyes very often as adults do, this may be the reason you will always lose in the eye blink game."}, {"url": "http://www.babynology.com/meaning-nairi-f4.html", "passage_text": "List of Armenian baby names, Armenian baby boy names (male), girl names (female) & Armenian names meanings has been compiled from various resources. Please use this list of Armenian baby names only for reference/idea to name your kid/child. New born don’t have the reflex to blink. Correctly said, new born babies don’t have very good reflex actions. An example of the same is that they don’t blink their eyes very often as adults do, this may be the reason you will always lose in the eye blink game."}]