[{"url": "http://medical-dictionary.thefreedictionary.com/spinal+reflex", "passage_text": "The knee jerk is an example of the simplest type of reflex. When the knee is tapped, the nerve that receives this stimulus sends an impulse to the spinal cord, where it is relayed to a motor nerve. This causes the quadriceps muscle at the front of the thigh to contract and jerk the leg up. This reflex, or simple reflex arc, involves only two nerves and one synapse. tonic neck reflex extension of the upper limb and sometimes the lower limb on the side to which the head is forcibly turned, with flexion of the contralateral limbs; seen normally in the newborn. If it persists into the second or third year of life, it indicates a neurologic disorder."}, {"url": "https://en.wikipedia.org/wiki/Withdrawal_reflex", "passage_text": "Once a danger receptor (called 'nociceptor') has been stimulated, the signal travels via the sensory nerve to the posterior horn of the spinal cord. The nerve synapses with ipsilateral motor neurons that exit the anterior horn of the spinal cord and work to pull the injured body part away from danger within 0.5 seconds. "}, {"url": "http://link.springer.com/article/10.1007%2Fs00221-012-3032-9", "passage_text": "Abstract. Homonymous and heteronymous reflex connections of the paraspinal muscles were investigated by the application of a tap to the muscle bellies of the lumbar multifidus and iliocostalis lumborum muscles and observation of surface electromyographic responses in the same muscles on both sides of the trunk."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_ipsilateral_and_contralateral_reflexes", "passage_text": "In an ipsilateral reflex, the response is on the same side of the body as the stimulus. In a contralateral reflex, the response is on the opposide side of the body as the stim … ulus. + 11 others found this useful. Eric Chagnon. The patellar reflex is ipsilateral. If the stimulus is applied to left knee cap, the left knee responds. On the other hand, if the right knee were to respond to a left knee st … imulus, the response would be considered contralateral."}, {"url": "https://quizlet.com/2235943/ch-13-spinal-cord-anatomy-flash-cards/", "passage_text": "Describe the components and operation of the flexor reflex. encounter pain (step on a tack), up leg and back, spinal nerve, spinal cord by dorsal side, axon into gray matter, synapse with interneurons, white matter, spinal cord segments, different levels of motor neurons, down spinal cord, down leg, muscles contract."}, {"url": "http://neuroscience.uth.tmc.edu/s3/chapter02.html", "passage_text": "As a result of this reflex, activation of the Ib afferent causes the muscle to cease contraction, as the alpha motor neuron becomes inhibited. Because this reflex contains an interneuron between the sensory afferent and the motor neuron, it is an example of a disynaptic reflex. Thus, when a muscle spindle is stretched and the stretch reflex is activated, the opposing muscle group must be inhibited to prevent it from working against the resulting contraction of the homonymous muscle (Figure 2.2). This inhibition is accomplished by an inhibitory interneuron in the spinal cord."}, {"url": "http://link.springer.com/article/10.1007%2Fs00221-012-3032-9", "passage_text": "Short latency heteronymous excitatory reflex connections were observed in muscles on the ipsilateral side, whilst reflex responses in the contralateral muscles were inhibitory in response to the same stimulus. Homonymous and heteronymous reflex connections of the paraspinal muscles were investigated by the application of a tap to the muscle bellies of the lumbar multifidus and iliocostalis lumborum muscles and observation of surface electromyographic responses in the same muscles on both sides of the trunk."}, {"url": "http://www.apsubiology.org/anatomy/2010/2010_Exam_Reviews/Exam_4_Review/CH_13_Proprioception_and_Types_of_Reflexes.htm", "passage_text": "tendon reflex-A type of monosynaptic ipsilateral segmental stretch reflex action in which a muscle is made to contract by a blow upon its tendon, e.g., the patellar reflex, the Achilles tendon reflex, the biceps reflex; its absence is generally a sign of disease. "}, {"url": "http://medical-dictionary.thefreedictionary.com/spinal+reflex", "passage_text": "Nerve pathway of a simple reflex. When the sensory nerve ending is stimulated, a nerve impulse travels along a sensory (afferent) neuron to the spinal cord. Here an association neuron transfers the impulse to a motor (efferent) neuron. tonic neck reflex extension of the upper limb and sometimes the lower limb on the side to which the head is forcibly turned, with flexion of the contralateral limbs; seen normally in the newborn. If it persists into the second or third year of life, it indicates a neurologic disorder."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3324696/", "passage_text": "The aim of the present study was, therefore, to investigate the reflex connectivity of the paraspinal muscles by the application of a tap to individual muscles and the observation of reflexes both homonymously and heteronymously on ipsilateral and contralateral sides of the trunk. Inhibitory responses in contralateral muscles. In contrast to the excitatory responses in ipsilateral paraspinal muscles, those observed in the contralateral muscles were inhibitory (Figs. 4, ​,5).5). The latencies for the contralateral inhibitory reflexes ranged from 20.9 ± 0.5 to 22.6 ± 1.4 ms (Fig."}]