[{"url": "http://medical-dictionary.thefreedictionary.com/infant", "passage_text": "See also growth. large-for-gestational-age infant a preterm, term, or postterm infant who is above the 90th percentile for gestational age in head circumference, body weight, or length. low-birth-weight infant one that weighs less than 2500 grams at birth. n/adj a child who is in the earliest stage of extrauterine life, a time extending from the first month after birth to approximately 12 months of age, when the baby is able to assume an erect posture; some extend the period to 24 months of age."}, {"url": "http://www.who.int/topics/infant_newborn/en/", "passage_text": "A newborn infant, or neonate, is a child under 28 days of age. During these first 28 days of life, the child is at highest risk of dying. It is thus crucial that appropriate feeding and care are provided during this period, both to improve the child’s chances of survival and to lay the foundations for a healthy life. "}, {"url": "http://www.who.int/mediacentre/factsheets/fs363/en/", "passage_text": "1 Every year, an estimated 15 million babies are born preterm (before 37 completed weeks of gestation), and this number is rising. 2  Preterm birth complications are the leading cause of death among children under 5 years of age, responsible for nearly 1 million deaths in 2013. An estimated 15 million babies are born too early every year. That is more than 1 in 10 babies. Almost 1 million children die each year due to complications of preterm birth. Many survivors face a lifetime of disability, including learning disabilities and visual and hearing problems."}, {"url": "http://medical-dictionary.thefreedictionary.com/infant", "passage_text": "small-for-gestational-age infant a preterm, term, or postterm infant who is below the 10th percentile for gestational age in head circumference, body weight, or length. term infant one born at a gestational age of 37 to 42 completed weeks (259 to 293 completed days). n/adj a child who is in the earliest stage of extrauterine life, a time extending from the first month after birth to approximately 12 months of age, when the baby is able to assume an erect posture; some extend the period to 24 months of age."}, {"url": "http://medical-dictionary.thefreedictionary.com/infant", "passage_text": "infant, n/adj a child who is in the earliest stage of extrauterine life, a time extending from the first month after birth to approximately 12 months of age, when the baby is able to assume an erect posture; some extend the period to 24 months of age."}, {"url": "http://legal-dictionary.thefreedictionary.com/Infants", "passage_text": "Common law held an infant, also called a minor or child, to be a person less than 21 years old. Currently, most state statutes define the age of majority to be 18. "}, {"url": "http://legal-dictionary.thefreedictionary.com/Infant", "passage_text": "infant. noun baby, child, innocent, juvenile, little one, minor, nursling, one who has not come of age, one who has not reached his majority, person under the age of majority, person under 18 years old, person who is not of full age, toddler, tot, young person, youngster, youth."}, {"url": "http://www.businessdictionary.com/definition/infant.html", "passage_text": "Definitions (3). 1.Air travel: Baby under two years of age at the time the journey commences. Infants fly usually free (particularly on domestic flights) if they do not occupy a seat, and where each infant is accompanied by a passenger paying adult fare. 2. Legal: Alternative UK term for minor."}, {"url": "http://medical-dictionary.thefreedictionary.com/newborn", "passage_text": "Etymology: AS, niwe, new, boren, to bear. a human infant from the time of birth through the 28th day of life. At birth, the gestational age and birth weight are assessed and the newborn classified accordingly, for example, large for gestational age, preterm (premature), or low birth weight. Also called neonate, newborn infant. (nē'ō-nā'tăl)."}, {"url": "http://babyproducts.about.com/od/faqs/f/babyfaq.htm", "passage_text": "Answer: On this site, the word baby means any child from birth to age 4. Newborn refers to babies under three months of age. Infants are babies from three months to one year old. Toddlers are babies from one year to four years of age. "}]