[{"url": "http://www.conwalinstitute.edu.au/courses/community-services/diploma-of-early-childhood-education-and-care", "passage_text": "The Diploma of Early Childhood Education and Care is the most current and practical qualification available for the Australian childcare industry. Graduates acquire the skills necessary to work in all aspects of early childhood care including day care, preschool and family day care centres."}, {"url": "http://www.senecacollege.ca/fulltime/ECYA.html", "passage_text": "Your Career. Accelerate your career with our three-semester diploma program in Early Childhood Education. Upon graduation, you'll be prepared for a fulfilling career working with children from infancy to 12 years. If you've completed an undergraduate degree from a postsecondary institution in Ontario or have a degree evaluated for Canadian equivalency, you may be eligible to earn your accelerated Early Childhood Education diploma in three semesters with ECYA."}, {"url": "http://www.anzukearlychildhood.com.au/certificate-3-and-diploma-in-children-s-services", "passage_text": "1 A certificate 3 in Children's Service's can be completed in as little as a few weeks plus a minimum of 120 hours of practical experience. 2  A Diploma in Children's Services can be completed in as little as 12 - 18 months and can be completed on saturdays. Why you'll want to study your Certificate 3 or Diploma in Children's Services. In order to work in the Early Childhood Sector or Out of School Hours Care you'll need to complete a Certificate 3 in Children's Services or higher."}, {"url": "http://study.com/articles/How_Long_is_a_Masters_in_Early_Childhood_Education_Program.html", "passage_text": "Accelerated. It may be possible to earn a master's degree in early childhood education in less than two years by entering an accelerated program. An accelerated program can possibly be completed in one year, but certainly in less than two years. Jobs and Salary Info for a Masters in Early Childhood Education. Master's degrees in early childhood education typically prepare students to work with children from infancy to third grade in..."}, {"url": "http://study.com/articles/How_Long_is_a_Masters_in_Early_Childhood_Education_Program.html", "passage_text": "It will take longer if a student decides to attend part-time, due to the number of credits taken. A master's degree program in early childhood education is designed to prepare certified teachers and other applicants interested in entering the field to work with children from birth to eight years old. Jobs and Salary Info for a Masters in Early Childhood Education. Master's degrees in early childhood education typically prepare students to work with children from infancy to third grade in..."}, {"url": "http://www.early-childhood-education-degrees.com/early-childhood-education-certificates/", "passage_text": "Early Childhood Education Certificates. If you love working with children, an Early Childhood Education Certificate might be the natural next step in your career. Besides furthering your education, a certificate might get you a raise, open new career doors, and put you one step closer to a degree. The length of the course will vary greatly from school to school. Some programs allow you to earn your certificate in as little as 6 months while others take two years. Don’t think that a 6 month program will be easier; you should have the same amount of work, just less time to complete it."}, {"url": "http://www.excite.com/education/education-teaching/early-childhood-education", "passage_text": "A: There are number of different programs offered in Early Childhood Education. These include one year certificate programs, two year associate's degree, four year bachelor's degree, and two year master's degree in early childhood education. Many other specializations are also offered in the field. However, the online Bachelor of Arts in Early Childhood Education is a self paced program,and is dependent on the students' speed. Hence, there is no specified time for the online degree. It can be completed before or after the average time taken to complete the degree."}, {"url": "http://laniertech.edu/AcademicPrograms/LTCPrograms.aspx?id=15", "passage_text": "Also how many classes are taken each semester? You can take up to 18 hours, but be sure not to overload your schedule; you want to be successful. We do have certificate programs which can be completed in one to three semesters. The diploma is 53 hours and the degree requires 72 hours for graduation. Most of the certificate and diploma classes can be transferred to the degree.Can I become an elementary school teacher with this degree?To become an elementary school teacher, you need a bachelor's degree and a teaching certificate."}, {"url": "http://study.com/articles/How_Long_is_a_Masters_in_Early_Childhood_Education_Program.html", "passage_text": "Master's degrees in early childhood education vary in length depending upon the actual program chosen and the number of credit hours needed to fulfill degree requirements. Master's programs generally take two years to complete if the student attends full-time. Jobs and Salary Info for a Masters in Early Childhood Education. Master's degrees in early childhood education typically prepare students to work with children from infancy to third grade in..."}]