[{"url": "https://www.irs.gov/pub/irs-regs/per_diem_faq_%26_a_v1.pdf", "passage_text": "What is the federal per diem rate for my area?Publication 1542, Per Diem Rates provides the rates for all continental U.S. areas.Return to top 3. What does per diem cover? There is a per diem rate for combined lodging and meal costs, and a per diem rate for meal costs alone. An employer mayuse either per diem method for reimbursing employee travel expenses. A self-employed person can only use per diem forthe meal costs.Return to top 4."}, {"url": "https://www.doi.gov/pfm/travel/Per-Diem-Expenses", "passage_text": "301-11.4 - When are my temporary duty travel reimbursements considered taxable income? When you receive subsistence payments (per diem) for travel of 24 hours or less that does not require lodging and all per diem payments for TDY travel that is expected to last for 1 year or more. You will not receive per diem if your temporary duty is within 50 miles of your duty station or your residence, unless the travel conditions are so severe returning to your residence would endanger your health and safety or you are attending a conference."}, {"url": "https://www.irs.gov/pub/irs-regs/perdiemfaq&a.prn.pdf", "passage_text": "There is a per diem rate for combined lodging and meal costs, and a per diem rate for meal costs alone. Anemployer may use either per diem method for reimbursing employee travel expenses. A self-employed personcan only use per diem for the meal costs. "}, {"url": "https://en.wikipedia.org/wiki/Per_diem", "passage_text": "Unsourced material may be challenged and removed. (April 2007). Per diem (Latin for per day or for each day) is a daily allowance for expenses—a specific amount of money an organization gives an individual, often an employee, per day to cover living expenses when traveling for work. A per diem can include part or all of the expenses incurred, for example it may exclude accommodation (for which reimbursement may be available on presentation of receipts) and only cover meals. Per diem is also used as an adjective and an adverb."}, {"url": "https://www.irs.gov/pub/irs-regs/per_diem_faq_%26_a_v1.pdf", "passage_text": "A per diem rate can be used for the combined costs of Lodging and M&IE. However, the rates vary depending onlocation. Use the rate for the area where your employee spends the night. The rates for the different cities are available inIRS Publication 1542 .Return to top 13. There is a per diem rate for combined lodging and meal costs, and a per diem rate for meal costs alone. An employer mayuse either per diem method for reimbursing employee travel expenses."}, {"url": "http://www.gsa.gov/portal/content/104208", "passage_text": "1 For federal employees, the Federal Travel Regulation (FTR) does not make a provision for “mixing and matching” reimbursement rates. 2  The lodging per diem rates are a maximum amount; the traveler only receives actual lodging costs up to that maximum rate. 1 If the city is not listed, but the county is, then the per diem rate is the rate for that entire county. 2  If the city and the county are not listed, then that area receives the standard CONUS location rate, which is currently $89 for lodging and $51 for meals and incidental expenses."}, {"url": "http://aviationtaxglossary.com/expiration_date/", "passage_text": "The expiration date is a date that applies to per diem rates, which is important when calculating a pilot or flight attendant's M&IE expense. The expiration date is the last date that CONUS or OCONUS per diem rates are valid. It is imporant to review the effective date, the expiration date, the seasonal start date, and the seasonal end date for any layover locations used in a per diem calculation. Often, the expiration date for per diem rates occurs on October 1st. That date marks a time called the transition period, which is the last three months of a calendar year. Help your facebook friends save money by recommending us! Please refer us"}, {"url": "http://en.allexperts.com/q/Tax-Law-Questions-932/2011/10/diem-expiration.htm", "passage_text": "The per diem rate for 2010 is $5 per day. Where a set amount has been deducted for meals, a fisher, who is away from home, is entitled to use the optional method for computing meals and incidental expenses even if the amount paid is less than the federal per diem rate. Received per diem. Then went to site in S. Carolina for past 6 months. Been receiving per diem. I'm told per diem will end since I've been with company for 1 yr but I say I relocated just 6 months ago so I still have 6 months of per diem left."}, {"url": "http://en.allexperts.com/q/Tax-Law-Questions-932/2011/10/diem-expiration.htm", "passage_text": "The taxpayer used the federal per diem rate for meal and incidental expenses (M & IE) he incurred. The taxpayer argued that maritime common law and a statutory exception permitted crewmembers of a commercial vessel to deduct 100% of expense for food and beverages. Received per diem. Then went to site in S. Carolina for past 6 months. Been receiving per diem. I'm told per diem will end since I've been with company for 1 yr but I say I relocated just 6 months ago so I still have 6 months of per diem left."}, {"url": "http://m.gsa.gov/m/#!/travel/perdiem/", "passage_text": "Per Diem Mobile App. Look up federal government per diem rates by city/state and ZIP code in locations throughout the United States and its territories. Per diem is the daily allowance for lodging (excluding taxes), meals and incidental expenses. These rates are established by the General Services Administration for destinations in the lower 48 contiguous United States only and by the U.S. Department of Defense for locations in Alaska, Hawaii and the U.S. territories"}]