[{"url": "http://stevendamico.com/geeksquad-rates-list/", "passage_text": "I believe many computer repair technicians have ideas about what the geek squad charge for computer repair services or are unsure. I created this simple table which shows what services they do, and charge for. Everything is taken directly from their website. Geek Squad is a business. The aim is to make money, and Geek Squad makes money off people who don’t know how to use a computer, the same way Jiffy Lube makes money off people who don’t know (or don’t care) to change their own oil."}, {"url": "http://stevendamico.com/geeksquad-rates-list/", "passage_text": "I charge $95.00 per hour here in Denver. Your not very smart if you allow the average computer wannabe to do this kind of work. That’s why I and many others charge what we do and $300 is nothing for a repair bill. Geek Squad is a business. The aim is to make money, and Geek Squad makes money off people who don’t know how to use a computer, the same way Jiffy Lube makes money off people who don’t know (or don’t care) to change their own oil."}, {"url": "http://www.cnet.com/forums/discussions/am-i-being-ripped-off-by-geek-squad-298746/", "passage_text": "The biggest issue with the Geek Squad is they charge way too much for their services. It's entirely possible that your hard drive failed or was failing, but it is coincidental that it did so in their hands. They are struggling to justify their existence. In my case the Geek Squad had my computer for two weeks, charged me 3 hours labor. I have changed graphics cards and associted software and drivers out in 30 minutes. They also chargeds me for a new graphics card and I ended up fixing their mistakes. You emphasized the word Skilled."}, {"url": "https://answers.yahoo.com/question/index?qid=20081116203206AAuXzQ7", "passage_text": "Rating Newest Oldest. Best Answer: Go to best buy and take a look at their sign with the repair cost.It is ridiculous,please don't go there,they charge and arm and a leg for simple tasks.Find a computer guy in your local paper.They are cheap and they even come to your house for no extra cost. Source(s): Safe Mode · 7 years ago. Thumbs up. Data backup is going to cost an extra $99 if you do care about your files. And then they'll try to sell you antivirus and antispyware, which is another $99. I'd recommend you do the backup yourself and then just have them clean the computer."}, {"url": "http://www.cnet.com/forums/discussions/am-i-being-ripped-off-by-geek-squad-298746/", "passage_text": "The Geek Squad is there to get you to buy a new computer from Best Buy. For any of their services, you need to pay the about $200. They will then call you in about a week to tell you that there is something even more wrong with your computer that will cost you more. In my case the Geek Squad had my computer for two weeks, charged me 3 hours labor. I have changed graphics cards and associted software and drivers out in 30 minutes. They also chargeds me for a new graphics card and I ended up fixing their mistakes. You emphasized the word Skilled."}, {"url": "http://www.tomshardware.com/forum/14881-10-geek-squad-exposed", "passage_text": "I work for BB.....and yeah the geek squad doesn't know a lot about computers. In fact i would dare to say i know more then they do, and i work in HT. BUT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! What you forget is that Jiffy Lube people dont know everything about cars, I could do it cheaper but i am too lazy. Now, you are bashing the geek squad. LIke I said, go do it yourself. There are a TON of kiddies out there that put a video card in once and now think they are computer experts. Induldge your senses and enter the marketplace for real for real."}, {"url": "https://answers.yahoo.com/question/index?qid=20100227142001AA3kfmt", "passage_text": "Best Answer: Pretty sure they dont charge an hourly rate. Its a flat fee thats so high they dont need to charge hourly. Taken from geek squad site. Software repair pricing starts at $199.99. Hardware repair/upgrades start at $29.99.. For only $149 they will set up a wireless network for you!"}, {"url": "http://www.tomshardware.com/forum/14881-10-geek-squad-exposed", "passage_text": "Ive often wondered why Geek Squad charges as high a price as they do for their services and if they used special software to help solve the problems they fix. It looks like they probably use all the proggies I do to run diagnostics, trojan/virus/spyware sweeps, and simple day to day maintenance. Now, you are bashing the geek squad. LIke I said, go do it yourself. There are a TON of kiddies out there that put a video card in once and now think they are computer experts. Induldge your senses and enter the marketplace for real for real."}, {"url": "https://en.wikipedia.org/wiki/Geek_Squad", "passage_text": "Geek Squad is a subsidiary of American multinational consumer electronics corporation Best Buy, headquartered in Richfield, Minnesota. The Geek Squad provides services in-store, on-site, and over the Internet via remote access, and also provides 24-hour telephone and emergency on-site support."}, {"url": "http://www.answers.com/Q/How_much_money_does_the_geek_squad_charge_per_service", "passage_text": "If you work at the Geek Squad City, located in Brooks, KY anywhere from $9 - $24 per hour. Part timers make between $9 - $11. Full time shipping and receiving make about … $12 per hour. TA make about $12 per hour. Geek Squad is owned by Best Buy and so is traded on the Stock Market as Best Buy, whose symbol is BBY. Edit. Share to: 1  Help From a Remote Location: Top-rated Online PC Repair Advances in technology make it possible to get your PC repaired without even unplugging it."}]