[{"url": "http://www.iaff.org/ET/JobAid/EAP/Sedentary_Lifestyle.htm", "passage_text": "The consequences of sedentary lifestyle are obvious. Obesity, heart disease, colon cancer, diabetes and hypertension are linked to sedentary lifestyle. In addition, mood disorders are more common in those with sedentary lifestyle. Substance use and abuse is more common in those who are physically inactive. Overall, reversing a sedentary lifestyle is one of the most rewarding lifestyle changes a person can undertake. Initiation of exercise releases the body s natural opioids; the phenomenon of runner s high is well documented"}, {"url": "http://www.lifespanfitness.com/workplace/resources/articles/health-risks-of-a-sedentary-lifestyle", "passage_text": "Worldwide, it is estimated that a sedentary lifestyle is responsible for 6% of coronary heart disease cases, 7% of type 2 diabetes, 10% of breast cancer and 10% of colon cancer cases. In fact, it was recently reported that inactivity is responsible for more annual deaths than smoking. First, you may be wondering what we are referring to when we mention a sedentary lifestyle. A sedentary lifestyle is defined as a type of lifestyle where an individual does not receive regular amounts of physical activity."}, {"url": "http://mtweb.mtsu.edu/hjgray/3010/Group%208%20Sedentary%20Lifestyle.sample.ppt", "passage_text": "Sedentary Lifestyle What is a sedentary lifestyle? Sedentary lifestyle is a type of lifestyle most commonly found in modern (particularly Western) cultures. It is characterized by sitting or remaining inactive for most of the day (for example, in an office or at home). "}, {"url": "http://www.wisegeek.org/what-is-a-sedentary-lifestyle.htm", "passage_text": "Passive entertainment such as playing video games is considered a sedentary lifestyle. A sedentary lifestyle is thought to be among the highest risk factors for type 2 diabetes. Like adults, children need to exercise to maintain a healthy body mass index (BMI). Weight gain is bolstered by a sedentary lifestyle. @Cupcake15 -I agree and I think that some sedentary lifestyle effects also include problems with cholesterol and diabetes. More people are being diagnosed with diabetes and one of the factors is obesity and a sedentary lifestyle."}, {"url": "http://www.thefreedictionary.com/sedentary", "passage_text": "sed•en•tar•y. 1. characterized by or requiring a sitting posture: a sedentary occupation. 2. characterized by inactivity and lack of exercise: a sedentary life. 3. Zool. a. abiding in one place; not migratory. "}, {"url": "https://en.wikipedia.org/wiki/Sedentary_lifestyle", "passage_text": "A sedentary lifestyle is a type of lifestyle with no or irregular physical activity. A person who lives a sedentary lifestyle may colloquially be known as a slob or couch potato. It is commonly found in both the developed and developing world. Sedentary activities include sitting, reading, watching television, playing video games, and computer use for much of the day with little or no vigorous physical exercise. A sedentary lifestyle can contribute to many preventable causes of death. Screen time is the amount of time a person spends watching a screen such as a television, computer monitor, or mobile device"}, {"url": "http://medical-dictionary.thefreedictionary.com/Sedentary+lifestyle", "passage_text": "sedentary lifestyle. A lifestyle involving little exercise, even of the least strenuous type. Sedentary living is associated with weight gain, obesity, type 2 diabetes mellitus, and, in many studies, an increased risk of coronary artery disease."}, {"url": "http://www.wisegeek.org/what-is-a-sedentary-lifestyle.htm", "passage_text": "These 10 animal facts will amaze you. A sedentary lifestyle is a mode of living in which a person, an adult or child, does not engage in sufficient physical activity or exercise for what is generally considered healthy living. @Cupcake15 -I agree and I think that some sedentary lifestyle effects also include problems with cholesterol and diabetes. More people are being diagnosed with diabetes and one of the factors is obesity and a sedentary lifestyle."}]