[{"url": "http://www.antioxidants-for-health-and-longevity.com/cinnamon-facts.html", "passage_text": "Cinnamon Facts: Types of Cinnamon. Although there are four main varieties of cinnamon, Ceylon cinnamon (Cinnamomum zeylanicum), and Cassia cinnamon (Cinnamomum cassia) are the most popular. Cinnamon health benefits don't seem to be significantly different from one type to another. Ceylon cinnamon is sometimes called true cinnamon. Cinnamon Facts: History of Cinnamon. The word cinnamon comes from the Greek kinnamomon. Cinnamon is one of the oldest spices known. It was mentioned in the Old Testament (Exodus 30: 22-33), and in Chinese writings as far back as 2800 BC."}, {"url": "http://www.cinnamonvogue.com/Types_of_Cinnamon_1.html", "passage_text": "All other Cinnamon looks like the Cassia Cinnamon sticks (above left) and tends to be hard, hollow and have only one rolled layer. Notice the color difference. Ceylon Cinnamon is lighter in color while other Cinnamon tends to be darker in color. There are hundreds of types of Cinnamon. But only 4 types or varieties of Cinnamon are used for commercial purposes. These are Ceylon Cinnamon, Cassia Cinnamon, Saigon Cinnamon and Korintje Cinnamon"}, {"url": "http://www.antioxidants-for-health-and-longevity.com/cinnamon-facts.html", "passage_text": "Due to its demand, cinnamon became one of the first commodities traded regularly between the Near East and Europe. Today, Ceylon cinnamon is produced in Sri Lanka, India, Madagascar, Brazil and the Caribbean, while Cassia is mainly produced in China, Vietnam and Indonesia. Learn more about the history of cinnamon. Cinnamon Facts: History of Cinnamon. The word cinnamon comes from the Greek kinnamomon. Cinnamon is one of the oldest spices known. It was mentioned in the Old Testament (Exodus 30: 22-33), and in Chinese writings as far back as 2800 BC."}, {"url": "http://coffeetea.about.com/od/Tisane-Herbal-Tea-Glossary/g/Cinnamon.htm", "passage_text": "It is also known as 'Ceylon cinnamon,' a reference to its native country of Sri Lanka (which was formerly known as Ceylon). Today, Ceylon cinnamon is commonly grown in Sri Lanka, India (particularly in the southern state of Kerala), Bangladesh, Brazil, Vietnam and Madagascar, amongst other countries. Ceylon cinnamon has a delicate, nuanced flavor that works well in sweet and savory foods and drinks. Definition: Cinnamon is a spice that can be purchased in its ground / powdered form or in the form of sticks (or 'quills'). Cinnamon has a fascinating history, which includes its role in war, its use as currency and its use as an aphrodisiac."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=68", "passage_text": "Due to its demand, cinnamon became one of the first commodities traded regularly between the Near East and Europe. Ceylon cinnamon is produced in Sri Lanka, India, Madagascar, Brazil and the Caribbean, while cassia is mainly produced in China, Vietnam and Indonesia. Cinnamon is available in either its whole quill form (cinnamon sticks) or as ground powder. All types of cinnamon belong to the same family of plants, called the Lauraceae family. In fact, there are more cinnamon species in this plant family (an estimated 2,000-2,500 total) than any other plant species."}, {"url": "http://www.cinnamonvogue.com/Types_of_Cinnamon_1.html", "passage_text": "With the exception of Ceylon Cinnamon, Cassia, Saigon and Korintje Cinnamon are also classified under the Cassia Cinnamon category because they are very similar to each other with only slight variations in color, taste, shape and Coumarin content. Notice the color difference. Ceylon Cinnamon is lighter in color while other Cinnamon tends to be darker in color. There are hundreds of types of Cinnamon. But only 4 types or varieties of Cinnamon are used for commercial purposes."}, {"url": "http://www.indianetzone.com/1/cinnamon.htm", "passage_text": "Cinnamon is an important tree spice grown in different parts of India. The Botanical name of Cinnamon is Cinnamomum zeylanicun Blume and it belongs to the family of Lauraceae. It is also called Darchini in Hindi, Lavangpattai in Kannada, Darushila in Sanskrit and Sanna-lavangapattai in Tamil. The quality of cinnamon depends, among other factors, on the region where it is grown. Sri Lankan cinnamon and cinnamon from the Seychelles Island are considered to be the best. In India, it is grown on the West coasts."}, {"url": "http://www.cinnamonvogue.com/Types_of_Cinnamon_1.html", "passage_text": "Ceylon Cinnamon has one advantage over all other types of Cinnamon. It has ultra low coumarin level s. Coumarin in high doses causes liver failure, so for people who take Cinnamon on a daily basis,Ceylon Cinnamon is the preferred choice. Click here to read the research on Cassia Cinnamon and Coumarin. Notice the color difference. Ceylon Cinnamon is lighter in color while other Cinnamon tends to be darker in color. There are hundreds of types of Cinnamon. But only 4 types or varieties of Cinnamon are used for commercial purposes."}, {"url": "http://www.thetiffinbox.ca/2013/04/my-masala-dabba-spice-box-all-about.html", "passage_text": "Even though 'True' Cinnamon is not traditionally used in Indian cuisine, there are many recipes that do call for it, particularly in more modern interpretations of Indian food. Its also traditionally used in Indian desserts and is a part of the spice cabinet. India and Sri Lanka (Ceylon) are also huge producers of cassia, with the state of Kerala in India, in particular, having some of the largest cassia/ cinnamon estates in Asia. Cassia bark is widely used in Indian cooking, in particular, and my research suggests that the reason is that its cheaper to buy and use."}]