[{"url": "https://www.esci.umn.edu/courses/1001/minerals/potassium_feldspar.shtml", "passage_text": "Based on their chemical composition, feldspars can be subdivided into two mineral groups – plagioclase feldspars and potassium feldspars. Potassium feldspars are a group of polymorphs, polymorphs being minerals that have the same chemical composition but slightly different crystal structures."}, {"url": "http://www.ima-na.org/?page=what_is_feldspar", "passage_text": "Feldspar is by far the most abundant group of minerals in the earth's crust, forming about 60% of terrestrial rocks. Most deposits offer sodium feldspar as well as potassium feldspar and mixed feldspars. Feldspars are primarily used in industrial applications for their alumina and alkali content."}, {"url": "http://www.minerals.net/mineral/plagioclase.aspx", "passage_text": "The Plagioclase series is a group of related feldspar minerals that essentially have the same formula but vary in their percentage of sodium and calcium. Albite and Anorthite are the end members of the series, with the intermediary minerals Oligoclase, Andesine, Labradorite, and Bytownite."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Geophys/feldspar.html", "passage_text": "Note that the plagioclase differs from the orthoclase in terms of the additional metals, plagioclase having calcium or sodium and orthoclase having potassium. The feldspars have similar physical properties and typically have a luster ranging from glassy to pearly."}, {"url": "http://www.minerals.net/mineral/orthoclase.aspx", "passage_text": "Orthoclase is one of the most common minerals, and occurs in numerous mineral environment s. It is polymorphous with the minerals Microcline and Sanidine. These three minerals form the Potassium Feldspar group."}, {"url": "http://geology.about.com/od/minerals/a/aboutfeldspar.htm", "passage_text": "Feldspars are a group of closely related minerals that together are the most abundant mineral in the Earth's crust. A thorough knowledge of the feldspars is what separates geologists from the rest of us."}, {"url": "http://www.galleries.com/Feldspar_Group", "passage_text": "The feldspar group is a fairly large group with nearly 20 members recognized, but only nine are well known and common. Those few, however, make up the greatest percentage of minerals found in the Earth's crust."}, {"url": "http://www.windows2universe.org/earth/geology/min_feldspar.html", "passage_text": "There are several types of feldspar. The characteristics of the two most common types are listed below. These two common types of feldspar are difficult to tell apart besides their color. Color can be helpful, but beware because the same mineral can often have different colors."}, {"url": "http://www.galleries.com/Feldspar_Group", "passage_text": "The feldspars are a group of minerals that have similar characteristics due to a similar structure. All feldspars have low symmetry, being only monoclinic, 2/m, to triclinic, bar 1. They tend to twin easily and one crystal can even be multiply twinned on the same plane, producing parallel layers of twinned crystals."}]