[{"url": "http://mattress.lifetips.com/cat/61072/mattress-sizes/index.html", "passage_text": "Like other kinds of mattress sizes, a “king” will vary. The standard king size measures 76” x 80”, but a king size mattress in the UK is roughly the same size as an American queen size mattress. Then there is the California King mattress which is 72” x 84”. In the UK there is also a “super king size” mattress, which measures about 72” x 78”. "}, {"url": "http://www.bettersleep.org/mattresses-and-more/mattress-sizes/", "passage_text": "Queen mattress dimensions are 60 inches wide by approximately 80 inches long – 6 inches wider and 5 inches longer than a full size mattress. These added inches can make all the difference in comfort, especially for couples, and have made the queen size mattress today's most popular mattress size. Sometimes still called a double mattress, a full size mattress is 53 inches wide, which is just 15 inches wider than a twin size (single). That leaves each partner only 27 inches of personal space, or about the width of a crib."}, {"url": "http://interiordec.about.com/od/buyingabed/a/a_bedsizes_3.htm", "passage_text": "1 Standard King or Eastern King beds are about 16 wider than a Queen bed and the same length. 2  A King size bed is sold with two box springs or frames and one mattress. 3  This makes it easier to move. 4  Overall dimensions: 76 wide x 80 long. "}, {"url": "http://www.sleeptrain.com/mattress-size-chart/education-mattress-size-chart.html", "passage_text": "King size mattress dimensions are approximately 76 inches wide by 80 inches long, making a king mattress almost the same size as two twin XL beds. This bed size is also preferable if you have children, dogs or cats that will be sharing your bed. A twin size mattress is the smallest mattress available and is best suited for one child or one adult. The dimensions of a twin size mattress are approximately 39 inches wide by 74 inches long. Taller adults may be more comfortably sleeping on a twin XL bed size."}, {"url": "http://www.bettersleep.org/mattresses-and-more/mattress-sizes/", "passage_text": "Twin Mattress. A twin mattress is the smallest possible mattress size, other than a crib-sized mattress. Twin mattress dimensions are approximately 38 inches wide by 75 inches long. Both twin and full sizes are approximately 75 inches long, which may be too short for some adults, especially men. Sometimes still called a double mattress, a full size mattress is 53 inches wide, which is just 15 inches wider than a twin size (single). That leaves each partner only 27 inches of personal space, or about the width of a crib."}, {"url": "http://www.sleeptrain.com/mattress-size-chart/education-mattress-size-chart.html", "passage_text": "At 72 inches wide by 84 inches long, the California king mattress is perfect for those who want more length in the bed. The California king is 4 inches narrower than a king size mattress, but it is 4 inches longer. This bed size still gives each sleeper 6 inches more sleeping width than a queen size bed. A twin size mattress is the smallest mattress available and is best suited for one child or one adult. The dimensions of a twin size mattress are approximately 39 inches wide by 74 inches long. Taller adults may be more comfortably sleeping on a twin XL bed size."}, {"url": "http://www.bedtimesuperstores.co.uk/blog/post/uk-standard-bed-sizes-and-dimensions/", "passage_text": "A standard king size bed is 5 feet wide and 6 feet 6 inches long (150 x 198 cm). Please note: from a king size bed and upwards the standard length increases by 3 inches to 6 feet 6 inches or about 2 metres. A Queen size bed in the US refers to a 60 inch wide by 80 inch long mattress (152 x 203 cm), although it is more commonly referred to in the UK as a ‘ King’ instead being of similar dimension."}, {"url": "http://www.bedtimesuperstores.co.uk/blog/post/uk-standard-bed-sizes-and-dimensions/", "passage_text": "The Queen size terminology is another taken from the American market. A Queen size bed in the US refers to a 60 inch wide by 80 inch long mattress (152 x 203 cm), although it is more commonly referred to in the UK as a ‘ King’ instead being of similar dimension."}, {"url": "http://www.bettersleep.org/mattresses-and-more/mattress-sizes/", "passage_text": "King Mattress. The king size mattress dimensions are 76 inches wide by approximately 80 inches long – about 18 inches wider than a queen. This is the closest a couple can come to having as much personal space (38 inches) as each would have on a twin bed. Sometimes still called a double mattress, a full size mattress is 53 inches wide, which is just 15 inches wider than a twin size (single). That leaves each partner only 27 inches of personal space, or about the width of a crib."}, {"url": "http://www.beddingexperts.com/mattress-sizes-chart/", "passage_text": "King size (also known as an eastern king) is the same length as a queen but much wider (16 inches). If you have the space it offers the most room for couples. King size beds are also great if you have kids or pets who like to share your bed. "}]