[{"url": "https://answers.yahoo.com/question/index?qid=20130713093209AAKnsEA", "passage_text": "Scoobert Scooby Doo is the eponymous character and protagonist of the Scooby-Doo animated television series created by the popular American animation company Hanna-Barbera. · just now. Report Abuse. Scoob is a Great Dane, but this should not mean immediately go buy a Great Dane just because you love Scooby Doo. Great Danes are one of the most fragile dog breeds."}, {"url": "https://en.wikipedia.org/wiki/Scooby-Doo_%28character%29", "passage_text": "In most incarnations of the series, Scooby is regarded as a unique Great Dane dog who is able to speak in broken English, and usually puts the letter  R  in front of words and noises made. Other incarnations, such as A Pup Named Scooby-Doo, present talking dogs as quite common in the larger fictional universe. Scooby-Doo, Where Are You! premiered on CBS on September 13, 1969 at 10:30 a.m. EST and ran for two seasons, for a total of 25 episodes."}, {"url": "https://en.wikipedia.org/wiki/Scooby-Doo_%28character%29", "passage_text": "Both the dog and the series would be renamed Scooby-Doo by Fred Silverman, CBS's head of daytime programming, between its unsuccessful first pitch and a second pitch which earned the show a green light. Scooby-Doo, Where Are You! premiered on CBS on September 13, 1969 at 10:30 a.m. EST and ran for two seasons, for a total of 25 episodes."}, {"url": "https://www.quora.com/What-kind-of-a-dog-is-Scooby-Doo", "passage_text": "Scooby Doo is a Great Dane. Look, someone got their Dane to look like Scooby: Other famous Great Danes are Marmaduke. and Astro, from the Jetsons. and Fang, the boarhound from Harry Potter (the books, not the movies). Scrappy Doo is a Great Dane too. 3 Answers. Quora User, Pet owner and dog rescue volunteer. 4.3k Views • Quora User has 10+ answers in. Since the other answers don't mention it, the artist who designed Scooby-Doo for Hanna-Barbera, Iwao Takamoto, based his design on reference sketches provided him by a fellow HB employee who bred Great Danes."}, {"url": "https://answers.yahoo.com/question/index?qid=20130713093209AAKnsEA", "passage_text": "Best Answer: He is widely believed to be a Great Dane, or at least based upon the Great Dane. HOwever the colouration (brown/tan with black patches) does not exist in the Great Dane breed. As others have said, the giant breeds are not for everyone, they require specialist care and consideration. · just now. Report Abuse. Scoob is a Great Dane, but this should not mean immediately go buy a Great Dane just because you love Scooby Doo. Great Danes are one of the most fragile dog breeds."}, {"url": "https://en.wikipedia.org/wiki/Scooby-Doo_%28character%29", "passage_text": "Veteran H-B voice artist Don Messick was the original voice of Scooby and spent decades working on the character. Scooby-Doo, Where Are You! premiered on CBS on September 13, 1969 at 10:30 a.m. EST and ran for two seasons, for a total of 25 episodes. Its final first-run episode aired on October 31, 1970"}, {"url": "http://researchmaniacs.com/FAQ/WhatKind/WhatKindOfDogIsScooby-Doo.html", "passage_text": "What kind of dog is Scooby-Doo? Question: What kind of dog is Scooby-Doo? So you are watching those funny Scooby-Doo cartoons and you are thinking that you want a Scooby-Doo dog, but you do not know what kind of dog Scooby-Doo is. Well, you have come to the right place. Scooby-Doo is a Great Dane, also known as Grand Danois. The Great Dane is a native of Denmark and was first bred for hunting. Great Dane (aka Scooby-Doo) features include short hair, and a friendly, gentle, and loving personality."}, {"url": "http://www.answers.com/Q/What_breed_of_dog_is_Scooby-Doo", "passage_text": "Scooby-doo was a Great Dane. The gang picked him up at a puppy store, unlike in the new the mystery begins movie where the movie makes him look adopted which he was not. Scoo … by-doo's original owner was shaggy and never has changed throughout the series and movies."}]