[{"url": "https://answers.yahoo.com/question/index?qid=20101111023458AAPqNQf", "passage_text": "Because the herbivore's large caecum (specifically) the appendix is a dead-end sac, it is able to hold the cellulose for a long time, long enough to be fermented by bacteria to essential substances such energy in the form of ATP. Think of the caecum as a large fermenting chamber in herbivores. In humans, it has little function as it is a merely a vestigial feature as a result of evolution. Ancient Humans had fairly large caecum because they consumed a large amount of raw plants."}, {"url": "https://answers.yahoo.com/question/index?qid=20101111023458AAPqNQf", "passage_text": "Best Answer: The caecum, together with the appendix, store/house certain bacteria that secrete enzymes to digest cellulose. It is very large in herbivores like cows, quite small in humans and other omnivores like pigs, and extremely small in carnivores. Think of the caecum as a large fermenting chamber in herbivores. In humans, it has little function as it is a merely a vestigial feature as a result of evolution. Ancient Humans had fairly large caecum because they consumed a large amount of raw plants."}, {"url": "http://en.wikivet.net/Caecum_-_Anatomy_%26_Physiology", "passage_text": "Gibbon caecum and appendix- © RVC 2008. The cecum is a blind ending diverticulum of the large intestine and it exists at the junction of the ileum and the ascending colon. Its size and physiological importance varies between species. It is a site of microbial fermentation, absorption and transportation. "}, {"url": "http://www.buzzle.com/articles/cecum-function.html", "passage_text": "Cecum Function. Cecum is a part of the large intestine and helps in the absorption of fluids. This article provides some information about the same and its functions, that might prove beneficial. Advertisement. Cecum is a part of the large intestine and is situated between ileum and the ascending colon. It is a pouch-like structure that is connected to the small intestine and it also has the appendix attached to it"}, {"url": "http://medical-dictionary.thefreedictionary.com/cecum", "passage_text": "cecum. 1. the first or proximal part of the large intestine, forming a dilated pouch distal to the ileum and proximal to the colon. There is a great deal of variation in the relative size between species. The dog's cecum is a small, coiled organ. "}, {"url": "https://en.wikipedia.org/wiki/Cecum", "passage_text": "The cecum or caecum (/ˈsiːkəm/ , plural ceca /ˈsiːkə/ ; from the Latin caecus meaning blind) is an intraperitoneal pouch, that is considered to be the beginning of the large intestine. It receives chyme from the ileum, and connects to the ascending colon of the large intestine. It is separated from the ileum by the ileocecal valve (ICV) or Bauhin's valve. It is also separated from the colon by the cecocolic junction. The appendix is connected to the cecum. The term cecum comes from the Latin caecum, literally blind, here in the sense blind gut or  cul de sac . In dissections by the Greek philosophers, the connection between the ileum of the small intestines and the cecum was not fully understood."}, {"url": "https://answers.yahoo.com/question/index?qid=1006052431266", "passage_text": "Answers. Best Answer: In biology, the cecum or caecum is a pouch connected to the large intestine between the ileum and the colon. It is separated from the ileum by the ileocecal valve (ICV) or Bauhin's valve, and is considered to be the beginning of the large intestine and part of the colon. Its function is to absorb water and salts from undigested food. It has a muscular wall that can knead the contents to speed up absorption"}]