[{"url": "http://www.lookaroundireland.com/ireland-travel-guide/rivers-of-ireland/", "passage_text": "One of the more noted rivers in Ireland is the River Foyle which flows through Derry City. It is a confluence of the rivers Finn and Mourne at the towns of Lifford in County Donegal and Strabane in County Tyrone."}, {"url": "http://www.askaboutireland.ie/enfo/irelands-environment/county-focus/dublin-south/rivers/", "passage_text": "Rivers in South Dublin. Several rivers flow through and rise in South Dublin and are an important aspect of the physical landscape. One of the most well known rivers flowing through the county is the River Liffey.The River Dodder flows through South Dublin on its way to the sea and the City Weir is situated on it."}, {"url": "http://www.answers.com/Q/Which_river_runs_throgh_Dublin", "passage_text": "The Liffey is a river in Ireland, which flows through the centre of Dublin. Its major tributaries include the River Dodder, the River Poddle and the River Camac. However, it i … s the River Poddle which is culverted and flows underneath the city.   WikiPedia."}, {"url": "https://en.wikipedia.org/wiki/River_Liffey", "passage_text": "The River Liffey (Irish: An Life) is a river in Ireland, which flows through the centre of Dublin. Its major tributaries include the River Dodder, the River Poddle and the River Camac."}, {"url": "https://simple.wikipedia.org/wiki/River_Liffey", "passage_text": "The Liffey (An Life in Irish) is a river in Ireland. It flows through the centre of Dublin. The river supplies much of Dublin's water. Major rivers that flow into the Liffey are the River Dodder, the River Poddle and the River Camac."}, {"url": "http://www.answers.com/Q/Which_river_runs_throgh_Dublin", "passage_text": "Dublin's main river is the river Liffey, but there are other rivers running through the city, like the Tolka and the Dodder."}, {"url": "http://10mosttoday.com/10-rivers-that-flow-through-europes-capital-cities/", "passage_text": "The Temple Bar area lies on the south bank of the Liffey. River Liffey, Dublin, Ireland. 5. The Danube, Budapest, Hungary – The Danube is the second longest river in Europe, after the Volga. It is 2,872 km (1,785 mi) long and flows through 4 capital cities: Vienna, Bratislava, Budapest and Belgrade."}]