[{"url": "http://www.answers.com/Q/Where_did_hip-_hop_originate", "passage_text": "Hip-hop started in the South Bronx. Hip hop singers, and break dancing was a way to be heard without violence. It is also said that Hip hop and even graffiti was a way to speak out against putting up the South Bronx express way. Graffiti was intentionally put on the trains so that it would be seen throughout New York."}, {"url": "http://realhiphop80.blogspot.com/2011/06/where-did-hip-hop-originated.html", "passage_text": "Hip Hop originated in the streets of the South Bronx. Hip Hop was created to stop the youth from joining gang. Moreover, it was created by Puerto Ricans and Blacks people in the South Bronx. Noticed that I say blacks because Jamaicans, Nigerians, African Americans etc.. help to build what we know today as Hip Hop."}, {"url": "http://www.askdeb.com/music/where-and-how-did-rap-music-originate/", "passage_text": "Hip hop was originally a combination of rap, DJing, breakdancing and “tagging”, which was the hip hop name for producing graffiti. Therefore, “rap” is the most famous part of hip hop culture, but “hip hop” comprises more than just rapping and rappers. These days, though, people often use the term “hip hop” when discussing music which combines rapping and Dj, and the term “hip hop” can be considered a proper definition of rap."}, {"url": "http://www.answers.com/Q/Where_did_hip-_hop_originate", "passage_text": "The term Hip Hop was a shortened version of  hippity hoppity a  general reference to the legendary pioneer DJ Kool Herc.  hippity  hoppity was how the people defined the … name for this new sound  that Herc created."}, {"url": "https://answers.yahoo.com/question/index?qid=20100224090124AAj8uj3", "passage_text": "Answers. Best Answer: Hip hop is evolved from advanced forms of breakdancing... which originated on the streets of New York and New Jersey, in lower class sections. Kids needed an outlet for venting frustration, and as an alternate to fighting, the breakdancing craze was born."}]