[{"url": "http://study.com/academy/lesson/what-is-human-body-tissue-definition-types-examples.html", "passage_text": "There are four main types of tissue: muscle, epithelial, connective and nervous. Each is made of specialized cells that are grouped together according to structure and function. Muscle is found throughout the body and even includes organs such as the heart."}, {"url": "http://www.msnucleus.org/membership/html/k-6/lc/humanbio/4/lchb4_3a.html", "passage_text": "BACKGROUND: A tissue is a group of cells that have a similar shape and function. Different types of tissues can be found in different organs. In humans, there are four basic types of tissue: epithelial, connective, muscular, and nervous tissue. There may be various sub-tissues within each of the primary tissues."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110208044413AA559K1", "passage_text": "These are the main types of tissues found in the human body and their functions. Tissues are composed of groups or layers of cells, which collectively perform a specific function. Different types of tissues have different structures that are specific to their function."}, {"url": "http://www.exploringnature.org/graphics/teaching_aids/Tissue_identification.pdf", "passage_text": "The 4 Basic Tissue Types in the Human Bodywww.exploringnature.org Tissues are groups of cells with a common structure (form) and function (job).There are four main tissues in the body – epithelium, muscle, connective tissue and nervous tissue."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110208044413AA559K1", "passage_text": "These are the major tissue types in the human body: •Connective •Epithelial •Muscular •Nervous system •Lymphatic Connective Tissue Connective tissue is made up of cells and protein fibers and provides support for other body tissues. The main proteins in connective tissue are collagen and elastin."}, {"url": "https://www.rapidlearningcenter.com/biology/anatomy-physiology/04-Tissues-of-the-Human-Body.html", "passage_text": "The four types of tissue in the human body: A tissue is a group of cells that is from similar embryological origin and is specialized for a particular function. Four types: epithelial, connective, muscle and nervous."}, {"url": "http://jb004.k12.sd.us/MY%20WEBSITE%20INFO/HUMAN%20ANATOMY/CHAPTER%205/VIRTUAL%20HISTOLOGY%20LAB/VL%20PAGE%203.htm", "passage_text": "THE FOUR MAJOR TISSUE TYPES: Histology translates to the study of tissues. A tissue is a group of cells that are similar in function (and usually structure). Generally, tissues work together in the body to form organs (e.g. heart, brain, liver, etc.)."}]