[{"url": "http://patient.info/health/metatarsalgia", "passage_text": "1 Stress crack (fracture) of a metatarsal. 2  A stress fracture is a type of incomplete fracture in a bone. 3  Stress fractures tend to occur as a result of overuse and are known as overuse injuries. 4  A metatarsal stress fracture is a stress fracture in one of the metatarsal bones in the foot. Metatarsalgia is the name given to pain in the front part of your foot under the heads of your metatarsal bones-the ball of your foot. Metatarsalgia can be caused by a number of different conditions affecting the foot. You may need some investigations to find the cause of your metatarsalgia."}, {"url": "https://en.wikipedia.org/wiki/Metatarsus", "passage_text": "The metatarsal bones, or metatarsus are a group of five long bones in the foot, located between the tarsal bones of the hind-and mid-foot and the phalanges of the toes. The base of each metatarsal bone articulates with one or more of the tarsal bones at the tarsometatarsal joints, and the head with one of the first row of phalanges at the metatarsophalangeal joints."}, {"url": "http://www.healthline.com/human-body-maps/metatarsal-bones", "passage_text": "Metatarsals. Metatarsals are part of the bones of the mid-foot and are tubular in shape. They are named by numbers and start from the medial side outward. The medial side is the same side as the big toe. They are called the first metatarsal, second metatarsal, third metatarsal, fourth metatarsal, and the fifth metatarsal. The first metatarsal is the strongest of the group. These bones are found between the phalanges of the toes and the tarsal bones"}, {"url": "http://www.merriam-webster.com/dictionary/metatarsal", "passage_text": "Definition of METATARSAL. : of, relating to, or being the part of the human foot or of the hind foot in quadrupeds between the tarsus and the phalanges that in humans comprises five elongated bones which form the front of the instep and ball of the foot. See metatarsal defined for kids. ADVERTISEMENT."}, {"url": "http://www.medicalnewstoday.com/articles/190431.php", "passage_text": "Metatarsal bones are a group of five longer bones in the foot. In the foot there are small toe nerves between the metatarsal bones. When the head of one metatarsal bone is pressed against another, the small nerve is caught between them and starts to become inflamed, thus causing metatarsalgia. 1 Pain in the ball of the foot, this is the metatarsal region, which is just behind the toes. 2  Pain that can occur near the toes. 3  Pain that increases when walking in bare feet, and even more so when walking on a hard surface."}, {"url": "https://en.wikipedia.org/wiki/Fifth_metatarsal_bone", "passage_text": "The fifth metatarsal bone is a long bone in the foot. It is the second smallest of the five metatarsal bones. The fifth metatarsal is analogous to the fifth metacarpal bone in the hand. As with the four other metatarsal bones it can be divided into three parts; a base, body and head. The base of the metatarsal is often injured and a particularly notorious fracture is the Jones fracture. When the tuberosity is broken, it is called a pseudo-Jones fracture or a dancer's fracture. This is a common fracture of the fifth metatarsal."}, {"url": "http://patient.info/health/metatarsalgia", "passage_text": "51. Metatarsalgia is the name given to pain in the front part of your foot under the heads of your metatarsal bones-the ball of your foot. Metatarsalgia can be caused by a number of different conditions affecting the foot. You may need some investigations to find the cause of your metatarsalgia."}, {"url": "http://www.medicalnewstoday.com/articles/190431.php", "passage_text": "Metatarsalgia, also known as stone bruise, is a type of pain and inflammation that occurs in a part of the foot known as the metatarsal (ball of foot). It often occurs in the metatarsal heads-where the three middle toes meet the ball of the foot. It is a common problem which can affect the bones and joints of the metatarsals. Most commonly, the first metatarsal head is affected-the ball of the foot just behind the big toe. 1 Pain in the ball of the foot, this is the metatarsal region, which is just behind the toes. 2  Pain that can occur near the toes. 3  Pain that increases when walking in bare feet, and even more so when walking on a hard surface."}, {"url": "http://patient.info/health/metatarsal-fractures", "passage_text": "The metatarsal bones are some of the most commonly broken (fractured) bones in the foot. There are two main types of metatarsal fracture: 1  Acute fracture-due to a sudden (acute) injury to the foot (typically dropping a heavy object on to the foot, a fall, or a sporting injury). 1 A fracture of the first metatarsal bone can lead to later arthritis of the big toe joint. 2  A fracture at the base of the fifth metatarsal bone is often mistaken for an ankle sprain. 3  This would usually result in it not being rested or supported enough."}, {"url": "https://en.wikipedia.org/wiki/Metatarsus", "passage_text": "The metatarsals are analogous to the metacarpal bones of the hand. The lengths of the metatarsal bones in humans are, in descending order: second, third, fourth, fifth and first. The base of each metatarsal bone articulates with one or more of the tarsal bones at the tarsometatarsal joints, and the head with one of the first row of phalanges at the metatarsophalangeal joints."}]