[{"url": "http://www.webmd.com/digestive-disorders/picture-of-the-spleen", "passage_text": "1 Ruptured spleen: The spleen is vulnerable to injury, and a ruptured spleen can cause serious life-threatening internal bleeding and is a life-threatening emergency. Because the spleen is protected by the rib cage, you can’t easily feel it unless it’s abnormally enlarged. The spleen plays multiple supporting roles in the body. It acts as a filter for blood as part of the immune system."}, {"url": "http://mamashealth.com/organs/spleen.asp", "passage_text": "The human spleen is an organ that creates lymphocytes for the destruction and recycling of old red-blood cells. The spleen is also a blood reservoir. It supplies the body with blood in emergencies such as a bad cut. The spleen is also the location where white blood cells trap organisms. The spleen is shaped like a loose fist and is tucked under the left side of the diaphragm. The average weight of an adult spleen is 0.44 lbs. During and after digestion, the size of the spleen increase"}, {"url": "http://www.buzzle.com/articles/where-is-your-spleen-located.html", "passage_text": "Where is Your Spleen Located. Spleen is exactly located at the left side of upper abdomen near to 9th, 10th and 11th rib. Now that you know about the location, read on to get detailed information on the structure and function of spleen. Advertisement. Spleen is found in almost all vertebrate animals. It is a very small organ, somewhat of the shape of your fist. It is located in the left side of your upper abdominal cavity, behind the stomach and very near to the left kidney. You cannot see or feel it as it is covered with cage of your ribs."}, {"url": "http://www.livescience.com/44725-spleen.html", "passage_text": "The spleen is located under the ribcage and above the stomach in the left upper quadrant of the abdomen. Adult spleens are usually about 5 inches wide and weigh about 6 ounces. Spleens are soft and purple, possessing many blood vessels. "}, {"url": "http://www.medicinenet.com/enlarged_spleen/page2.htm", "passage_text": "The spleen is located in the left upper quadrant of the abdomen, just beneath the diaphragm and next to the stomach. It has a very rich blood supply since it is responsible for filtering blood, and it is protected by the 9th, 10th, and 11th ribs. Normally, it is the size of an orange or a small fist. "}, {"url": "http://byebyedoctor.com/spleen-pain/", "passage_text": "The spleen is an organ that is small and located just below the rib cage on the left side. Usually, the spleen is approximately the size of a fist, but there are a number of conditions that can cause the spleen to enlarge. This can happen because of infections, liver diseases as well as some cancers. Problems with the spleen especially one that is enlarged can cause the following symptoms: 1  In certain cases – there are no symptoms. 2  Fullness or pain in the upper left abdomen and can spread to the left shoulder."}, {"url": "http://www.buzzle.com/articles/spleen-pain-causes.html", "passage_text": "The spleen is a lymphatic organ that is located in the upper-left part of the abdomen, and is protected by the rib cage. It serves a variety of important functions in the body. This article deals with the various causes that lead to spleen pain, along with the related symptoms and treatment options. Advertisement. "}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-spleen", "passage_text": "Front View of the Spleen. The spleen is an organ in the upper far left part of the abdomen, to the left of the stomach. The spleen varies in size and shape between people, but it’s commonly fist-shaped, purple, and about 4 inches long. Because the spleen is protected by the rib cage, you can’t easily feel it unless it’s abnormally enlarged. The spleen plays multiple supporting roles in the body. It acts as a filter for blood as part of the immune system. Old red blood cells are recycled in the spleen, and platelets and white blood cells are stored there. The spleen also helps fight certain kinds of bacteria that cause pneumonia and meningitis"}, {"url": "http://diseasespictures.com/enlarged-spleen/", "passage_text": "by admin Leave a Comment. Spleen is located on the left side of the stomach well beneath the rib cage. It is a small soft organ performing several functions for your body. Spleen roughly measures the size of your fist but when it gets enlarged it can grow up in size pressing the stomach and liver. Functions of Spleen :"}, {"url": "http://www.innerbody.com/image/dige06.html", "passage_text": "Protected by our ribs, the spleen is located between the stomach and the diaphragm in the left hypochondriac region of the abdominal body cavity. "}]