[{"url": "http://www.answers.com/Q/Where_do_luna_moths_live", "passage_text": "How long do Luna moths live for? The length of time that a Luna moth will live, will depend on the  climate they are born into. In cooler climates they can live for up  to seven days, while in warmer climat … es, they can live up to 10  weeks. "}, {"url": "http://insects.about.com/od/butterfliesmoths/fl/Luna-Moth-Actias-luna.htm", "passage_text": "Diet: Luna moth caterpillars feed on the foliage of a variety of host trees and shrubs, including walnut, hickory, sweetgum, persimmon, sumac, and white birch. Adult luna moths live only a few days, just long enough to find a mate and reproduce. Because they don't feed as adults, they lack a proboscis. "}, {"url": "https://en.wikipedia.org/wiki/Actias_luna", "passage_text": "The luna moth (Actias luna) is a lime-green, Nearctic Saturniid moth in the family Saturniidae, subfamily Saturniinae. It has a wingspan of up to 114 mm (4.5 in), making it one of the largest moths in North America. The luna moth pupates after spinning a cocoon. The cocoon is thin and single layered. Shortly before pupation, the final, fifth instar caterpillar will engage in a gut dump where any excess water, food, feces, and fluids are expelled."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/luna_moth.htm", "passage_text": "Once the wings are inflated, the adult moth will wait until nightfall to fly off to find a mate. Adult Luna Moths don't eat; in fact, they don't even have a mouth. They only live for about a week, and their only purpose is to mate. Female Luna Moths release a chemical at night which attracts males. Luna Moths are members of the Saturniidae family, also known as the Giant Silkworm Moths.. Luna Moths are huge moths, with a wingspan of four and a half inches. They have a white body, pinkish legs, and huge pale green wings. The hindwings have eyespots and long tails. They fly, only at night, in Spring and early Summer. The female Luna Moth lays eggs on the bottom of Black Walnut leav"}, {"url": "http://www.bugfacts.net/luna-moth.php", "passage_text": "Luna Moth. My Home: I am found in trees of the eastern part of the United States and into Canada. I only fly at night and that is how I got my name, the word luna means moon. What I eat: As a caterpillar, I will eat hickory, sycamore and walnut leaves. I do not have a mouth and do not eat as an adult. What I look like: My wings are light green with yellow stripes that have a long wing tail. My wingspan is approximately five inches long and four inches wide."}, {"url": "http://www.answers.com/Q/Where_does_the_luna_moth_live", "passage_text": "The length of time that a Luna moth will live, will depend on the  climate they are born into. In cooler climates they can live for up  to seven days, while in warmer climat … es, they can live up to 10  weeks. Jane Savage. The Luna moth only live's about a week because it has no mouth and can't eat. *Source* http://www.totallybuggin.com/site/1586384/page/836018. 18 people found this useful."}, {"url": "http://www.maynardlifeoutdoors.com/2013/05/luna-moth-photo.html", "passage_text": "This is a male Luna Moth (not 'Lunar moth'); only the fourth I've ever seen in 60 years. Luna moths are native to North America, and not so much rare as secretive. These are forest-dwelling, night-flying, short-lived moths. In New England, adults emerge from pupa in late May to mid-June. "}, {"url": "https://en.wikipedia.org/wiki/Actias_luna", "passage_text": "This moth is found in North America from east of the Great Plains in the United States to northern Mexico and from Saskatchewan eastward through central Quebec to Nova Scotia in Canada. There have been sightings as far south as central Florida. See map. The luna moth pupates after spinning a cocoon. The cocoon is thin and single layered. Shortly before pupation, the final, fifth instar caterpillar will engage in a gut dump where any excess water, food, feces, and fluids are expelled."}, {"url": "https://en.wikipedia.org/wiki/Actias_luna", "passage_text": "Although rarely seen due to their very brief (1 week) adult lives, luna moths are considered common. As with all Saturniidae, the adults do not eat or have mouths. They emerge as adults solely to mate, and as such, only live approximately one week. They are more commonly seen at night. The luna moth pupates after spinning a cocoon. The cocoon is thin and single layered. Shortly before pupation, the final, fifth instar caterpillar will engage in a gut dump where any excess water, food, feces, and fluids are expelled."}]