[{"url": "http://www.medicinenet.com/fluconazole/article.htm", "passage_text": "PRESCRIBED FOR: Fluconazole is used for treating vaginal, oral, and esophageal fungal infections caused by Candida. It may also be effective in treating urinary tract infections, peritonitis, pneumonia and disseminated"}, {"url": "http://www.medicinenet.com/fluconazole/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Fluconazole is an anti-fungal medication related to clotrimazole (Lotrimin), ketoconazole (Nizoral), itraconazole (Sporanox), and miconazole (Micatin, Monistat). It prevents growth of fungi by preventing production of the membranes that surround fungal cells."}, {"url": "http://www.drugs.com/diflucan.html", "passage_text": "Diflucan (fluconazole) is an antifungal medicine. Diflucan is used to treat infections caused by fungus, which can invade any part of the body including the mouth, throat, esophagus, lungs, bladder, genital area, and the blood."}, {"url": "https://www.healthwarehouse.com/fluconazole-100mg-tablets-generic-diflucan.html", "passage_text": "(floo-KON-a-zole). COMMON BRAND NAME(S): Diflucan. USES: Fluconazole is used to prevent and treat a variety of fungal and yeast infections. It belongs to a class of drugs called azole antifungals."}, {"url": "http://women.emedtv.com/diflucan/generic-diflucan.html", "passage_text": "Diflucan ® (fluconazole) is a prescription antifungal medication approved for treating and/or preventing several different fungal infections. Most commonly, it is used to treat vaginal yeast infections. Brand-name Diflucan is manufactured by Pfizer, Inc."}, {"url": "http://www.medindia.net/drug-price/fluconazole.htm", "passage_text": "Drug Fluconazole. The generic Fluconazole is manufactured by 422 companies. The information provided includes the cost of the drug and the type of drug-tablet, capsule, syrup, cream, gel, ointment, liquid or injection. To view the price of the drug click on the brand name. Please also note that Medindia's database currently has 557 Brands of Generics of Fluconazole listed."}, {"url": "http://www.diflucanhome.com/generic-diflucan.html", "passage_text": "Generic Diflucan-fluconzaole is the drug used for the treatment of candidiasis, a common infection caused by a fungus. The generic of this drug is fluconazole. In the US, the common brand name for this drug is Diflucan, produced by Pfizer. Candidiasis or sometimes called as thrush, is a yeast infection. The organism that is responsible for candidiasis, or otherwise known as the causative agent, is named Candida albicans."}]