[{"url": "http://www.dnr.state.mn.us/forestry/education/treeforallseasons/whatisatree.html", "passage_text": "Deciduous trees are sometimes called angiosperms, broadleaf trees, or hardwoods. Oaks, maples, and elms are deciduous trees. Coniferous trees are trees that produce seeds without fruits or nuts. Most coniferous trees bear seeds in cones, have needles instead of broad leaves, and keep their needles in winter. Coniferous trees are also called gymnosperms, evergreens, or softwoods. Spruces, firs, and pines are coniferous. During the growing season, the cells in the cambium divide to make new xylem and phloem. In spring they divide quickly and add a thick, light-colored layer"}, {"url": "http://www.wikihow.com/Prune-Conifers", "passage_text": "Conifers are trees and shrubs that have needle-type leaves and produce cones instead of flowers. Conifer trees have only one main “leader” or trunk that extends all the way to the top. Conifer shrubs can be short, medium or tall with a more rounded shape, or they can be low ground-cover types like “Blue Rug” junipers. Regardless of whether the conifer is a tree or shrub, they are generally pruned in the same way"}, {"url": "http://wwf.panda.org/about_our_earth/ecoregions/about/habitat_types/habitats/coniferous_forests/", "passage_text": "Unusually for coniferous trees they are deciduous, that is they shed their leaves in winter. Coniferous trees such as cypresses, cedars and redwoods are found in warmer regions. Life on the forest floor. Even evergreen trees eventually shed their leaves and grow new ones. Mosses, liverworts and lichens are also found on the forest floor and grow on tree trunks and branches. There are few flowering plants. Coniferous Forests of the world."}, {"url": "http://onnaturemagazine.com/field-trip-coniferous-trees.html", "passage_text": "All of Ontario’s 12 coniferous trees and three shrubs retain their narrow needle-or scale-like leaves beyond one growing season, except the tamarack (see “The deciduous coniferous tree,” opposite page). Red pine needles may remain on the tree for three years; the needles of balsam fir may last up to seven years. Use these tips to identify coniferous trees: Pines and larches have needles in clusters of two, three, five or more. Firs and hemlocks have flat, single needles, sometimes with a slender leaf-stalk joining the main needle to the branch, and sometimes without one. The needles of spruces have edges."}, {"url": "http://interwork.sdsu.edu/fire/resources/conifer-forest.htm", "passage_text": "Coulter pine occurs throughout the mountain ranges of California and into Mexico. It is a native evergreen conifer that lives up to 100 years of age. It attains a height of 30 to 83 feet and a diameter 12 to 31 inches. The bark is thick and roughly furrowed and the crown is pyramidal like a typical christmas tree. Needles occur in groups of three and are 6 to 12 inches long. "}, {"url": "http://www.crystalgraphics.com/powerpictures/images.photos.asp?ss=coniferous+forest", "passage_text": "Healthy big green coniferous trees in a forest of old spruce fir and pine trees in wilderness area of a national park lit by bright yellow sunlight-coniferous forest picture. Misty forests of evergreen coniferous trees in an ethereal landscape with low laying mist or cloud clinging to the tops of the trees image. Healthy big green coniferous trees in forest of old spruce fir and pine trees in wilderness area of a national park stock photo. Healthy big green coniferous trees in a forest of old spruce fir and pine trees in wilderness area of a national park lit by bright yellow sunlight-image."}, {"url": "http://bioweb.uwlax.edu/bio203/2010/panich_just/Site/Adaptations.html", "passage_text": "The phloem can be considered the densly packed area surrounding the xylem. Left: one of the most important adaptations of conifer trees is the thick waxy cuticle that waterproof the leaves. Leaves. One of the most notable adaptations of conifer trees are the presence of needle-like leaves. These leaves are adapted to survive in harsher and colder conditions compared to broad leaves. The needle-like leaves are an important adaptation to Conifer trees because they do not accumulate much snow, keeping the weight load mild. Even though Tamarack trees lose their leaves in the winter, they are still subject to some snowfall."}, {"url": "http://wwf.panda.org/about_our_earth/ecoregions/about/habitat_types/habitats/coniferous_forests/", "passage_text": "Evergreen regions. Coniferous forests are made up mainly of cone-bearing or coniferous trees, such as spruces, hemlocks, pines and firs. The leaves of these trees are either small and needle-like or scale-like and most stay green all year around (evergreen). All are softwoods able to survive cold termperatures and acidic soil. Mosses, liverworts and lichens are also found on the forest floor and grow on tree trunks and branches. There are few flowering plants. Coniferous Forests of the world."}, {"url": "http://onnaturemagazine.com/field-trip-coniferous-trees.html", "passage_text": "A thick, transparent cuticle envelops the needles, preventing moisture loss year-round. Coniferous trees have descended from an ancient lineage of plants – the gymnosperms (the term derives from the Greek word meaning “naked seeds”). These trees are cone bearers and most grow two types of cones. Use these tips to identify coniferous trees: Pines and larches have needles in clusters of two, three, five or more. Firs and hemlocks have flat, single needles, sometimes with a slender leaf-stalk joining the main needle to the branch, and sometimes without one. The needles of spruces have edges."}]