[{"url": "https://uk.answers.yahoo.com/question/index?qid=20070403075038AAEvpEd", "passage_text": "Cockatiels can live between 29 years to about 40 years. My sister had a cockatiel, she later gave me him (Pierre). He lived to be about 31 years old. Someone had given Pierre to us and said that he was about 10 years old at that time. He had injured his wing, so wasn't able to fly. I had taken care of him. "}, {"url": "https://answers.yahoo.com/question/index?qid=20060718105128AA8cW2M", "passage_text": "Report Abuse. Generally they can live to about 25 years if they are on a healthy diet and don't have any health issues. I do know of one lady who has a 29 year old Cockatiel, that may be a record though. Sapphyre Certified Avian Specialist http://www.borrowed-rainbow.com http://groups.yahoo.com/group/BorrowedRa... The great thing about cockatiels is that they can live longer than dogs and cats, but they don't live (almost) forever like the larger parrots like amazons and macaws! Source(s): Cockatiel breeder and long time bird owner. white_ravens_white_crows · 9 years ago. Thumbs up. 3. Thumbs down. 1. 1 comment. Loading "}, {"url": "http://pets.thenest.com/average-age-life-cockatiel-bird-6303.html", "passage_text": "Age and Lifespan. In the wild, cockatiels live for 10 to 14 years, but those in captivity can easily live for 20 years or longer. Guinness World Records lists Pretty Boy as the oldest confirmed cockatiel, who died in 2004 at the age of 29 years. With proper nutrition and exercise, your bird will be around for a long time. Your orange-cheeked 'tiel can live for upwards of 20 years, so he's a long-term commitment. In the wild, cockatiels live for 10 to 14 years, but those in captivity can easily live for 20 years or longer."}, {"url": "http://www.birdchannel.com/bird-species/find-the-right-bird/pet-cockatiel-faq.aspx", "passage_text": "Informative and interesting. Although most web sites say cockatiels live 15-20 years, my cockatiel Buddy is 35 years old! I bought him in from a home breeder in Florida when my youngest son was three years old, and he is 38 now. He doesn't talk as much now and is a bit cantankerous, but is healthy and active. Hy, we all get grouchiest with age. Cockatiels are active pet birds, so your cockatiel needs a spacious bird cage. Opt for a bird cage that is at least 24 inches wide by 24 inches tall with ½ to 1-inch bar spacing."}, {"url": "http://petoftheday.com/talk/showthread.php?26631-How-long-do-Cockatiels-live", "passage_text": "I have heard many different opinions on how old a cockatiel life span is and I'm as in the dark as I have ever been on the matter, and my bird Russ is going on 16 now. I'd love to have some frim idea so that I don't receive the shock of my life one morning when I take his covers off. Who knows, he may be hanging around for another 15 years. My tiels are only 4 years old right now, and I try to feed them the best diet possible. With a good diet (seeds, pellets, veggies, whole wheat bread, rice, boiled egg once in a while, etc.) cockatiels can live long and healthy for a long time."}, {"url": "https://answers.yahoo.com/question/index?qid=20060718105128AA8cW2M", "passage_text": "Generally they can live to about 25 years if they are on a healthy diet and don't have any health issues. I do know of one lady who has a 29 year old Cockatiel, that may be a record though. The great thing about cockatiels is that they can live longer than dogs and cats, but they don't live (almost) forever like the larger parrots like amazons and macaws! Source(s): Cockatiel breeder and long time bird owner. white_ravens_white_crows · 9 years ago. Thumbs up. 3. Thumbs down. 1. 1 comment. Loading .."}, {"url": "http://www.backyardchickens.com/t/460757/how-long-do-cockatiels-live", "passage_text": "We purchased our cockatiel Charlie 23 years ago. At the time we got 3 cockatiels, a male that I fell in love with and Charlie and a female who quickly became a bonded pair for my Mother. Edited by ScissorChick - 3/5/11 at 6:07pm. Cockatiels can live 35 years on a good pelleted diet. Birds on all seed diets get obese or sick and usually their time. is up at 15 years, or around that."}]