[{"url": "http://kulmansam.com/kiswahili/swahili_animals.html", "passage_text": "'Safari' in 'Swahili' actually means journey or a long trip. Here are the 'Swahili' names of common African Animals arranged in alphabetical order of translation from English to Swahili. You will find that very often a Swahili word is of same form as a singular or plural. Since many animals that exist in other parts of the world do not exist in East Africa, there are no names for them in Swahili. "}, {"url": "https://en.wikipedia.org/wiki/Swahili_language", "passage_text": "Although only around five to fifteen million people speak Swahili as their first language, it is used as a lingua franca in much of Southeast Africa. Estimates of the total number of Swahili speakers vary widely, from 60 million to over 150 million. It is a lingua franca of the African Great Lakes region and other parts of Southeast Africa, including Tanzania, Kenya, Uganda, Rwanda, Burundi, Mozambique and the Democratic Republic of the Congo. The closely related Comorian language, spoken in the Comoros Islands, is sometimes considered a dialect."}, {"url": "https://en.wikipedia.org/wiki/Swahili_language", "passage_text": "Swahili serves as a national language of four nations: Tanzania, Kenya, Uganda and the Democratic Republic of the Congo. Shikomor, the official language in Comoros and also spoken in Mayotte (Shimaore), is related to Swahili. Swahili is also one of the official languages of the African Union and East African Community. It is a lingua franca of the African Great Lakes region and other parts of Southeast Africa, including Tanzania, Kenya, Uganda, Rwanda, Burundi, Mozambique and the Democratic Republic of the Congo. The closely related Comorian language, spoken in the Comoros Islands, is sometimes considered a dialect."}, {"url": "http://www.omniglot.com/writing/swahili.htm", "passage_text": "Swahili (Kiswahili / كِسوَهِل). Swahili is a Bantu language spoken in Tanzania, Burundi, Congo (Kinshasa) Kenya, Mayotte, Mozambique, Oman, Rwanda, Somalia, South Africa, Uganda, UAE and the USA. Around 5 million people speak Swahili as a native language, and a further 135 million speak is as a second language. In the Democratic Republic of Congo Swahili is spoken in the five eastern provinces, and overall almost half of the population speak it. In Uganda Swahili is widely spoken among non-Baganda people, and is taught in schools."}, {"url": "https://en.wikipedia.org/wiki/Peppa_Pig", "passage_text": "Peppa Pig is a children's television programme broadcasting on Channel 5 and Nick Jr. in the UK, Nickelodeon / Nick Jr. in the USA, ABC 4 Kids in Australia and Discovery Kids in Latin America, including Brazil. Each episode is approximately 5 minutes long. Peppa Pig the game was developed by Ubisoft and published by Pinnacle Inc., it was released on 27 November 2009 for the Nintendo Wii console and Nintendo DS hand-held game system. It is a children's video game to learn and play, and it contains 11 games and activities."}, {"url": "https://en.wikipedia.org/wiki/Swahili_language", "passage_text": "Swahili, also known as Kiswahili, is a Bantu language and the first language of the Swahili people. It is a lingua franca of the African Great Lakes region and other parts of Southeast Africa, including Tanzania, Kenya, Uganda, Rwanda, Burundi, Mozambique and the Democratic Republic of the Congo. The closely related Comorian language, spoken in the Comoros Islands, is sometimes considered a dialect."}, {"url": "http://www.glcom.com/hassan/lessons/useful_swahili_words.html", "passage_text": "In Swahili, Saturday is the first day of the week. The sixth day of the week, Thursday, is mostly pronounced as  Alkhamis i  to match the way it is pronounced in its Arabic origin. Thursday and Friday both are of Arabic origin. Swahili is one of the easiest languages to learn. Here are a few basic things to know about Swahili: Swahili verbs always carry with them the subject (and sometimes the object) and the tense. For example, Ninakula, is a complete sentence which means I am eating."}, {"url": "http://www.omniglot.com/writing/swahili.htm", "passage_text": "The majority of people in Tanzania and Kenya speak Swahili as a second language, and most educated Kenyans are fluent in the language, as it is compulsory in schools, and also taught in universities. In the Democratic Republic of Congo Swahili is spoken in the five eastern provinces, and overall almost half of the population speak it. In Uganda Swahili is widely spoken among non-Baganda people, and is taught in schools."}, {"url": "http://www.glcom.com/hassan/lessons/useful_swahili_words.html", "passage_text": "To be able to pronounce Swahili words correctly, I strongly recommend the Teach Yourself Swahili CD. You can also check out the Introduction to Kiswahili Language by AbdulGhany Mohammed and Kassim A. Abdullah or the Swahili Pronunciation Guide by Thomas Hinnebusch and Sarah Mirza. Some pronunciation is provided in each section of this page in MP3 format. Swahili is one of the easiest languages to learn. Here are a few basic things to know about Swahili: Swahili verbs always carry with them the subject (and sometimes the object) and the tense. For example, Ninakula, is a complete sentence which means I am eating."}]