[{"url": "http://www.answers.com/Q/How_much_does_a_publix_manager_earn_a_year", "passage_text": "Financial managers can earn upwards of about $100,000.00 depending on the company. Now for smaller companies they can earn in the range stemming from about $45,000 to about $7 … 5,000."}, {"url": "http://www.myjobapps.com/publix-manager-salary/", "passage_text": "Store Manager. 1  Salary: The usual salary a store manager receives can be anywhere around $52,000 to $115,000 annually. 2  Bonuses: Publix provide bonuses that could reach up to $40,000 and can start from a respectable $10,000 depending on the performance."}, {"url": "http://www.answers.com/Q/How_much_does_a_Publix_store_manager_make", "passage_text": "i was a store manager for 4 years and an assistant manager for 2. SM's make between 45K and60K. Assitant managers make between 35K and 40K. SM's have a bonus potential o … f 40% of salary. ASM's have a bonus potential of 15"}, {"url": "http://www.answers.com/Q/How_much_does_a_Publix_store_manager_make", "passage_text": "The salaries of a CEFCO store managers depends on few   important facts.     1-   level of experience2-   Type, size and volume of the sto … re3-   Promotion or external hire             So it is safe to say a new store   manager could start with anywhere between $45,000 to $65,000 a year."}, {"url": "http://corporate.publix.com/careers/stores", "passage_text": "Many of our store associates stay with Publix for their entire career, either in our stores or in other parts of the company. In fact, more than 25,000 associates have been with Publix for at least 10 years. Get the word on why people stay here so long with testimonials from these associates."}, {"url": "http://www.myjobapps.com/publix-manager-salary/", "passage_text": "1 Salary: The usual salary a store manager receives can be anywhere around $52,000 to $115,000 annually. 2  Bonuses: Publix provide bonuses that could reach up to $40,000 and can start from a respectable $10,000 depending on the performance."}, {"url": "http://corporate.publix.com/careers/stores/management", "passage_text": "Average earnings range from $47,000 per year for entry-level managers to $119,000 per year for store managers. The higher an associate's pay, the more shares of company stock that associate receives in a retirement account at no cost."}, {"url": "http://corporate.publix.com/careers/stores", "passage_text": "Every Publix store is a multi-million dollar enterprise, offering rewarding careers and exciting earnings potential. Each of our more than 1,000 stores is staffed with an average of 130 associates, creating a wide variety of job opportunities."}]