[{"url": "http://www.livescience.com/32016-niels-bohr-atomic-theory.html", "passage_text": "The Bohr model shows the atom as a small, positively charged nucleus surrounded by orbiting electrons. A stylized representation of a lithium atom illustrates Niels Bohr's atomic model, that an atom is a small, positively charged nucleus surrounded by orbiting electrons. Combining Rutherford's description of the nucleus and Planck's theory about quanta, Bohr explained what happens inside an atom and developed a picture of atomic structure. This work earned him a Nobel Prize of his own in 1922."}, {"url": "https://en.wikipedia.org/wiki/Bohr_model", "passage_text": "The Bohr model is a relatively primitive model of the hydrogen atom, compared to the valence shell atom. As a theory, it can be derived as a first-order approximation of the hydrogen atom using the broader and much more accurate quantum mechanics and thus may be considered to be an obsolete scientific theory. After the cubic model (1902), the plum-pudding model (1904), the Saturnian model (1904), and the Rutherford model (1911) came the Rutherford–Bohr model or just Bohr model for short (1913). The improvement to the Rutherford model is mostly a quantum physical interpretation of it."}, {"url": "http://chemistry.tutorvista.com/inorganic-chemistry/niel-bohr-atomic-theory.html", "passage_text": "Niels Bohr atomic theory can used to explain the structure of all atoms. Niels Bohr atomic theory was a combination of Rutherford’s model and an idea of atom, with quantum theory, which is introduced by Max Plank. Niels Henrik David Bohr (1885-1962) was published his Niels Bohr atomic theory in 1913. He was a Danish physicist and he got Nobel Prize in 1922 in physics for atomic structure and quantum mechanics. He was one of the most influential scientists in 20th century."}, {"url": "http://www.livescience.com/32016-niels-bohr-atomic-theory.html", "passage_text": "View full size image. Niels Bohr was one of the foremost scientists of modern physics, best known for his substantial contributions to quantum theory and his Nobel Prize-winning research on the structure of atoms. Born in Copenhagen in 1885 to well-educated parents, Bohr became interested in physics at a young age. Combining Rutherford's description of the nucleus and Planck's theory about quanta, Bohr explained what happens inside an atom and developed a picture of atomic structure. This work earned him a Nobel Prize of his own in 1922."}, {"url": "https://en.wikipedia.org/wiki/Niels_Bohr", "passage_text": "[nels ˈb̥oɐ̯ˀ] ; 7 October 1885 – 18 November 1962) was a Danish physicist who made foundational contributions to understanding atomic structure and quantum theory, for which he received the Nobel Prize in Physics in 1922. Bohr was also a philosopher and a promoter of scientific research. Bohr developed the Bohr model of the atom, in which he proposed that energy levels of electrons are discrete and that the electrons revolve in stable orbits around the atomic nucleus but can jump from one energy level (or orbit) to another. Bohr founded the Institute of Theoretical Physics at the University of Copenhagen, now known as the Niels Bohr Institute, which opened in 1920. Bohr mentored and collaborated with physicists including Hans Kramers, Oskar Klein, George de Hevesy and Werner Heisenberg."}, {"url": "http://www.nobelprize.org/nobel_prizes/physics/laureates/1922/bohr-facts.html", "passage_text": "The Bohr's Theory. The discoveries of the electron and radioactivity at the end of the 19th century led to different models for the structure of the atom. In 1913, Niels Bohr proposed a theory for the hydrogen atom based on quantum theory that energy is transferred only in certain well defined quantities. Electrons should move around the nucleus but only in prescribed orbits. When jumping from one orbit to another with lower energy, a light quantum is emitted"}, {"url": "http://chemistry.tutorcircle.com/inorganic-chemistry/niels-bohr-atomic-theory.html", "passage_text": "Niels Bohr Quantum Theory. Neils Bohr was the first to apply the quantum theory to atomic structure. The quantum theory of atomic processes was proposed by Niels Bohr in the year 1913 and was based on the atomic model proposed earlier by Rutherford. The quantum theory of atomic processes was proposed by Niels Bohr in the year 1913, and was based on the atomic model proposed earlier by Rutherford."}]