[{"url": "https://en.wikipedia.org/wiki/Hashimoto%27s_thyroiditis", "passage_text": "From Wikipedia, the free encyclopedia. Hashimoto's thyroiditis or chronic lymphocytic thyroiditis is an autoimmune disease in which the thyroid gland is attacked by a variety of cell-and antibody-mediated immune processes, causing primary hypothyroidism. "}, {"url": "http://www.earthclinic.com/cures/hashimotos_thyroiditis.html", "passage_text": "Hashimoto’s disease is a condition that affects this gland and disrupts the functioning of the thyroid. Hashimoto’s thyroiditis, also known as lymphocytic thyroiditis, is a condition in which the immune system attacks the thyroid gland, causing inflammation and decreased activity of the thyroid."}, {"url": "http://www.medicinenet.com/hashimotos_thyroiditis/article.htm", "passage_text": "Hashimoto's thryoiditis is an autoimmune condition that is a common cause of hypothyroidism. In Hashimoto's thyroiditis, the body mounts an immune reaction against its own thyroid gland tissue, leading to inflammation of the gland (thyroiditis). 1 Hashimoto's thyroiditis is caused by an autoimmune process that causes inflammation of the thyroid gland. 2  Symptoms of Hashimoto's thyroiditis are those of hypothyroidism and include. 3  feeling cold, 4  depression, 5  dry skin, 6  constipation, 7  fatigue, 8  sleepiness, and."}, {"url": "http://www.naturalnews.com/048539_Hashimotos_disease_autoimmune_conditions_hypothyroidism.html", "passage_text": "(NaturalNews) Common symptoms of Hashimoto's disease plus nearly 100 other autoimmune conditions include fatigue, low-grade fever, inability to stay mentally focused, and (usually) an unexplainable feeling of chronic sickness or pain. Sadly, conventional medicine would have you believe there is no cure. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/hashimotos-disease/basics/symptoms/CON-20030293", "passage_text": "You might not notice signs or symptoms of Hashimoto's disease at first, or you may notice a swelling at the front of your throat (goiter). Hashimoto's disease typically progresses slowly over years and causes chronic thyroid damage, leading to a drop in thyroid hormone levels in your blood. The signs and symptoms are mainly those of an underactive thyroid gland (hypothyroidism). Signs and symptoms of hypothyroidism include: 1  Fatigue and sluggishness."}, {"url": "http://www.medicinenet.com/hashimotos_thyroiditis/article.htm", "passage_text": "Hashimoto's thyroiditis is a condition caused by inflammation of the thyroid gland. It is an autoimmune disease, which means that the body inappropriately attacks the thyroid gland-as if it was foreign tissue. The underlying cause of the autoimmune process remains unknown. 1 Hashimoto's thyroiditis is caused by an autoimmune process that causes inflammation of the thyroid gland. 2  Symptoms of Hashimoto's thyroiditis are those of hypothyroidism and include. 3  feeling cold, 4  depression, 5  dry skin, 6  constipation, 7  fatigue, 8  sleepiness, and."}, {"url": "http://www.webmd.com/women/hashimotos-thyroiditis-symptoms-causes-treatments", "passage_text": "Symptoms of Hashimoto's Thyroiditis. Hashimoto's symptoms may be mild at first or take years to develop. The first sign of the disease is often an enlarged thyroid, called a goiter. The goiter may cause the front of your neck to look swollen. A large goiter may make swallowing difficult. Other symptoms of an underactive thyroid due to Hashimoto's may include: 1  weight gain. 2  fatigue. 3  paleness or puffiness of the face"}, {"url": "http://www.mayoclinic.org/diseases-conditions/hashimotos-disease/basics/definition/CON-20030293", "passage_text": "Thyroid gland. Hashimoto's disease is a condition in which your immune system attacks your thyroid, a small gland at the base of your neck below your Adam's apple. The thyroid gland is part of your endocrine system, which produces hormones that coordinate many of your body's activities. Doctors test your thyroid function to help detect Hashimoto's disease. Treatment of Hashimoto's disease with thyroid hormone replacement usually is simple and effective. 1  Symptoms."}, {"url": "http://www.webmd.com/women/hashimotos-thyroiditis-symptoms-causes-treatments", "passage_text": "In this article. Also called Hashimoto's disease, Hashimoto's thyroiditis is an autoimmune disease, a disorder in which the immune system turns against the body's own tissues. In people with Hashimoto's, the immune system attacks the thyroid. The first sign of the disease is often an enlarged thyroid, called a goiter. The goiter may cause the front of your neck to look swollen. A large goiter may make swallowing difficult. Other symptoms of an underactive thyroid due to Hashimoto's may include: 1  weight gain. 2  fatigue."}, {"url": "http://womenshealth.gov/publications/our-publications/fact-sheet/hashimoto-disease.html", "passage_text": "Hashimoto’s disease is an autoimmune disease that affects the thyroid. It also is called Hashimoto’s thyroiditis (theye-royd-EYET-uhss). The thyroid is a small gland in the front of the neck. The thyroid makes hormones called T3 and T4 that regulate how the body uses energy. Many people with Hashimoto’s disease have no symptoms for years. An enlarged thyroid, called a goiter, is often the first sign of disease. The goiter may cause the front of the neck to look swollen. You or your doctor may notice the goiter."}]