[{"url": "https://en.wikipedia.org/wiki/Gymnosperm", "passage_text": "Their naked condition stands in contrast to the seeds and ovules of flowering plants (angiosperms), which are enclosed within an ovary. Gymnosperm seeds develop either on the surface of scales or leaves, often modified to form cones, or at the end of short stalks as in Ginkgo. The gymnosperms and angiosperms together compose the spermatophytes or seed plants. By far the largest group of living gymnosperms are the conifers (pines, cypresses, and relatives), followed by cycads, gnetophytes (Gnetum, Ephedra and Welwitschia), and Ginkgo (a single living species)"}, {"url": "http://www.theplantlist.org/browse/G/", "passage_text": "The Gymnosperms (Conifers, cycads and allies). are seed-bearing vascular plants, such as cycads, ginkgo, yews and conifers, in which the ovules or seeds are not enclosed in an ovary. The word gymnosperm comes from the Greek word gymnospermos, meaning naked seeds. Gymnosperm seeds develop either on the surface of scale or leaf-like appendages of cones, or at the end of short stalks. The largest group of living gymnosperms are the conifers (pines, cypresses and relatives) and the smallest is ginkgo, a single living plant species found in China. There are around 1000 species of gymnosperm. You can also browse genera found in Gymnosperm"}, {"url": "http://www.answers.com/Q/Examples_of_gymnosperms", "passage_text": "Gymnosperm is a word to refer to a plant with a vascular system that reproduces with seeds, but does not flower. The word 'gymnosperm' means 'naked seed' in Latin. There are four different divisions of gymnosperm-pinophyta (or conifers), ginkgophyta (or ginkgos), cycadophyta (or cycads) and gnetophyta (or gnetum, ephedra, and welwitschia). Gymnosperms rely on wind pollination to reproduce"}, {"url": "http://www.examples10.com/e/gymnosperms/", "passage_text": "Gymnosperms. Gymnosperm is a word to refer to a plant with a vascular system that reproduces with seeds, but does not flower. There are four different divisions of gymnosperm-pinophyta, or conifers, ginkgophyta, or ginkgos, cycadophyta, or cycads, and gnetophyta, or gnetum, ephedra, and welwitschia. Gymnosperms rely on wind pollination to reproduce. The word gymnosperm means naked seed in Latin. Examples of gymnosperms :"}, {"url": "https://en.wikipedia.org/wiki/Gymnosperm", "passage_text": "Gymnosperms, like all vascular plants, have a sporophyte-dominant life cycle. The gametophyte (gamete-bearing phase) is relatively short-lived. Two spore types, microspores and megaspores, are typically produced in pollen cones or ovulate cones, respectively. Gymnosperm seeds develop either on the surface of scales or leaves, often modified to form cones, or at the end of short stalks as in Ginkgo."}, {"url": "http://dendro.cnre.vt.edu/forsite/idtype.htm", "passage_text": "--Gymnosperms are a taxonomic class that includes plants whose seeds are not enclosed in an ovule (like a pine cone). Gymnosperm means as naked seed. This group is often referred to as softwoods. Gymnosperms usually have needles that stay green throughout the year. Examples are pines, cedars, spruces and firs. Some gymnosperms do drop their leaves-ginkgo, dawn redwood, and baldcypress, to name a few. --Angiosperms are a taxonomic class of plants in which the mature seed is surrounded by the ovule (think of an apple). This group is often referred to as hardwoods. Angiosperms are trees have broad leaves that usually change color and die every autumn. Oaks, maples and dogwoods are examples of deciduous trees"}, {"url": "http://www.examplesof.com/science/gymnosperms.html", "passage_text": "Example of Gymnosperms. Gymnosperms are an ancient class of seed plants, related to the pre dinosaur era flora, and are believed to have originated in the late Carboniferous Period, about 360 million years ago. This class includes cycads, confers gnetophytes and ginkgoes. "}]