[{"url": "http://work.chron.com/starting-wages-new-rns-1895.html", "passage_text": "As you increase your specialty focus as an RN, you also increase your earning power. For example, an RN specializing in anesthesia can earn a starting salary of $110,000 to $130,000 annually, according to a 2009 study of wages reported by the Certified Registered Nurse Anesthetist website. The more education you have as an RN, the more you make starting out, according to the Journal of Nursing. An RN with a bachelor's degree can expect a starting salary of between $40,000 and $50,000 each year. A master's degree-holding RN should earn between $50,000 and $62,000 per year as a starting salary. Related Reading: The Effects of Starting a New Career"}, {"url": "http://money.usnews.com/careers/best-jobs/registered-nurse/salary", "passage_text": "Salary Outlook. The BLS reports the median salary for a registered nurse was $66,220 in 2013. The best-paid 10 percent of RNs made more than $96,320, while the bottom 10 percent earned less than $45,630. The highest-paid RN positions are clustered in California, including the metropolitan areas of San Francisco, San Jose and Vallejo. In 2013, registered nurses made an average salary of $68,910, which is pretty good pay compared with some of the other health care professions on this year’s Best Jobs list."}, {"url": "http://work.chron.com/starting-salaries-registered-nurses-two-year-degree-9078.html", "passage_text": "Hospitals hire registered nurses with a two-year associate degree in nursing from a junior or a community college and pay first year salaries slightly below $44,000 according to May 2011 estimates from the Bureau of Labor Statistics, or BLS. "}, {"url": "http://money.usnews.com/careers/best-jobs/registered-nurse/salary", "passage_text": "$67,930. In 2013, registered nurses made an average salary of $68,910, which is pretty good pay compared with some of the other health care professions on this year’s Best Jobs list. The highest-paid RN positions are clustered in California, including the metropolitan areas of San Francisco, San Jose and Vallejo. In 2013, registered nurses made an average salary of $68,910, which is pretty good pay compared with some of the other health care professions on this year’s Best Jobs list."}, {"url": "http://www.topregisterednurse.com/salary/", "passage_text": "As per the Bureau of Labor Statistics, the average income for registered nurses was $68,910 per annum, in May 2013. The mean hourly wages was reported to be $33.13. The total number of RNs employed throughout the USA was 2,661,890. Hourly RN Salary on Different Percentile Brackets. 1  90% RNs made less than $46.31 per hour; 10% RNs made above $46.31. 2  75% earned less than $38.55; 25% earned more than $38.55. 3  The income of 50% employees was below $31.84 per hour; while the other 50% enjoyed hourly salary more than $31.84."}, {"url": "http://www.registerednursern.com/registered-nurse-rn-salary-pay-wages-and-income-of-registered-nurses/", "passage_text": "The starting salary of a Registered Nurse can range from around $28,000-$50,000 per year on average. The starting hourly wage of an RN can range from $16.50-26.00 per hour. This salary will increase over time, as nurses gain experience, certifications, and specialize in a specific area. Registered nurses can also advance their career to managment postions, in addition to regular raises offered by employers. According to the Bureau of Labor Statistics lastest data, the average salary of a registered nurse in the United States is $69,790. The average hourly wage of a registered nurse is $33.55. Keep in mind that these are only averages, and that a registered nurse may make more or less than these amounts based on location, experience, and other factors. In addition, the starting salaries for an RN may be much less than the average salary"}, {"url": "http://money.usnews.com/careers/best-jobs/registered-nurse", "passage_text": "Salary. The BLS reports the median salary for a registered nurse was $66,220 in 2013. The best-paid 10 percent of RNs made more than $96,320, while the bottom 10 percent earned less than $45,630. "}]