[{"url": "http://uk.practicallaw.com/5-517-2055", "passage_text": "A standard document for the sale of residential freehold land by a mortgagee. This standard document incorporates the Standard Conditions of Sale (Fifth Edition) (SCS). A number of the provisions in the contract modify and exclude the SCS. Where title to the Property (or part of it) is unregistered, it may be convenient to annex the epitome of title to the contract (see Annex 3). For a form of epitome that may be used for this purpose, see Standard document, Epitome of title (www.practicallaw.com/5-383-5260) ."}, {"url": "http://www.finance.gov.au/sites/default/files/v1-ContractTemplate.pdf", "passage_text": "Commonwealth of Australia Standard Form Contract Drafting Note: This template is to be used with the Commonwealth Standard Form Request for Offer Template for routine procurement of general goods and services with an estimated value of less than $80,000 and which the agency has assessed as being a low risk procurement. "}, {"url": "http://uk.practicallaw.com/5-517-2055", "passage_text": "If the Borrower is bankrupt or a trustee in bankruptcy has been appointed, you should use Standard document, Contract for the sale of residential freehold property by trustee in bankruptcy (www.practicallaw.com/6-422-4461) . Where title to the Property (or part of it) is unregistered, it may be convenient to annex the epitome of title to the contract (see Annex 3). For a form of epitome that may be used for this purpose, see Standard document, Epitome of title (www.practicallaw.com/5-383-5260) ."}, {"url": "http://smallbusiness.chron.com/legal-wording-contracts-63215.html", "passage_text": "Two Types of Contracts. The basic component of contract law is the differentiation between simple contracts and deeds. Contrary to the wording, a simple contract does not necessarily mean that it's free of complexity. Almost all contracts -- whether made in writing, by word of mouth or implied by action -- are simple contracts. Deeds are the other form of contract. Siri Stafford/Photodisc/Getty Images. During the course of business, organizations enter into contracts with vendors, customers, employees and suppliers. As an agreement that is legally binding, contracts contain specific wording that can sometimes be difficult to understand."}, {"url": "http://uk.practicallaw.com/5-517-2055", "passage_text": "The Protocol requires a seller to prepare a draft contract incorporating the Standard Conditions of Sale (Fifth Edition) (SCS) and discourages the use of further clauses when using the standard form of contract (see paragraph 24(1) in Stage B of the Protocol). Where title to the Property (or part of it) is unregistered, it may be convenient to annex the epitome of title to the contract (see Annex 3). For a form of epitome that may be used for this purpose, see Standard document, Epitome of title (www.practicallaw.com/5-383-5260) ."}, {"url": "http://www.bmmagazine.co.uk/columns/termination-of-contracts/", "passage_text": "One important point to bear in mind if you want to terminate a contract is: be sure that you comply strictly with the wording of the relevant provisions. Contracts often have a clause which specifies how notices are to be given – e.g. by recorded delivery. "}, {"url": "http://uk.practicallaw.com/5-517-2055", "passage_text": "This clause is based on Standard clause, Entire agreement: property documents (www.practicallaw.com/7-504-3977) but is amended for use in a contract for sale in an insolvency context. The entire agreement clause limits the Buyer's ability to rely on representations and warranties. Where title to the Property (or part of it) is unregistered, it may be convenient to annex the epitome of title to the contract (see Annex 3). For a form of epitome that may be used for this purpose, see Standard document, Epitome of title (www.practicallaw.com/5-383-5260) ."}, {"url": "http://www.mondaq.com/x/110368/Contract+Law/An+A+to+Z+of+Contract+Clauses+Key+Terms+for+your+Contracts", "passage_text": "T is for Termination. It is common is most commercial contracts to see a termination clause which enables the parties to terminate the contract prior to the expiry of the contract's stipulated term. The clause sets out automatic triggers which enable immediate termination of the contract or termination on notice."}]