[{"url": "http://study.com/academy/lesson/sensory-details-in-writing-definition-examples.html", "passage_text": "Sensory details include sight, sound, touch, smell, and taste. Sensory details engage the reader's interest, and should be incorporated to add more depth to your writing. Imagery is the sight sense. A narrator is the speaker in a story."}, {"url": "http://study.com/academy/lesson/supporting-details-definition-examples-lesson.html", "passage_text": "When writing, it's really important to keep your reader engaged. Whether you're writing a persuasive piece or a narrative, you want to be descriptive and to the point. Be sure to include supporting details in your writing to provide information that supports the topic sentence. To do this, you can use descriptive words, examples, comparisons, reasons, explanations, facts and connect to the topic sentence or subject. To unlock this lesson you must be a Study.com Member."}, {"url": "http://www.yourdictionary.com/detail", "passage_text": "The definition of detail is to describe or give information about something, or to clean and shine all parts of an automobile. 1  When you describe your plan to a friend, this is an example of when you detail your plan. 2  Washing and waxing the dashboard of a car is an example of a step to detail a car."}, {"url": "http://study.com/academy/lesson/sensory-details-in-writing-definition-examples.html", "passage_text": "Sensory Details Definition. Sensory details include sight, sound, touch, smell, and taste. Writers employ the five senses to engage a reader's interest. If you want your writing to jump off the page, then bring your reader into the world you are creating."}, {"url": "http://www.merriam-webster.com/dictionary/detail", "passage_text": ": to state particular facts or information about (something) : to describe or discuss the details of (something). : to thoroughly clean (a car) in an attempt to make it look new. : to choose (a person or group of people) to do a special job."}, {"url": "http://www.thefreedictionary.com/details", "passage_text": "To report or relate explicitly or in particulars: detailed the charges against the defendant. 2. To provide with artistic or decorative detail: detailed the quilt with colorful applique. appliqué. 3 to assign to a particular: Duty the musicians and other-non combatants were detailed to carry the (Stretchers Peter). cozzens"}, {"url": "http://grammar.about.com/od/d/g/Detail-term.htm", "passage_text": "By Richard Nordquist. Definition: In composition, a particular item of information (including descriptive, illustrative, and statistical information) that supports an idea or contributes to an overall impression in an essay, report, or other kind of text or presentation."}]