[{"url": "http://www.costowl.com/home-improvement/siding-stucco-cost.html", "passage_text": "1 Stucco siding installation costs $7.50 to $10 per square foot. 2  Synthetic stucco may be slightly more expensive. 3  On a home with 1,500 exterior square feet, that s a total cost of approximately $11,000 to $15,000."}, {"url": "http://www.answermefast.com/How_much_does_redoing_stucco_cost-qna36592.html", "passage_text": "Someone said: The cost of stucco for a 1800 sqft Home would be roughly $20000. I would definitely look into james hardie cement board with a panel detailed install as it would give you the stucco look for less and last longer. Check out our website www.mlworks.ca."}, {"url": "http://home.costhelper.com/stucco.html", "passage_text": "1 Costs vary considerably for smaller projects, such as repairing the stucco after installing new windows. 2  For example, a Northern California contractor has a minimum fee of $1,200 to repair stucco around two medium-sized windows."}, {"url": "http://homewyse.com/services/cost_to_install_stucco.html", "passage_text": "Get an INSTANT estimate of the cost to Install Stucco! Our free calculator uses recent, trusted data to estimate costs for your Stucco Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Stucco ranges between $6.79 - $11.78 per square foot* ."}, {"url": "http://www.zillow.com/advice-thread/Whole-House-Demo-Stucco-Redo-with-Wood-Siding/520756/", "passage_text": "The house they bought is two stories and about 2400 sq ft. The area is 90005 Los Angeles. They are charging us $40,000 to demolish the stucco and re-do the entire house with wood paneling. This doesn't include the cost of putting in new windows, as they're charging us separately for that."}, {"url": "http://home.costhelper.com/stucco.html", "passage_text": "Typical costs: 1  Stucco installation runs around $6-$9 a square foot, or about $12,000-$18,000 for a 2,000-square-foot exterior of a 3-bedroom home, depending on the complexity of the project, the location and the local economy."}]