[{"url": "https://en.wikipedia.org/wiki/Rain", "passage_text": "The urban heat island effect leads to increased rainfall, both in amounts and intensity, downwind of cities. Global warming is also causing changes in the precipitation pattern globally, including wetter conditions across eastern North America and drier conditions in the tropics. When air turbulence occurs, water droplets collide, producing larger droplets. As these larger water droplets descend, coalescence continues, so that drops become heavy enough to overcome air resistance and fall as rain."}, {"url": "http://www.metoffice.gov.uk/learning/rain/why-does-it-rain", "passage_text": "There are three different ways of turning moist air into cloud, so that it rains or snows. Rain-and other forms of precipitation-occur when warm moist air cools and condensation occurs. Since warm air can hold more water than cool air, when the warmer air is cooled the moisture condenses to liquid-and it rains. The video and text below explain how rain forms and the different types of rain that we get in the UK. Frontal rain occurs when two air masses meet. When a warm air mass meets a cold air mass, they don't mix as they have different densities (a bit like oil and water)."}, {"url": "http://ww2010.atmos.uiuc.edu/(Gh)/guides/mtr/cld/prcp/home.rxml", "passage_text": "SectionsLatest Update: 07/21/97 Rain and Hail Atmospheric conditions that lead to the development of rain and hail. Freezing Rain A detailed look at freezing rain, associated dangers and the conditions that lead to its development. Sleet Atmospheric conditions that lead to the development of sleet. "}, {"url": "https://en.wikipedia.org/wiki/Rain", "passage_text": "Rain is liquid water in the form of droplets that have condensed from atmospheric water vapor and then precipitated —that is, become heavy enough to fall under gravity. Rain is a major component of the water cycle and is responsible for depositing most of the fresh water on the Earth. It provides suitable conditions for many types of ecosystems, as well as water for hydroelectric power plants and crop irrigation. When air turbulence occurs, water droplets collide, producing larger droplets. As these larger water droplets descend, coalescence continues, so that drops become heavy enough to overcome air resistance and fall as rain."}, {"url": "https://answers.yahoo.com/question/index?qid=20080422040509AADcpqx", "passage_text": "A-warm, moist air rises Reason: As the warm air rises it cools. When it cools, it will hit the dew point temperature which is always lower than the air temperature. This is when the moisture condenses into water droplets and will eventually lead to rain. Source(s): Student meteorologist. Mr. Weather · 8 years ago"}, {"url": "http://www.mayoclinic.org/diseases-conditions/hypothermia/basics/causes/con-20020453", "passage_text": "Hypothermia occurs when your body loses heat faster than it produces it. The most common causes of hypothermia are exposure to cold-weather conditions or cold water. But prolonged exposure to any environment colder than your body can lead to hypothermia if you aren't dressed appropriately or can't control the conditions. Specific conditions leading to hypothermia include: 1  Wearing clothes that aren't warm enough for weather conditions. 2  Staying out in the cold too long."}, {"url": "http://water.usgs.gov/edu/watercycleprecipitation.html", "passage_text": "Water cycle for kids poster. Precipitation is water released from clouds in the form of rain, freezing rain, sleet, snow, or hail. It is the primary connection in the water cycle that provides for the delivery of atmospheric water to the Earth. Most precipitation falls as rain"}, {"url": "http://www.krysstal.com/rain.html", "passage_text": "As it is always warmer than the surrounding air, it continues rising. Low pressure leads to unstable air conditions. When the ground is heated, the air will rise and keep rising. Eventually, the rising air will cool enough to produce condensation (cloud and rain). When the atmosphere is at high pressure, the rising air bubble is always cooler than the surrounding air. When the ground is heated, the air will not rise. If air does not rise, rain cannot condense. Convection rain requires a warm ground and low pressure. It causes short showers interspaced with sunny periods."}, {"url": "http://www.krysstal.com/rain.html", "passage_text": "High pressure leads to stable air conditions. When the ground is heated, the air will not rise. If air does not rise, rain cannot condense. Convection rain requires a warm ground and low pressure. It causes short showers interspaced with sunny periods."}]