[{"url": "https://in.answers.yahoo.com/question/index?qid=20090211075717AA2xO4y", "passage_text": "A peptide bond is a chemical bond formed between two molecules when the carboxyl group of one molecule reacts with the amine group of the other molecule, thereby releasing a molecule of water (H2O). This is a dehydration synthesis reaction (also known as a condensation reaction), and usually occurs between amino acids."}, {"url": "https://answers.yahoo.com/question/index?qid=20070508200048AASDrLM", "passage_text": "Best Answer: Proteins are linear polymers formed by linking the a-carboxyl group of one amino acid to the a-amino group of another amino acid with a peptide bond (also called an amide bond). The formation of a dipeptide from two amino acids is accompanied by the loss of a water molecule (Figure 3.18)."}, {"url": "http://www.answers.com/Q/How_is_a_peptide_bond_formed", "passage_text": "A peptide bond is a covalent chemical bond formed between two molecules when the carboxyl group of one molecule reacts with the amino group of the other molecule, thereby releasing a molecule of water (H2O). This is a dehydration synthesis reaction."}, {"url": "https://en.wikipedia.org/wiki/Peptide", "passage_text": "The covalent chemical bonds are formed when the carboxyl group of one amino acid reacts with the amino group of another. The shortest peptides are dipeptides, consisting of 2 amino acids joined by a single peptide bond, followed by tripeptides, tetrapeptides, etc."}, {"url": "http://www.open.edu/openlearn/science-maths-technology/science/biology/proteins/content-section-1.2", "passage_text": "The peptide bonds that link amino acid residues in a polypeptide are formed in a condensation reaction between the acidic carboxyl group of one amino acid and the basic amino group of another amino acid. In the context of a peptide, the amide group (CO–NH) is referred to as the peptide group."}, {"url": "http://www.answers.com/Q/Peptide_bonds_form_between", "passage_text": "A peptide bond is a covalent chemical bond formed between two molecules when the carboxyl group of one molecule reacts with the amino group of the other molecule, thereby rele … asing a molecule of water (H2O). This is a dehydration synthesis reaction. 17 people found this useful."}, {"url": "http://www.phschool.com/science/biology_place/biocoach/translation/pepb.html", "passage_text": "Amino acids are joined together in proteins by peptide bonds. A peptide bond forms between the carboxyl group of one amino acid (amino acid 1 in the figure below) and the amino group of the adjacent amino acid (amino acid 2)."}, {"url": "https://answers.yahoo.com/question/index?qid=20070508200048AASDrLM", "passage_text": "A peptide bond is a chemical bond formed between two molecules when the carboxyl group of one molecule reacts with the amino group of the other molecule, releasing a molecule of water (H2O). This is a dehydration synthesis reaction (also known as a condensation reaction), and usually occurs between amino acids."}]