[{"url": "http://www.jointandspine.com/prp-therapy/what-is-prp/", "passage_text": "Platelet Rich Plasma Therapy, also referred to as PRP Therapy, is a progressive non-surgical treatment to treat a variety of orthopedic conditions including arthritis, tendon injuries, and ligament injuries. PRP is part of a group of state-of-the-art treatments collectively referred to as Regenerative Medicine."}, {"url": "http://www.regenlabusa.com/", "passage_text": "1 As the Autologous-Platelet Rich Plasma (A-PRP) is processed from the patients own blood, there is no risk of allergy or rejection with this treatment."}, {"url": "http://illinoispain.com/prptreatment/", "passage_text": "Platelet‐Rich Plasma treatment, also known as PRP, is growing in popularity among many famous athletes such as Matt Forte, Derrick Rose, Maria Sharapova, Brian Urlacher, and Kobe Bryant, just to name a few."}, {"url": "http://orthonc.com/news-updates/news-archives/what-prp-therapy", "passage_text": "PRP is Platelet-Rich Plasma therapy. Although an emerging technology and technique in sports medicine, it has been used since the mid-1990’s in dental and oral surgery and to aid in soft tissue recovery following plastic surgery."}, {"url": "http://orthonc.com/news-updates/news-archives/what-prp-therapy", "passage_text": "PRP therapy, which takes approximately twenty minutes to complete, begins with collection of 30 milliliters of the patient’s blood. The blood sample is placed in a centrifuge to separate the platelet-rich plasma from the other components of whole blood."}, {"url": "http://www.emoryhealthcare.org/sports-medicine/procedures/prp-therapy.html", "passage_text": "Athletes and active individuals who endure chronic pain from tendon injuries or osteoarthritis may finally get relief from a safe, non-surgical procedure. It's called Platelet-Rich Plasma (PRP) Therapy, and it utilizes platelets from the athletes' own blood to rebuild a damaged tendon or cartilage. It has been successful in not only relieving the pain, but also in jumpstarting the healing process."}, {"url": "https://www.hss.edu/condition-list_prp-injections.asp", "passage_text": "The use of platelet rich plasma (PRP), a portion of the patient’s own blood having a platelet concentration above baseline, to promote healing of injured tendons, ligaments, muscles, and joints, can be applied to various musculoskeletal problems."}]