[{"url": "http://www.hepatitis.va.gov/patient/hbv/what-it-is.asp", "passage_text": "Hepatitis B. The term hepatitis means inflammation of the liver. When the liver is inflamed, it can have a harder time doing some of its jobs. (See Understanding the Liver .) A hepatitis virus is one that lives in liver cells and causes inflammation."}, {"url": "http://www.hepatitis.va.gov/patient/hbv/what-it-is.asp", "passage_text": "Hepatitis B virus is contained in blood and body fluids. It is not contained in food or water. It is passed from person to person when blood, semen, or other body fluid infected with the virus enters the body of a person who is not infected."}, {"url": "http://www.webmd.com/hepatitis/hepb-guide/hepatitis-b-topic-overview", "passage_text": "Topic Overview. Hepatitis B is a virus that infects the liver. Most adults who get it have it for a short time and then get better. This is called acute hepatitis B. Sometimes the virus causes a long-term infection, called chronic hepatitis B. Over time, it can damage your liver. Babies and young children infected with the virus are more likely to get"}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-b.html", "passage_text": "Hepatitis B virus is easily spread through contact with the blood or other body fluids of an infected person. People can also be infected from contact with a contaminated object, where the virus can live for up to 7 days."}, {"url": "http://wwwnc.cdc.gov/travel/diseases/hepatitis-b", "passage_text": "Hepatitis B is a contagious virus that is transmitted through blood, blood products, and other body fluids (such as semen). Travelers can become infected through unprotected sex with an infected person, injection drug use, and transfusions with unscreened blood."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001324/", "passage_text": "Acute hepatitis B is a short-term infection with the hepatitis B virus. Symptoms usually last several weeks but they can last up to 6 months. The infection sometimes clears up because your body is able to fight off the infection and get rid of the virus."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000279.htm", "passage_text": "Hepatitis B infection is caused by the hepatitis B virus (HBV).You can catch hepatitis B through contact with the blood or body fluids (semen, vaginal fluids, and saliva) of a person who has the virus."}, {"url": "http://www.cdc.gov/hepatitis/HBV/PDFs/HepBGeneralFactSheet.pdf", "passage_text": "Hepatitis B is a contagious liver disease that results from infection with the Hepatitis B virus. When first infected, a person can develop an “acute” infection, which can range in severity from a very mild illness with few or no symptoms to a serious condition requiring hospitalization."}]