[{"url": "https://en.wikipedia.org/wiki/Disproportionation", "passage_text": "Disproportionation is a specific type of redox reaction in which a species is simultaneously reduced and oxidised to form two different products. The oxidation state of oxygen is -1/2 in the superoxide free radical anion, -1 in hydrogen peroxide and 0 in dioxygen. 1  In the Cannizzaro reaction, an aldehyde is converted into an alcohol and a carboxylic acid. 2  In the related Tishchenko reaction, the organic redox reaction product is the corresponding ester."}, {"url": "http://encyclopedia2.thefreedictionary.com/Disproportionation+reaction", "passage_text": "An example of a disproportionation reaction that is accompanied by redistribution of alkyl groups is the conversion of alkyl benzenes into a mixture of benzene and polyalkyl benzenes when treated with aluminum chloride: the redistribution of atoms or their groups among molecules of the same substance, as a result of which the substance becomes two or more different substances, some of which have more—and others fewer—of those atoms or groups than the original substance."}, {"url": "https://en.wikipedia.org/wiki/Comproportionation", "passage_text": "Comproportionation or symproportionation is a chemical reaction where two reactants, each containing the same element but with a different oxidation number, will form a product in which the elements involved reach the same oxidation number. 1 Potassium permanganate contains manganese with oxidation number of +7 and reacts with a manganese compound having oxidation number +2 to yield manganese(IV) oxide (manganese dioxide) with oxidation number +4, potassium hydroxide and water."}, {"url": "https://en.wikipedia.org/wiki/Disproportionation", "passage_text": "Another example of biochemical dismutation reaction is the disproportionation of acetaldehyde into ethanol and acetic acid. While in respiration electrons are transferred from substrate (electron donor) to an electron acceptor, in fermentation part of the substrate molecule itself accepts the electrons. The oxidation state of oxygen is -1/2 in the superoxide free radical anion, -1 in hydrogen peroxide and 0 in dioxygen. 1  In the Cannizzaro reaction, an aldehyde is converted into an alcohol and a carboxylic acid. 2  In the related Tishchenko reaction, the organic redox reaction product is the corresponding ester."}, {"url": "http://www.adichemistry.com/general/stoichiometry/reactions/disproportionation.html", "passage_text": "Reaction of Nitrogen dioxide with water. Nitrogen dioxide, NO 2 reacts with water to give nitric and nitrous acids (Ostwald process). It is a disproportionation reaction. The Nitrogen in NO 2 is in +4 oxidation state. It is reduced to nitrous acid, HNO 2 in which the OS of nitrogen is +3 and oxidized to nitric acid, HNO 3 in which the OS of nitrogen is +5. Except fluorine, halogens (Cl 2 ,Br 2, I 2) undergo disproportionation in alkaline medium. They form halide and hypohalite in cold and dilute alkali. Here, one chlorine atom is oxidized to +1 and second is reduced to -1 oxidation states. Whereas, halide and halate are formed in hot and concentrated alkali."}, {"url": "https://en.wikipedia.org/wiki/Disproportionation", "passage_text": "For example, the UV photolysis of mercury(I) chloride Hg 2 Cl 2 → Hg + HgCl 2 is a disproportionation. Mercury (I) is a diatomic dication Hg2+ 2. The oxidation state of oxygen is -1/2 in the superoxide free radical anion, -1 in hydrogen peroxide and 0 in dioxygen. 1  In the Cannizzaro reaction, an aldehyde is converted into an alcohol and a carboxylic acid. 2  In the related Tishchenko reaction, the organic redox reaction product is the corresponding ester."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Disproportionation-Definition.htm", "passage_text": "Definition: Disproportionation is a chemical reaction, typically a redox reaction, where a molecule is transformed into two or more dissimilar products. Disproportionation reactions follow the form: 2A → A' + A. where A, A', and A are all different chemical species. The reverse reaction of disproportionation is called comproportionation. Examples: Hydrogen peroxide converting into water and oxygen is a disproportionation reaction. 2 H 2 O 2 → H 2 O + O 2. Water dissociating into H 3 O + and OH-is an example of a disproportionation reaction that is not a redox reaction."}, {"url": "http://www.answers.com/Q/WHAT_is_disproportionation_reaction", "passage_text": "Share to: A disproportionation reaction is one in which a species has been both oxidised and reduced (that is, the oxidation state of the related species found in the products has incre …. 31 people found this useful. Is a reaction in which a chemical substance is oxidized and reduced at the same time."}, {"url": "http://www.adichemistry.com/general/stoichiometry/reactions/disproportionation.html", "passage_text": "DISPROPORTIONATION. The reaction that involves simultaneous oxidation and reduction of atoms of same element from one oxidation state (OS) to two different oxidation states is known as disproportionation reaction. Except fluorine, halogens (Cl 2 ,Br 2, I 2) undergo disproportionation in alkaline medium. They form halide and hypohalite in cold and dilute alkali. Here, one chlorine atom is oxidized to +1 and second is reduced to -1 oxidation states. Whereas, halide and halate are formed in hot and concentrated alkali."}, {"url": "http://www.answers.com/Q/What_is_disproportionate_reaction", "passage_text": "Is a reaction in which a chemical substance is oxidized and reduced at the same time. "}]