[{"url": "http://www.crystalinks.com/colosseum.html", "passage_text": "The Roman Colosseum. The Colosseum or Coliseum, originally the Flavian Amphitheatre (Latin: Amphitheatrum Flavium, Italian Anfiteatro Flavio or Colosseo), is an elliptical amphitheatre in the centre of the city of Rome, Italy, the largest ever built in the Roman Empire. It is one of the greatest works of Roman architecture and engineering. Unlike earlier amphitheatres that were built into hillsides, the Colosseum is an entirely free-standing structure. It is elliptical in plan and is 189 metres (615 ft / 640 Roman feet) long, and 156 metres (510 ft / 528 Roman feet) wide, with a base area of 6 acres."}, {"url": "http://www.colosseum.net/listingview.php?listingID=11", "passage_text": "Modern Colosseum. Modern Colosseum-Colosseum. During the modern times, 16th and 17th century, the Colosseum became of great interest for the Church. Pope Sixtus V wanted to turn the building into a wool factory. The idea was to provide employment for Rome's prostitutes. His plan never became a reality, because of his premature death. In the 20th and 21st centuries, The Colosseum became a site for Roman Catholic ceremonies. Pope Benedict XVI performs the Stations of the Cross called the Scriptural Way of the Cross, on Good Fridays."}, {"url": "https://en.wikipedia.org/wiki/Colosseum", "passage_text": "The Colosseum's original Latin name was Amphitheatrum Flavium, often anglicized as Flavian Amphitheater. The building was constructed by emperors of the Flavian dynasty, following the reign of Nero. This name is still used in modern English, but generally the structure is better known as the Colosseum. In the Middle Ages, the Colosseum was not regarded as a monument, and was used as what some modern sources label a quarry, which is to say that stones from the Colosseum were taken for the building of other sacred sites."}, {"url": "https://en.wikipedia.org/wiki/Colosseum", "passage_text": "The Colosseum or Coliseum (/kɒləˈsiːəm/ kol-ə-SEE-əm), also known as the Flavian Amphitheatre (Latin: Amphitheatrum Flavium; Italian: Anfiteatro Flavio [amfiteˈaːtro ˈflaːvjo] or Colosseo [kolosˈsɛːo]), is an oval amphitheatre in the centre of the city of Rome, Italy. In the Middle Ages, the Colosseum was not regarded as a monument, and was used as what some modern sources label a quarry, which is to say that stones from the Colosseum were taken for the building of other sacred sites."}, {"url": "http://www.colosseum.net/listingview.php?listingID=2", "passage_text": "Name of Colosseum-Colosseum. The name Colosseum been considered to come from a colossal statue of Nero, that was situated nearby. The statue was given a different signification, by Nero's successors, and probably became a statue in honor of Helios or Apollo. "}, {"url": "http://schools-wikipedia.org/wp/c/Colosseum.htm", "passage_text": "In antiquity, Romans may have referred to the Colosseum by the unofficial name Amphitheatrum Caesareum; this name could have been strictly poetic as it was not exclusive to the Colosseum; Vespasian and Titus, builders of the Colosseum, also constructed an amphitheater of the same name in Puteoli (modern Pozzuoli). By the year 1000 the name Colosseum had been coined to refer to the amphitheatre. The statue itself was largely forgotten and only its base survives, situated between the Colosseum and the nearby Temple of Venus and Roma. The name further evolved to Coliseum during the Middle Ages."}, {"url": "http://www.tickitaly.com/galleries/colosseum-rome-italy.php", "passage_text": "The name Colosseum is in fact a much later addition. It was originally known as the Flavian Amphitheatre, and was conceived as a peculiarly Roman political gesture ... a gift from a new dynasty of Roman emperors to a populace kept happy by bread and circuses. Book tickets for The Roman Colosseum / Guided tour of the Colosseum. The Colosseum, Rome-ticket types, opening times, how to gain admission. The Colosseum, Rome, Italy-visitor information. The Colosseum or Coliseum is today the most recognisable of Rome's Classical buildings."}, {"url": "http://www.ancient.eu/Colosseum/", "passage_text": "The Colosseum or Flavian Amphitheatre is a large ellipsoid arena built in the first century CE under the Roman emperors of the Flavian dynasty: Vespasian (69-79 CE), Titus (79-81 CE) and Domitian (81-96 AD). One of the oldest depictions of the Colosseum appeared on the coins of Titus and shows three tiers, statues in the upper external arches and the large column fountain-the Meta Sudans-which stood nearby."}, {"url": "http://www.crystalinks.com/colosseum.html", "passage_text": "The Colosseum's original Latin name was Amphitheatrum Flavium, often anglicized as Flavian Amphitheater. The building was constructed by emperors of the Flavian dynasty, hence its original name. This name is still used frequently in modern English, but it is generally unknown. Unlike earlier amphitheatres that were built into hillsides, the Colosseum is an entirely free-standing structure. It is elliptical in plan and is 189 metres (615 ft / 640 Roman feet) long, and 156 metres (510 ft / 528 Roman feet) wide, with a base area of 6 acres."}]