[{"url": "http://www.weather-forecast.com/locations/Kirkenes/forecasts/latest", "passage_text": "Kirkenes 10 day weather forecast, updated four times a day and shows the weather summary plus detailed sun, rain, snow, wind and temperature. The weather forecast extends out to 10 days showing information for morning, afternoon and overnight."}, {"url": "http://www.worldweatheronline.com/Kirkenes-weather/Finnmark/NO.aspx", "passage_text": "Kirkenes weather text for Thu 15 th October. The weather is going to be light rain. The visibility is going to be around 9 km i.e. 5 miles and an atmospheric pressure of 1011 mb. The daytime temperature is going to reach 4 °c and the temperature is going to dip to 1 °c at night."}, {"url": "https://weatherspark.com/averages/28866/Kirkenes-Finnmark-Norway", "passage_text": "This report describes the typical weather at the Kirkenes Airport (Kirkenes, Norway) weather station over the course of an average year. It is based on the historical records from 1985 to 2012. Earlier records are either unavailable or unreliable."}, {"url": "https://weatherspark.com/averages/28866/Kirkenes-Finnmark-Norway", "passage_text": "Kirkenes has a humid subarctic continental climate with cool summers and no dry season. The area within 25 mi of this station is covered by forests (32%), oceans and seas (26%), grasslands (22%), tundra (9%), and shrublands (7%)."}, {"url": "http://www.holiday-weather.com/kirkenes_no/averages/", "passage_text": "Kirkenes: Annual Weather Averages. July is the hottest month in Kirkenes with an average temperature of 12°C (53°F) and the coldest is January at -10°C (15°F) with the most daily sunshine hours at 12 in March. The wettest month is July with an average of 50mm of rain. Loading weather data."}, {"url": "http://www.worldweatheronline.com/Kirkenes-weather/Finnmark/NO.aspx", "passage_text": "Kirkenes weather text for Sat 17 th October. The Kirkenes weather is going to be light drizzle. Kirkenes visibility is going to be around 2 km i.e. 1 miles and an atmospheric pressure of 1005 mb. The daytime temperature is going to reach 6 °c and the temperature is going to dip to 3 °c at night."}]