[{"url": "http://www.webmd.boots.com/smoking-cessation/emphysema", "passage_text": "Emphysema. Emphysema is a long-term, progressive disease of the lungs that primarily causes shortness of breath. In people with emphysema the lung tissues necessary to support the physical shape and function of the lung are damaged. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/emphysema/basics/definition/CON-20014218", "passage_text": "Emphysema gradually damages the air sacs (alveoli) in your lungs, making you progressively more short of breath. Emphysema is one of several diseases known collectively as chronic obstructive pulmonary disease (COPD). Smoking is the leading cause of emphysema. Your lungs' alveoli are clustered like bunches of grapes. In emphysema, the inner walls of the air sacs weaken and eventually rupture — creating one larger air space instead of many small ones. This reduces the surface area of the lungs and, in turn, the amount of oxygen that reaches your bloodstream."}, {"url": "http://www.webmd.com/lung/copd/emphysema-symptoms", "passage_text": "In this article. Emphysema is a form of chronic (long-term) lung disease, usually caused by smoking. Because of lung damage, people with emphysema have difficulty blowing air out. The major symptom of emphysema is shortness of breath. In most people, symptoms of emphysema are slowly progressive. Shortness of breath is by far the most common of emphysema symptoms. Most people with emphysema first notice something's wrong when they become winded during a previously routine activity. This might be climbing stairs or mowing the lawn."}, {"url": "http://www.medicalnewstoday.com/articles/8934.php", "passage_text": "Emphysema is a condition that forms part of chronic obstructive pulmonary disease (COPD) and involves the enlargement of the air sacs in the lung. 2-4. The alveoli at the end of the bronchioles of the lung become enlarged because of the breakdown of their walls. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3228", "passage_text": "Emphysema: is a lung condition featuring an abnormal accumulation of air due to enlargement and destruction of the lung's many tiny air sacs resulting in the formation of scar tissue. "}, {"url": "http://medical-dictionary.thefreedictionary.com/emphysema", "passage_text": "Emphysema is a chronic respiratory disease where there is over-inflation of the air sacs (alveoli) in the lungs, causing a decrease in lung function, and often, breathlessness. In the early stages of emphysema, the only result may be dysfunction of the small airways. Patients with emphysema may show an increase in the total amount of air that is in the lungs (total lung capacity), but a decrease in the amount of air that can be breathed out after taking a deep breath (vital capacity)."}, {"url": "http://medical-dictionary.thefreedictionary.com/emphysema", "passage_text": "A. It's a chronic lung disease, characterized by destruction of the walls of the air sacs (alveoli) where the blood exchange oxygen and CO2 with the air. The disease leads to obstruction of the airflow, air trapping inside the lungs, and to many long term complications, and eventually to death. In the early stages of emphysema, the only result may be dysfunction of the small airways. Patients with emphysema may show an increase in the total amount of air that is in the lungs (total lung capacity), but a decrease in the amount of air that can be breathed out after taking a deep breath (vital capacity)."}, {"url": "https://en.wikipedia.org/wiki/Emphysema", "passage_text": "Chronic obstructive pulmonary disease (COPD), also known as chronic obstructive lung disease (COLD), and chronic obstructive airway disease (COAD), among others, is a type of obstructive lung disease characterized by chronically poor airflow. It typically worsens over time. The main symptoms include shortness of breath, cough, and sputum production. Most people with chronic bronchitis have COPD. Tobacco smoking is the most common cause of COPD, with a number of other factors such as air pollution and genetics playing a smaller role."}, {"url": "http://www.webmd.com/lung/copd/what-is-emphysema", "passage_text": "In this article. Emphysema is a form of chronic (long-term) lung disease. People with emphysema have difficulty breathing from a limitation in blowing air out. There are multiple causes of emphysema, but smoking is by far the most common. Emphysema is one of the main types of chronic obstructive pulmonary disease (COPD). "}, {"url": "http://www.merriam-webster.com/dictionary/emphysema", "passage_text": ": a condition characterized by air-filled expansions of body tissues; specifically: a condition of the lung marked by abnormal enlargement of the alveoli with loss of pulmonary elasticity that is characterized especially by shortness of breath and may lead to impairment of heart action. Definition of EMPHYSEMA for Kids. : a disease in which the lungs become stretched and inefficient."}]