[{"url": "http://www.nlda.org/how-to-get-rid-of-wisdom-tooth-pain-24-best-home-remedies/", "passage_text": "It is also a very effective way of getting rid of uncomfortable wisdom tooth pain and will make you feel better in no time. Take a cotton swab and add to it a few drops of vanilla extract. Place this cotton ball directly on the affected tooth and let it sit there for a good 15 minutes or more. A frozen potato is a great home remedy that will get rid of wisdom tooth pain in a jiffy. Take a potato and put it in the freezer for about ten minutes or until well-chilled. Remove the potato from the freezer and cut off a thin slice that will fit directly onto your wisdom tooth."}, {"url": "http://www.nlda.org/how-to-get-rid-of-wisdom-tooth-pain-24-best-home-remedies/", "passage_text": "Rinsing your mouth with warm salt water is one of the easiest and most effective ways to get rid of wisdom tooth pain. Take hot water and dissolve a few tablespoons of salt in it. When the salt water has cooled to a warm temperature, rinse your mouth with it for a few minutes and you will find noticeable relief. A frozen potato is a great home remedy that will get rid of wisdom tooth pain in a jiffy. Take a potato and put it in the freezer for about ten minutes or until well-chilled. Remove the potato from the freezer and cut off a thin slice that will fit directly onto your wisdom tooth."}, {"url": "http://www.webmd.com/first-aid/tc/bruises-and-blood-spots-under-the-skin-home-treatment", "passage_text": "1 Do not massage the bruised area if it causes pain. 2  If your bruise is causing pain, take an over-the-counter pain medicine, such as acetaminophen (Tylenol), ibuprofen (Advil, Motrin), or naproxen (Aleve). 3  Read and follow all instructions on the label. 4  If desired, apply a natural product directly to the bruise. If your bruise does not require an evaluation by a doctor, you may be able to use home treatment to help relieve pain, swelling, and stiffness. 1  Rest and protect a bruised area. 2  Ice will reduce pain and swelling. 3  Apply ice or cold packs immediately to prevent or minimize swelling."}, {"url": "http://snippets.com/what-can-be-done-for-a-bruised-tooth.htm", "passage_text": "Answer by YK (304). A bruised tooth is sometimes caused by grinding or clenching the jaw, especially during sleep. This bruises the pulp inside the tooth, causing pain. A Tylenol can help relieve pain temporarily, but if it persists, go see a dentist. If tooth grinding is the cause, he may need a mouthguard. add a comment. +1 vote! +7. "}, {"url": "http://www.wikihow.com/Get-Rid-of-Tooth-Pain", "passage_text": "You may need to get professional dental treatment in order to get rid of the pain permanently, but in the meantime, there are plenty of first aid and alternative home treatments you can try to soothe the ache. Keep reading to learn more. Get the tooth filled. A dentist may fill your tooth if your tooth pain is caused by tooth decay (cavities) or loose fillings. 1  The dentist will drill out the decayed part of the tooth and fill it with a composite or amalgam filling. 2  As fillings age, they may break down or become loose."}, {"url": "http://www.getridofthings.com/beauty/skin/get-rid-of-bruises/", "passage_text": "I’m here to tell you how to get rid of that bruise. Getting rid of a bruise isn’t really possible. Well, it is and it isn’t. Your body does most of the work itself, but there are some things you can do to help speed your body’s natural healing processes. Read on if you want to know how to get rid of a bruise. "}, {"url": "http://www.wikihow.com/Get-Rid-of-Tooth-Pain", "passage_text": "Cloves have a natural numbing effect and are also effective at killing bacteria. You can use whole cloves, ground cloves, or clove oil to get rid of your tooth pain. 1  If using ground cloves, use clean hands to apply a pinch of ground cloves in between the pained gum and the cheek. Get the tooth filled. A dentist may fill your tooth if your tooth pain is caused by tooth decay (cavities) or loose fillings. 1  The dentist will drill out the decayed part of the tooth and fill it with a composite or amalgam filling. 2  As fillings age, they may break down or become loose."}, {"url": "http://www.nlda.org/how-to-get-rid-of-wisdom-tooth-pain-24-best-home-remedies/", "passage_text": "To use this easy home remedy for wisdom tooth pain, take a dab of your regular toothpaste, put it in a small bowl, and mix a bit of baking soda with it. Apply this paste directly to the tooth that’s hurting and you are sure to notice relief. A frozen potato is a great home remedy that will get rid of wisdom tooth pain in a jiffy. Take a potato and put it in the freezer for about ten minutes or until well-chilled. Remove the potato from the freezer and cut off a thin slice that will fit directly onto your wisdom tooth."}, {"url": "http://www.wikihow.com/Get-Rid-of-Tooth-Pain", "passage_text": "2. Avoid chewing on the painful area. Until you can get rid of the tooth pain, you should chew on the other side of your mouth. 1  In addition to avoiding the hurt area of your mouth, cover any exposed holes responsible for causing the pain. Get the tooth filled. A dentist may fill your tooth if your tooth pain is caused by tooth decay (cavities) or loose fillings. 1  The dentist will drill out the decayed part of the tooth and fill it with a composite or amalgam filling. 2  As fillings age, they may break down or become loose."}]