[{"url": "http://chemistry.illinoisstate.edu/standard/che360/handouts/360entropycalcs.pdf", "passage_text": "4) Chemical Reactions Because S is a state function, the standard molar entropy change for chemical reaction € δ S r ! may be calculated using a method similar to that for calculating standard molar enthalpies of reaction, δ S r ! = !ν i S ii ∑ . (25) In Eq. (1) Also, since the heat evolved at constant pressure is the enthalpy change, € q rev = p δ H, the entropy change for a phase transition becomes € δ S = δ HT. (2) Example Determine the standard molar entropy for the following phase transition occurring at 1 bar pressure and 100°C, 2€ HO (ℓ) → H 2 O (g) . (3) This phase transition is known as vaporization, and the standard molar enthalpy of vaporization, vap€ δ H ! , for water may be found in the literature as 44.0 kJ/mol. The standard molar entropy of vaporization is therefore € δ S vap ! = δ H vap ! T vap = 44.0×10 3 J/mol373 Kδ S vap ! = 118 Jmol −1 K −1"}, {"url": "http://chemistry.illinoisstate.edu/standard/che360/homework/360ps6solns.pdf", "passage_text": "Chemistry 360 Dr. Jean M. Standard Problem Set 6 Solutions 1. Three moles of an ideal gas expand isothermally and reversibly from 90 to 300 L at 300 K. (a) Calculate € δ U m, € mΔ S m, w per mole, and q per mole. For an ideal gas, € δ U = C v T, or in terms of molar quantities, €δ U m = C v, m δ T. Finally, since € dS = dq rev T, for an isothermal process, the molar entropy change is € δ S m = q m T = 3003J/mol300KΔ S m = 10.01Jmol −1 K −1. (b) If the expansion is carried out irreversibly by allowing the gas to expand rapidly into a vacuum, determine € δ U m, €"}, {"url": "http://chemistry.illinoisstate.edu/standard/che360/handouts/360entropycalcs.pdf", "passage_text": "Example Calculate the entropy change for mixing 1 mole of H 2 and 1 mole of O 2 at 25°C and 1 bar pressure. Since there are two moles total of gases, the mole fraction of H 2 is 0.5 and the mole fraction of O 2 is 0.5. Using Eq. (1) Also, since the heat evolved at constant pressure is the enthalpy change, € q rev = p δ H, the entropy change for a phase transition becomes € δ S = δ HT. (2) Example Determine the standard molar entropy for the following phase transition occurring at 1 bar pressure and 100°C, 2€ HO (ℓ) → H 2 O (g) . (3) This phase transition is known as vaporization, and the standard molar enthalpy of vaporization, vap€ δ H ! , for water may be found in the literature as 44.0 kJ/mol. The standard molar entropy of vaporization is therefore € δ S vap ! = δ H vap ! T vap = 44.0×10 3 J/mol373 Kδ S vap ! = 118 Jmol −1 K −1"}, {"url": "https://en.wikipedia.org/wiki/Entropy", "passage_text": "Since entropy is a state function, the entropy change of any process in which temperature and volume both vary is the same as for a path divided into two steps-heating at constant volume and expansion at constant temperature. In which CD is the disorder capacity of the system, which is the entropy of the parts contained in the permitted ensemble, CI is the information capacity of the system, an expression similar to Shannon's channel capacity, and CO is the order capacity of the system."}, {"url": "https://en.wikipedia.org/wiki/Standard_molar_entropy", "passage_text": "From Wikipedia, the free encyclopedia. In chemistry, the standard molar entropy is the entropy content of one mole of substance, under standard conditions (not standard temperature and pressure). The standard molar entropy is usually given the symbol S °, and as units of joules per mole kelvin (J mol −1 K −1). Unlike standard enthalpies of formation, the value of S ° is absolute. That is, an element in its standard state has a nonzero value of S ° at room temperature. The standard molar entropy of a gas at STP includes contributions from: 1  The heat capacity of one mole of the solid from 0 K to the melting point (including heat absorbed in any changes between different crystal structures). 2  The latent heat of fusion of the solid."}, {"url": "http://www.science.uwaterloo.ca/~cchieh/cact/applychem/entropy.html", "passage_text": "For example, the standard molar entropy of some solids are given below: The standard molar entropies (standard entropy per mole) for gases are usually higher because heat of melting and heat of vaporization must be included. The standard molar entropies for noble gases are: "}, {"url": "http://entropysite.oxy.edu/wiki_entropy.html", "passage_text": "If you are now taking a course in chemistry and have a textbook, turn to the table or short list of ‘Standard Molar Entropy Values’ for elements and compounds. (The standard temperature used in such tables is 298.15 K and a solid is (s), a liquid (l), and a gas (g). Of course, we have a start on a good answer to that question: it must have something to do with the motional energy (plus any phase change potential energy) in the substance at that temperature. However, we need one more fact about energy and entropy for a complete understanding."}, {"url": "http://www.alevelchem.com/aqa_a_level_chemistry/unit3.5/s351/01.htm", "passage_text": "The standard enthalpy of formation. The enthalpy of formation is the energy change when 1 mole of a substance is formed from its constituent elements in their standard states. Particular points to note: 1  The elements are in their usual states under standard conditions. i.e at 25ºC and 1 atmosphere pressure (100 kPa). "}]