[{"url": "http://www.abbreviations.com/MDA", "passage_text": "MDA is an Australian television series that aired between 2002 and 2005 on the Australian Broadcasting Corporation. It concerned the day-to-day operation of legal firm MDA, which specialised in medical defence."}, {"url": "https://en.wikipedia.org/wiki/3,4-Methylenedioxyamphetamine", "passage_text": "(January 2015). While MDA is generally similar to MDMA, users report that MDA has more stimulant and psychedelic qualities and less intense entactogenic effects than MDMA. MDA is also considered less predictable than MDMA, with effects varying greatly from person to person."}, {"url": "http://realdealondrugs.blogspot.com/2014/10/what-is-difference-between-mdma-and-mda.html", "passage_text": "MDA has been around for as long as MDMA and is possibly one of the least understood drugs around-certainly there is a lot of mythology about what it is and its effects. It tends to appear on the scene in cycles, particularly when ecstasy quality starts to drop."}, {"url": "http://realdealondrugs.blogspot.com/2014/10/what-is-difference-between-mdma-and-mda.html", "passage_text": "MDA users report more stimulant and hallucinogenic effects. MDA has less entactogenic effects-the effect that ecstasy users are usually looking for. It is important to note that MDA has been linked to some deaths, usually from seizures, hyperthermia or heart problems, possibly due to the stimulant effect of the drug."}, {"url": "https://www.mda.org/", "passage_text": "MDA is the world’s leading nonprofit health organization sponsoring research seeking the causes of and effective treatments for neuromuscular diseases. MDA research grants currently are supporting more than 250 projects worldwide. 1  State of the Science."}, {"url": "http://realdealondrugs.blogspot.com/2014/10/what-is-difference-between-mdma-and-mda.html", "passage_text": "MDA and MDMA are from the same 'family' of drugs, with MDA having properties similar to those of both LSD and amphetamine. In fact MDA was the original 'love drug' until the emergence of MDMA as a street drug in the 1980s. There are no approved medical uses for MDA."}, {"url": "http://www.differencebetween.net/science/health/drugs-health/difference-between-mda-and-mdma/", "passage_text": "MDA, also known as 3, 4-Methylenedioxyamphetamine is a drug which belongs to the phenethylamine and amphetamine chemical classes. It is a stimulant and a psychedelic. It is mainly used as a recreational drug."}]