[{"url": "http://www.u-s-history.com/pages/h374.html", "passage_text": "Robert Whitehill was prominent in the Anti-Federalist opposition to ratification, basing his views both on procedure and the failure of the new constitution to include a bill of rights. He put forward Fourteen Points , in a document that was signed by 21 members of the Pennsylvania convention. This series of essays was probably the most widely known expression of anti-federalist views. The first letter ends: Anti-Federalists were concerned that the constitution did not equally divide power among the three branches of government."}, {"url": "https://quizlet.com/26907632/the-constitution-flash-cards/", "passage_text": "Create a free account to save it. Advertisement Upgrade to remove ads. The origins of the constitution, the government that failed, the Philadelphia convention, the agenda in Philadelphia, the Madisonian Model, Ratifying the Constitution, Constitutional Change, and Understanding the Constitution."}, {"url": "https://en.wikipedia.org/wiki/Anti-Federalism", "passage_text": "The Anti-Federalists played upon these feelings in the ratification convention in Massachusetts. By this point, five of the states had ratified the Constitution with relative ease, but the Massachusetts convention was far more bitter and contentious. Ten of these amendments were immediately ratified and became known as the Bill of Rights, with one of the other two becoming the 27th Amendment —almost 200 years later. Thus, while the Anti-Federalists were unsuccessful in their quest to prevent the adoption of the Constitution, their efforts were not totally in vain."}, {"url": "http://www.constitutionfacts.com/us-articles-of-confederation/the-great-debate/", "passage_text": "The Anti-Federalists. Patrick Henry, Opposer of the Constitution. In the ratification debate, the Anti-Federalists opposed to the Constitution. They complained that the new system threatened liberties, and failed to protect individual rights. The Anti-Federalists weren't exactly a united group, but instead involved many elements. And the push for ratification brought on a seemingly endless barrage of documents, articles, and pamphlets both supporting and opposing it. There were two sides to the Great Debate: the Federalists and t"}, {"url": "https://answers.yahoo.com/question/index?qid=20080808061942AAZwgcn", "passage_text": "Radicals among the Anti-Federalists even believed that the Federal Government might one day raise an army (via conscription and income taxation) and inflict it's will on the various states! They were, of course, correct. Source(s): http://www.teachervision.fen.com/us-hist... Some of the opposition believed that the central government under the Articles of Confederation was sufficient. Still others believed that while the national government under the Articles was too weak, the national government under the Constitution would be too strong. Hope I helped:). catica · 7 years ago."}, {"url": "http://www.constitutionfacts.com/us-articles-of-confederation/the-great-debate/", "passage_text": "This was not easy. And the push for ratification brought on a seemingly endless barrage of documents, articles, and pamphlets both supporting and opposing it. There were two sides to the Great Debate: the Federalists and the Anti-Federalists."}, {"url": "http://www.u-s-history.com/pages/h374.html", "passage_text": "Anti-Federalists believed also that the Federalists were representing the interest of the aristocratic elements in society at the expense of the ordinary people in rural society. This was important at a time when the overwhelming majority of the population lived outside cities and earned a living by working the land. This series of essays was probably the most widely known expression of anti-federalist views. The first letter ends: Anti-Federalists were concerned that the constitution did not equally divide power among the three branches of government."}, {"url": "https://en.wikipedia.org/wiki/Anti-Federalism", "passage_text": "The Articles of Confederation: predecessor to the U.S. Constitution and drafted from Anti-Federalist principles. Anti-Federalism refers to a movement that opposed the creation of a stronger U.S. federal government and which later opposed the ratification of the Constitution of 1788. The previous constitution, called the Articles of Confederation, gave state governments more authority. Ten of these amendments were immediately ratified and became known as the Bill of Rights, with one of the other two becoming the 27th Amendment —almost 200 years later. Thus, while the Anti-Federalists were unsuccessful in their quest to prevent the adoption of the Constitution, their efforts were not totally in vain."}, {"url": "http://www.u-s-history.com/pages/h374.html", "passage_text": "The Anti-Federalists opposed ratification of the Constitution and were typified by: 1  A desire to establish a weak central government (as had been created by the Articles of Confederation). 2  A corresponding desire for strong state governments. This series of essays was probably the most widely known expression of anti-federalist views. The first letter ends: Anti-Federalists were concerned that the constitution did not equally divide power among the three branches of government."}]