[{"url": "http://consumer.georgia.gov/consumer-topics/magistrate-court", "passage_text": "If you can't to resolve a dispute with a person or a business, you may take your problem to magistrate court. Magistrate court, also called small claims court, is an informal court that handles money claims of less than $15,000. This court offers a quick and inexpensive process to resolve complaints. "}, {"url": "http://www.dca.ca.gov/publications/small_claims/basic_info.shtml", "passage_text": "Small claims courts can order a defendant to do something, as long as a claim for money is also part of the lawsuit. If you are suing to get back the lawn mower you loaned to a neighbor, for instance, the court can order the return of the mower, or payment for the mower if it is not returned. You may file as many as you wish for $2,500 or less. The fee for filing in small claims court depends on the amount of the claim: $30 if the claim is for $1,500 or less, $50 if the claim is for more than $1,500 but less than or equal to $5,000, or $75 if the claim is for more than $5,000."}, {"url": "http://www.courts.ca.gov/1062.htm", "passage_text": "Click if you have been sued in small claims. If you have been sued for $10,000 or less in a limited civil case, the plaintiff (the person or company that sued) either could not take you to small claims court (because of the type of case or plaintiff involved) or chose NOT to file in small claims court. 1 For example, in a dispute over whether or not you owe someone money, you can sue in small claims to recover money you paid under protest (which means you have to pay the amount and then go to court to ask for it back). 2  But you cannot sue to get the court to decide whether or not you owe money before you pay it."}, {"url": "http://www.courts.ca.gov/1062.htm", "passage_text": "If you are an individual and want to file a lawsuit for $10,000 or less, you have the option of filing a small claims case or a limited civil case. If you are a business, you can file in small claims court for $5,000 or less. 1 For example, in a dispute over whether or not you owe someone money, you can sue in small claims to recover money you paid under protest (which means you have to pay the amount and then go to court to ask for it back). 2  But you cannot sue to get the court to decide whether or not you owe money before you pay it."}, {"url": "http://www.courts.state.co.us/userfiles/file/SmallClaimsHandBook.pdf", "passage_text": "Can you get what you want? The small claims court is a “court of limited jurisdiction.” This means that the court cannot award more than $7,500,even if your claim is worth more. You will have to waive your right to the amount that exceeds $7,500, or you willhave to bring your claim in a different court. The fee that you will have to pay de-pends on the amount of your claim. The court clerk can tell you how much to pay for the filing fee. Service The Small Claims Rules set out the procedure for serving the complaint on the defendant."}, {"url": "http://flcourts.org/resources-and-services/family-courts/family-law-self-help-information/small-claims.stml", "passage_text": "A small claims case is a legal action filed in county court to settle minor legal disputes among parties where the dollar amount involved is $5,000 or less, excluding costs, interest, and attorneys' fees. Forms that have been approved for statewide use are located within the Florida Small Claims Rules. "}, {"url": "http://www.dca.ca.gov/publications/small_claims/file.shtml", "passage_text": "Before you can sue in small claims court, you must first contact the defendant (or defendants) if it's practical to do so. You must then ask for the money, property, or other relief that you intend to ask the judge to award you in court. In legal terms, you must make a demand on the other person, if possible. You must pay the small claims court a filing fee when you file your case. If you can't afford this expense, you may ask the court to waive (forgive) those fees. You can request a court waiver by completing and filing an Request to Waive Court Fees (FW-001)."}, {"url": "http://www.courts.ca.gov/1062.htm", "passage_text": "If you win, the court can order the losing side to pay your court fees and costs BUT if you filed a limited civil case when you could have filed in small claims court, the judge can decide not to order the losing side to pay for fees and costs. 1 For example, in a dispute over whether or not you owe someone money, you can sue in small claims to recover money you paid under protest (which means you have to pay the amount and then go to court to ask for it back). 2  But you cannot sue to get the court to decide whether or not you owe money before you pay it."}, {"url": "http://www.courts.ca.gov/1256.htm", "passage_text": "If you have filed more than 12 claims in the past 12 months, the filing fee is $100 (for any claim amount). Filing fees change, so make sure you check to see what the current filing fees for small claims cases are at the time of your filing. A temporary judge (called a judge pro tem or judge pro tempore) is someone who has been a lawyer for at least 10 years and is specially trained to hear and decide small claims cases. If you do not want a temporary judge, you can ask the court to have a judge hear your case."}]