[{"url": "http://www.webmd.com/men/weight-loss-bmi", "passage_text": "In this article. Your BMI is based on your height and weight. It's one way to see if you're at a healthy weight. Underweight: Your BMI is less than 18.5. Healthy weight: Your BMI is 18.5 to 24.9. Overweight: Your BMI is 25 to 29.9. Obese: Your BMI is 30 or higher. The chart below shows examples of body mass indexes. The figure at which your height corresponds with your weight is your body mass index"}, {"url": "http://medical-dictionary.thefreedictionary.com/BMI", "passage_text": "body mass index. An index for estimating obesity. The BMI can be obtained by dividing weight in kilograms by height in meters squared, or according to the following formula: BMI = (Weight/2.205) / (Height/39.37) 2. In adults, a BMI greater than 30 kg/m 2 indicates obesity; a BMI greater than 40 kg/m 2 indicates morbid obesity; and a BMI less than 18.5 kg/m 2 indicates a person is underweight. The lowest overall death rate is found in people with a BMI of 20 to 24.9 kg/m 2. See also: index."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=16125", "passage_text": "Abbreviated BMI. BMI is a person's weight in kilograms (kg) divided by his or her height in meters squared. The National Institutes of Health (NIH) now defines normal weight, overweight, and obesity according to BMI rather than the traditional height/weight charts. Overweight is a BMI of 27.3 or more for women and 27.8 or more for men. Obesity is a BMI of 30 or more for either sex (about 30 pounds overweight). "}, {"url": "https://en.wikipedia.org/wiki/Body_mass_index", "passage_text": "The body mass index (BMI) or Quetelet index, is a value derived from the mass (weight) and height of an individual. "}, {"url": "http://bmi.emedtv.com/bmi/what-does-bmi-stand-for-p3.html", "passage_text": "Nearly 61 million adults are obese (defined as a BMI greater than or equal to 30). Approximately 15 percent of children and adolescents are overweight, and another 15 percent are at risk for being overweight (BMI for age between the 85th and 95th percentile). Child obesity is a growing concern in today's world. Keep in mind that BMI is a screening tool; it is not used to diagnose any medical conditions but instead is used as one measure to assess a person's weight and his or her risk for developing certain medical conditions. 1. 2. 3."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=31101", "passage_text": "BMI calculation: A person's weight in kilograms (kg) divided by their height in meters (m) squared. BMI stands for body mass index. With pounds (lbs) and inches, use the following table to calculate the BMI. Find the appropriate height in the left-hand column. Move across the row to the given weight. The number at the top of the column is the BMI for that height and weight"}, {"url": "http://medical-dictionary.thefreedictionary.com/BMI", "passage_text": "body mass index (BMI) the weight in kilograms divided by the square of the height in meters, a measure of body fat that gives an indication of nutritional status. cardiac index cardiac output corrected for body size. In adults, a BMI greater than 30 kg/m 2 indicates obesity; a BMI greater than 40 kg/m 2 indicates morbid obesity; and a BMI less than 18.5 kg/m 2 indicates a person is underweight. The lowest overall death rate is found in people with a BMI of 20 to 24.9 kg/m 2. See also: index."}, {"url": "https://en.wikipedia.org/wiki/Underweight", "passage_text": "(November 2011). Underweight is a term describing a person whose body weight is considered too low to be healthy. The definition usually refers to people with a body mass index (BMI) of under 18.5 or a weight 15% to 20% below that normal for their age and height group. "}, {"url": "http://bmi.emedtv.com/bmi/what-does-bmi-stand-for.html", "passage_text": "BMI stands for body mass index. While BMI does not measure body fat directly, it corresponds pretty closely to direct measures of body fat. Therefore, BMI can be considered an alternative for direct measures of body fat. BMI is determined by a person's height and weight. Because the BMI calculation requires only height and weight, it is inexpensive and easy to use. BMI is used as a method of screening for weight categories that may lead to health problems (see Health Effects of Obesity). "}]