[{"url": "http://www.studymode.com/subjects/minoan-mycenaean-similarities-page1.html", "passage_text": "The Evolution of the Palace. The Evolution of the Palace The Minoans who settled on Crete and the Mycenaean people who settled on several sites on the Grecian mainland were two civilizations that contributed to the cultural makeup of classical Greece. The two civilizations shared similarities in architecture as they both settled... "}, {"url": "http://historylink101.com/2/greece3/minoans-mycenaens.htm", "passage_text": "The Ancient Minoans and Mycenaeans. The Greeks trace their culture back to two earlier cultures known as the Minoans and the Mycenaeans. The Minoans were named after the legendary King Minos. A large palace had been discovered at Krossos on the island of Crete. It is believed to have been built around 2000 B.C. "}, {"url": "http://www.enotes.com/homework-help/what-were-major-differences-between-minoan-420529", "passage_text": "(Answer #1). Minoan civilization differed from Mycenaean in several ways. The first major difference was language. The Mycenaeans spoke a version of Greek, written in a syllabary called Linear B. The Minoan language is unknown. Minoan writings have been found in two forms, a hieroglyphic script (most famously used on the Phaistos disk) and a later script called Linear A. Neither of the two Minoan scripts have been deciphered."}, {"url": "https://quizlet.com/13488481/minoan-vs-mycenaean-flash-cards/", "passage_text": "The Minoans was a naval civilization and the Mycenaean were a land civilization and the Minoans DID NOT have fortresses. The Mycenaean culture and the Minoan culture had baths that fitted the human body, and drainpipes. "}, {"url": "https://ph.answers.yahoo.com/question/index?qid=20100916051817AAkNGis", "passage_text": "During the International Bronze Age, two distinctive and dynamic civilizations appeared on the eastern Mediterranean. The island of Crete was home to the Minoans and on mainland Greece resided the Mycenaeans. These two regions had distinct political similarities and differences in their respective societies. It's interesting to examine the political contrasts which existed between the two"}, {"url": "https://answers.yahoo.com/question/index?qid=20090127140907AAnW9uJ", "passage_text": "Rating Newest Oldest. Best Answer: The Minoan civilization came before the Mycenaean civilization. Minoan was also highly advanced and by all accounts a peaceful people who dominated the Aegean by trade rather then war. Mycenaean came later and were a very war oriented people, most notably in Homers Iliad. "}, {"url": "http://www.answers.com/Q/What_are_the_differences_between_the_minoan_and_mycenaean_civilizations", "passage_text": "The Minoan civilization (2.700 BC) preceded the Mycenaean  civilization(1.600). The main difference was that the Minoans were  a very peaceful civilization (nowhere in their … art battles or  anything war related is depicted, only festivities, which is  somewhat unique) and they were more sea-orientated. The Minoan civilization collapsed with the eruption of a volcano on the island of Thira/Santorini, and then the military take over by the Mycenaeans. The Mycenaean civilizatio … n fell with the migration of another bellicose group of people, the Dorians, to the area. The Dorian civilization caused the Greek Dark Ages."}, {"url": "http://www.answers.com/Q/Differences_and_similarities_between_minoan_civilization_and_the_mycenaean_civilization", "passage_text": "The Minoans was a n … aval civilization and the Mycenaean were a land civilization. After the volcanic eruption at Santorini, a tidal wave destroyed much of the Minoan civilization, that gave the opportunity to the Mycenaeans to invade and conquer the Minoans. + 52 others found this useful. Marcus Jones. The Minoan civilization collapsed with the eruption of a volcano on the island of Thira/Santorini, and then the military take over by the Mycenaeans. The Mycenaean civilizatio … n fell with the migration of another bellicose group of people, the Dorians, to the area."}, {"url": "http://www.answers.com/Q/What_are_the_differences_between_the_minoan_and_mycenaean_civilizations", "passage_text": "Making the world better, one answer at a time. The Minoan civilization was established on the island of Crete. The Mycenaean civilization was established on Peloponese, south of Athens close to Corinth. The Minoans was a naval civilization and the Mycenaean were a land civilization. The Minoan civilization collapsed with the eruption of a volcano on the island of Thira/Santorini, and then the military take over by the Mycenaeans. The Mycenaean civilizatio … n fell with the migration of another bellicose group of people, the Dorians, to the area. The Dorian civilization caused the Greek Dark Ages."}]