[{"url": "http://www.merriam-webster.com/dictionary/bisque", "passage_text": "Definition of BISQUE. : odds allowed an inferior player: as a: a point taken when desired in a set of tennis b: an extra turn in croquet c: one or more strokes off a golf score. "}, {"url": "http://culinaryarts.about.com/od/glossary/g/Bisque.htm", "passage_text": "Genti and Hyers/Photodisc/Getty Images. Definition: A bisque is a rich, creamy soup made with shellfish — specifically, bisque is traditionally made with the pureed puréed meat of, crustaceans including, lobster, crab shrimp or. crayfish Bisque can be thickened with rice, which is the traditional method. Modern bisques are often thickened with roux. Additionally, although a classic bisque is made only with shellfish, some thick soups made with vegetables, poultry or meat are sometimes referred to as bisques."}, {"url": "http://culinaryarts.about.com/od/glossary/g/Bisque.htm", "passage_text": "Definition: A bisque is a rich, creamy soup made with shellfish — specifically, bisque is traditionally made with the pureed puréed meat of, crustaceans including, lobster, crab shrimp or. Crayfish when making, bisque the shells are roasted and then simmered to produce a highly flavorful stock which is then. thickened Bisque can be thickened with rice, which is the traditional method. Modern bisques are often thickened with roux. Additionally, although a classic bisque is made only with shellfish, some thick soups made with vegetables, poultry or meat are sometimes referred to as bisques."}, {"url": "https://en.wiktionary.org/wiki/bisque", "passage_text": "Noun [edit]. bisque ‎(countable and uncountable, plural bisques). 1  A thick creamy soup made from fish, shellfish, meat or vegetables. ( 2 sports) An extra turn, free point or some other advantage allowed. 3  1937, P. G. Wodehouse, 'Lord Emsworth and Others' , Overlook, Woodstock: 2002, p 137-8. Categories 1  : English terms derived from French. 2  English borrowed terms. 3  English lemmas. 4  English nouns. 5  English uncountable nouns. 6  English countable nouns. 7  en:Sports. 8  English adjectives. 9  English uncomparable adjectives. 10  en:Browns. 11  en:Colors. 12  en:Foods. 13  en:Soups."}, {"url": "http://colors.findthedata.com/l/833/Bisque", "passage_text": "Be the first to review. 'Bisque' is a shade of White that is 23% saturated and 100% bright. For reference purposes, Bisque has the hex value #FFE4C4. Moreover, Bisque can be referenced by the string 'Bisque' in CSS documents"}, {"url": "http://www.yourdictionary.com/bisque", "passage_text": "(countable and uncountable, plural bisques). 1  A thick creamy soup made from fish, shellfish, meat or vegetables. ( 2 sports) An extra turn, free point or some other advantage allowed. 3  A free turn in a handicap croquet match. 4  A free point in a handicap real tennis match. 5  A pale pinkish brown colour. 1 A thick creamy soup made from fish, shellfish, meat or vegetables. ( 2 sports) An extra turn, free point or some other advantage allowed. 3  A free turn in a handicap croquet match. 4  A free point in a handicap real tennis match. 5  A pale pinkish brown colour. 6  A form of unglazed earthenware; biscuit."}, {"url": "http://pottery.about.com/od/potterygloassary/g/bisque.htm", "passage_text": "Definition: Bisque (noun) refers to ware which has been fired once and has no chemically bonded water left in the clay. Bisque is a true ceramic material, although the clay body has not yet reached maturity. To bisque (verb) is to fire the clay for the first time. Bisque fire (noun) is the first firing and is usually only to between cones 08 and 06 (1720 and 1835 degrees F or 945 and 1005 degrees C)."}, {"url": "http://www.thefreedictionary.com/bisque", "passage_text": "Noun. 1. bisque-a thick cream soup made from shellfish. soup-liquid food especially of meat or fish or vegetable stock often containing pieces of solid food. bisque 1. n. 1. a. A rich, creamy soup made from meat, fish, or shellfish. b. A thick cream soup made of pureed puréed. vegetables. 2 ice cream mixed with crushed macaroons or. nuts"}]