[{"url": "http://www.druginfo.sl.nsw.gov.au/drugs/list/synthetic_drugs.html", "passage_text": "Synthetic drugs are products containing chemical substances artificially developed to mimic the effects of illegal drugs like cannabis, cocaine and methamphetamine. They come in the form of powders, pills and dried herbs that have been soaked in synthetic chemicals. Synthetic drugs and the law. In September 2013 the NSW Goverment introduced changes to the Drug Misuse and Trafficking Act 1985 to prohibit the manufacture, supply and advertising of psychoactive substances (colloquially known as synthetic drugs)."}, {"url": "http://www.narcotics.com/list/synthetic-narcotics-list/", "passage_text": "Synthetic Narcotics List. The illegal drug market, while still active, is quickly being outpaced by the rise in synthetic drug use. Drugs, such as cocaine and heroin, though illegal, are nonetheless plant-based organic concoctions while synthetic varieties consist of any number and mixture of chemical compounds. Dangerous synthetic drugs like bath salts are on this narcotics list. Data gathered by the Office of National Drug Control Policy show an estimated 28,531 emergency room visits in 2011 resulted from synthetic narcotic use."}, {"url": "http://www.narconon.org/drug-abuse/effects-of-synthetic-drugs.html", "passage_text": "There’s “bath salts,” there’s synthetic marijuana and there’s drugs that used to be called “designer drugs.” Now all these classes of drugs are starting to be grouped together with the designation “synthetics.”. Synthetic marijuana is sold as Spice or K2 or one of a dozen other names. As reported by the European Monitoring Center for Drugs and Drug Addiction, a new, deadly substance is being abused by those seeking a thrill in the UK and in Europe. This new drug is a synthetic nicknamed 4,4’-DMAR, 4-methyl-euphoria, 4-methyl-U4Euh, 4-M-4-MAR, 4,4-dimethylaminorex or Serotoni."}, {"url": "http://www.narconon.org/drug-abuse/effects-of-synthetic-drugs.html", "passage_text": "Effects of Synthetics. The new synthetic drugs that are making the rounds of drug-using markets are some of the most destructive drugs available today. As reported by the European Monitoring Center for Drugs and Drug Addiction, a new, deadly substance is being abused by those seeking a thrill in the UK and in Europe. This new drug is a synthetic nicknamed 4,4’-DMAR, 4-methyl-euphoria, 4-methyl-U4Euh, 4-M-4-MAR, 4,4-dimethylaminorex or Serotoni."}, {"url": "http://recovergateway.org/substance-abuse-resources/facts/synthetic-drugs/", "passage_text": "Bath salts and synthetic marijuana such as K2 and Spice are classified as synthetic drugs, which are sold in retail outlets and via the Internet under many different brand labels as plant food and herbal incense, respectively. "}, {"url": "http://www.cnn.com/2013/09/13/health/synthetic-drugs-7-things/index.html", "passage_text": "While methamphetamine and MDMA -- also known as ecstasy or molly -- are technically synthetic drugs because they are made entirely from chemicals, the term synthetic drugs usually refers to bath salts and synthetic marijuana that are often sold in stores and online as household items. "}, {"url": "https://www.drugabuse.gov/publications/drugfacts/synthetic-cathinones-bath-salts", "passage_text": "DrugFacts: Synthetic Cathinones (“Bath Salts”). The term “bath salts” refers to an emerging family of drugs containing one or more synthetic chemicals related to cathinone, an amphetamine-like stimulant found naturally in the khat plant. Early indications are that synthetic cathinones have a high abuse and addiction potential. In a study of the rewarding and reinforcing effects of MDPV, rats showed self-administration patterns and escalation of drug intake nearly identical to methamphetamine."}, {"url": "http://www.drugfree.org/wp-content/uploads/2012/02/Parents360-Synthetics-Bath-Salts-K2-Spice-Parents-Guide-FINAL-2-13-12.pdf", "passage_text": "1 Parents360 Synthetic Drugs: Bath Salts, K2/Spice: A guide for parents and other influencers February 16, 2012. 2 drugfree.org Parents360 Synthetic Drugs:Bath Salts, K2/Spice Hello, and welcome to the Parents360 module that addresses issues pertaining to synthetic drugs such as Bath Salts and K2/Spice. The presentation has a number of drug-specific modules that can be added to it. The one were talking about today is Synthetic Drugs such as Bath Salts and K2/Spice. This is a very important topic to address because synthetic drugs are dangerous."}, {"url": "https://en.wikipedia.org/wiki/Synthetic_cannabis", "passage_text": "Synthetic cannabis (synthetic marijuana), or technically synthetic cannabinoid receptor agonists are designer drugs that mimic the effects of cannabis sprayed onto a herbal base material. There are several psychoactive artificial cannabinoid families (e.g. AM-xxx, HU-xxx, JWH-xxx, CP xx) that are used as designer drugs sprayed on herbs and sold as natural highs under brand names like K2 and Spice, both of which are genericized trademarks used for any synthetic cannabis product."}, {"url": "http://www.whitehouse.gov/ondcp/ondcp-fact-sheets/synthetic-drugs-k2-spice-bath-salts", "passage_text": "Overview and History. Synthetic cannabinoids, commonly known as “synthetic marijuana,” “K2,” or “Spice”, are often sold in legal retail outlets as “herbal incense” or “potpourri”, and synthetic cathinones are often sold as “bath salts” or “jewelry cleaner”. Congress has taken steps to ban many of these substances at the Federal level, and the Administration has supported such efforts. The Synthetic Drug Abuse Prevention Act is part of the FDA Safety and Innovation Act of 2012, signed into law by President Obama."}]