[{"url": "http://www.wikihow.com/Change-the-Size-of-an-Image-in-KB", "passage_text": "Open the image in an image editing program, such as Photoshop. Increasing the size of the actual image will always result in loss of quality and increased pixelation. There is no way to increase the size of a JPG, PNG, or BMP image without losing quality. Increase the size of your image by 10%. You can do this by changing the percentage from 100% to 110%. Click the OK button. The image size will increase slightly, and you will notice an increase in graininess."}, {"url": "http://answers.microsoft.com/en-us/office/forum/office_2010-outlook/how-do-i-reduce-the-size-of-a-photo-in-mb-without/f0460e54-33be-4e19-91d7-f95eef8b1269", "passage_text": "TO. You have identified the 2 variables that affect the image file size, the dimensions (number of pixels) and the resolution (amount of detail in the picture). Tools like picasa can be used to modify both variables. You can also find free online download tools to do that for you. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080130152542AA9bE7j", "passage_text": "Best Answer: Your image size is fine, a little on the small side, but will do for a contest with no problem. Don't worry yourself with dpi either, 72dpi is standard for viewing on a computer monitor (you won't see any difference the higher you go) and high enough to be printed out to 4x6 (typical for contest entries). First if you have a jpeg save it as a tiff, then resize the image file in 10% increments, keep an eye on it to see if you see loss of quality. Stop when you do. Give the file an unsharp mask save as a tiff and then save a new file as jpeg. Iris R · 8 years ago"}, {"url": "http://www.wikihow.com/Change-the-Size-of-an-Image-in-KB", "passage_text": "Sometimes you get a message that you need to change an image size when trying to upload a picture. You may need to resize images to make them smaller, bigger, or even increase the actual file size of an image without affecting the quality. Follow this guide to learn how. Increase the size of your image by 10%. You can do this by changing the percentage from 100% to 110%. Click the OK button. The image size will increase slightly, and you will notice an increase in graininess."}, {"url": "http://www.wikihow.com/Change-the-Size-of-an-Image-in-KB", "passage_text": "1 The lower the quality, the smaller the file size. 2  Each time you re-compress a JPG image, it will lose quality. 3  There are a variety of programs and online services that will compress images without you needing to install a full-blown image editing suite. Increase the size of your image by 10%. You can do this by changing the percentage from 100% to 110%. Click the OK button. The image size will increase slightly, and you will notice an increase in graininess."}, {"url": "https://answers.yahoo.com/question/index?qid=20080130152542AA9bE7j", "passage_text": "· just now. Report Abuse. First if you have a jpeg save it as a tiff, then resize the image file in 10% increments, keep an eye on it to see if you see loss of quality. Stop when you do. Give the file an unsharp mask save as a tiff and then save a new file as jpeg. Iris R · 8 years ago"}, {"url": "http://www.wikihow.com/Change-the-Size-of-an-Image-in-KB", "passage_text": "Compress the image using image editing software. One of the quickest ways to reduce the file size of an image is to compress it into a different format. Open your file in an image editing program (even Paint will work) and save it as a compressed file type. The most common form of image compression is JPG. Increase the size of your image by 10%. You can do this by changing the percentage from 100% to 110%. Click the OK button. The image size will increase slightly, and you will notice an increase in graininess."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20130817105552AAOEvlK", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: If you used a lossy compression algorithm (like JPEG), you can't uncompress it. You can convert it to a larger format, such as PNG or BMP, or increase the resolution but the definition of lossy is that you no longer have all the information from the original picture. From a lossless compression algorithm, like PNG or GIF, you can just save it in an uncompressed form like BMP. Lossless compression means it shrinks the size of the file, but it does so without losing any information. To relate it to writing, lossy compression is like a summary of the pictur"}, {"url": "http://productforums.google.com/d/topic/picasa/0BAtaSzUKMY", "passage_text": "Adjust the size (in pixels)... A smaller size gives a smaller photo in MB (fewer pixels to store). Adjust the quaility setting... A lower quality setting uses less disk space, a high quality setting uses more disk space. There's no way to know what you'll get before you do it. Do several extracts at various size/quality settings"}]