[{"url": "http://www.biography.com/people/dwayne-johnson-11818916", "passage_text": "Early Life. Professional wrestler and actor Dwayne The Rock Douglas Johnson was born on May 2, 1972, in Hayward, California. The grandson of professional wrestler Peter High Chief Fanene Maivia and son of wrestler Rocky Johnson, the young Johnson grew up watching his father perform in the ring. Dwayne The Rock Johnson was born into a professional wrestling family in 1972. An injury ended his college football career, so he entered the ring with the Word Wrestling Federation. As The Rock, he famously feuded with wrestler Steve Austin and won the WWF Heavyweight title six times."}, {"url": "https://en.wikipedia.org/wiki/Dwayne_Johnson", "passage_text": "Dwayne Douglas Johnson (born May 2, 1972), also known by his ring name The Rock, is an American / Canadian actor, producer and semi retired professional wrestler, signed with WWE. Johnson was a college football player for the University of Miami, winning a national championship on the 1991 Miami Hurricanes football team. He later played for the Calgary Stampeders in the Canadian Football League, and was cut two months into the 1995 season."}, {"url": "https://answers.yahoo.com/question/index?qid=20091205233601AA4Wh7G", "passage_text": "Best Answer: ya samoan Dwayne's father is Rocky Johnson, an African-American. His mother is a full-blooded Samoan. Through his mother, Dwayne is related to almost all wrestlers of Samoan descent, from Afa and Sika to Rikishi and even Superfly Jimmy Snuka (though only honorarily to Snuka.). Source(s): Report Abuse. Dwayne Johnson, the son of Ata Johnson (nee Née) maivia and professional Wrestler Soulman Rocky, johnson was born In, Hayward.[california] 2 his maternal, Grandfather High. chief"}, {"url": "http://ethnicelebs.com/dwayne-the-rock-johnson", "passage_text": "Ethnicity: *African-Canadian (Black Nova Scotian), small amount of Irish (father) *Samoan (mother). Dwayne Johnson, also credited as The Rock, is an American professional-wrestler, actor, and producer. He is the son of Ata (Maivia) and Rocky Johnson (born Wayde Douglas Bowles), a Canadian and American wrestler. A picture of The Rock at a young age, along with his parents, can be found here. Dwayne’s paternal grandparents were James Henry A. Bowles (the son of John W. Bowles and Lila/Lilla Jones) and Lillian Gay (the daughter of Alfred Gay and Isabel Sickles)."}, {"url": "http://ethnicelebs.com/dwayne-the-rock-johnson", "passage_text": "Dwayne’s mother is Samoan. Dwayne’s father, who is black (African-Canadian), was born in Amherst, Nova Scotia, Canada (of Black Nova Scotian heritage, descended from African-Americans who left the U.S. after the American Revolution, having sided with the British). A picture of The Rock at a young age, along with his parents, can be found here. Dwayne’s paternal grandparents were James Henry A. Bowles (the son of John W. Bowles and Lila/Lilla Jones) and Lillian Gay (the daughter of Alfred Gay and Isabel Sickles)."}, {"url": "http://www.imdb.com/name/nm0425005/bio", "passage_text": "Overview (4). Dwayne Douglas Johnson, also known as The Rock, was born on May 2, 1972 in Hayward, California, to Ata Johnson (nee Née) maivia And-canadian born professional Wrestler Rocky. johnson His father is black (of Black Nova Scotian descent), and his mother is of Samoan background (her own father was Peter Fanene Maivia, also a professional wrestler). While growing up, Dwayne traveled around a lot with his parents and watched his father perform in the ring."}, {"url": "https://answers.yahoo.com/question/index?qid=20080309183747AAsqNA9", "passage_text": "Rating Newest Oldest. Best Answer: He has a American nationality Dwayne Douglas Johnson was born in Hayward, California, and he Is from African-Canadian and Samoan descent. born on May 2nd 1972 to Rocky Johnson and Ata Johnson. While growing up, Dwayne traveled around a lot with his parents and watched his father perform in the ring"}, {"url": "http://www.answers.com/Q/What_ethnicity_is_Dwayne_Johnson", "passage_text": "Confidence votes 135. He is African Canadian/Samoan his Father is Canadian and mother samoan. His father is W.W.E. Hall Of Famer Soulman Rocky Johnson,(real name Wade Bowles) from Amherst Nova Scotia, Canada. He was born in Hawaii but his background is Samoa. His dad is Samoan and the mum is Hawaiian.. An Actor, and Wrestler.One Of The best wrestlers in wwe Dwayne Johnson is a human being p.s. He is an actor And a wwe wrestler. + 57 others found this useful. Jodie Bolinger. Edit. Share to: 1  Flat Screen TVs: LED and LCD There's a common misunderstanding when it comes to LED and LCD TVs."}, {"url": "http://www.imdb.com/name/nm0425005/bio", "passage_text": "Mini Bio (1). Dwayne Douglas Johnson, also known as The Rock, was born on May 2, 1972 in Hayward, California, to Ata Johnson (nee Née) maivia And-canadian born professional Wrestler Rocky. johnson His father is black (of Black Nova Scotian descent), and his mother is of Samoan background (her own father was Peter Fanene Maivia, also a professional wrestler). While growing up, Dwayne traveled around a lot with his parents and watched his father perform in the ring."}]