[{"url": "http://dl.clackamas.edu/ch105/lesson4colorimetry.html", "passage_text": "Lesson 4: Colorimetry. One useful and often used way of determining the concentration of a chemical in a solution, if it has a color, is to measure the intensity of the color and relate the intensity of the color to the concentration of the solution. Several useful factors are very important. Along with operating the instruments, colorimetry also involves calculations to actually figure out the concentration of a solution from the absorbance measurements made by using the colorimeters. There are three methods that can be used depending on what information is available."}, {"url": "http://www.thefreedictionary.com/colorimetry", "passage_text": "Noun. 1. colorimetry-quantitative chemical analysis by color using a colorimeter. colorimetric analysis. quantitative analysis, quantitative chemical analysis-chemical analysis to determine the amounts of each element in the substance. "}, {"url": "http://work.chron.com/jobs-use-colorimetry-23498.html", "passage_text": "Colorimetry is sometimes simply referred to as color science. It's the science of identifying and describing how people perceive colors. Colorimetry is the practice in which various mixtures of three colors are used to define almost every color in the spectrum. For example, RGB is the percentage of red, green and blue in a color shade."}, {"url": "https://en.wikibooks.org/wiki/A-level_Applied_Science/Finding_out_about_substances/Colorimetry", "passage_text": "Uses of colorimetry [edit]. Colorimetry is used in chemistry and in other sorts of places such as in industries colour printing, textile manufacturing, paint manufacturing and in food industries (including the chocolate industry). Colorimetry is also used in asprin. Colorimetry is just one of the types of photometric analysis techniques i.e. it is a way of measuring light. Below are most possible colorimetric tests: colorimetry can be used to find out the concentration of any coloured subsistent."}, {"url": "https://en.wikipedia.org/wiki/Colorimetry_(chemical_method)", "passage_text": "A colorimeter is a device used to test the concentration of a solution by measuring its absorbance of a specific wavelength of light (not to be confused with the tristimulus colorimeter used to measure colors in general). "}, {"url": "http://www.wisegeek.com/what-is-colorimetry.htm", "passage_text": "Adorable animal families that will make you aww. Colorimetry is the analysis of chemical samples to collect information about their concentration. It involves passing light through a sample and measuring how much is absorbed by the solution, using equipment like a spectrophotometer to measure as precisely as possible. A spectrophotometer may be used during colorimetry. The therm colorimetry may be used to describe the study of how people perceive color and distinguish between colors. Colorimetry can be used to help people with colorblindness."}, {"url": "http://gamma-sci.com/colorimetry/", "passage_text": "The science of colorimetry is used to quantify the response of the human visual system and match human color perception for applications in a variety of industries. "}, {"url": "https://en.wikipedia.org/wiki/Colorimetry", "passage_text": "Colorimetry (American English) or Colourimetry (British English; see spelling differences) is the science and technology used to quantify and describe physically the human color perception .. "}]