[{"url": "http://www.trade.gov/mas/ian/referenceinfo/tg_ian_001872.asp", "passage_text": "1 Excludes such services in which the cost is included in the price of the goods and is not billed separately or is declared as a part of the price of the goods on the import or export declaration filed with the U.S. Customs and Border Protection. Unlike trade in goods, which is closely tracked through the submission of EEIs to the AES system, services trade calculations are based on quarterly, annual, and benchmark surveys and partial information generated from monthly reports. Services trade totals are then estimated from these survey results."}, {"url": "http://www.merriam-webster.com/dictionary/transaction", "passage_text": "transaction. noun trans·ac·tion \\tran-ˈzak-shən, tran(t)-ˈsak-\\. Tweet. : a business deal: an occurrence in which goods, services, or money are passed from one person, account, etc., to another. : the act or process of doing business with another person, company, etc. : the act or process of transacting business"}, {"url": "http://www.trade.gov/mas/ian/referenceinfo/tg_ian_001872.asp", "passage_text": "The U.S. Bureau of Economic Analysis collects and compiles U.S. services import and export statistics. These are released in a monthly press release entitled U.S. International Trade in Goods and Services report (FT900). Unlike trade in goods, which is closely tracked through the submission of EEIs to the AES system, services trade calculations are based on quarterly, annual, and benchmark surveys and partial information generated from monthly reports. Services trade totals are then estimated from these survey results."}, {"url": "http://www.investopedia.com/terms/t/trade.asp", "passage_text": "DEFINITION of 'Trade'. A basic economic concept that involves multiple parties participating in the voluntary negotiation and then the exchange of one's goods and services for desired goods and services that someone else possesses. The advent of money as a medium of exchange has allowed trade to be conducted in a manner that is much simpler and effective compared to earlier forms of trade, such as bartering. In financial markets, trading also can mean performing a transaction that involves the selling and purchasing of a security."}, {"url": "https://en.wikipedia.org/wiki/Trade_finance", "passage_text": "Trade finance signifies financing for trade, and it concerns both domestic and international trade transactions. A trade transaction requires a seller of goods and services as well as a buyer. Various intermediaries such as banks and financial institutions can facilitate these transactions by financing the trade."}, {"url": "http://www.investopedia.com/terms/r/related-partytransaction.asp", "passage_text": "DEFINITION of 'Related-Party Transaction'. A business deal or arrangement between two parties who are joined by a special relationship prior to the deal. For example, a business transaction between a major shareholder and the corporation, such as a contract for the shareholder's company to perform renovations to the corporation's offices, would be deemed a related-party transaction. Next Up."}, {"url": "https://en.wikipedia.org/wiki/Harmonized_System", "passage_text": "The Harmonized Commodity Description and Coding System, also known as the Harmonized System (HS) of tariff nomenclature is an internationally standardized system of names and numbers to classify traded products. "}, {"url": "http://www.wto.org/english/tratop_e/cusval_e/cusval_info_e.htm", "passage_text": "The customs value of the good does not need to be determined, as the duty is not based on the value of the good but on other criteria. In this case, no rules on customs valuation are needed and the Valuation Agreement does not apply. If the rate of duty is ad valorem, the customs value is essential to determine the duty to be paid on an imported good. Short historical overview back to top. Article VII GATT. Article VII of the General Agreement on Tariffs and Trade laid down the general principles for an international system of valuation."}]