[{"url": "http://cooking.stackexchange.com/questions/8564/how-long-can-i-keep-home-made-caesar-dressing", "passage_text": "You can age raw eggs by keeping them in the fridge for 3 days, so I would definitely say more than 3 days, but less than a week. I think the dressing would develop a bad consistency or start to taste too strong before it actually spoiled. share | improve this answer. edited Oct 27 '10 at 19:52."}, {"url": "http://www.answers.com/Q/How_long_will_potato_salad_stay_fresh_in_the_refrigerator", "passage_text": "If you put eggs in your salad then you have 3 days to use it up in. If you omit the eggs then you have about 5 days as long as the salad doesn't sit out and get warm since it has mayonnaise in it."}, {"url": "http://www.wikihow.com/Keep-Salad-Fresh", "passage_text": "1 Egg salad, potato salad, tuna salad, chicken salad, and mayonnaise-based pasta salad can last three to five days if stored in the refrigerator. 2  Discard the egg salad if it is left out at room temperature for more than two hours or if it develops an off smell."}, {"url": "http://www.lowcarbfriends.com/bbs/low-carb-recipe-help-suggestions/246786-how-long-will-egg-tuna-chicken-salad-keep-fridge.html", "passage_text": "Salad in the bowl doesn't last more than 2 days anyway. I keep egg salad for 3-4 days, and tuna 2-3 days. Cold cuts are usually good for about 5 days (depending). I think that's a recommendation and not what Real people do."}, {"url": "http://stilltasty.com/fooditems/index/17132", "passage_text": "1 How long does egg salad last at room temperature? 2  Bacteria grow rapidly at temperatures between 40 °F and 140 °F; egg salad should be discarded if left for more than 2 hours at room temperature."}, {"url": "http://www.myrecipes.com/how-to/cooking-questions/how-long-hard-boiled-eggs-keep", "passage_text": "If the egg is peeled it won't last as long—keep it no more than 3-5 days, and be sure to wrap it well in plastic wrap and/or store it in a heavy duty plastic bag or container with a lid. See our collection of Egg Recipes if you're looking for ways to use up all your hard-cooked eggs."}, {"url": "http://cookeatshare.com/popular/how-long-does-egg-salad-keep-in-the-fridge", "passage_text": "Trusted Results with How long does egg salad keep in the fridge. Perfect Potato Salad-Allrecipes. Tips and recipes for making the perfect summer side. ... However, your salad will be outstanding no matter which variety you choose, as long as you cook the potatoes carefully."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_egg_salad_in_the_refrigerator", "passage_text": "To  be safe, keep refrigerated raw eggs in shell for no more than three  weeks.     Egg Whites   Raw egg whites can be refrigerated up to four days.Cooked  Egg Dishes  No cooked egg dish should be left out at room temperature for  more than two hours."}, {"url": "http://cooking.stackexchange.com/questions/8564/how-long-can-i-keep-home-made-caesar-dressing", "passage_text": "Up to 7 days (homemade mayo as well). Egg whites/yolks out of the egg (but not combined with the acid) can last 3-4 days refrigerated, and eggs in-shell are good for 2-4 weeks depending on processing."}]