[{"url": "http://www.thefreedictionary.com/Soy+product", "passage_text": "soybean-the most highly proteinaceous vegetable known; the fruit of the soybean plant is used in a variety of foods and as fodder (especially as a replacement for animal protein). soya, soya bean, soy. soy flour, soybean flour, soybean meal-meal made from soybeans. soya, soya bean, soybean, soy-the most highly proteinaceous vegetable known; the fruit of the soybean plant is used in a variety of foods and as fodder (especially as a replacement for animal protein). legume, leguminous plant-an erect or climbing bean or pea plant of the family Leguminosae."}, {"url": "http://www.thefreedictionary.com/soy", "passage_text": "soy-thin sauce made of fermented soy beans. soy sauce. soya, soya bean, soybean, soy-the most highly proteinaceous vegetable known; the fruit of the soybean plant is used in a variety of foods and as fodder (especially as a replacement for animal protein). soya, soya bean, soybean."}, {"url": "https://en.wikipedia.org/wiki/Soy_protein", "passage_text": "Soy protein is a protein that is isolated from soybean. It is made from soybean meal that has been dehulled and defatted. Dehulled and defatted soybeans are processed into three kinds of high protein commercial products: soy flour, concentrates, and isolates. Recently, soy protein popularity has increased due to its use in health food products, and many countries allow health claims for foods rich in soy protein. Soy protein is generally regarded as being concentrated in protein bodies, which are estimated to contain at least 60–70% of the total soybean protein."}, {"url": "http://www.thefreedictionary.com/soy", "passage_text": "4. soy-the most highly proteinaceous vegetable known; the fruit of the soybean plant is used in a variety of foods and as fodder (especially as a replacement for animal protein). soya, soya bean, soybean. soy flour, soybean flour, soybean meal-meal made from soybeans. soyabean oil, soybean oil-oil from soya beans"}, {"url": "http://www.foodrenegade.com/dangers-of-soy/", "passage_text": "After decades of hearing marketing spin about how soy is a wonder food, a protein-rich legume able to rescue us from our dependence on meat, I suppose it’s understandable why so many people have yet to understand fully the dangers of soy. The other ingredients in these foods are no better for you than the soy protein that goes into them. Soy milk, for example, is simply a cocktail of soy protein, sugar, and vegetable oil. The “natural” MSG formed in soy processing is already bad for you, but even more MSG, and more flavorings, are added."}, {"url": "https://en.wikipedia.org/wiki/Tofu", "passage_text": "Tofu, also known as bean curd, is a food made by coagulating soy milk and then pressing the resulting curds into soft white blocks. It is a component in East Asian and Southeast Asian cuisines. There are many different varieties of tofu, including fresh tofu and tofu that has been processed in some way. "}, {"url": "http://www.audioenglish.org/dictionary/soy.htm", "passage_text": "legume; leguminous plant (an erect or climbing bean or pea plant of the family Leguminosae). Meronyms (parts of soy): soy; soybean (most highly proteinaceous vegetable crop known). soy; soya bean; soybean (a source of oil; used for forage and soil improvement and as food). Holonyms (soy is a member of...): genus Glycine; Glycine (genus of Asiatic erect or sprawling herbs: soya bean). The noun SOY has 4 senses: 1. a source of oil; used for forage and soil improvement and as food. 2. erect bushy hairy annual herb having trifoliate leaves and purple to pink flowers; extensively cultivated for food and forage and soil improvement but especially for its nutritious oil-rich seeds; native to Asia."}, {"url": "http://www.soyfoods.org/soy-products/soy-fact-sheets/soy-protein-isolate-fact-sheet", "passage_text": "Soy Protein Isolate. Soy protein isolate is a dry powder food ingredient that has been separated or isolated from the other components of the soybean, making it 90 to 95 percent protein and nearly carbohydrate and fat-free. Soy protein isolate is used in making a variety of foods. It may be found in: 1  dairy-type products such as beverage powders, infant formulas, liquid nutritional meals, and some varieties of liquid soymilk. 2  bottled fruit drinks."}, {"url": "https://en.wikipedia.org/wiki/Soy_protein", "passage_text": "Soy protein isolate has been used since 1959 in foods for its functional properties. Recently, soy protein popularity has increased due to its use in health food products, and many countries allow health claims for foods rich in soy protein. Soy protein is generally regarded as being concentrated in protein bodies, which are estimated to contain at least 60–70% of the total soybean protein. Upon germination of the soybean, the protein will be digested, and the released amino acids will be transported to locations of seedling growth"}]