[{"url": "http://www.nature.com/news/encode-the-human-encyclopaedia-1.11312", "passage_text": "The pilot ENCODE project cost an estimated $55 million; the scale-up was about $130 million; and the NHGRI could award up to $123 million in the next phase. Some researchers argue that they have yet to see a solid return on that investment. ENCODE was designed to pick up where the Human Genome Project left off. Although that massive effort revealed the blueprint of human biology, it quickly became clear that the instruction manual for reading the blueprint was sketchy at best."}, {"url": "https://en.wikipedia.org/wiki/GENCODE", "passage_text": "GENCODE is a scientific project in genome research and part of the ENCODE (ENCyclopedia Of DNA Elements) scale-up project. The GENCODE consortium was initially formed as part of the pilot phase of the ENCODE project to identify and map all protein-coding genes within the ENCODE regions (approx. 1% of Human genome). The APPRIS server has been used in the context of the scale up of the ENCODE project to annotate the Human genome but APPRIS is being used for other species (e.g. mouse, rat and zebrafish). The pipeline is made up of separate modules that combine protein structure and function information and evolutionary evidence."}, {"url": "https://en.wikipedia.org/wiki/GENCODE", "passage_text": "The National Human Genome Research Institute (NHGRI) launched a public research consortium named ENCODE, the Encyclopedia Of DNA Elements, in September 2003, to carry out a project to identify all functional elements in the human genome sequence. The APPRIS server has been used in the context of the scale up of the ENCODE project to annotate the Human genome but APPRIS is being used for other species (e.g. mouse, rat and zebrafish). The pipeline is made up of separate modules that combine protein structure and function information and evolutionary evidence."}, {"url": "https://www.encodeproject.org/", "passage_text": "The goal of ENCODE is to build a comprehensive parts list of functional elements in the human genome, including elements that act at the protein and RNA levels, and regulatory elements that control cells and circumstances in which a gene is active. ENCODE investigators employ a variety of assays and methods to identify functional elements. The discovery and annotation of gene elements is accomplished primarily by sequencing a diverse range of RNA sources, comparative genomics, integrative bioinformatic methods, and human curation."}, {"url": "http://ghr.nlm.nih.gov/handbook/genomicresearch/encode", "passage_text": "Coinciding with the completion of the Human Genome Project in 2003, the ENCODE Project began as a worldwide effort involving more than 30 research groups and more than 400 scientists. The approximately 20,000 genes that provide instructions for making proteins account for only about 1 percent of the human genome. A goal of the ENCODE Project is to link variations in the expression of certain genes to the development of disease. The ENCODE Project has given researchers insight into how the human genome functions."}, {"url": "https://www.encodeproject.org/", "passage_text": "The ENCODE (Encyclopedia of DNA Elements) Consortium is an international collaboration of research groups funded by the National Human Genome Research Institute (NHGRI). ENCODE investigators employ a variety of assays and methods to identify functional elements. The discovery and annotation of gene elements is accomplished primarily by sequencing a diverse range of RNA sources, comparative genomics, integrative bioinformatic methods, and human curation."}, {"url": "http://www.nature.com/encode/", "passage_text": "The results of the ENCODE project are presented in 30 papers, published simultaneously in Nature, Genome Research and Genome Biology, and collected here. The latest chapter in our story is ENCODE; an ambitious project which aims to characterise all the functional element in the human genome. This animation shows how ENCODE is the next major step along this path."}, {"url": "http://www.nature.com/encode/", "passage_text": "The Encyclopedia of DNA Elements (ENCODE) project dishes up a hearty banquet of data that illuminate the roles of the functional elements of the human genome. Here, six scientists describe the project and discuss how the data are influencing research directions across many fields. The latest chapter in our story is ENCODE; an ambitious project which aims to characterise all the functional element in the human genome. This animation shows how ENCODE is the next major step along this path."}, {"url": "http://ghr.nlm.nih.gov/handbook/genomicresearch/encode", "passage_text": "The Broad Institute describes the purpose of the ENCODE Project. The National Human Genome Research Institute announces results of the ENCODE Project in a Press Release and provides an overview of the ENCODE Project. Some of the outcomes of the ENCODE Project are detailed by Cold Springs Harbor Laboratory. A goal of the ENCODE Project is to link variations in the expression of certain genes to the development of disease. The ENCODE Project has given researchers insight into how the human genome functions."}]