[{"url": "https://faculty.washington.edu/chudler/synapse.html", "passage_text": "The Synapse. Neurons have specialized projections called dendrites and axons. Dendrites bring information to the cell body and axons take information away from the cell body. Information from one neuron flows to another neuron across a synapse. The synapse contains a small gap separating neurons. The synapse consists of: 1  a presynaptic ending that contains neurotransmitters, mitochondria and other cell organelles. 2  a postsynaptic ending that contains receptor sites for neurotransmitters. 3  a synaptic cleft or space between the presynaptic and postsynaptic endings."}, {"url": "http://www.qmu.ac.uk/hn/appliedscience/D%20Excitable%20Tissues/synapses.htm", "passage_text": "As well as occurring between neurons, synapses also occur at junctions between neurons and effectors (i.e. either muscles or glands); like the junction between a neuron and skeletal muscle cells shown below. Synaptic junctions are of two types; CHEMICAL and ELECTRICAL. 1) CHEMICAL. If the excitable cells are neurons (as above), or a neuron and a muscle cell (shown right), the junction between them forms a chemical synapse. "}, {"url": "https://en.wikipedia.org/wiki/Electrical_synapse", "passage_text": "An electrical synapse is a mechanical and electrical conductive link between two neighboring neurons that is formed at a narrow gap between the pre-and postsynaptic neurons known as a gap junction. At gap junctions, such cells approach within about 3.5 nm of each other, a much shorter distance than the 20- to 40-nanometer distance that separates cells at chemical synapse. In many animals, electrical synapse-based systems co-exist with chemical synapses."}, {"url": "http://science.education.nih.gov/supplements/nih2/addiction/guide/pdfs/lesson2.pdf", "passage_text": "Figure 2.2: Neurons transmit information to other neurons. Information passes from the axon of the presynaptic neuron to the dendrites of the postsynaptic neuron. Figure 2.3: The synapse is the site where chemical signals pass between neurons. "}, {"url": "http://www.cerebromente.org.br/n12/fundamentos/neurotransmissores/neurotransmitters2.html", "passage_text": "(a) Neurites of two cells connected. Most mammalian synapses are chemical, but there is a simple form of electrical synapse that allows the direct transfer of ionic current from one cell to the next. Electrical synapses occur at specialized sites called gap junctions. The typical and most frequent type of synapse is the one in which the axon of one neuron connects to a second neuron by usually making contact with one of its dendrites or with the cell body. There are two ways in which this can happen: the electrical and the chemical synapses."}, {"url": "http://www.mind.ilstu.edu/curriculum/neurons_intro/neurons_intro.php", "passage_text": "A network of neurons (or neural network) is merely a group of neurons through which information flows from one neuron to another. The image below represents a neural network. Information flows between the blue neurons through electrical synapses. Information flows from yellow neuron A, through blue neuron B, to pink neuron C via chemical synapses. The following animation illustrates the difference between these two kinds of synapses."}, {"url": "https://en.wikipedia.org/wiki/Neurotransmitter", "passage_text": "Neurotransmitters are endogenous chemicals that enable neurotransmission. They transmit signals across a chemical synapse, such as in a neuromuscular junction, from one neuron (nerve cell) to another target neuron, muscle cell, or gland cell. Neurotransmitters are released from synaptic vesicles in synapses into the synaptic cleft, where they are received by receptors on other synapses. "}, {"url": "https://faculty.washington.edu/chudler/chnt1.html", "passage_text": "Neurotransmitters and Neuroactive Peptides. Communication of information between neurons is accomplished by movement of chemicals across a small gap called the synapse. Chemicals, called neurotransmitters, are released from one neuron at the presynaptic nerve terminal"}, {"url": "https://www.boundless.com/biology/textbooks/boundless-biology-textbook/the-nervous-system-35/how-neurons-communicate-200/synaptic-transmission-763-11996/", "passage_text": "Referenced in 1 quiz question. During transmission across a chemical synapse: the neurotransmitter is released, causing the postsynaptic ion channels to open., All of these., gap junctions block current from traveling from one cell to the next., or sodium ions hyperpolarize the post-synaptic cell membranes."}]