[{"url": "http://www.livestrong.com/article/224545-normal-body-temperature-for-infants/", "passage_text": "In infants from birth to 3 months old, an abnormal temperature--either too low or too high--can be a sign of something serious. A baby with a low body temperature may have a serious infection, according to MedlinePlus.com, and an infant with a fever requires an immediate call to the doctor. Photo Credit baby image by Dron from Fotolia.com. An infant up to 3 months old has a normal body temperature range of 97 to 100.4 degrees Fahrenheit, 36 to 38 degrees Celsius, according to the American Academy of Pediatrics. Temperatures both higher and lower than this range are a cause for concern"}, {"url": "http://www.babycenter.com/0_fever-in-babies_84.bc", "passage_text": "Most doctors – and the American Academy of Pediatrics (AAP) — agree that a normal body temperature for a healthy baby is between 97 and 100.3 degrees Fahrenheit. If your baby's rectal temperature is 100.4 degrees or higher, he has a fever. A higher-than-normal body temperature is called a fever. A fever is usually a sign that the body is waging a war against infection. Taking your baby's temperature can confirm your suspicions and help you and your child's doctor figure out the best way to get your baby back on the road to health."}, {"url": "http://www.modernmom.com/2c2371d2-051f-11e2-9d62-404062497d7e.html", "passage_text": "A baby’s temperature is no different. According to the American Academy of Pediatrics, normal body temperature for a health baby ranges between 97 degrees and 100.4 degrees Fahrenheit (36 degrees to 38 degrees Celsius). A rectal temperature reading above this range indicates a fever. Contact your doctor immediately if your child is less than three months old and has a temperature of 100.4 degrees Fahrenheit or above. If your child is older than three months with a fever of 102.2 degrees, call the doctor to inquire if she should be seen."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below 98.6°F (37°C) . "}, {"url": "http://www.babyearth.com/grow/baby-temperature-range-whats-normal/", "passage_text": "In terms of a typical range for baby, as outlined by the AAP, anywhere between 97.5° F (36.4° C) and 99.5° F (37.5° C) is totally normal. A temperature reading of 100.4° F (38° C) is considered to be the beginning of a fever and should typically be accompanied by other symptoms. "}, {"url": "http://www.ehow.com/about_5063083_normal-body-temperature-infant_.html", "passage_text": "Toddlers should generally have a temperature of between 97 and 100.4 degrees Fahrenheit. While 98.6 degrees is the standard for a normal... 1  How to Take A Baby's Temperature Under The Armpit. Everyone knows that a normal human body temperature is 98.6 degrees Fahrenheit--except when it isn't. The 98.6-degree standard is nothing more than an average. Normal body temperature can vary from person to person and from situation to situation. For infants, the variation can be even bigger, because their small bodies cannot regulate temperature as well as adults can"}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/fever-in-infants-and-children.html", "passage_text": "A normal temperature is about 98.6°F (37°C) when taken orally (in your child’s mouth) and 99.6°F (37.5°C) when taken rectally (in your child’s bottom). Many doctors define a fever as an oral temperature above 99.5°F (37.5°C) or a rectal temperature above 100.4°F (38°C). "}]