[{"url": "http://www.euintheus.org/", "passage_text": "Martin Schulz, President of the European Parliament. About the EU Delegation in the United States We promote EU policies in the United States, which includes presenting and explaining EU actions to the U.S. Administration and Congress. The EU, winner of the 2012 Nobel Peace Prize, is represented in the United States by the Delegation of the European Union in Washington, DC."}, {"url": "https://en.wikipedia.org/wiki/European_Commissioner", "passage_text": "A European Commissioner is a member of the 28-member European Commission. Each Member within the Commission holds a specific portfolio, and the Commission is led by the President of the European Commission. In simple terms they are the equivalent of national ministers. "}, {"url": "http://www.euintheus.org/", "passage_text": "State of the Union 2015. “Our European Union is not in a good state. There is not enough Europe in this Union. And there is not enough Union in this Union.” This morning, European Commission President Jean-Claude Juncker delivered his first State of the Union address before the European Parliament in Strasbourg. The EU, winner of the 2012 Nobel Peace Prize, is represented in the United States by the Delegation of the European Union in Washington, DC."}, {"url": "http://ec.europa.eu/index_en.htm", "passage_text": "The European Commission ensures proper application of EU law. This month's infringement package adopted by the Commission includes 19 reasoned opinions and 10 referrals to the Court of Justice, including the referral of six Member States that have failed to transpose the Bank Recovery and Resolution Directive."}, {"url": "http://www.citizensinformation.ie/en/government_in_ireland/european_government/eu_institutions/european_commission.html", "passage_text": "Information. The European Commission is based in Brussels in Belgium. It also has offices in Luxembourg, representations in all EU countries and delegations in many capital cities around the world. It is made up of 28 Commissioners, one from each Member State. The Commission has a number of important functions: 1  The Commission initiates legislation. 2  It makes proposals for European laws, which are sent to the Council and European Parliament for amendment and approval."}, {"url": "http://ec.europa.eu/about/index_en.htm", "passage_text": "The Commission President is then elected by the European Parliament by a majority of its component members (which corresponds to at least 376 out of 751 votes). Following this election, the President-elect selects the 27 other members of the Commission, on the basis of the suggestions made by Member States. The European Commission is the EU's executive body. It represents the interests of the European Union as a whole (not the interests of individual countries). The term 'Commission' refers to both the College of Commissioners and to the institution itself. 1  What we do."}, {"url": "http://cfp-reformwatch.eu/2010/05/the-role-of-the-commission/", "passage_text": "The Brussels based European Commission is the executive body of the EU, responsible for: 1  Proposing legislation to the European Parliament and Council. 2  Managing and implementing EU Policies and supervising the budget. 3  Ensuring EU law is upheld by the Member States. 4  Representing the EU on a global level. 1 Proposing legislation to the European Parliament and Council. 2  The Commission is the only EU institution with the power to initiate legislation; 3"}, {"url": "http://ec.europa.eu/about/index_en.htm", "passage_text": "About the European Commission. The European Commission is the EU's executive body. It represents the interests of the European Union as a whole (not the interests of individual countries). The term 'Commission' refers to both the College of Commissioners and to the institution itself. 1  What we do. 2  1 President, 7 Vice-Presidents and 20 Commissioners"}, {"url": "http://www.differencebetween.net/business/organizations-business/difference-between-european-union-and-european-commission/", "passage_text": "Comparing the European Commission (EC) to the European Union (EU) is like telling how the President’s office or the executive branch differs from the broader presidential/democratic form of government. This is because the EC is part of the bigger EU. The European Commission, otherwise known simply as the Commission, acts as the executive branch that can propose legislation that serves for the benefit of the entire continent. It is also responsible for the usual, day-to-day operations of the Union. It has 27 commissioners collectively known as the College."}]