[{"url": "https://www.cable.co.uk/guides/is-talkmobile-any-good/", "passage_text": "Promoting itself as ‘the value network operator’, Talkmobile focuses on cut-price mobile phone deals. Known for launching a headline-grabbing, £1 per month SIM-only contract back in 2011, it’s certainly not afraid to challenge convention. With a range of monthly phone contracts and SIM-only plans available, it’s good to see Talkmobile offers start at a relatively low £7 per month. The Small 12 month SIM-only plan gives you 250 minutes, 5000 texts and 500MB of data on a 12-month contract."}, {"url": "http://ukmobilecoverage.co.uk/network/talkmobile", "passage_text": "About Talkmobile. Talkmobile are a mobile virtual network operator (MVNO) who are owned by Carphone Warehouse and use the Vodafone network signal infrastructure for handling their calls. They offer a range of Pay As You Go (PAYG) tariffs, as well as some monthly contracts. We provide easy access to the network coverage checkers for every major UK mobile phone network, including Talkmobile. Simply click on a network logo above to go directly to the coverage map. All data comes straight from the network website itself. Above the coverage map you'll see the logos of each network."}, {"url": "http://talkmobile.co.uk/about-talkmobile/signal", "passage_text": "At Talkmobile, we want you to enjoy using your phone so you'll be pleased to hear we use the Vodafone network to run our service. Vodafone’s signal covers 99.7% of the UK population and keeps more calls connected to the end than any other network in the UK. Our network partner. We know good phone signal's important. It’s frustrating if you can’t make a call, a conversation cuts out halfway through, or your data speed’s slower than a teenager on Monday morning."}, {"url": "http://talkmobile.co.uk/help/signal-help/area-check/", "passage_text": "Check Talkmobile signal in your area. Our signal covers 99.7% of the UK to allow you to make calls, texts and access the Internet from almost everywhere, but there are some areas where our signal is stronger than others. To make sure there is Talkmobile signal in your area, enter your postcode into our signal checker"}, {"url": "http://www.cnet.com/uk/news/talkmobile-network-from-carphone-warehouse-offers-cheap-pay-as-you-go/#!", "passage_text": "tumblr. Talkmobile, a new mobile network from Carphone Warehouse, will focus on short-term contract deals and a very tasty looking pay as you go tariff. We like to pronounce it all as one word, rather than 'talk mobile', and imagine it's what Oprah calls her car, like the Batmobile. Talkmobile network from Carphone Warehouse offers cheap pay as you go. A new network from Carphone Warehouse is offering fair deals for people who are looking to go SIM-only, or not be tied to a lengthy 18 or 24 month contract. 1  by Asavin Wattanajantra."}, {"url": "http://mobilenetworkcomparison.org.uk/reviews/talkmobile/", "passage_text": "TalkMobile is a virtual network operated by the Carphone Warehouse. It replaced the existing Carphone Warehouse virtual networks Mobile World & Fresh Mobile and one in five Carphone Warehouse prepay sales are now on TalkMobile. TalkMobile uses the Vodafone network and the coverage is great in most areas of the country and they have a decent 3G signal. They operate a good, well-informed phone customer service which rarely forces an automated system on you and has short waiting time."}, {"url": "http://help2.talktalk.co.uk/network-coverage", "passage_text": "Network coverage. We have teamed up with Vodafone so you are able to use your mobile in 99% of the UK. Use this mobile checker to check the coverage in your area or for any network issues. "}, {"url": "https://en.wikipedia.org/wiki/Talkmobile", "passage_text": "Talkmobile is an online based mobile virtual network operator (MVNO) operating in the United Kingdom on the Vodafone network. As part of Vodafone, the business is based in Newbury, Berkshire. Launching through Carphone Warehouse in 2007, Talkmobile was originally called Fresh Mobile and used to run on the one2one/T-Mobile network. The Fresh brand. was discontinued in 2010 in favour of TalkMobile. Vodafone bought TalkMobile from Carphone Warehouse in 2011"}]