[{"url": "http://www.wsj.com/articles/SB10001424053111904194604576580720025344668", "passage_text": "Height loss is a natural part of aging—some people start shrinking slightly as early as 30. Losing too much height too rapidly, however, can signal a high risk for hip fractures, spinal fractures and even heart disease, particularly in men, several recent studies have found. "}, {"url": "http://philsantamaria.com/stay-fit/shrinkage-how-our-body-parts-get-smaller-as-we-age/", "passage_text": "Height Shrinkage. Most of us lose at least 1/3 of an inch in height every decade after the age of 40. By 80, most men will be 2 inches shorter than they were in their prime, and women will be as much as 3.15 inches shorter. "}, {"url": "http://dailynightly.nbcnews.com/_news/2012/05/29/11941980-avoiding-height-loss-as-you-age?lite", "passage_text": "Our vertebra also loses bone density as we age, making them thinner. The end result is a stooped spine. And it's not just hazardous to your posture -- Harvard researchers recently found that height loss, a commonly seen by-product of age-related bone thinning, is a predictor of future risk of hip fractures. "}, {"url": "http://bodyodd.nbcnews.com/_news/2011/10/07/8193729-yep-youre-shrinking-as-you-get-older-heres-why?lite", "passage_text": "A little bit of shrinking is a normal part of aging, and it happens because of three things, basically, Raj says. First, as we age, the discs between our vertebrates lose fluid, so they flatten a bit and your vertebrates simply come together, so your spine is actually shrinking a little bit, Raj explains. Dr. Roshini Raj confirms that you are getting shorter as you get older. She tells TODAY's Savannah Guthrie the causes of height loss and how to prevent it. You're not imagining it: You're shrinking."}, {"url": "http://www.dailymail.co.uk/health/article-2040850/Yes-shrink-age--rapid-decline-signal-health-risks.html", "passage_text": "A height loss of two inches or more may be a cause for concern. Most would not consider their late 30s as being 'over the hill,' but scientists have revealed that we are... at least when it comes to height. This is the age when you start to shrink with men and women losing around half an inch in height each decade. For many this is a gradual process and nothing to worry about. Over the years the discs between the vertebrae flatten, there can be joint space narrowing and muscles start to lose mass."}, {"url": "http://www.answers.com/Q/How_can_you_shrink_your_height", "passage_text": "The height of a person is primarily determined by bone structure and is not easilly reduced. A person's height will reduce slightly as the discs between the spinal vertebrae become thinner with age. In addition, people with osteoporosis appear to shrink in height, but that appearance is due to the bending of the spine, producing the characteristic hump high on the back. "}, {"url": "http://www.nytimes.com/2013/01/03/booming/why-am-i-getting-shorter-with-age.html", "passage_text": "Relax. You’ve been through this before. Back when you were a baby baby boomer, your doctor probably laid you down every few months and measured your height. Then came the big day: you toddled into the doctor’s office on your own two feet and instead of lying down to be measured, you stood up. "}, {"url": "http://www.dailymail.co.uk/health/article-2042222/Your-incredible-shrinking-body-From-brain-heart--gets-smaller-age.html", "passage_text": "As the body’s ability to replace new bone tissue slows, the bones shrink slightly and become brittle, making them more likely to collapse and break — a condition known as osteoporosis. As well as the bones shrinking, height loss is also caused by the flattening of the discs that sit between the bones of the spine. Height loss at any age can be a warning sign of osteoporosis, particularly in women, but in men it also appears to be a marker for heart disease. But what many people won’t realise is that height is just one thing that shrinks with age: our hearts, facial bones and sex organs all shrink, too. Such changes often go hand in hand with health problems."}, {"url": "https://www.zocdoc.com/answers/14786/why-do-people-seem-to-shrink-with-age", "passage_text": "That is an interesting question to discuss with your primary care physician. Believe it or not, we start shrinking around age 30, and between the ages of 30 and 70, men tend to lose about 1 inch of height and women tend to lose around 2 inches. The medical community believes that people shrink for several reasons. "}, {"url": "http://preventdisease.com/news/articles/prevent_yourself_from_shrinking.shtml", "passage_text": "............................................................................................................... Height loss is a normal fact of aging, unfortunately people dont notice it when the decrements are small, and not all height loss is normal. Studies show some people can lose between one and two inches between the ages of 30 and 70. However, people in their 30s tend to not notice the decrease in height. In their 50s and 60s is when it becomes obvious, researchers say. "}]