[{"url": "http://allfinishconstruction.com/services/eifs", "passage_text": "Exterior Insulation and Finish Systems (EIFS) are multi-component exterior wall systems which generally consist of: 1  an insulation board. 2  an adhesive and/or mechanical attachment of the insulation board to the substrate or existing wall surface. The most basic and common EIFS is called a barrier EIFS (also known as a traditional or conventional EIFS). Another type is called an EIFS with Drainage, which is a barrier EIFS to which a water drainage capability has been added."}, {"url": "http://buildingscience.com/documents/reports/rr-0406-face-sealed-drainable-eifs/view", "passage_text": "Abstract: Exterior insulation and finishing systems (EIFS) are inherently defective and unfit of use as an exterior cladding system where moisture sensitive components are used without a provision for drainage or in locations and assemblies without adequate drying. "}, {"url": "https://en.wikipedia.org/wiki/Exterior_insulation_finishing_system", "passage_text": "A historic brick building in Germany covered with EIFS on the right side. Exterior insulation and finishing system (EIFS) is a general class of non-load bearing building cladding systems that provides exterior walls with an insulated, water-resistant, finished surface in an integrated composite material system. EIFS before 2000 was a barrier system, meaning the EIFS system itself was the weather barrier. After 2000 the EIFS industry introduced the air/moisture barrier that resides behind the foam."}, {"url": "http://allfinishconstruction.com/services/eifs", "passage_text": "There are two types of EIFS systems, barrier and drainable. Barrier, the earlier type, typically applied the insulating polystyrene board directly to the exterior sheathing with adhesive, followed by base coat, mesh and finish coat. There is no provision to deal with moisture that can be trapped if the system leaks. The most basic and common EIFS is called a barrier EIFS (also known as a traditional or conventional EIFS). Another type is called an EIFS with Drainage, which is a barrier EIFS to which a water drainage capability has been added."}, {"url": "http://www.wbdg.org/design/env_wall_eifs.php", "passage_text": "Fundamentals. All EIFS are proprietary systems and the components of the system should not be modified beyond the limits stated in the manufacturer's literature. The design of the interface with other components of the wall system is the responsibility of the wall designer. EIFS is available in two basic types: a barrier wall system or a wall drainage system. Barrier EIFS wall systems rely primarily on the base coat portion of the exterior skin to resist water penetration."}, {"url": "http://ilinspect.com/", "passage_text": "What is EIFS. Exterior Insulation Finish Systems (EIFS) or commonly known as Dryvit or Synthetic Stucco is an exterior cladding used on residential and commercial/industrial properties in the US since the 1960’s. These systems have superior energy efficiency and endless design flexibility"}, {"url": "http://exteriorinsulationfinishsystems.com/eifs/what-is-eifs/", "passage_text": "EIFS is an acronym that stands for “Exterior Insulation Finish Systems”, and is sometimes mistakenly referred to as “Stucco”. It is a multi-layer building cladding (exterior wall) that has the ability to reduce a home’s heating or cooling requirements. "}, {"url": "http://www.parex.com/systems.shtml?id=1", "passage_text": "Optimum EIFS. Optimum EIFS is premium classic EIF system. Like Standard EIFS, this system also offers the base level of benefits available in EIFS; energy efficiency, light weight, versatile design, and economical installation. Like Standard WaterMaster EIFS, this system offers the base level of benefits found in a classic EIF system and the superior moisture protection found in a base drainage system. However, Optimum WaterMaster LCR EIFS makes use of a premium base coat & adhesive as well as premium finish."}, {"url": "http://www.pieglobal.com/articles/eifs-vs-stucco-whats-the-difference/", "passage_text": "First, to make things complicated, there are two types of EIFS: PB systems and PM systems. Originally, the different systems were classified according to the composition of their respective finish or color coat. Regardless of the system, both EIFS and stucco depend on the proper installation of a secondary drainage plane behind the system components, flashings, terminations, and sealants to effectively manage water that invariably infiltrates the primary protection plane of the EIFS or stucco."}, {"url": "http://www.wbdg.org/design/env_wall_eifs.php", "passage_text": "Exterior Insulation and Finish System (EIFS) is an exterior wall cladding that utilizes rigid insulation boards on the exterior of the wall sheathing with a plaster appearance exterior skin. EIFS is available in two basic types: a barrier wall system or a wall drainage system. Barrier EIFS wall systems rely primarily on the base coat portion of the exterior skin to resist water penetration."}]