[{"url": "http://forums.segwaychat.org/archive/index.php/t-22242.html", "passage_text": "Dealers frequently open the new boxes and charge the batteries, as they do not do well to stay long times in the box unplugged... SO the conditions of your batteries on your new segway cannot be assessed here. I believe the owners manual says to charge the segway for 12 hours before using it. I suspect that many people do not do that. Typically, most of the charge goes into the batteries in 4 to 6 hours, the entire process takes about 8, with cell balancing. Of course, this all depends on how much charge is still in the batteries when you start to charge it... I've seen lots of information out there about how long the i2's battery LASTS, but no information about how long it takes to charge. As I am looking to buy a brand new i2 this coming Saturday, I'm wondering how long I can expect to have to let it charge before I can use it. Thanks!"}, {"url": "http://www.mysegadventures.com/faq/", "passage_text": "The Segway Human Transporter is the first of its kind – a self-balancing, personal transportation device designed to go anywhere people do. Segways are easy to use and operate and usually takes new riders 10 minutes of training to learn. The two-wheeled Segway sports high-tech gyroscopes that monitor your balance 100 times a second and automatically respond to your body’s movements. To move forward, the rider simply leans forward. "}, {"url": "http://www.spinfoot.com/SegwayBatteryFAQ.html", "passage_text": "Now charge your Segway for 8 to 12 hours, or longer. If possible unplug for a minutes to re-start the fast charge cycle and leave it plugged in for at least a few hours. Doing the second round of discharging as described in the procedure above has been debated in the user community. Common Questions 1.1 - How do I charge my battery when my HT first arrives? Charge 12 hours without interruption before first use The first 5 charges use up at least one bar but no more than 3 bars. For the first 5 charges, charge at least 8 hours without interruption. Following this initial conditioning procedure is believed to be one of the most important factors to getting best overall performance and lifespan out of your batteries. It s hard to wait 12 hours on day one, but do it anywa"}, {"url": "http://www.batteryrefill.com/Segway/i2_x2.phtml", "passage_text": "Our price is for pair of batteries. YOU HAVE TO USE EITHER A PAIR OF NI-MH OR LI-ION BATTERY PACKS. YOU CANNOT MIX ONE NI-MH WITH ONE LI-ION. SEGWAY RECOMMENDS TO CHANGE BATTERY PACKS IN PAIRS. (If you are a dealer/renter and if you need to refill/exchange just one pack, contact us 909-268-8741). "}, {"url": "http://www.segway.ch/en/infos/faq.php", "passage_text": "6 – 8 hours are necessary for a full charge. The Segway PT should be charged at room temperature (between 20 and 27°C), using a common plug (100 – 240 volt), which is available in every household. As long as your Segway PT is in the balancing mode, it only requires little strength to guide it up the ramp. If your car has a small luggage space, the handle bar of the Segway PT can be removed. The Segway PT i2 requires a space of H 49 x W 64 x L 46 cm, the PT x2 requires H 63 x W 84 x L 51 cm."}, {"url": "http://www.eqna.org/4120/how-long-will-a-segway-run-on-a-single-charge-say-a-12-hr-one-in-distance-or-hours", "passage_text": "How fast will it go? Anywhere from dead still up to about as fast as an average fit person can run-ie from 0 to 12mph. How far will it go? This depends obviously on a number of factors, like how heavy you are, how fast you ride, and the type of terrain you ride over or up, but, on a full charge, about 15 to 22 miles. How long does it take to charge? From completely empty to full, about 8 hours. "}, {"url": "http://www.segway.ch/en/infos/faq.php", "passage_text": "With a new and fully charged battery, the Segway PT has a range of up to 40 km, the Segway x2 up to 20 km. This is mainly dependent on terrain, driving style, incline, tyre pressure, temperature and weight of the driver. As long as your Segway PT is in the balancing mode, it only requires little strength to guide it up the ramp. If your car has a small luggage space, the handle bar of the Segway PT can be removed. The Segway PT i2 requires a space of H 49 x W 64 x L 46 cm, the PT x2 requires H 63 x W 84 x L 51 cm."}, {"url": "http://www.spinfoot.com/SegwayBatteryFAQ.html", "passage_text": "1.2 - How do I charge my batteries The simple answer is-Just keep your Segway plugged in when it is not in use. The Segway's batteries were designed to need minimal attention and if you are completely un-interested in details, you don t need to know much more than this. Common Questions 1.1 - How do I charge my battery when my HT first arrives? Charge 12 hours without interruption before first use The first 5 charges use up at least one bar but no more than 3 bars. For the first 5 charges, charge at least 8 hours without interruption. Following this initial conditioning procedure is believed to be one of the most important factors to getting best overall performance and lifespan out of your batteries. It s hard to wait 12 hours on day one, but do it anyway"}]