[{"url": "http://www.thedeterminedheart.com/", "passage_text": "So many things occurred in Mary Shelley's life that one can't help anticipating that something momentous is just a few pages away. May is to be commended for her devotion to her heroine in this crack tale. I will be happy to tell friends to curl up with THE DETERMINED HEART on a cold weekend this fall. Antoinette May has put the author back in the center of her own life. She puts to rest any idea that Shelley's production of *Frankenstein* was a one-off fluke. Shelley was a stunning, original thinker who wrote incessantly, despite a series of tragedies in her twenties that would have broken a lesser person."}, {"url": "http://antoinettemay.com/", "passage_text": "Nob Hill Gazette. Select More Articles by Category Books archaeology Antiques & Architecture Gold Country Selected Travel Profiles & Biographies History Ghost Stories Mexico & Central America. Books archaeology Antiques & Architecture Gold Country Selected Travel Profiles & Biographies History Ghost Stories Mexico & Central America. "}, {"url": "http://www.thedeterminedheart.com/", "passage_text": "To describe her life as unconventional would be an understatement. What Antoinette May does with The Determined Heart: The Tale of Mary Shelley and Her Frankenstein is take the details of Shelley's life and weave them as a fictional narrative that hooks the reader from the beginning. Antoinette May has put the author back in the center of her own life. She puts to rest any idea that Shelley's production of *Frankenstein* was a one-off fluke. Shelley was a stunning, original thinker who wrote incessantly, despite a series of tragedies in her twenties that would have broken a lesser person."}, {"url": "http://susancoventry.blogspot.com/2015/08/book-review-determined-heart-tale-of.html", "passage_text": "Mary was the daughter of the famous Mary Wollstonecraft, a philosopher and women’s rights advocate and William Godwin, a political philosopher. Her mother died from complications of a difficult childbirth. Mary and a stepsister, Fanny, were raised by William Godwin. When Mary was four, her father remarried, bringing another stepsister, Claire, into the household, along with a stepmother who was so glaringly different from her brilliant mother that Mary could not help but rebel. Mary makes the best of a situation that isn’t exactly what she imagined. She and her poet do have a life filled with passion, love, and intellectual engagement. She meets other men and women with similar interests (for example, Lord Byron.) They travel. She and Shelley both write. There are babies and miscarriages."}, {"url": "http://www.thedeterminedheart.com/", "passage_text": "And, of course, after finishing Antoinette May's book, don't be surprised to find yourself hankering to read some of Shelley's oeuvre. While FRANKENSTEIN is always worth re-reading, given what she experienced, Shelley's other works deserve more than to be shut up, forgotten, in the Arctic of the stacks. Antoinette May has put the author back in the center of her own life. She puts to rest any idea that Shelley's production of *Frankenstein* was a one-off fluke. Shelley was a stunning, original thinker who wrote incessantly, despite a series of tragedies in her twenties that would have broken a lesser person."}, {"url": "http://susancoventry.blogspot.com/2015/08/book-review-determined-heart-tale-of.html", "passage_text": "Disclaimer: I received this book for free from Netgalley. This did not influence my review. The Determined Heart. The Tale of Mary Shelley and Her Frankenstein by Antoinette May is a touching story of the devoted love of Mary Godwin Shelley for the romantic poet Percy Bysshe Shelley. Mary makes the best of a situation that isn’t exactly what she imagined. She and her poet do have a life filled with passion, love, and intellectual engagement. She meets other men and women with similar interests (for example, Lord Byron.) They travel. She and Shelley both write. There are babies and miscarriages."}, {"url": "http://www.thedeterminedheart.com/", "passage_text": "May shows us that much, much more comprised Shelley's life, and that her literary lifetime output was so much more than the one novel. Antoinette May has put the author back in the center of her own life. She puts to rest any idea that Shelley's production of *Frankenstein* was a one-off fluke. Shelley was a stunning, original thinker who wrote incessantly, despite a series of tragedies in her twenties that would have broken a lesser person."}]