[{"url": "http://www.babynamespedia.com/meaning/Martez", "passage_text": "[ 2 syll. mar-tez, ma-rt-ez ] The baby boy name Martez is pronounced as M AA RTehZ †. Martez is a Spanish name of Latin origin. In addition, Martez is a derivative (Spanish) of Martin. The names Martes, Martese, Marteze, Martice, Martiese, Martis, and Martise are derivatives of Martez. Martez is rare as a baby boy name. At the modest peak of its usage in 1992, 0.009% of baby boys were named Martez. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Martez.html", "passage_text": "English names generally consist of a given name, middle name and family name. Many English speaking countries have fairly flexible naming laws. This allows the multicultural families that live in these countries to merge the naming conventions of their faiths or previous nationalities with their current homeland."}, {"url": "http://www.ebabynames.com/#!meaning-of-Martez", "passage_text": "Martez is a surname derived from the surname Martinez, which is likely derived from Martinus. The meaning of Martinus is unclear, but it is derived from the name of the Roman god of war, Mars. Tweet. 4 5. The meaning of Martez is unknown. Its origin is  Variant of the Spanish name Martinez . Martez is a form of Martinez and is generally pronounced like  MAR tez . This name is mostly being used as a boys name. Last year it ranked 1,883rd in the U.S. Social Security Administration list of most popular baby boy names"}, {"url": "http://www.ourbabynamer.com/Martez-name-popularity.html", "passage_text": "Compare To: See the name popularity of Martez since 1880 and compare it to other names in both chart and table forms. View Martez popularity trends, and how the popularity of Martez has changed over time. Name: "}, {"url": "http://www.thenamemeaning.com/martez/", "passage_text": "The meaning of Martez is “From the god Mars”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. If you consider naming your baby Martez we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.thenamemeaning.com/martez/", "passage_text": "Search comprehensively and find the name meaning of Martez and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Martez and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Martez is fascinating, learn more about it. If you consider naming your baby Martez we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}, {"url": "http://www.behindthename.com/name/martin", "passage_text": "From the Roman name Martinus, which was derived from Martis, the genitive case of the name of the Roman god MARS. Saint Martin of Tours was a 4th-century bishop who is the patron saint of France. "}, {"url": "http://www.thenamemeaning.com/martez/", "passage_text": "Instead, we recommend that you pay a greater attention to the origin and meaning of the name Martez. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Martez, spread the love and share this with your friends. If you consider naming your baby Martez we recommend you take note of the special meaning and history of the name as your baby’s name will play a big role in its life and your baby will hear it spoken every day."}]