[{"url": "http://www.capacitorguide.com/tantalum-capacitor/", "passage_text": "Tantalum Capacitor. Tantalum capacitors are electrolytic capacitors which use tantalum metal for the anode. They are polarized capacitors with superior frequency and stability characteristics. Tantalum capacitor definition. Tantalum capacitors are electrolytic capacitors which use tantalum metal for the anode. They are polarized capacitors with superior frequency and stability characteristics."}, {"url": "https://en.wikipedia.org/wiki/Tantalum", "passage_text": "Tantalum is a rare, hard, blue-gray, lustrous transition metal that is highly corrosion-resistant. It is part of the refractory metals group, which are widely used as minor components in alloys. The chemical inertness of tantalum makes it a valuable substance for laboratory equipment and a substitute for platinum. Tantalum is also used for medical implants and bone repair. Its main use today is in tantalum capacitors in electronic equipment such as mobile phones, DVD players, video game systems and computers. Tantalum, always together with the chemically similar niobium, occurs in the minerals tantalite, columbite and coltan (a mix of columbite and tantalite). Tantalum is a rare metal, comprising just 6991800000000000000♠8×10−9 % of the universe, making it fifteen times less abundant in the universe than gold (which makes up 6992600000000000000♠6×10−8 %)."}, {"url": "https://www.sparkfun.com/news/1271", "passage_text": "The tantalum capacitors is a special type of electrolytic capacitor. To make a tantalum capacitor, powdered tantalum is formed into a pellet through the sintering process. The pellet is submerged in an acidic solution and a DC voltage is applied, which creates an oxide layer over all the tantalum particles. The worst part is that they often fail short. If you are using tantalum capacitors for power supply decoupling and a voltage spike causes a tantalum “event,” the power and ground lines are then shorted together, which could ruin even more circuitry."}, {"url": "http://www.radio-electronics.com/info/data/capacitor/tantalum-capacitor.php", "passage_text": "Tantalum SMD capacitors. Tantalum SMD capacitors are widely used to provide levels of capacitance that are higher than those that can be achieved when using ceramic capacitors. The capacitor technology that is used within SMD tantalum capacitors is based on the solid tantalum capacitor technology. Tantalum capacitor advantages and disadvantages. tantalum capacitors offer many advantages over other types of capacitor. This has meant that their use has risen considerably over the years, and now they are widely used in all forms of electronics equipment."}, {"url": "https://en.wikipedia.org/wiki/Tantalum_capacitor", "passage_text": "Tantalum capacitors are the main use of the element tantalum. Tantalum ore is one of the conflict minerals. Some non-governmental organizations are working together to raise awareness of the relationship between consumer electronic devices and conflict minerals. Tantalum electrolytic are polarized and generally require anode electrode voltage to be positive relative to the cathode voltage. With a reverse voltage applied, a reverse leakage current flows in very small areas of microcracks or other defects across the dielectric layer to the anode of the electrolytic capacitor."}, {"url": "https://en.wikipedia.org/wiki/Tantalum_capacitor", "passage_text": "A tantalum electrolytic capacitor, a member of the family of electrolytic capacitors, is a polarized capacitor whose anode electrode (+) is made of tantalum on which a very thin insulating oxide layer is formed, which acts as the dielectric of the capacitor. Tantalum electrolytic are polarized and generally require anode electrode voltage to be positive relative to the cathode voltage. With a reverse voltage applied, a reverse leakage current flows in very small areas of microcracks or other defects across the dielectric layer to the anode of the electrolytic"}, {"url": "http://www.capacitorguide.com/tantalum-capacitor/", "passage_text": "Tantalum capacitors are a subtype of electrolytic capacitors. They are made of tantalum metal which acts as an anode, covered by a layer of oxide which acts as the dielectric, surrounded by a conductive cathode. The use of tantalum allows for a very thin dielectric layer. Tantalum capacitor definition. Tantalum capacitors are electrolytic capacitors which use tantalum metal for the anode. They are polarized capacitors with superior frequency and stability characteristics."}, {"url": "http://www.radio-electronics.com/info/data/capacitor/tantalum-capacitor.php", "passage_text": "1 Tantalum capacitors with porous anode and liquid electrolyte: This form of tantalum capacitor is also known as the wet tantalum capacitor and it was the first form to be introduced. 2  It still offers the best space factor. 3  A variety of electrolytes can be used within this form of tantalum capacitor. Tantalum capacitor advantages and disadvantages. tantalum capacitors offer many advantages over other types of capacitor. This has meant that their use has risen considerably over the years, and now they are widely used in all forms of electronics equipment."}, {"url": "http://www.piclist.com/images/www/hobby_elec/e_capa.htm", "passage_text": "Tantalum Capacitors are electrolytic capacitors that is use a material called tantalum for the electrodes. Large values of capacitance similar to aluminum electrolytic capacitors can be obtained. Also, tantalum capacitors are superior to aluminum electrolytic capacitors in temperature and frequency characteristics. "}]