[{"url": "http://www.acceptancerate.com/schools/university-of-north-carolina-wilmington", "passage_text": "The applicant selectivity of UNCW is about average, as determined by collecting standardized test scores e.g. ACT/SAT and high school average GPA ranges of students who were granted admissions from previous years."}, {"url": "http://uncw.edu/admissions/StandardizedTesting.html", "passage_text": "SAT II Subject Tests and AP or IB scores are not considered in the admission decision at UNCW. SAT Reasoning Test. UNCW will consider scores from either the current SAT or the redesigned SAT. The middle 50 percent of admitted students scored an 1130 to a 1250 on the math and critical reading sections of the SAT."}, {"url": "http://www.acceptancerate.com/schools/university-of-north-carolina-wilmington", "passage_text": "About fourteen thousand students are enrolled at UNCW. Students can report either the ACT or SAT exam scores to UNCW. A score in the range of 1620 - 1850 on the SAT exam, or 22 - 26 on the ACT exam is among the 25th - 75th percentile range among admitted students. By applying sampled GPA data from over 150 schools, we are able to estimate that the UNCW average GPA ranges from 3.35 to 3.52 for accep"}, {"url": "http://uncw-admissions.blogspot.com/2011/09/sat-or-actwhich-one-should-i-take.html", "passage_text": "• UNCW encourages SAT score choice. Should your scores fall outside of our average, hold your scores and consider taking the ACT with writing exam. Send in only your highest score from the ACT with writing or submit several SAT scores for us to create your highest overall score."}, {"url": "http://www.prepscholar.com/act/s/colleges/UNCW-ACT-scores-GPA", "passage_text": "The average ACT score composite at UNCW is a 25. The 25th percentile ACT score is 23, and the 75th percentile ACT score is 26. In other words, a 23 places you below average, while a 26 will move you up to above average. There's no absolute ACT requirement at UNCW, but they really want to see at least a 23 to have a chance at being considered."}]