[{"url": "https://en.wikipedia.org/wiki/Kitchen_knife", "passage_text": "A kitchen knife is any knife that is intended to be used in food preparation. While much of this work can be accomplished with a few general-purpose knives – notably a large chef's knife, a tough cleaver, and a small paring knife – there are also many specialized knives that are designed for specific tasks. The term Utility knife is often used for a non-kitchen cutting tool with a short blade which can be replaced, or with a strip of blades which can be snapped off when worn. A utility knife is between a chef's knife and paring knife in size, about 10 cm and 18 cm (4 and 7 inches) in length."}, {"url": "http://allrecipes.com/recipe/13981/eggplant-parmesan-i/", "passage_text": "1 Arrange a single layer of eggplant slices on top of the sauce. 2  Top the eggplant with 1/2 of the cheese mixture. 3  Repeat layering process until all the eggplant and cheese mixture is used. 4  Pour remaining sauce on top of layers, and sprinkle with remaining Parmesan cheese. Ready In. 1  Sprinkle both sides of the eggplant slices with salt. 2  Preheat oven to 350 degrees F (175 degrees C). 3  Rinse the eggplant in cold water until all salt is removed. 4  In a 9x13 inch baking dish, evenly spread 1 1/2 cups of spaghetti sauce. 5  Bake 30 to 45 minutes in the preheated oven, until sauce is bubbly."}, {"url": "http://allrecipes.com/recipe/13981/eggplant-parmesan-i/", "passage_text": "1 In a medium bowl, mix the ricotta, mozzarella cheese and 1/4 cup Parmesan cheese. 2  Mix in egg and basil. 3  Rinse the eggplant in cold water until all salt is removed. 4  In a large skillet, heat 4 tablespoons olive oil over medium heat. 5  Place one layer of eggplant in the pan, brown each side. Ready In. 1  Sprinkle both sides of the eggplant slices with salt. 2  Preheat oven to 350 degrees F (175 degrees C). 3  Rinse the eggplant in cold water until all salt is removed. 4  In a 9x13 inch baking dish, evenly spread 1 1/2 cups of spaghetti sauce. 5  Bake 30 to 45 minutes in the preheated oven, until sauce is bubbly."}, {"url": "http://naturalsociety.com/15-companies-whose-products-contain-wood-pulp-cellulose/", "passage_text": "What many do not realize, however, is that cellulose is actually wood pulp. Unable to be digested by humans due to the lack of necessary enzymes needed to break the ingredient down, cellulose has been deemed ‘safe for consumption’ by the FDA. Cellulose is virgin wood pulp that has been processed and manufactured for different functions, such as its prime use throughout the food supply. Cellulose can be found in products under ingredient listings such as cellulose gum, powdered cellulose, microcrystalline cellulose, and more. "}, {"url": "http://www.tastymeatloafrecipes.com/meatloaf-bread-crumb-substitutes.html", "passage_text": "Meatloaf can be made without breadcrumbs, but we as a society have become accustomed to preparing our meatloaf recipes with bread crumbs. If you want to try something different, or you happen to be out of breadcrumbs, here is a handy list of breadcrumb alternatives for your meatloaf recipe. 1) Cornflakes Crush the cornflakes, or other unsweetened cereal, in a ziploc bag and use as you would breadcrumbs. 2) Soft Bread Tear the bread into small pieces. The pieces can be used instead of dried bread crumbs. Make sure you tear or cut the bread into small enough pieces so you can incorporate it evenly into the meatloaf. 3) Quinoa Prepare according to package directions, or use leftover quinoa"}, {"url": "http://allrecipes.com/recipe/13981/eggplant-parmesan-i/", "passage_text": "1 Place one layer of eggplant in the pan, brown each side. 2  Repeat with remaining eggplant slices, using additional oil if necessary. 3  In a 9x13 inch baking dish, evenly spread 1 1/2 cups of spaghetti sauce. 4  Arrange a single layer of eggplant slices on top of the sauce. 5  Top the eggplant with 1/2 of the cheese mixture. Ready In. 1  Sprinkle both sides of the eggplant slices with salt. 2  Preheat oven to 350 degrees F (175 degrees C). 3  Rinse the eggplant in cold water until all salt is removed. 4  In a 9x13 inch baking dish, evenly spread 1 1/2 cups of spaghetti sauce. 5  Bake 30 to 45 minutes in the preheated oven, until sauce is bubbly."}, {"url": "https://www.mainstreet.com/slideshow/10-brands-put-wood-their-food", "passage_text": "The recent class-action lawsuit brought against Taco Bell raised questions about the quality of food many Americans eat each day. Chief among them is the use of cellulose (read: wood pulp), an extender whose use in a roster of food products, from crackers and ice creams to puddings and baked goods, is now being exposed. Cellulose adds fiber to the food, which is good for people who do not get the recommended daily intake of fiber in their diets, Inman said. It also extends the shelf life of processed foods. Plus, cellulose's water-absorbing properties can mimic fat, he said, allowing consumers to reduce their fat intake."}, {"url": "https://www.mainstreet.com/slideshow/10-brands-put-wood-their-food", "passage_text": "We would expect increased disclosure to follow increased use of cellulose and other filler products as the practice increases in frequency.. To that end, TheStreet has rounded up a list of popular foods that use cellulose. It's by no means an exhaustive list, and we suggest consumers read food labels carefully. Cellulose adds fiber to the food, which is good for people who do not get the recommended daily intake of fiber in their diets, Inman said. It also extends the shelf life of processed foods. Plus, cellulose's water-absorbing properties can mimic fat, he said, allowing consumers to reduce their fat intake."}, {"url": "https://www.mainstreet.com/slideshow/10-brands-put-wood-their-food", "passage_text": "Cellulose is virgin wood pulp whose variant forms (cellulose gum, powdered cellulose, microcrystalline cellulose, etc.) are deemed safe for human consumption by the FDA, but the agency sets no limit on the amount that can be used in food products, as it does with other contaminants. Cellulose adds fiber to the food, which is good for people who do not get the recommended daily intake of fiber in their diets, Inman said. It also extends the shelf life of processed foods. Plus, cellulose's water-absorbing properties can mimic fat, he said, allowing consumers to reduce their fat intake."}]