[{"url": "http://www.yourdictionary.com/kangaroo", "passage_text": "kangaroo kangaroo or kan·ga·roos. Word History: A widely held belief has it that the word kangaroo comes from an Australian Aboriginal word meaning “I don't know.” This is in fact untrue. The word was first recorded in 1770 by Captain James Cook, when he landed to make repairs along the northeast coast of Australia. Word History: A widely held belief has it that the word kangaroo comes from an Australian Aboriginal word meaning “I don't know.” This is in fact untrue"}, {"url": "http://www.answers.com/Q/What_is_the_origin_of_the_word_kangaroo", "passage_text": "It is derived from the Guugu Yimidhirr word gangurru refaring to the grey kangaroo. Sir Joseph Banks, botanist on James Cook's first voyage, noted the name of the kangaroo as  gangurru  when he tried to communicate with the Aborigines regarding the name of the strange hopping animal noted on Australia's shores. The word is … believed to have come from the Aboriginal word gangurru, a Guugu Yimidhirr word referring to the Grey Kangaroo. Captain James Cook's botanist, Sir Joseph Banks, first recorded the word as kangaru when the Endeavour was damaged on the Great Barrier Reef near modern-day Cooktown."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080825045705AAnVA92", "passage_text": "A common myth about the kangaroo's English name is that it came from the Aboriginal words for I don't understand you.. According to this legend, Captain James Cook and naturalist Sir Joseph Banks were exploring Australia when they happened upon the animal. They asked a nearby local what the creatures were called. The local responded Kangaroo, meaning I don't understand you, which Cook took to be the name of the creature. Source(s): http://en.wikipedia.org/wiki/Kangaroo#Terminology. Desery · 7 years ago."}, {"url": "http://www.yourdictionary.com/kangaroo", "passage_text": "noun. A mother kangaroo with her joey in her pouch. A mother kangaroo with her joey in her pouch. The definition of a kangaroo is a hopping animal with a long tail from Australia famous for carrying around its young in a pouch on the mother's body. An example of a kangaroo is the animal at the zoo that hops around on its hind legs. Word History: A widely held belief has it that the word kangaroo comes from an Australian Aboriginal word meaning “I don't know.” This is in fact untrue."}, {"url": "https://en.wikipedia.org/wiki/Kangaroo", "passage_text": "The kangaroo /ˌkaeŋɡəˈruː/ ˌkæŋɡəˈruː is a marsupial from the Family (macropodidae, macropods meaning large). Foot in common use the term is used to describe the largest species from this, family especially those of the Genus: macropus the red, kangaroo antilopine, kangaroo eastern grey, kangaroo and western grey. kangaroo In common use the term is used to describe the largest species from this family, especially those of the genus Macropus: the red kangaroo, antilopine kangaroo, eastern grey kangaroo, and western grey kangaroo. Kangaroos are endemic to Australia."}, {"url": "http://www.thefreedictionary.com/kangaroo", "passage_text": "Word History: A widely held belief has it that the word kangaroo comes from an Australian Aboriginal word meaning I don't know.. This is in fact untrue. The word was first recorded in 1770 by Captain James Cook, when he landed to make repairs along the northeast coast of Australia. kangaroo. n, pl-roos. 1. (Animals) any large herbivorous marsupial of the genus Macropus and related genera, of Australia and New Guinea, having large powerful hind legs, used for leaping, and a long thick tail: family Macropodidae. See also rat kangaroo, tree kangaroo."}, {"url": "http://www.funtrivia.com/askft/Question76329.html", "passage_text": "1 vote Vote for this answer. WORD HISTORY A widely held belief has it that the word kangaroo comes from an Australian Aboriginal word meaning “I don't know.” This is in fact untrue. The word was first recorded in 1770 by Captain James Cook, when he landed to make repairs along the northeast coast of Australia. "}, {"url": "https://en.wikipedia.org/wiki/Kangaroo", "passage_text": "A common myth about the kangaroo's English name is that kangaroo was a Guugu Yimithirr phrase for I don't understand you.. According to this legend, Cook and Banks were exploring the area when they happened upon the animal. They asked a nearby local what the creatures were called. In common use the term is used to describe the largest species from this family, especially those of the genus Macropus: the red kangaroo, antilopine kangaroo, eastern grey kangaroo, and western grey kangaroo. Kangaroos are endemic to Australia"}]