[{"url": "http://french.about.com/od/pronunciation/a/accents.htm", "passage_text": "By Laura K. Lawless. There are four French accents for vowels and one accent for a consonant. For specific information on what the accents do to change the pronunciation of the letters they modify, please see the appropriate letter pages. The accent aigu ´ (acute accent) can only be on an E. At the beginning of a word, it often indicates that an S used to follow that vowel, e.g., etudiant (étudiant). student"}, {"url": "http://www.answers.com/Q/What_does_accent_mean", "passage_text": "-------------------------------- An accent is the stress on a syllable or words spoken by a person of specific language. For example a person speaking 'semi' as 'say-my' and using word 'apartment' is considered using American accent. The Spanish word que (no accent) may mean either what or that, depending on context. When que is used as part of a noun clause, as in Eso es lo que voy a hacer (T … hat is what I'm going to do) it means what.."}, {"url": "http://www.linguisticsociety.org/content/why-do-some-people-have-accent", "passage_text": "One is a 'foreign' accent; this occurs when a person speaks one language using some of the rules or sounds of another one. For example, if a person has trouble pronouncing some of the sounds of a second language they're learning, they may substitute similar sounds that occur in their first language. "}, {"url": "https://en.wikipedia.org/wiki/Accent_(sociolinguistics)", "passage_text": "In sociolinguistics, an accent (/ˈaeksɨnt/ ˈæksɨnt /-or/) ɛnt is a manner of pronunciation peculiar to a particular, individual, location or. nation Accent serves as the first point of gate keeping because we are forbidden, by law and social custom, and perhaps by a prevailing sense of what is morally and ethically right, from using race, ethnicity, homeland or economics more directly. We have no such compunctions about language, however."}, {"url": "http://www.definitions.net/definition/accent", "passage_text": "Accent. In sociolinguistics, an accent is a manner of pronunciation peculiar to a particular individual, location, or nation. An accent may identify the locality in which its speakers reside, the socio-economic status of its speakers, their ethnicity, their caste or social class, their first language, and so on. Accents typically differ in quality of the voice, pronunciation and distinction of vowels and consonants, stress, and prosody."}, {"url": "http://www.answers.com/Q/What_does_accent_mean", "passage_text": "The verb to accent means to accentuate or specifically enhance, or to stress a word syllable. The noun accent is similarly a stress or prominence (as in pronunciation or in music. It also refers to any of various marks or punctuation. In language, it is a set of pronunciations particular to a region or ethnic group. The Spanish word que (no accent) may mean either what or that, depending on context. When que is used as part of a noun clause, as in Eso es lo que voy a hacer (T … hat is what I'm going to do) it means what.."}, {"url": "http://www.thefreedictionary.com/accent", "passage_text": "accent. n. 1. (Phonetics & Phonology) the characteristic mode of pronunciation of a person or group, esp one that betrays social or geographical origin. 2. (Phonetics & Phonology) the relative prominence of a spoken or sung syllable, esp with regard to stress or pitch. 5. a mode of pronunciation characteristic of or distinctive to the speech of a particular person, group, or locality: a southern accent. 6. such a mode of pronunciation recognized as being of foreign origin: She still speaks with an accent. 7. a. a stress or emphasis given to certain musical notes."}, {"url": "https://en.wikipedia.org/wiki/Accent_(music)", "passage_text": "In music, an accent is an emphasis placed on a particular note, either as a result of its context or specifically indicated by an accent mark. Accents contribute to the articulation and prosody of a performance of a musical phrase. Compared to surrounding notes: 1  A dynamic accent or stress accent is an emphasis using louder sound, typically most pronounced on the attack of the sound. 2  A tonic accent is an emphasis on notes by virtue of being higher in pitch as opposed to higher in volume."}, {"url": "https://en.wikipedia.org/wiki/Accent_(music)", "passage_text": "1 A dynamic accent or stress accent is an emphasis using louder sound, typically most pronounced on the attack of the sound. 2  A tonic accent is an emphasis on notes by virtue of being higher in pitch as opposed to higher in volume. 3  An agogic accent is an emphasis by virtue of being longer in duration. Compared to surrounding notes: 1 "}, {"url": "https://en.wikipedia.org/wiki/Accent_(sociolinguistics)", "passage_text": "An accent may be identified with the locality in which its speakers reside (a regional or geographical accent), the socio-economic status of its speakers, their ethnicity, their caste or social class (a social accent), or influence from their first language (a foreign accent). Accent serves as the first point of gate keeping because we are forbidden, by law and social custom, and perhaps by a prevailing sense of what is morally and ethically right, from using race, ethnicity, homeland or economics more directly. We have no such compunctions about language, however."}]