[{"url": "http://www.midwestgardentips.com/best_perennial_ornamental_grasses.html", "passage_text": "Feather Reed Grass: Calamagrostis x acutiflora This hardy perennial grass is cool season grass that is hardy to zone 4, where it becomes a warm season grass due to the cooler overall climate of the north. It has an upright narrow form and arching fronds, growing from 2 to 5 feet depending on variety."}, {"url": "http://www.midwestgardentips.com/best_perennial_ornamental_grasses.html", "passage_text": "Blue Fescue: Festuca glauca This hardy perennial grass has been used for some time in gardens across the country. It is a cool season grass, evergreen in zone 5, hardy to zone 4, with some varieties hardy in zone 3."}, {"url": "http://extension.illinois.edu/grasses/understanding.cfm", "passage_text": "Understanding Ornamental Grasses. With the popularity of ornamental grasses and their use in the landscape, it is a good idea to understand how these plants grow. This understanding will lead to better use of these plants and often avoid disappointment or frustration. Grasses respond and start to grow based upon temperature."}, {"url": "http://ryegrasses.com/", "passage_text": "Perennial ryegrass is planted as permanent turf or lawn grass and to overseed warm season grasses while they are in winter dormancy. Perennial ryegrass seed is also mixed with other cool season grasses to provide more density to the dominate grass in the mixture."}, {"url": "http://www.midwestgardentips.com/best_perennial_ornamental_grasses.html", "passage_text": "Japanese Silvergrass: Miscanthus sinensis This particular variety of the hardy perennial, warm season grass, is 4-8 feet tall and hardy to zone 3. It’s upright stature is excellent for screening, specimen plants, large container plantings, or water features. It does very well in full sun and average to wet soils."}, {"url": "http://www.homedepot.com/p/Pennington-50-lb-Fairway-Supreme-Perennial-Ryegrass-Blend-100082740/100598506", "passage_text": "Perennial Ryegrass Blend is great for home lawns, golf courses and athletic fields. Perennial Rye grass seed blend grows a lush, fine bladed permanent northern lawn. Excellent for use to overseed southern bermuda grass in the fall or winter."}, {"url": "http://extension.illinois.edu/lawntalk/weeds/perennial_grassy_weeds_in_lawns.cfm", "passage_text": "One way to distinguish perennial grasses from annuals is the time of the year established plants are present. Perennials (other than nimblewill and zoysiagrass) will appear as established green grasses early in spring; whereas most annual grasses like crabgrass don't appear until late spring or early summer."}]