[{"url": "http://blog.mosaicartsupply.com/how-to-color-grout/", "passage_text": "If you find that you can’t get a dark enough color with white grout, then consider starting with grey grout. However, if you start with grey grout, you may find it easier to get a darker color, but it might be less intense than what you got with the white grout. White grout (for dry indoor mosaic art*) can be colored with artists acrylic paint. You should mix the grout up according to manufacturer instructions, and once you have a nice lump of grout with a consistency similar to dough, you can add the paint. Mix in the paint a little bit at a time until you work up to the color you wan"}, {"url": "http://www.groutshields.com/", "passage_text": "Even though our sealer allows you to change the color of your grout, it is not to be confused with grout dye, or a grout stain or paint. Unlike a dye or stain or paint, Grout Shield color seal will bond to your grout, filling the pores, while keeping the same look and texture of your original grout. Grout Shield color sealer allows you to change your grout from dark to light, or even light to dark. Our sealer is thick enough to even cover black grout with white sealer! Grout Shield “Homeowner kits”, come with everything that you need to complete a full project in your home. Our sealer is perfect for counters and backsplashes and anywhere that you have grout; it can even be used outside or around pools! We can custom match any color in the world, including leading grout brands such as: Custom Building Products/Polyblend, Laticrete, Hydroment, Tec and C-Cure."}, {"url": "http://www.groutshields.com/", "passage_text": "Grout Shield’s grout color sealer allows you to match or change the color of your grout, without removing out your existing grout! Grout Shield allows you to recolor your grout easily, by using one of our all-in-one Grout Re-Color Kits. Our sealer is perfect for counters and backsplashes and anywhere that you have grout; it can even be used outside or around pools! We can custom match any color in the world, including leading grout brands such as: Custom Building Products/Polyblend, Laticrete, Hydroment, Tec and C-Cure."}, {"url": "http://www.installerstore.com/SKM-Grout-Aide-Grout-Marker.html", "passage_text": "Grout Aide marker by SKM Industries is a colored grout marker which makes it simple to update colored grout. The colored grout marker provides you with an incredibly easy way to refresh the color of tile grout, and can also be used to completely change grout color. The Grout Aide marker's solution is non-toxic, water-resistant, fast-drying and non-bleaching, so it can even be used in a non-ventilated bathroom. "}, {"url": "http://homeguides.sfgate.com/change-color-nonsanded-grout-once-installed-29821.html", "passage_text": "A new grout color can enhance your tile. If you’ve made a mistake in selecting the grout color or the once-white grout has turned to a dirty brown, consider recoloring your nonsanded grout. Without hiring a professional to remove the grout and install new grout, homeowners can change the color with a good cleaning and a couple coats of a grout stain and sealer product. Make no mistake, this is a tedious job, but with a steady hand and patience, you can rejuvenate the grout in just one day."}, {"url": "http://www.lowes.com/projects/repair-and-maintain/repair-tile-grout/project", "passage_text": "Match Your Grout Color. While regrouting tile isn't complicated, matching grout color can be tricky. Get a sample chart from Lowe's and find the closest color match. If the original grout color is lighter than the color you chose from the sample chart, lighten the new grout by adding more water when you mix it. "}, {"url": "http://blog.mosaicartsupply.com/how-to-color-grout/", "passage_text": "Unless you are using gray tile or light blue tile, a medium gray is usually the best choice of color because it tends to contrast the most colors. If you match grout color to tile color, then your tiles won’t be separated visually, and the mosaic effect will be lost. The grout line is best used to separate the tiles visually and not as a color field. Think about how a thin pencil line provides definition to watercolor paintings but not color. White grout (for dry indoor mosaic art*) can be colored with artists acrylic paint. You should mix the grout up according to manufacturer instructions, and once you have a nice lump of grout with a consistency similar to dough, you can add the paint. Mix in the paint a little bit at a time until you work up to the color you want"}, {"url": "http://www.youtube.com/watch?v=NayDx_A2fvg", "passage_text": "To change your grout color use The Tile Shop's Superior brand Pro Color. The Pro Color is an epoxy paint that changes the color and seals the grout for up to 15 years of protection. "}, {"url": "http://www.wikihow.com/Change-the-Color-of-Grout", "passage_text": "Grout can easily become discolored and dingy over time-something that is displeasing to many people. Rather than suffering through dealing with unattractive dark lines between your tiles, you can take action to change the color of your grout. Although neither is especially timely, you can choose to stain your grout or to give it a deep-cleaning."}]