[{"url": "http://www.animationcareerreview.com/articles/animation-director-career-profile", "passage_text": "Animation Director Salaries. According to the Bureau of Labor Statistics, the median annual wage for animation directors (producers and directors) is $71,350. The lowest 10 percent average less than $32,080 per year, and the top 10 percent average more than $187,200 per year."}, {"url": "http://www.animationarena.com/video-game-salary.html", "passage_text": "If you are hired as a lead artist or animator you can expect a salary of just over $64K per year until you have at least three years of experience. Once you have over three years on the job you will begin to make around $67K. Video game animators will make on the average, $46,700 a year for three years of experience or less. There is quite an increase once you make it past the three year mark, you can now make $67,000 a year."}, {"url": "http://www.payscale.com/research/US/Job=Animator/Salary", "passage_text": "(United States). An Animator earns an average salary of $50,281 per year. A skill in 2D Animation is associated with high pay for this job. Pay for this job rises steadily for more experienced workers, but goes down significantly for the few employees with more than 20 years' experience. "}, {"url": "http://work.chron.com/much-money-can-make-animation-9425.html", "passage_text": "As of 2011, the U.S. Bureau of Labor Statistics estimates that about 28,400 animators were employed in the United States. As of that year, animators reported average hourly earnings of $32.72 and an average annual salary of $68,060. Half of the animators working in the United States reported yearly incomes ranging from $45,750 to $82,860, and the top-earning 10 percent of U.S. animators earned $109,370 or more per year. The very lowest salary for animators, $30,310 per year, was reported in Montana. While the U.S. economy is expected to add jobs at an average rate of 14 percent between 2010 and 2020, the bureau projects that jobs for animators will grow at a significantly slower rate of just 8 percent."}, {"url": "http://money.usnews.com/careers/best-jobs/art-director", "passage_text": "Salary. The BLS reports the median annual wage for art directors was $83,000 in 2013. The best-paid 10 percent in the field made approximately $169,450, while the bottom 10 percent made approximately $44,500. The highest-paid work is in the metropolitan areas of New York City, San Francisco and San Jose, California"}, {"url": "http://www1.salary.com/Art-Director-salary.html", "passage_text": "For example the median expected annual pay for a typical Art Director in the United States is $88,329, so 50% of the people who perform the job of Art Director in the United States are expected to make less than $88,329. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. 4  Purchase Full Report. "}, {"url": "http://www.youtube.com/watch?v=01rZ8JR9boU", "passage_text": "Animators get paid a range of salaries, from $50 per foot of film to $1,500 per week. Calculate an animator's salary, whether working for a feature film or a small-time television show, with helpful information from a writer, director and animator in this free video on cartoon animation. 1  Science & Technology. "}, {"url": "http://money.usnews.com/careers/best-jobs/art-director/salary", "passage_text": "$94,260. Art directors make an average annual wage that’s higher than other creative jobs on our list. For example, an art director’s average annual wage in 2013 was $96,650, compared with an architect ’s average wage of $79,650 and a public relations specialist ’s average wage of $63,020 in the same year. The BLS reports the median annual wage for art directors was $83,000 in 2013. The best-paid 10 percent in the field made approximately $169,450, while the bottom 10 percent made approximately $44,500. The highest-paid work is in the metropolitan areas of New York City, San Francisco and San Jose, California."}, {"url": "http://www1.salary.com/Cartoonist-Animator-salary.html", "passage_text": "For example the median expected annual pay for a typical Cartoonist / Animator in the United States is $49,135, so 50% of the people who perform the job of Cartoonist / Animator in the United States are expected to make less than $49,135. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. "}]