[{"url": "http://www.emedicinehealth.com/dental_abscess/article_em.htm", "passage_text": "A dental abscess is an infection of the mouth, face, jaw, or throat that begins as a tooth infection. The original cause may be from a deep cavity, periodontal (gum) disease, or from trauma. Such infections are more likely to be caused by poor dental health and can result from lack of proper and timely dental care."}, {"url": "http://www.webmd.boots.com/oral-health/guide/dental-abscess", "passage_text": "A dental abscess is formed of pus affecting teeth or gums. Dental abscess can cause throbbing pain and is caused by bacterial infection. A dental abscess can begin as a tooth infection or cavity. These infections are common in people with poor dental health and result from lack of regular dental care."}, {"url": "http://www.webmd.boots.com/oral-health/guide/dental-abscess", "passage_text": "An infected tooth that has not received appropriate dental care can cause a dental abscess to form. Poor oral hygiene, (such as not brushing and flossing properly or often enough) can cause cavities to form in your teeth. The infection then may spread to the gums and adjacent areas and become a painful dental abscess."}, {"url": "http://www.medicalnewstoday.com/articles/170136.php", "passage_text": "A dental abscess, or tooth abscess, is an accumulation of pus that forms inside the teeth or gums. The abscess typically originates from a bacterial infection, often one that has accumulated in the soft pulp of the tooth."}, {"url": "http://www.emedicinehealth.com/dental_abscess/article_em.htm", "passage_text": "1 Periodontal abscesses are the result of an infection that has moved deeper into gum areas (on the outside surfaces of a tooth), and a periapical abscess refers to a tooth with an infection of the dental pulp (starting inside a tooth)."}, {"url": "http://www.colgate.com/en/us/oc/oral-health/conditions/dental-emergencies-and-sports-safety/article/abscess", "passage_text": "In rare cases, the infection that causes an abscess may spread and lead to serious health problems. What You Can Do. Abscesses are always serious because the infection may spread to other parts of the body."}, {"url": "http://www.mouthhealthy.org/en/az-topics/a/abscess/", "passage_text": "Abscess (Toothache). An abscessed tooth is an infection caused by tooth decay, periodontal disease or a cracked tooth. These problems can let bacteria enter the pulp (the soft tissue of a tooth that contains nerves, blood vessels and connective tissue) and can lead to pulp death."}, {"url": "http://www.webmd.com/oral-health/guide/abscessed-tooth", "passage_text": "An abscessed tooth is a painful infection at the root of a tooth or between the gum and a tooth. It's most commonly caused by severe tooth decay. Other causes of tooth abscess are trauma to the tooth, such as when it is broken or chipped, and gingivitis or gum disease."}, {"url": "http://www.mouthhealthy.org/en/az-topics/a/abscess/", "passage_text": "If the abscess is not treated, it can lead to a serious infection in the jaw bone, teeth and surrounding tissues. 1  pain. 2  swelling. 3  redness in the gums. 4  bad taste in the mouth. 5  fever."}]