[{"url": "http://www.behindthename.com/glossary/view/name", "passage_text": "More specifically a name is a label for a specific person, place or thing. These are sometimes called proper names. The rest of this article deals with names for people (personal names), but see place names and brand names for other types of proper names. A personal name is a name that belongs to a person. Family names and given names are prominent examples of personal names. It is not known when humans first began using names though the practice is certainly very old, probably extending far into prehistory"}, {"url": "http://no2np.org/named-person/", "passage_text": "The Scottish Parliament has passed legislation to appoint a ‘Named Person’ for every child in Scotland. This is a state official tasked with looking after a child’s “wellbeing”, that is, their “happiness”. 1 The scheme is compulsory. 2  Every child will have a Named Person by law. 3  They will have power to access confidential data on the family, and to talk to a child without their parents agreeing with what they say."}, {"url": "http://www.gov.scot/Resource/Doc/1141/0109328.pdf", "passage_text": "A child-centred approach The role of the Named Person endorses the child-centred approach of Getting it right for every child. Children, young people, parents and carers should have clear information about who is the child’s Named Person. All staff in all agencies should know what to do and when to share information with the Named Person because it is the Named Person who will provide a consistent, easy-to-recognise route for help. An important part of taking a child-and family-centred approach means respecting confidentiality."}, {"url": "http://www.gov.scot/Resource/Doc/1141/0109328.pdf", "passage_text": "This is an essential feature of a child centred approach to early intervention.The Named Person will be there for each child and the role will be part of day-to-day work. It may be that a child or family wish to contact their Named Person if they are worried about something. All staff in all agencies should know what to do and when to share information with the Named Person because it is the Named Person who will provide a consistent, easy-to-recognise route for help. An important part of taking a child-and family-centred approach means respecting confidentiality."}, {"url": "http://grammar.ccc.commnet.edu/grammar/nouns.htm", "passage_text": "A noun is the name of a person, place, thing, or idea. Whatever exists, we assume, can be named, and that name is a noun. A proper noun, which names a specific person, place, or thing (Carlos, Queen Marguerite, Middle East, Jerusalem, Malaysia, Presbyterianism, God, Spanish, Buddhism, the Republican Party), is almost always capitalized. "}, {"url": "https://en.wikipedia.org/wiki/Personal_name", "passage_text": "A personal name or full name refers to the set of names by which an individual is known and that can be recited as a word-group, with the understanding that, taken together, they all relate to that one individual. In many cultures, the term is synonymous with the birth and legal names of the individual, see below. For some people, their name is a single word, known as a mononym. This can be true from birth, or occur later in life. For example, Teller, of the magician duo Penn and Teller, was named Raymond Joseph Teller at birth, but changed his name both legally and socially to be simply Teller."}, {"url": "http://www.gov.scot/Topics/People/Young-People/gettingitright/named-person", "passage_text": "A Named Person is one point of contact that children and families can go to for advice or support if they need it. While most will get all the help and support they need from their parents, wider family and community, sometimes they and their families may seek extra support. The Named Person will provide a consistent approach to supporting children’s and young people’s wellbeing. They will give children, young people and parents access to help and advice wherever they live in Scotland. Access to a Named Person is an entitlement for children and young people from 0-18 years, or beyond if still in school"}, {"url": "http://no2np.org/", "passage_text": "The Scottish Government’s planned Named Person scheme will undermine parents’ responsibility for their own children and allow state officials unprecedented powers to interfere with family life. That’s why so many are saying NO2NP. "}, {"url": "https://en.wikipedia.org/wiki/Personal_name", "passage_text": "A person's full name usually identifies that person for legal and administrative purposes, although it may not be the name by which the person is commonly known; some people use only a portion of their full name, or are known by titles, nicknames, or other formal or informal designations. For some people, their name is a single word, known as a mononym. This can be true from birth, or occur later in life. For example, Teller, of the magician duo Penn and Teller, was named Raymond Joseph Teller at birth, but changed his name both legally and socially to be simply Teller."}]