[{"url": "https://en.wikipedia.org/wiki/Kuiper_belt", "passage_text": "The Kuiper belt is home to three officially recognized dwarf planets: Pluto, Haumea, and Makemake. Some of the Solar System's moons, such as Neptune's Triton and Saturn 's Phoebe, are also thought to have originated in the region. In 1992, 1992 QB1 was discovered, the first Kuiper belt object (KBO) since Pluto. Since its discovery, the number of known KBOs has increased to over a thousand, and more than 100,000 KBOs over 100 km (62 mi) in diameter are thought to exist."}, {"url": "http://lcogt.net/spacebook/comets-kuiper-belt-and-oort-cloud/", "passage_text": "Kuiper Belt. The Kuiper belt is a region between about 30 and 50 AU from the Sun in the plane of the ecliptic. It is believed to be where most of the trans-Neptunian objects are, including Pluto and several other recently discovered dwarf planets. It is also thought to be the origin of many of the solar system's short-period comets. There are several types of Kuiper belt objects, or KBOs. Classical KBOs orbit between 30 and 50 AU from the Sun with most between 42 and 48 AU."}, {"url": "http://www.universetoday.com/107598/what-is-the-kuiper-belt/", "passage_text": "While most of the 100,000 plus objects in the Kuiper Belt are composed primarily of ices, Pluto and the small planets in this region are rocky. Pluto is estimated to be 70 percent rock, and Eris, being 27 percent more massive, is likely more rocky and therefore more planet-like. Dr. Mike Brown is a professor of planetary astronomy at Caltech. He’s best known as the man who killed Pluto, thanks to his team’s discovery of Eris and other Kuiper Belt Objects. We asked him to help us explain this unusual region of our solar system"}, {"url": "http://www.universetoday.com/107598/what-is-the-kuiper-belt/", "passage_text": "Composition: There have been more than a thousand objects discovered in the Kuiper Belt, and it’s theorized that there are as many as 100,000 objects larger than 100 km in diameter. Given to their small size and extreme distance from Earth, the chemical makeup of KBOs is very difficult to determine. Dr. Mike Brown is a professor of planetary astronomy at Caltech. He’s best known as the man who killed Pluto, thanks to his team’s discovery of Eris and other Kuiper Belt Objects. We asked him to help us explain this unusual region of our solar system"}, {"url": "https://en.wikipedia.org/wiki/Kuiper_belt", "passage_text": "The objects within the Kuiper belt, together with the members of the scattered disc and any potential Hills cloud or Oort cloud objects, are collectively referred to as trans-Neptunian objects (TNOs). In 1992, 1992 QB1 was discovered, the first Kuiper belt object (KBO) since Pluto. Since its discovery, the number of known KBOs has increased to over a thousand, and more than 100,000 KBOs over 100 km (62 mi) in diameter are thought to exist."}, {"url": "http://www.space.com/16144-kuiper-belt-objects.html", "passage_text": "Beyond the gas giant Neptune lies a region of space filled with icy bodies. Known as the Kuiper Belt, this chilly expanse holds trillions of objects, remnants of the early solar system. Dutch astronomer Jan Oort first proposed in 1950 that some comets might come from the the solar system’s far suburbs. "}, {"url": "http://www.answers.com/Q/What_is_kuiper_belt_object_made_of", "passage_text": "The Kuiper Belt is a region beyond Neptune in which an assortment of the solar system's refuse from planet-making orbits the sun. This includes ice, dust, and gas, along with … much larger objects like asteroids and comets. The Kuiper Belt is believed to be the the source of many short-period comets, which are comets that quickly orbit the sun. One important element of the Kuiper Belt is that it also contains much larger objects like minor planets and large asteroids."}, {"url": "http://www.answers.com/Q/What_is_the_Kuiper_Belt_made_of", "passage_text": "The Kuiper belt is somewhat similar to the asteroid belt (with its rocky, metallic chunks), but the objects are made mostly of ice and frozen gases. This area of the solar system is large and difficult to assess as the objects in it are so far away and are, in general, quite small. There is some 20 to 200 times more mass in the Kuiper belt than in the asteroid belt. As the Kuiper belt is the group of trans-Neptunian objects out to the margin stated, Pluto spends most of its 248-year solar orbital time in the Kuiper belt."}, {"url": "http://www.universetoday.com/107598/what-is-the-kuiper-belt/", "passage_text": "On January 19th, 2006, NASA launched the New Horizons space probe for the sake of studying Pluto, its moons and one or two other Kuiper Belt objects. As of January 15th, 2015, the spacecraft began its approach to the dwarf planet, and is expected to make a flyby by July 14th, 2015. Dr. Mike Brown is a professor of planetary astronomy at Caltech. He’s best known as the man who killed Pluto, thanks to his team’s discovery of Eris and other Kuiper Belt Objects. We asked him to help us explain this unusual region of our solar system"}]